["Na temelju članka 23. stavka 6. točka 1. i točka 5. Zakona o pravu na pristup informacijama (NN 25/13, 85/15 i 69/22), (u daljnjem tekstu: Zakon), povodom zahtjeva korisnika prava na pristup informacijama MILJENKA CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb, službenik za informiranje Hrvatskog judo saveza (u daljnjem tekstu: HJS), Ul. Ivana Cankara 13, 10 000 Zagreb, OIB:67894852113, donosi dana 18. kolovoza 2025.godine\n\nRJEŠENJE\n\nOdbijaju se svi zahtjevi MILJENKA CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb, OIB:34665061509 za pristup informacijama, podneseni dana 11. kolovoza 2025.g., u kojima podnositelj zahtjeva traži od HRVATSKOG JUDO SAVEZA dostavu informacija o realizaciji judaša (judoka) Dominika Družeta, Ane Viktorije Puljiz, Zlatka Kumrić i Barbare Matić za kalendarske godine: 2020., 2021., 2022., 2023. i 2024.godinu, zahtjev za dostavu informacija o realizaciji judašice (judoke) Nine Simić za kalendarske godine: 2022., 2023. i 2024.godinu, te zahtjev za dostavu informacija o ", "realizaciji judašice (judoke) Lare Cvjetko za 2024.godinu.\n\nObrazloženje\n\nKorisnik prava na pristup informacijama, MILJENKO CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb, OIB:34665061509 podnio je dana 11.08.2025.g. ukupno 25 zahtjeva za pristup informacijama u kojem traži od HRVATSKOG JUDO SAVEZA dostavu informacija o realizaciji judaša (judoka) Dominika Družeta, Ane Viktorije Puljiz, Zlatka Kumrić i Barbare Matić za kalendarske godine: 2020., 2021., 2022., 2023. i 2024.godinu, zahtjev za dostavu informacija o realizaciji judašice (judoke) Nine Simić za kalendarske godine: 2022., 2023. i 2024.godinu, te zahtjev za dostavu informacija o realizaciji judašice (judoke) Lare Cvjetko za 2024.godinu.\n\nKorisnik prava na pristup informacijama poslao je e-mail dana 11.08.2025.g. koji je uputio na sljedeće e , - dean.bogic@judo.hr,ivan.segedi@kif.unizg.hr,ivan.segedi@kif.hr,tadija.orlovic@odata.com.hrr,d.vlasta @stucos.hr,ivan.jelencic1946@gmail.com,gkovacic23@gmail.com,fernando.kirigin@opatija.hr", ",kirigin@ hotmail.com,ppi@pristupinfo.hr,pisarnica@pristupinfo.hr,marija.picek@pristupinfo.hr, tajnistvo@uskok.dorh.hr, Subject: Zahtjevi za pristup dokumentaciji za istrage i sudske postupke.\n\nmail\n\nadrese:\n\noffice@judo.hr\n\n,\n\nsluzbenik-informiranje@judo.hr\n\nKorisnik prava na pristup informacijama je dana 17. veljače 2025.g. podnio gotovo identične zahtjeve - njih 21., za sve osobe koje i u ovim zahtjevima pobrojava, s tim da je sada uključio dodatno i judašicu (judoku) Ninu Simić, te traži istu dokumentaciju – realizaciju po kalendarskim godinama. Dana 03.03.2025.g. tijelo javne vlasti – Hrvatski judo savez- donio je Rješenje kojim odbija podnositelja u odnosu na sve podnesene zahtjeve. Nije poznato da li je podnositelj zahtjeva na to Rješenje kojim se kumulativno rješavalo od 21. zahtjevu podnio žalbu Povjereniku za informiranje.\n\nTekst e-maila od 11.08.2025.g. koji prati sada 25. podnesena zahtjeva nejasan je i konfuzan u smislu razloga traženja pristupa informacijama, pa se tijelo", " javne vlasti neće u ovom Rješenju posebno referirati na taj tekst. Obzirom je u odnosu na podnositelja zahtjeva pravno situacija nepromijenjena, odnosno sve okolnosti su identične onima u ožujku 2025.godine (trajanje sudskog postupka), to je tijelo javne vlasti odlučilo kako se u dispozitivu navodi.\n\nOdredbom članka 23. stavkom 6., točka 1. Zakona o pravu na pristup informacijama propisano je da će tijelo javne vlasti rješenjem odbiti zahtjev ako se ispune uvjeti propisani u članku 15. stavku 1. citiranog Zakona.\n\nObzirom je situacija nepromijenjena, odnosno i dalje se pred Općinskim kaznenim sudom u Zagrebu vodi kazneni postupak, poslovni broj: K-240/2022, privatni tužitelj HJS, optuženik Miljenko Cvjetko, datum pokretanja postupka 18.02.2022.g., radi kaznenog djela iz čl.147 st.2. Kaznenog zakona – Uvreda – kaznena djela protiv časti i ugleda, to za vrijeme trajanja postupka tijelo javne vlasti ima zakonsku obvezu ograničavanja pristupa informacijama. Zatražene informacije referiraj", "u se i na citirani kazneni postupak.\n\nNadalje, odredbom članka 23. stavkom 6. točkom 5. Zakona o pravu na pristup informacijama, propisano je da će tijelo javne vlasti rješenjem odbiti zahtjev ako jedan ili više međusobno povezanih podnositelja putem jednog ili više funkcionalno povezanih zahtjeva očito zloupotrebljava pravo na pristup informacijama, a osobito kada zbog učestalih zahtjeva za dostavu istih ili istovrsnih informacija ili zahtjeva kojima se traži velik broj informacija dolazi do opterećivanja rada i redovitog funkcioniranja tijela javne vlasti.\n\nPodnositelj je podnio istog dana 11.08.2025.g. ukupno 25 zahtjeva, koji zahtjevi su sadržajno identični u smislu dokumenta koji se traži - realizacija, te u odnosu na veći broj osoba i za dugi vremenski period ( 2020—2024.g.), gdje bi sve i da nema sudskog kaznenog postupka kao zapreke udovoljavanja tolikom broju zahtjeva, bilo evidentno opterećivanje rada i redovnog funkcioniranja tijela javne vlasti.\n\nPonašanje podnositelja u sm", "islu podnošenja tolikog broja zahtjeva potvrđuje da isti koristi pravo na pristup informacijama suprotno njegovoj svrsi, odnosno zbog razloga koji se ne mogu povezati s javnim interesom, te da isti ne postupa s ciljem pribavljanja informacija od javnog značaja. S obzirom na prethodno navedeno, odlučeno je kao u izreci ovoga rješenja.\n\nUPUTA O PRAVNOM LIJEKU: Protiv ovog rješenja može se izjaviti Žalba Povjereniku za informiranje u Zagrebu, Trg Žrtava fašizma 3, u roku od 15 dana od dana dostave Rješenja. Žalba se izjavljuje putem tijela javne vlasti.\n\nSlužbenik za informiranje HRVATSKOG JUDO SAVEZA DEAN BOGIĆ\n\n___ __________________________\n\nDostaviti: Poštom na adresu MILJENKO CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb e-mailom : miljenko.cvjetko@gmail.com"]