["Na temelju Clanka 13. Zakona o udrugama (Narodne novine, br. 74/14, 70/17, 98/19 1 151/22) 1\n¢lanka 30. Zakona o sportu (Narodne novine, br. 141/22) na sjednici Skupstine Gradanskog\nnogometnog kluba ,,Dinamo“ odrzanoj ... donesen je:\n\nSTATUT\nGRADANSKOG NOGOMETNOG KLUBA ,,DINAMO”\n\nI. UVODNE ODREDBE\n\nClanak 1.\n\nOvim Statutom ureduju se: naziv 1 sjediste udruge; grb (znak) udruge; podrucje 1 ciljevi\ndjelovanja; zastupanje; djelatnost; gospodarska dj", "elatnost; nacin osiguranja javnosti djelovanja\nudruge; uvjeti 1 nacin uclanjivanja; prestanak Clanstva; prava, obveze 1 odgovornosti Clanova;\npopis Clanova; tijela udruge, njihov sastav 1 nacin sazivanja sjednica; izbor, opoziv, ovlasti,\nodgovornost, nacin odlucivanja 1 trajanje mandata; nacin ryeSavanja sporova 1 sukoba interesa\nunutar udruge; nacin sazivanja SkupStine u slucaju isteka mandata; izbor 1 opoziv likvidatora;\nprestanak postojanja ud", "ruge; imovina, nacin stjecanja 1 raspolaganja imovinom; postupak s\nimovinom u slucéaju prestanka postojanja udruge, nacin provodenja referenduma te ostala pitanja\nod znaéaja za udrugu.\n\nClanak 2.\n(1) Naziv Udruge je: Gradanski nogometni klub ,,Dinamo“.\n(2) Skraéeni naziv Udruge je: GNK ,,Dinamo™“.\n(3) Gradanski nogometni klub ,,Dinamo“ je profesionalni nogometni klub.\n\n(4) SjediSte kluba je u Zagrebu, Maksimirska cesta 128.\n\nClanak 3.\n\n(1) Gradan", "ski nogometni klub ,,Dinamo“ (u daljnjem tekstu: Klub) je udruga registrirana u\nRegistru udruga Republike Hrvatske 1 u Evidenciji pravnih osoba u sportu.\n\n(2) Klub je neprofitna pravna osoba.\n\nClanak 4.\n(1) Klub ima pe€at.\n\n(2) Peéat je okruglog oblika, promjera 35 mm, s ispisanim nazivom 1 mjestom sjedista Kluba\npo obodu peéata 1 znakom u sredini.\nClanak 5.\n\n(1) Klub je osnovan 26. travnja 1911. pod nazivom I. Hrvatski gradanski Sportski klub u\n", "Zagrebu (u daljnjem tekstu: Gradansk1).\n\n(2) Obiljezja Kluba su grb (znak) 1 plava boja, koja slijede izgled obiljezja 1 sportsku tradiciyu\nGradanskog.\n\n(3) Grb (znak) Kluba je kruznog oblika 1 simbolizira oblik nogometne lopte, a Sto ukazuje na\nosnovnu djelatnost Kluba.\n\n(4) Osnova grba (znaka) sastavljena je od dva polukruga: povijesnog hrvatskog grba s\nnaizmjenicnim crvenim 1 biyelim poljima te tradicionalnog u plavoj boji Grada Zagreba s\nbije", "lim slovom “d” koje predstavlja pocetno slovo naziva Kluba u diyelu ,,Dinamo”’.\n\n(5) Sve linije unutar grba (znaka) 1 rub grba (znaka) su zlatne boje.\n(6) Zig Kluba prati obiljeZja grba, peéata i drugih znakova Kluba.\n\n(7) Iznimno od odredaba stavaka 3.-5. ovog Clanka Statuta, Klub moze koristiti dijelove grba\n(znaka) kao sastavni dio drugih amblema odnosno znakova, pod uvjetom da se time ne\nvrijeda ugled 1 dostojanstvo Kluba.\n\nClanak 6.\n\n(1) Upr", "avljanje Klubom temelji se na naéelu demokratskog ustroja. Klubom, na na¢in propisan\nodredbama ovog Statuta, upravljaju Clanovi Kluba, neposredno ili putem svojih izabranih\npredstavnika u tijelima Kluba..\n\n(2) O pronyeni naziva Kluba u dielu ,,Dinamo“, grba (znaka), boje, trayne lokacije stadiona,\npreoblikovanja, pripajanja, spajanja ili podjele Kluba te dobrovoljnog prestanka rada Kluba\nraspisuje se, sukladno ¢lanku 55. ovog Statuta, referendum ", "svih Clanova Kluba s pravom\nglasa.\n\nClanak 7.\n\nKlub zastupaju Predsjednik Kluba, Predsjednik Nadzornog odbora Kluba 1 Uprava Kluba,\nsukladno odredbama ovog Statuta.\n\nClanak 8.\n(1) Klub:\n\na. postupa sukladno Pravilima nogometne igre koje je donio Medunarodni nogometni\nsavez BORD (IFAB);\n\nb. poSstuje nacela privrzenosti, integriteta 1 sportskog ponaSanja kao izraza fairplaya;\n\nc. postuje statut, pravilnike 1 odluke FIFA-e 1 UEFA-e 1 Hrvatskog nogom", "etnog\nsaveza (HNS) u svako vrijeme;\n\nd. priznaje nadleZnost Arbitraznog suda za sport (CAS) u Lausanni (Svicarska), kao\nSto je utvrdeno relevantnim odredbama Statuta FIFA-e, UEFA-e;\n\ne. priznaje nadleznost Arbitraznog suda HNS-a 1 sukladno tome podnosit Ce sve\nsporove nacionalnih razmjera, koji su nastali 1z ili u vezi s primjenom Statuta ili\npravilnika HNS-a, u posljednjoj instanci samo tim arbitrazama, koje rjeSavaju svoje\nsporove, iskljucujuci", " svaki redovni sud, osim ukoliko je to izricito zabranjeno\nvazecim zakonodavstvom u Republici Hrvatskoj.\n(2) U slucéaju sporova za koje su nadlezna pravosudna tijela FIFA-e, UEFA-e, CAS-a,\nArbitraznog suda Saveza ili pravnih tijela Saveza, Klub se obvezuje da spor ne¢e iznositi\npred redovne sudove.\n\n(3) Klub poStuje sve odluke nadleznih tijela HNS-a, FIFA-e 1 UEFA-e 1 CAS-a.\n\nClanak 9.\n(1) Klub je neutralan po pitanjima politike 1 vjere.\n\n(2) Dis", "kriminacija bilo koje vrste prema osobama temeljena na osnovi rase ili etnicke\npripadnosti, nacionalnog ili socijalnog podriyjetla, vjere, spola, jeziku, politickog uvjerenja\n1 ostalim razlozima propisanim posebnim propisima o suzbyanju diskriminacije zabranjena\nje te predstavlja razlog za iskljucenje 1z Kluba u stegovnom postupku.\n\nIL. VIZIJA, MISIJA, SVRHA, CILJEVI, NACELA TE PODRUCGCJE\nDJELOVANJA I DJELATNOSTI KLUBA\n\nClanak 10.\nVizija, misija ", "1 Svrha Kluba:\n\n(1) Vizija Kluba je predstavljati Grad Zagreb 1 Republiku Hrvatsku te hrvatski narod kao\nmedunarodno prepoznat klub koji postize sportske 1 poslovne uspjehe, okuplja svoje\nClanove 1 navijace te konstantno stvara svojim primjerom pozitivne druStvene promjene.\nKlub tezi biti najboljim primjerom kako klub svojih ¢lanova moze biti uspjeSan, otvoren 1\nvjerodostojan u svemu Sto radi — na terenu 1 1zvan njega.\n\n(2) Misija Kluba je biti K", "lub svojih Clanova, s dubokom gradanskom, zagrebackom 1\nhrvatskom tradicijom, koji svakodnevno spaja sport, zajednicu 1 navijacku strast. Klub\ndjeluje odgovorno, transparentno 1 ukljucivo kroz odgoj mladih sportaSa, izgradnju\npovjerenja medu svojim Clanovima 1 navijacima, jacanja zagrebackog 1 hrvatskog identiteta\nte aktivno djelovanje kao pozitivan ¢imbenik u drustvu. Cilj Kluba je uvijek posteno\npobijediti na terenu, ali 1 vjerodostojno predsta", "vljati Klub 1 pripadnost plavoj boj1.\n\n(3) Svrha Kluba je sluziti svojim Clanovima 1 navijacima kroz vrhunski nogomet 1 prezentaciyu\nsporta, razvoj mladih, promicanje pozitivnih vrednota u druStvu te jaCanje zajedniStva na\nlokalnoj 1 nacionalnoj razini.\n\nClanak 11.\nCiljevi Kluba su:\n(1) Identitet 1 vrednote:\n\na. Njegovati identitet Kluba kao otvorenog, gradanskog, zagrebackog 1 hrvatskog\nkluba, temeljenog na nacelima demokrati¢nosti, transparentn", "osti 1 zajedniStva.\n\nb. Promicati kulturu poStenja, odgovornosti, izvrsnosti 1 medusobnog uvazavanja u\nSvim segmentima djelovanja Kluba.\n\nc. Razvijati Klub kao medunarodno prepoznat 1 vjerodostojan sportski 1 druStveni\nsimbol koji svojim primjerom potice pozitivne promjene u sportu 1 druStvu.\nd. Aktivno ukljucivati bivSe igraée kao ambasadore klupskih vrijednosti te poticati\n\nnjihovo javno djelovanje u promociji Kluba, sporta, zajedniStva 1 drust", "vene\nodgovornosti.\n\n(2) Sportski razvoj 1 rezultati:\n\na.\n\nPostizati vrhunske sportske rezultate kroz stalni razvoj igra¢kog kadra, posebno\nputem omladinske Skole, s ciljem stvaranja igra¢a za prvu moméad 1 hrvatsku\nreprezentaciju.\n\nSudjelovati u domacim 1 medunarodnim natjecanjima te na dostojan nacin\npredstavljati Klub, Grad Zagreb 1 Republiku Hrvatsku.\n\nOsiguravati profesionalni 1 struéni razvoj sportskih djelatnika kroz obrazovanje,\nrazmjenu z", "nanja 1 cjelozivotno ucenje.\n\nUlagati u sportsku 1 klupsku infrastrukturu 1 tehnoloski razvoj, u skladu s europskim\nstandardima 1 nacelima odrzivosti.\n\nPodrzavati muSke, zenske, veteranske 1 futsal ekipe te druge varijante nogometnog\nsporta s ciljem razvoja 1 popularizacije Kluba, njegovog imena, sporta 1 nogometa.\n\n(3) DruStveni utjecaj 1 zajednica:\n\na.\n\nBiti srediSnje mjesto okupljanja Clanova, osobito djece 1 mladih, kroz organizaciju\nSkola no", "gometa 1 poticanje sportskog nacina Zivota.\n\nAktivno doprinositi lokalnoj zajednici kroz druStveno odgovorne projekte, s\nposebnim naglaskom na mlade 1 ranjive skupine.\n\nSustavno izgradivati povjerenje medu Clanovima 1 navijacima Kluba kroz otvoren\ndialog 1 ukljucivanje u odlucivanje, temeljem participativnog modela upravljanja.\n\n(4) Klub sukladno ciljevima djeluje na podrucju sporta.\n\nClanak 12.\n\nNaéela upravljanja Klubom su:\n\na.\n\nZakonitost, eti", "¢nost 1 odgovornost: Klub djeluje u skladu sa zakonima, najvisim\neti¢kim standardima 1 odgovorno prema svojim Clanovima, naviyacima 1 zajednici.\n\nTransparentnost 1 otvorenost: Komunikacia s Clanovima 1 javnoScu temelji se na\niskrenosti, dostupnosti informacija 1 jasnom obrazlaganju odluka.\n\nParticipacya 1 ukljucivost: Klub potiée aktivno sudjelovanje Clanova 1 navijaca u\ndonoSenju odluka te njeguje dialog 1 uvazavanje razlicitih misljenja.\n\nIzvrs", "nost 1 razvoj: Klub tezi izvrsnosti u sportu, poslovanju 1 druStvenom\ndjelovanju, promice ucenje, inovacije 1 stalno unapredenye.\n\nIntegritet 1 izbjegavanje sukoba interesa: Svi koji djeluju u ime Kluba duzni su\nrazdvajati privatne 1 klupske interese te postupati u najboljem interesu Kluba.\n\nGradanski identitet 1 druStvena odgovornost: Klub Cuva svoju zagrebacku 1 hrvatsku\ntradicyu, promice zajedniStvo, poStovanje razlicitosti 1 koristi sport kao", " alat\npozitivnih drustvenih promjena.\nClanak 13.\n\nDjelatnosti Kluba su:\n\na.\n\nNatjecateljska aktivnost: Sudjelovanje u profesionalnim 1 amaterskim natjecanjima\nu nogometu na lokalnoj, drzavnoj 1 medunarodnoj razini, za sve uzraste 1 kategorye.\n\nRazvoj sportaSa 1 stru¢nog kadra: Stru¢no-pedagoSki rad s igra¢ima svih dobnih\nskupina kroz Skole nogometa, treninge 1 pripreme, te osposobljavanje 1 usavrSavanje\nvlastitog trenerskog 1 strucnog kadra.\n\nInf", "rastruktura 1 tehni¢ka podrska: Upravljanje, odrzavanje 1 daljnji razvoj sportske\ninfrastrukture te osiguravanje svih uvjeta potrebnih za licenciranje prema propisima\nHNS-a 1 UEFA-e.\n\nSuradnja 1 umrezavanje: Razviyanje suradnje s drugim sportskim klubovima,\nsportskim 1 stru¢énim organizacijama, posebno povezivanje sa sportskim klubovima\nkoji koriste naziv \"Dinamo\" s ciljem stvaranja integriranog sportskog udruzenja\nkoje promice zajednicke vrijedn", "osti, koristi zajedni¢ku infrastrukturu 1 doprinosi\ndrustvenom utjecaju Kluba, kao 1 suradnja s tijelima javne vlasti te pravnim 1\nfizi¢kim osobama u cilju ostvarivanja sportskih 1 drugih interesa Kluba.\n\nRazvoj €lanstva 1 klupske kulture: Organizirano okupljanje Clanova svih uzrasta te\npromicanje vrijednosti Kluba kroz izdavanje publikacija 1 razvoj odnosa s\nnavijacima 1 zajednicom.\n\nPromicanje 1 razvoj nogometa: Poticanje nogometa u skladu s na", "cionalnim 1\nlokalnim strateskim dokumentima, s posebnim naglaskom na djecu, mlade 1\nzdravstveno usmjereno tjelesno vjezbanje.\n\nZdravlje 1 sigurnost sportaSa: Sudjelovanje u sustavima zdravstvene skrbi,\nantidopinga te promicanje sigurnosti, posebno u zastiti djece 1 borbi protiv nasilja u\nSportu.\n\nEdukaciya 1 savjetovanje: Provodenje edukacija, informiranje 1 savjetovanje\nsportaSa, sportskih djelatnika 1 gradana o temama relevantnima za sport 1 zd", "ravlje.\n\nAdministrativne 1 zakonske obveze: Vodenje propisanih evidenciya u nacionalnim\nsportskim sustavima te obavljanje svih drugih poslova sukladno zakonu 1 Statutu\nKluba.\n\nHumanitarna 1 druStvena djelatnost: u tu svrhu 1zmedu ostalih aktivnosti, osniva 1\npodupire Zakladu GNK Dinamo ,,Nema predaje“.\n\nClanak 14.\n\n(1) Gospodarske djelatnosti koje Klub obavlja su:\n\na.\nb.\nC.\nd.\n\nizdavacka 1 edukacijska djelatnost;\nprodaja svojih proizvoda na malo ", "izvan prodavaonica, sukladno Zakonu o trgovini;\npromidzbene djelatnosti;\n\ndavanje u zakup 1 podzakup vlastitih poslovnih prostora 1 mjesta za oglaSavanje.\n\n(2) Djelatnosti 1z stavka 1. ovog Clanka Klub obavlja u skladu s posebnim propisima koji\nureduju gospodarsko poslovanje udruga kao pravnih osoba.\n\n(3) Dyjelatnosti 1z stavka 1. ovog Clanka ne mogu se obavljati radi stjecanja dobiti za svoje\nClanove ili trece osobe.\n(4) Ako u obavljanju gospoda", "rskih djelatnosti Klub ostvari dobit ona se mora koristiti\niskljucivo za obavljanje 1 unapredenje djelatnosti Kluba kojima se ostvaruju ciljevi Kluba,\nutvrdeni ovim Statutom, sukladno zakonu.\n\nClanak 15.\n\nKlub moze osnivati trgovacka druStva sukladno odredbama Zakona o trgovackim druStvima,\nkao 1 druge oblike pravnih osoba sukladno posebnim propisima, ako je to u cilju osiguranja\nmateryalnih uvjeta rada 1 razvoja Kluba.\n\nClanak 16.\n(1) Djelovanje", " Kluba je javno, a ostvaruje se putem:\na. internetskih stranica Kluba, aplikaciyja 1 drustvenih mreza;\nb. javnih media;\nc. povjerenika Kluba;\nd. skupovima za Clanove koji se organiziraju najmanje jednom godiSnje;\ne. ostalih nacina informiranja sukladno odluci Uprave Kluba.\n\n(2) Clanove Kluba pravodobno se obavjeS8tava o radu Kluba te aktima i odlukama njegovih\ntiela. Statut, Pravilnik o izborima u GNK ,,Dinamo“ te godiSnja financijska izvjeSéa 1\n", "revizorski nalazi moraju biti dostupni ¢lanovima Kluba na odgovaraju¢i nacin.\n\n(3) O nacinu javnosti rada Kluba 1 obavjeStavanja Clanova odluku donosi Uprava Kluba.\n\nClanak 17.\n(1) Klub se moze udruziti u saveze udruga, zajednice, mreze 1 u medunarodne udruge.\n\n(2) Odluku o udruZivanju donosi Skup§Stina Kluba.\n\nIl. CLANOVI KLUBA, PRIJATELJI KLUBA I POVJERENICI KLUBA\n\n1. CLANOVI KLUBA\n\nClanak 18.\n\n(1) Clanom Kluba moZe postati svaka fizi¢ka osoba ", "koja ispunjavanjem pristupnice prihva¢a\nnacela djelovanja, Statut 1 druge akte Kluba te koja uplati Clanarinu iz ¢lanka 19. ovog\nStatuta.\n\n(2) Osobe mlade od 18 godina te osobe liSene poslovne sposobnosti mogu postati ¢lanom\nKluba na nacin da:\n\na. Za osobu mladu od 14 godina ili osobu liSenu poslovne sposobnosti pisanu izjavu\no uclanjivanju daje zakonski zastupnik ili skrbnik;\n\nb. Za osobu stariyju od 14 godina, a mladu od 18 godina zakonski zast", "upnik ili skrbnik\ndaje pisanu suglasnost.\nClanak 19.\n\n(1) Fizi¢ke osobe 1z €lanka 18. ovog Statuta postayu Clanovi Kluba upisom u Jedinstveni popis\nClanova.\n\n(2) Clanstvo u Klubu prestaje istekom kalendarske godine.\n\n(3) Fizi¢ka osoba koja je bila Clanom Kluba u toj kalendarskoj godini moZe, najraniye od 1.\n(prvog) prosinca tekuce kalendarske godine ili po isteku kalendarske godine, obnoviti\nClanstvo za iducu kalendarsku godinu novom uplatom godi", "Snje Clanarine, s time da ¢lanska\nprava 1 obveze u toj kalendarskoj godini teku od trenutka obnove Clanstva u Klubu, a u\nslucaju ranije obnove za iducu kalendarsku godinu njezinim pocéetkom.\n\n(4) Visinu Clanarine odreduje Nadzorni odbor.\n\n(5) Svaki ¢lan moze dobiti Clansku iskaznicu ¢1j1 izgled definira Uprava Kluba.\n\nClanak 20.\n\n(1) Jedinstveni popis Clanova vodi stru¢éna sluzba Kluba po odluci Uprave Kluba u\nelektroni¢kom obliku te obavezno sad", "rzi podatke o osobnom imenu, osobnom\nidentifikacijskom broju (OIB), datumu rodenja, datumu pristupanja Klubu 1 datumu\nprestanka Clanstva u Klubu.\n\n(2) U arhivi Kluba Cuvaju se privole o koriStenju osobnih podataka u skladu s propisima o\nzaStiti podataka, adrese prebivaliSta ili boravisSta, brojevi telefona, adrese e-poSte 1 ostali\npodaci 1z pristupnice ili pisane izjave o uclanjivanju.\n\n(3) Jedinstveni popis Clanova uviek je, u sjediStu Kluba ili", " na drugom myestu po odluci Uprave\nKluba, dostupan u elektroni¢kom obliku na uvid svim Clanovima 1 nadleznim tijelima na\nnjihov zahtjev, u skladu sa zakonom 1 drugim propisima o zaStiti podataka.\n\nClanak 21.\n\n(1) Punoljetni 1 poslovno sposobni ¢lanovi Kluba, pod uvjetom da su bili Clanovi iu prethodnoj]\nkalendarskoj godini, sukladno odredbama ovog Statuta, imaju pravo:\n\na. birati1i biti birani u tijela Kluba;\nb. zatraziti raspisivanje referenduma", ";\nc. glasovati na referendumu;\n\nd. sudjelovati u radu 1 upravljanju Klubom putem izabranih predstavnika u Skup8stini\n1u drugim tijelima Kluba te sudjelovati u savjetodavnim odborima 1 povjerenstvima\nkoje osniva Nadzorni odbor Kluba.\n\n(2) Svi €lanovi Kluba, sukladno odredbama ovog Statuta, imaju pravo:\nbiti imenovani u Upravu Kluba;\n\nb. biti pravodobno obavjeStavani o radu Kluba te aktima 1 odlukama tijela Kluba na\nnacin propisan Statutom, posebni", "m aktima 1 odlukama Uprave Kluba;\n\nc. biti nagradeni pocasnim odlikovanjima za doprinos Klubu ili za dugotrajno\nClanstvo, sukladno odluci Nadzornog odbora Kluba;\n\nd. komunicirati pisanim putem s Klubom 1 dobiti pravodobne odgovore, sukladno\nodluci Uprave Kluba;\n\ne. sudjelovati na skupovima za Clanove.\n\n(3) Svi €lanovi Kluba mogu ostvarivati dodatne pogodnosti sukladno odluci Uprave Kluba.\nClanak 22.\nDuZznosti 1 odgovornosti ¢lanova Kluba su:\na. p", "oStovati nacela djelovanja, Statut te druge akte 1 odluke Kluba;\nb. podupirati Klub i aktivno sudjelovati u ostvarenju ciljeva Kluba;\n\nc. obavijestiti Klub o promjeni osobnog imena te adresi prebivaliSta ili boraviSta;\n\nO-\n\nStititi ugled 1 dostojanstvo Kluba suzdrzavajuci se od ponaSanja 1 radnji koje Stete\nKlubu te njegovu ugledu, Casti 1 dostojanstvu.\n\nClanak 23.\n\nIgraci, Clanovi Uprave Kluba 1 zaposlenici Kluba koji su ¢lanovi Kluba te povjere", "nici Kluba,\npored prava, duznosti 1 odgovornosti 1z Clanaka 21. 1 22. ovog Statuta, imaju 1 druga prava,\nobveze 1 odgovornosti utvrdene ugovorima te odlukama tijela Kluba.\n\nClanak 24.\n\n(1) Clanstvo u Klubu, osim iz razloga propisanog Glankom 19. stavkom 2. ovog Statuta,\nprestaje 1:\n\na. dragovoljnim istupom;\nb. iskljucenjem u stegovnom postupku;\nc. smrcu.\n\n(2) Ukoliko ¢lanu SkupStine Kluba, Nadzornog odbora Kluba, Predsjedniku Kluba ili\npovjerenik", "u Kluba prestane Clanstvo u Klubu 1z razloga navedenih u stavku |. to¢kama a.-\nc. ovog Clanka Statuta, isto automatski dovodi do prestanka mandata u tom tijelu Kluba 1/ili\ngubitka statusa povjerenika.\n\n(3) Clanovi SkupStine Kluba, élanovi Nadzornog odbora Kluba, Predsjednik Kluba te\npovjerenici Kluba duzni su do 31. (trideset prvog) prosinca tekuce kalendarske godine\nobnoviti Clanstvo u Klubu za iducu kalendarsku godinu novom uplatom godiSnje ¢la", "narine.\nUkoliko isto propuste uciniti, strucna sluzba iz Clanka 20. stavka 1. ovog Statuta pisanim\nce ih putem upozoriti na tu duznost 1 ostaviti im rok od 15 (petnaest) dana da obnove\nClanstvo.\n\n(4) Ukoliko ¢lan SkupStine Kluba, ¢lan Nadzornog odbora Kluba, Predsjednik Kluba ili\npovjerenik Kluba ne obnovi Clanstvo u Klubu niti u roku 1z stavka 3. ovog ¢lanka Statuta,\nisto automatski dovodi do prestanka mandata u tom tielu Kluba 1/ili gubitka sta", "tusa\npovjerenika.\n\nClanak 25.\n\n(1) Disciplinski prekrSaj predstavlja svako djelovanje Clana Kluba kojim se krSe nacela\ndjelovanja 1 ciljevi Kluba, odredbe Statuta 1 drugih akata Kluba, odluke tijela Kluba ili\nodredbe relevantnih zakona 1 podzakonskih propisa.\n\n(2) Dyjelovanje 1z stavka 1. ovog Clanka Statuta smatra se teSkim disciplinskim prekrSajem\nukoliko se Klubu takvim djelovanjem nanosi materialna ili nematerijalna Steta, a osobito:\n\na. izno", "Senje poslovne ili sluzbene tajne ili ostalih povjerljivih informacija Kluba bez\nodobrenje nadleznih tiyela Kluba;\n\nb. grubo vrijedanje Easti 1 ugleda Kluba;\nc. grubo vrijedanje, klevetanje ili nanoSenje materijalne ili nematerijalne Stete drugim\n¢lanovima Kluba ili Prijateljima Kluba, povjerenicima Kluba, kao 1 ¢lanovima tijela\nKluba tiyekom ili zbog obavljanja njihovih funkcya;\n\nd. prisila, prijetnja te svaki drugi oblik nezakonitog utjecaja il", "1 pokuSaj takvog\nnezakonitog utjecaja na Clanove tijela Kluba, ostale organe Kluba, zaposlenike Kluba\n1 sli¢no, koji sprjecavaju ili otezavaju obavljanje poslova 1z njihove nadleznosti;\n\ne. nasilnicko, diskriminatorno 1 rasisti¢ko ponaSanje.\n(3) Stegovne mjere su:\na. Opomena;\nb. Suspenziya Clanstva na rok od 3 (tri) mjeseca do 3 (tri) godine;\nc. Trajno iskljucenje iz Clanstva.\n\n(4) Stegovne mjere 1z stavka 3. tocaka b. 1c. ovog Statuta mogu se iz", "reci za teSke disciplinske\nprekrSaje te u slucajevima ponavljanja disciplinskih prekrSaja iz stavka 1. ovog Clanka\nStatuta radi kojih su Clanu Kluba prethodno bile izrecene stegovne mjere opomene.\n\n(5) Stegovni postupak pokreée se na zahtjev bilo kojeg Clana tijela Kluba.\n\n(6) Odluku o stegovnoj mjeri, kao prvostupanjsko tijelo, donosi Uprava Kluba u roku od 30\n(trideset) dana od dana pokretanja stegovnog postupka.\n\n(7) Clanu Kluba se odluka 0 st", "egovnoj mjeri dostavlja na adresu prebivali8ta ili boravi8ta koju\nje naznacio prilikom uclanjenja u Klub ili 0 kojoj je, sukladno Clanku 22. stavku 1. toéci c.\novog Statuta, obavijestio Klub.\n\n(8) Protiv odluke o stegovnoj mjeri élan Kluba ima pravo na Zalbu. Zalba se podnosi Nadzornom\nodboru, kao drugostupanjskom tijelu, u roku od 15 (petnaest) dana od dana primitka odluke.\n\n(9) Nadzorni odbor duzan je o zalbi odluciti u roku od 30 (trideset) da", "na, racunajuci od dana\nprimitka zalbe.\n\n(10) Odluka Nadzornog odbora o stegovnoj mjeri je konaéna.\n\n(11) Ustegovnom postupku u kojem je disciplinski okrivljenik ¢lan tijela Kluba koje odlucuje\no stegovnim mjerama, taj Clan ne sudjeluje u raspravi 1 donoSenju odluke o stegovnoj mjeri.\n\n2. PRIJATELJI KLUBA\n\nClanak 26.\n\n(1) Prijatel) Kluba moze postati fizi¢ka osoba iz zemlje il1 inozemstva koja moralno 1\nmateryalno podupire nacela djelovanja Kluba.", " Prijatelj Kluba nije clan Kluba, no moze, u\nskladu s propisima, uzivati pogodnosti odredene posebnim aktom Kluba.\n\n(2) Prijateljem Kluba postaje se upisom u Popis Prijatelja Kluba koji vodi strucna sluzba po\nodluci Uprave Kluba. Popis Prijatelja Kluba ne mora sadrzavati OIB.\n\n(3) Prijatelji Kluba ne mogu birati ili biti birani u tyela Kluba, niti sudjelovati u izbornim\npostupcima ili referendumu, ali mogu biti izabrani u savjetodavne odbore 1 po", "vjerenstva koje\nosniva Nadzorni odbor.\n\n(4) Prijatelju Kluba izdaje se iskaznica ¢1j1 izgled definira Uprava Kluba.\n(5) Prijatelj Kluba ne moze biti osoba koja svojim ponaSanjem 1 radnjama nanosi materyalnu ili\nnemateriyalnu Stetu Klubu te koja nasilni¢kim, diskriminatornim 1 rasisti¢kim ponaSanjem\nradnjama onemogu¢ava ostvarenje ciljeva 1 obavljanje djelatnosti te Steti ugledu Kluba.\n\n(6) Prijatelji Kluba imaju pravo biti pravodobno obavjeStavan", "i o radu Kluba i aktima 1 odlukama\nnjegovih tiela na nacin propisan Statutom, posebnim aktima 1 odlukama Uprave te\nkomunicirati pisano 1 putem skupova za Clanove s tiyelima Kluba u okviru njihove\nnadleznosti 1 dobiti pravodobne odgovore, a duzni su poStivati Statut 1 druge akte Kluba,\npodupirati Klub te suzdrzavati se od ponaSanja 1 radnji koje Stete Klubu 1 njegovu ugledu.\n\n(7) Osoba prestaje biti Prijateljem Kluba istekom kalendarske godine, te", "meljem izjave da ne\nZeli viSe biti Prijatel) Kluba, smrcu ili odlukom o prestanku statusa Prijatelja Kluba u\nstegovnom postupku sukladno odredbi Clanka 25. ovog Statuta. U slucaju da Prijately Kluba\nispuni uvjete za Clanstvo 1 uclani se u Klub, prestaje mu status Prijatelja Kluba 1 briSe se 1z\npopisa Prijatelja Kluba.\n\n(8) Prijateljima Kluba mogu se izreci stegovne mjere opomena 1 prestanak statusa Priatelja\nKluba na nacin 1 pod uvjetima propisan", "im u Clanku 25. ovog Statuta.\n\n(9) Posebnim aktom Uprave Kluba detaljnije se ureduju pitanja vezana za proceduru stjecanja\nstatusa Prijatelja Kluba, pogodnostima, obnavljanju 1 prestanku statusa Prijatelja Kluba.\n\n(10) Visinu naknade za Prijatelje Kluba odreduje Nadzorni odbor, a jednaka je visini\nClanarine za Clanove Kluba.\n\n3. POVJERENICI KLUBA\n\nClanak 27.\n\n(1) Povjerenik moze biti svaki Clan Kluba koji je podnio zamolbu 1 koji ispunjava slyede", "ce\nuvjete:\n\nda je punoljetna 1 poslovno sposobna osoba;\n\nb. da jeu trenutku podnoSenja zamolbe ¢lan Kluba, pod uvjetom da je bio ¢lan Kluba 1\nu prethodnoj kalendarskoj godini;\n\nc. daje prije podnosenja zamolbe, u kalendarskoj godini u kojoj je podnio zamolbu, na\nnjegovu preporuku u Klub uclanjeno najmanje 50 ¢lanova Kluba;\n\nd. dane postoje zapreke iz ovog Statuta.\n\n(2) Odluku o imenovanju 1 razrjeSenju povjerenika donosi Uprava Kluba. Povjerenik ", "moze\nUpravi Kluba podnijeti 1 ostavku na mjesto povjerenika.\n\n(3) Povjerenik je duzan poticati uclanjivanje novih ¢lanova Kluba 1 upisivanje novih Priatelja\nKluba te ih izvjeStavati o drugim vaznim temama koje se odnose na ostvarivanje ciljeva\nKluba 1 obavljanje njegove djelatnosti te je duzan, u slucajevima propisanim ¢Clankom 52.\novog Statuta, sudjelovati na izborima kao kandidat za Clana SkupStine Kluba.\n\n(4) Uprava Kluba svojim odlukama uredu", "je odnose s povjerenicima 1 s imenovanim\npovjerenikom moze zakljuciti ugovor o medusobnim pravima 1 obvezama.\nIV. TIJELA KLUBA\n\nClanak 28.\nTiela Kluba su:\na. SkupStina Kluba (u tekstu Statuta 1: SkupStina)\nb. Nadzorni odbor Kluba (u tekstu Statuta 1: Nadzorni odbor)\nc. Predsjednik Kluba (u tekstu Statuta 1: Predsjednik)\nd. Uprava Kluba (u tekstu Statuta 1: Uprava)\n\nClanak 29.\n\n(1) Clanovi tijela Kluba mogu biti samo punoljetni i poslovno sposobni", " lanovi Kluba pod\nuvjetom da su isti bili Clanovi Kluba i u kalendarskoj godini koja prethodi godini u kojoj se\nodrzavaju izbori, osim u slucaju imenovanja Clanova Uprave Kluba.\n\n(2) Clanovi klupskih tijela ne mogu biti osobe za koje postoje zapreke iz Zakona o sportu i\nZakona o udrugama.\n\n(3) Clanovi tijela Kluba niti Po¢asni predsjednik Kluba, uz razloge iz stavka 2. ovog élanka\nStatuta ne mogu biti osobe:\n\nkoje su aktivni nogometni sudac, ili ", "osoba koja je to bila u posljednje 3 (tri) godine;\n\nkoje ne mogu biti Clanovi Uprave odnosno nadzornog odbora dioni¢kog druStva\nprema odredbama Zakona o trgovackim druSstvima 1 Zakona o sprjec¢avanju sukoba\ninteresa u obnaSanju javnih duznosti;\n\nkoji su dioniéari ili Clanovi drugog nogometnog kluba;\n\nkoje svojim djelovanjem mogu neposredno utjecati na sustav natjecanja u\nnogometnom sportu, a osobito sportasi koji su profesionalci prema Zakonu o s", "portu,\nmenadzeri 1 posrednici u sportu, kao 1 osobe koje su to bile u razdoblju od posljednjih\ngodinu dana;\n\nkoje su posljednjih godinu dana bile Clanovi ili ¢lanovi tijela pravne osobe koja\nobavlja djelatnost organiziranja sportske kladionice;\n\nkoje s menadzerima 1 posrednicima u istome sportu 1 ¢lanovima pravnih osoba te\nClanovima tiela pravnih osoba koje obavljaju djelatnost organiziranja sportskih\nkladionica djeluju zajednick1;\n\nkoje imaju il", "i su posljednjih godinu dana imale sklopljen ugovor s nogometaSem ili\nnogometnim trenerom na temelju kojega ostvaruje pravo na dio prihoda koji\nproizlaze 1z obavljanja djelatnosti nogometaSa ili nogometnog trenera ili djeluju\nzajednicki s takvim osobama;\n\nkoje su ovlaStene za zastupanje u pravnoj osobi koja sukladno Zakonu o sportu ima\nsklopljene ugovore o ulaganju u fizicke osobe u nogometu;\n\nkoje su u posljednje tri godine pravomoéno kaznjene z", "a kaznena djela ili prekrSaje\nu sportu 1 u vezi sa sportom 1 sportskim natjecanjima;\n\nkoje su pravomoéno osudene na kaznu zatvora u trajanju od najmanje 6 (Sest) mjeseci\nza neko od kaznenih djela pocinjena s namjerom, a nie primijenjena uvjetna osuda\ngodinu dana od odsluzenja kazne;\n\nkoje ne ispunjavaju druge uvjete propisane Zakonom o sportu 1 drugim zakonima;\n1. koje su aktivni igrac, trener ili zaposlenik Kluba, a ako to postanu tijekom mandat", "a\nu tielima Kluba, prestaje 1m mandat 1 Clanstvo u tyelu Kluba, osim ¢lanovima\nUprave Kluba za ¢lanstvo 1 zaposlenicki odnos u Upravi, kao Sto niti Predsjedniku\nza njegov zaposlenicki odnos 1 profesionalne duznosti ne prestaje mandat 1 Clanstvo\nu tiyelima koji proizlaze 1z funkcije Predsjednika prema ovom Statutu.\n\n(4) Svaki ¢lan Kluba koji ulazi u bilo koje tijelo Kluba mora potpisati izjavu kojom izjavljuje\nda nema zapreka iz stavaka 2.13. ovog", " Clanka Statuta te da ¢e u slucaju nastupa istih odmah\nobavijestiti Upravu Kluba.\n\n(5) Ukoliko se na izborima za SkupStinu Kluba kandidiraju zaposlenici Kluba, izbor u SkupStinu\nKluba predstavlja razlog za prestanak ugovora o radu 1/il1 sli¢nih ugovora koje imaju\nzakljucene s Klubom. Iznimno, ako se na izborima kao nositelj liste za svoj drugi mandat\nkandidira Predsjednik, ne prestaje mu ugovor tijekom izbornog postupka.\n\n(6) Clanovi tijela Kluba", ", Poéasni predsjednik Kluba, élanovi Izbornog povjerenstva, povjerenici\nKluba 1 Clanovi odbora koje osniva Nadzorni odbor mogu, prema odluci Uprave uz\nprethodno odobrenje Predsjednika Kluba, primati naknadu koja moze biti 1 nagrada\nmaterijalne naravi, ili da s ostalim osobama koje Klub Zeli nagraditi, budu gosti na domacim\n1/ili gostuyucim utakmica Kluba.\n\nClanak 30.\nMandat Clanovima tiela Kluba prestaje istekom mandata ill:\nsmrcu;\n\na\nb. pisanom ", "ili zapisnikom konstatiranom ostavkom;\n\nc. razrjeSenjem;\n\nd. trenutkom izbora novog saziva tijela Kluba;\n\ne. gubitkom poslovne sposobnosti;\n\nf. prestankom Clanstva u Klubu sukladno Clanka 24. stavaka 2. 14. ovog Statuta;\n\ng. nastupom okolnosti iz Clanka 29. stavaka 2. 1 3. ovog Statuta.\n\n1. SKUPSTINA\n\nClanak 31.\n(1) SkupStina je najviSe tiyelo Kluba.\n\n(2) SkupStina se sastoji od 50 (pedeset) predstavnika Clanova Kluba izabranih na nacin propisan\n", "odredbama ovog Statuta.\n\n(3) Mandat Clanova SkupStine, osim u slucéajevima propisanim ¢lankom 30. tockama a., b., d.,\ne., f. 1 g. ovog Statuta, je 5 (pet) godina te isti Clanovi mogu biti izabrani na novo mandatno\nrazdoblje.\n\nClanak 32.\n(1) SkupStina:\n\na. utvrduje opcu politiku, strateSke ciljeve 1 smjernice rada Kluba na temelyu Izbornog\nprograma pobjednicke izborne liste;\nb. usvaja Statut Kluba te predlaze njegove izmjene 1 dopune u slucajevima", " propisanim\nodredbama ovog Statuta;\n\nc. usvaja plan rada 1 financijski plan za sljedecu kalendarsku godinu;\n\nd. usvaja godiSnje financysko izvjeSce 1 izvjeS¢a Predsjednika Kluba o radu za\nprethodnu kalendarsku godinu;\n\ne. verificira 1zvjeSce o radu Nadzornog odbora za prethodnu kalendarsku godinu;\n\nf. donosi Poslovnik o radu SkupStine Kluba, Pravilnik 0 izborima u GNK ,,Dinamo“ te\ndruge akte 1 odluke vazne za rad Kluba prema ovom Statutu, poput p", "ravila o eti¢kim\npitanjima 1 pitanjima sukoba interesa;\n\ng. odlucuje o promjeni ciljeva, djelatnosti 1 obavljanju gospodarskih djelatnosti Kluba;\nh. odlucuje o udruzivanju u saveze, zajednice, mreze 1 druge oblike povezivanja udruga;\n1. birairazrjeSava Predsjednika Kluba;\n\nj. bira 1 razrjeSava Predsjednika Nadzornog odbora, Zamyjenika Predsjednika\nNadzornog odbora te ostale Clanove Nadzornog odbora;\n\nk. moze, uz Nadzorni odbor, razriyeSsiti Izbor", "no povjerenstvo 1 pojedine njegove Clanove\nradi uoéenih nepravilnosti na temelju ¢ega Nadzorni odbor provodi poziv 1 izbor za\nClanove novog Izbornog povjerenstva;\n\nl. na prijedlog Nadzornog odbora, bira 1 razrjeSava Pocasnog predsjednika Kluba;\nm. imenuje 1 opoziva likvidatora Kluba;\n\nn. donosi odluku o prestanku rada Kluba, raspodjeli preostale imovine Kluba 1 o\nstatusnim promjenama (pripajanju, spajanju 1 podjeli Kluba) 1 druge za nju formalno\n", "obvezujuce odluke u skladu s rezultatima provedenog referenduma;\n\no. naknadno verificira prestanak u Clanstvu tijela Kluba 1z razloga u Clanku 24., 29. 1\n30. ovog Statuta na prvoj sljedecoj sjednici;\n\np. tumaci Statut 1 opce akte koje donosi, odlucuje 1 0 drugim pitanjima za koje joj je\novim Statutom utvrdena nadleznost, ili nije utvrdena za druga tijela Kluba;\n\nClanak 33.\n\n(1) Sjednice SkupStine, osim u slucajevima propisanim odredbama ovog Stat", "uta, odlukom\nsaziva Nadzorni odbor putem Predsjednika Nadzornog odbora, a u slucaju njegove\nsprijecenosti putem Zamjenika Predsjednika Nadzornog odbora, a u slucaju sprijecenosti\nPredsjednika Nadzornog odbora 1 Zamyenika Predsjednika Nadzornog odbora putem\nnajstarijeg (po datumu rodenja) clana Nadzornog odbora.\n\n(2) Nadzorni odbor najkasnije 15 (petnaest) dana prije dana odrzavanja sjednice SkupStine\nformira konaéan popis svih ¢lanova Skup&tine. ", "U slucaju sazivanja izvanredne sjednice\nSkupstine Nadzorni odbor formira konacéan popis svih Clanova SkupStine u najkra¢em\nmogucem roku, a najkasnije 5 (pet) dana prije odrzavanja sjednice SkupStine.\n\n(3) Clana Skup&tine kojem je mandat u Skup&tini prestao iz razloga propisanih Glankom 30.\ntockama a., b., d., e., f. 1 g. ovog Statuta zamjenjyuje novi Clan s popisa preostalih kandidata\nza Clanove SkupStine s iste izborne liste na na¢in da Nadzorni", " odbor, nakon Sto bude\nobavijeSten ili sazna za prestanak mandata pojedinog Clana SkupStine, uvrStava novog Clana\nSkupStine na konaéan popis Clanova Skup$stine. Iznimno, ukoliko ¢lanu SkupStine prestane\nmandat u SkupStini nakon isteka roka 1z stavka 2. ovog Clanka Statuta, Nadzorni odbor,\nnakon Sto bude obavieSten ili sazna za prestanak mandata Clana SkupStine, uvrstava novog\nClana SkupStine na konaéan popis Clanova SkupStine.\n(4) Konaéan popis s", "vih ¢lanova SkupStine verificira se ¢itanjem imena Clanova SkupStine na\npocetku svake sjednice SkupStine.\n\n(5) U sluéaju da se iscrpi broj zamjena, SkupStina nastavlja s radom s preostalim brojem Clanova\nSkupStine, pod uvjetom da broj Clanova SkupStine nije manji od 26 (dvadeset Sest), te se\nprema tom broju odgovarajuce mijenjaju potrebne vecine za donoSenje odluka 1z nadleznosti\nSkupStine.\n\n(6) Zamjenskom ¢lanu SkupStine mandat traje do isteka m", "andata SkupStine.\n\n(7) U odluci o sazivanju SkupStine iz stavka 1. ovog ¢Clanka Statuta, koja se mora poslati\nClanovima SkupStine, Predsjedniku Kluba 1 Pocasnom predsjedniku Kluba najkasnije 15\n(petnaest) dana prije odrzavanja SkupStine, a u slucaju sazivanja izvanredne sjednice\nSkupStine najkasnie 5 (pet) dana prije odrzavanja sjednice, utvrduje se dnevni red te mjesto,\nkoje je u pravilu u sjediStu Kluba, 1 vrijeme odrzavanja sjednice SkupStine.", " Uz dnevni red\nobavezno se dostavljaju 1 svi materyali potrebni za donoSenje odluka po dnevnom redu.\n\n(8) Predsjednik Kluba ili najmanje 15 (petnaest) Clanova SkupStine mogu, nakon primitka\nodluke o utvrdivanju dnevnog reda redovne sjednice SkupStine, a najkasnije 5 (pet) dana\nprije sjednice SkupStine, pisanim zahtjevom Nadzornom odboru dopuniti dnevni red bilo\nkojom tocékom koja je u nadleznosti SkupStine.\n\n(9) Nadzorni odbor putem Predsjednika ", "Nadzornog odbora ili osobe koja ga sukladno stavku 1.\novog Clanka Statuta zamjenjuje, duzan je dopune dnevnog reda Predsjednika Kluba ili\nnajmanje 15 (petnaest) Clanova Skup$stine uvrstiti na dnevni red SkupStine.\n\n(10) Najkasniye 3 (tri) dana prije dana odrzavanja sjednice SkupStine Clanovima Skup8Stine,\nPredsjedniku Kluba 1 Pocéasnom predsjedniku Kluba dostavlja se konac¢ni dnevni red\nSkupStine, a Clanovima SkupStine se, uz kona¢éni dnevni red ", "SkupStine, obvezno dostavljaju\n1 svi dodatni materyali potrebni za donoSenje odluka prema dnevnom redu.\n\n(11)  Clanovi Skup8tine imaju pravo, radi donoSenja informirane odluke na Skup8tini, i Sire\nod dokumenata koji se dostavljaju uz konaéni dnevni red, bilo kada od tyjela Kluba pisanim\nzahtjevom traziti podatke, pod uvjetom da isti ne predstavljaju poslovnu ili sluzbenu tajnu 1\nu skladu su s posebnim propisima o zaSstiti osobnih podataka. Ukolik", "o do dana odrzavanja\nsjednice SkupStine Clan SkupStine ne dobiye trazene podatke, tijelo Kluba kojem je zahtjev\nupucen duzno je odgovor na zahtjev ili zatrazene podatke dati na sjednici SkupStine 1 to prie\ndonoSenja odluke o toéci dnevnog reda za koju je zahtjev upucen.\n\nClanak 34.\n(1) Sjednice SkupStine mogu biti izborne, redovite 1 1zvanredne.\n\n(2) Izborna sjednica SkupStine odrzava se najkasniye u roku od 15 (petnaest) dana od dana\nodrzavanja ", "izbora 1 u drugim slucajevima propisanim ovim Statutom te na istoj, a sukladno\nrezultatima izbora te odredbama ovog Statuta, izabire Predsjednika Kluba, Predsjednika\nNadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te ostale Clanove Nadzornog\nodbora.\n\n(3) Redovna sjednica SkupStine saziva se najmanje jednom godi&Snje.\n\n(4) Izvanredna sjednica SkupStine moze se sazvati prema potrebi, za bilo kojyu odluku 1z\nnadleznosti SkupStine, a mora s", "e sazvati:\n\na. ako, 1z razloga propisanih Clankom 44. ovog Statuta, prestane mandat Predsjedniku\nKluba;\n\nb. ako, 1z razloga propisanih ¢lankom 30. to¢kama a.-g. ovog Statuta, prestane mandat\nsvim Clanovima Nadzornog odbora ili broj Clanova Nadzornog odbora padne ispod\nbroja 5 (pet);\nc. ako sazivanje izvanredne sjednice SkupStine, obrazlozenim zahtjevom koji sadrzi 1\nprijedlog dnevnog reda izvanredne sjednice SkupStine, zatrazi1 Nadzorni odbor;\n\nd", ". ako sazivanje izvanredne sjednice SkupStine, obrazlozenim zahtjevom koji sadrzi 1\npriyedlog dnevnog reda izvanredne sjednice SkupStine, zatrazi natpolovi¢na vecina\nClanova SkupStine.\n\n(5) U sluéaju 1z stavka 4. tocke a. ovog Clanka Statuta, izvanredna sjednica SkupStine saziva se\nna na¢éin 1 u rokovima propisanim Clankom 44. ovog Statuta.\n\n(6) U slucéaju iz stavka 4. tocke b. ovog Clanka Statuta, Predsjednik Kluba duzan je sazvati\nizvanrednu sj", "ednicu SkupStine u roku od 5 (pet) dana od saznanja za prestanak mandata svim\n¢lanovima Nadzornog odbora ili pada broja Clanova Nadzornog odbora ispod broja 5 (pet).\n\n(7) U sluéaju iz stavka 4. tocaka c. 1d. ovog Clanka Statuta, Nadzorni odbor putem Predsjednika\nNadzornog odbora ili osobe koja ga sukladno Clanku 33. stavku 1. ovog Statuta zamjenjuje,\nduzan je sazvati izvanrednu sjednicu SkupStine u roku od 5 (pet) dana od zaprimanja\nzahtjeva za s", "azivanje izvanredne sjednice SkupStine te se ista mora odrzati najkasniye u roku\nod 15 (petnaest) dana od odluke o sazivanju.\n\n(8) Ako Predsjednik Nadzornog odbora ili osoba koja ga sukladno ¢lanku 33. stavku 1. ovog\nStatuta zamjenjuje, u slucajevima iz stavka 4. tocaka c. 1 d. ovog Statuta, ne sazove\nizvanrednu sjednicu SkupStine u roku od 5 (pet) dana od dana zaprimanja zahtjeva,\nizvanrednu sjednicu SkupStine mogu sazvati sami predlagatelji, na", " nacin da svi predlagatelj1\npotpisu poziv kojom se saziva sjednica izvanredne SkupStine.\n\n(9) Nakon sazivanja izvanredne sjednice SkupStine na zahtjev Nadzornog odbora ili\nnatpolovi¢ne vecine Clanova Skupstine mora proteci najmanje 3 (tri) mjeseca prie\npodnoSenja novog zahtjeva za sazivanjem nove izvanredne sjednice SkupStine s istim\nprijedlogom dnevnog reda.\n\nClanak 35.\n\n(1) SkupStina na izbornoj sjednici odlucuje pravovaljano o izborima 1z lank", "a 34. stavka 2. ovog\nStatuta, ako je na sjednici nazocéna natpolovicna vecina Clanova SkupStine, a odluke donosi\nvecinom glasova svih Clanova Skup§tine, osim ako odredbama ovog Statuta nije propisan\ndrugaciji nacin donoSenja odluka.\n\n(2) SkupStina odlucuje pravovaljano ako je na sjednici nazo¢na natpolovicna vecina ¢lanova\nSkupStine, a odluke donosi vecinom glasova nazoénih Clanova SkupStine, osim ako Statutom\nnye propisan drugaciji nacin donoSen", "ja odluke.\n\n(3) SkupStina dvotre¢cinskom vecinom svih ¢lanova SkupStine donosi odluku o:\n\na. izmjenama 1 dopunama Statuta, osim u slucajevima kada je za promjenu tog diyela\nStatuta prethodno potrebno provodenje referenduma, kada odlucuje na nacin\npropisan stavkom 2. ovog Clanka Statuta;\n\nb. razrjeSenju cijelog Nadzornog odbora, Predsjednika Nadzornog odbora, Zamjenika\nPredsjednika Nadzornog odbora 1/ili pojyedinih Clanova Nadzornog odbora;\n\nc. ra", "zrjeSenju Predsjednika Kluba;\nd. razrjeSenju Pocasnog predsjednika Kluba;\ne. sazivanju izvanrednih izbora.\n\n(4) U slucaju izjednacenog broja glasova kod donoSenja odluka na sjednicama SkupStine\nprijedlog se smatra odbijenim. SkupStina, po odluci predsjedavajuceg, moze ponovno\nodlucivati o istom prijedlogu nakon dodatne rasprave 1 izmjene sadrzaja prijedloga dok traje\nista to¢ka dnevnog reda ili na iducoj sjednici SkupStine.\nClanak 36.\n\n(1) Sjedni", "cama Skup§Stine predsjeda Predsjednik Nadzornog odbora, a u slucaju njegove\nsprijecenosti Zamyenik Predsjednika Nadzornog odbora, a u_ slucaju_ sprijecenosti\nPredsjednika Nadzornog odbora 1 Zamjenika Predsjednika Nadzornog odbora najstariji (po\ndatumu rodenja) nazocéni Clan Nadzornog odbora (dalje u tekstu 1: Predsjedavajuci\nSkupStine). Iznimno, ako prestane mandat svim Clanovima Nadzornog odbora ili broj\nClanova Nadzornog odbora padne ispod broj", "a 5 (pet), Predsjedavajuci SkupStine na\nizvanrednoj sjednici SkupStine je Predsjednik Kluba.\n\n(2) SkupStina zapocinje verificiranjem kona¢nog popisa svih Clanova SkupStine, utvrdivanjem\nprisutnog broja Clanova SkupStine od strane Predsjedavajuceg SkupStine te izborom ¢lanova\nRadnog predsjednistva SkupStine.\n\n(3) Radno  predsjednistvo SkupStine rukovodi Radom SkupStine, a_ sastoji se od\nPredsjedavajuceg SkupStine te 2 (dva) Clana SkupStine koja iz", "abire Predsjedavajuci\nSkupStine.\n\n(4) SkupStina sve verifikacye u svojoj nadleznosti obavlja javnim Citanjem u zapisnik.\n\n(5) Na izbornoj sjednici SkupStine, do izbora Predsjednika Kluba, Predsjednika Nadzornog\nodbora 1 Zamjenika Predsjednika Nadzornog odbora, sjednicom SkupStine predsjeda nositel}\nizborne liste koja je na izborima ostvarila veci broj glasova €lanova Kluba. Nakon izbora\nPredsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika", " Predsjednika Nadzornog\nodbora te ostalih ¢lanova Nadzornog odbora, nositelja izborne liste koja je na izborima\nostvarila veci broj glasova Clanova Kluba zamjenjuje Predsjednik Nadzornog odbora kao\npredsjedavajuceg skupStine.\n\n(6) O radu sjednice SkupStine vodi se zapisnik koji se trajno Cuva u arhivi Kluba, a kojeg\npotpisuju Predsjedavajuci SkupStine 1 zapisnicar.\n\n(7) Uprava dostavlja zapisnik sa sjednica SkupStine nadleznom uredu koji vodi reg", "istar udruga.\n\n2. NADZORNI ODBOR\n\nClanak 37.\n\n(1) Nadzorni odbor Kluba je nadzorno 1 izvjeStajno tijelo SkupStine koje nadzire upravljanje\nKlubom, provodenje nacela Kluba, ukljucujuci 1 strateSke smjernice SkupStine kao 1\nprovodenje Izbornog programa pobjednicke izborne liste.\n\n(2) Nadzorni odbor sastoji se od 9 (devet) ¢lanova izabranih iz redova Clanova Skup&tine na\nnacin propisan ovim Statutom, 1 to:\n\na. Predsjednika Nadzornog odbora;\nb. Zamye", "nika Predsjednika Nadzornog odbora;\nc. 7 (sedam) ¢Clanova Nadzornog odbora.\n\n(3) SkupStina, sukladno odredbama ovog Statuta, bira Predsjednika Nadzornog odbora,\nZamjenika Predsjednika Nadzornog odbora 1 ostale Clanove Nadzornog odbora.\n\n(4) Clanovi Nadzornog odbora ne mogu biti élanovi drugih tijela Kluba, osim SkupStine.\nClanak 38.\n\n(1) Mandat Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te\nClanova Nadzornog odbora, osi", "m u slucajevima propisanim ¢lankom 30. to¢kama a.-g. ovog\nStatuta, je 5 (pet) godina te isti Clanovi mogu biti izabrani na nova mandatna razdoblja.\n\n(2) U sluéaju prestanka mandata pojedinih Clanova Nadzornog odbora 1z razloga propisanih\nClankom 30. to¢ékama a.-g. ovog Statuta, Nadzorni odbor do izbora novih ¢lanova nastavlja\ns radom s tim smanjenim brojem Clanova, pod uvjetom da broj Clanova Nadzornog odbora\nnije manji od 5 (pet).\n\n(3) U sluéaju", " 1z stavka 2. ovog Clanka Statuta, SkupStina na prvoj sljedecoj sjednici SkupStine,\nna prijedlog Predsjednika Nadzornog odbora, bira preostale Clanove Nadzornog odbora 1z\nredova Clanova SkupStine.\n\n(4) Ukoliko, 1z razloga propisanih ¢lankom 30. tockama a.-g. ovog Statuta, prestane mandat\nPredsjedniku Nadzornog odbora, novim Predsjednikom Nadzornog odbora automatski\npostaje Zamjenik Predsjednika Nadzornog odbora, a ¢lan Nadzornog odbora na izborno", "] listi\nnaveden pod rednim brojem 4 (Cetiri) automatski postaje novi Zamjenik Predsjednika\nNadzornog odbora. Navedeni se nacin izbora novog Predsjednika Nadzornog odbora ili\nZamjenika Predsjednika Nadzornog odbora primjenjuje do Clana Nadzornog odbora koji je\nna izborno] listi naveden pod rednim brojem 10 (deset), a ukoliko prestane mandat 1 Clanu\nNadzornog odbora koji je na izbornoj listi naveden pod rednim brojem 10 (deset),\nPredsjednikom Nadzo", "rnog odbora ili Zamjenikom Predsjednika Nadzornog odbora\nautomatski postaju novoizabrani ¢lanovi Nadzornog odbora redoslijedom njihovog izbora\nza Clanove Nadzornog odbora.\n\n(5) U sluéaju da, iz razloga propisanih ¢lankom 30. to¢ékama a.-g. ovog Statuta, prestane mandat\nsvim Clanovima Nadzornog odbora ili broj Clanova Nadzornog odbora padne ispod broja 5\n(pet), Predsjednik Kluba, u roku koji ne moze biti dulji od 5 (pet) dana, saziva izvanrednu\nsj", "ednicu SkupStine te predlaze nove Clanove Nadzornog odbora 1z redova Clanova SkupSstine,\na najmanje 15 (petnaest) Clanova SkupStine pisanim prijedlogom moze na sjednici predloziti\ndruge kandidate.\n\n(6) U sluéajevima 1z ovog Clanka Statuta, novoizabranim Clanovima Nadzornog odbora mandat\ntraje do isteka mandata Nadzornog odbora.\n\nClanak 39.\nNadzorni odbor Kluba:\n\na. nadzire provedbu op¢cih nacela djelovanja Kluba te Stiti 1 promice njegov identite", "t,\npovijest, vrijednosti 1 Clanska prava;\n\nb. skrbi o financijskom, pravnom 1 gospodarskom poslovanju Kluba te o raspolaganju\nnjegovom imovinom;\n\nc. radi procjene financijskog poslovanja Kluba mora angazirati neovisnog vanjskog\nrevizora jednom godisnje. IzvjeS¢ée neovisnog revizora sastavni je dio izvjeS¢a o radu\nNadzornog odbora.\n\nd. nadzire provedbu odluka SkupStine, strateSkih smjernica, godiSnjeg plana rada,\nfinancijskog plana 1 Izbornog prog", "rama Kluba;\n\ne. daje prethodnu suglasnost Predsjedniku Kluba za imenovanje 1 razrjeSenje Clanova\nUprave;\n\nf. pomaze Predsjedniku u odredivanju operativnih 1 strateSkih ciljeva te zaduzenja\nClanovima Uprave 1 nadzire njihovu provedbu;\ng. odobrava prijedlog Predsjednika 1 Uprave u vezi godiSnjeg plana rada 1 financijskog\nplana Kluba te godisnjeg financijskog 1zvjeS¢a 1 1zvjeS¢a o radu Kluba;\nh. usuradnji s Predsjednikom, redovno provodi formalnu ev", "aluaciju rada svakog Clana\n\nUprave, uzimajuci u obzir ostvarenje ciljeva 1 poStivanje vrednota Kluba;\n\n1. nadzire rad Predsjednika 1 Uprave te u vezi toga moze izdavati naputke, 1 zahtijevati\nizvjeSca 1 dokumentaciju te sazivati dodatne koordinacijske sastanke;\n\nj. daje prethodnu suglasnost za pravne poslove 1 zaduzenja Kluba iznad iznosa od\n3.000.000 EUR (tri miliyuna eura) te za provizije 1 podjele kod transfera koje prelaze\n10% (deset posto) v", "rijednosti ugovora;\n\nk. obavjeStava nadlezna tijela Kluba o neuskladenostima u radu ili aktima s odredbama\nStatuta 1 drugih akata te, ukoliko iste ne budu ispravljene, o tome izvjeScuje\nSkupstinu;\n\nl. saziva izbore putem Predsjednika Nadzornog odbora te osniva, nadzire 1 razrjeSava\nIzborno povjerenstvo 1 pojedine njegove Clanove iskljucivo iz razloga propisanih\novim Statutom 1 Pravilnikom o izborima u GNK ,,Dinamo“ nakon €ega provodi poziv\nza nov", "e Clanove\n\nm. rjeSava sukobe interesa 1 sporove unutar Kluba;\n\nn. dyjeluje kao drugostupanjsko tijelo u stegovnim postupcima koji se odnose na ¢lanska\nprava 1 obveze te donosi konaéne odluke 0 stegovnim mjerama;\n\no. predlaze izmjene 1 dopune Statuta, osim u slucajevima propisanim odredbama ovog\nStatuta, predlaze Pravilnik o izborima u GNK ,,Dinamo“, kao 1 pravila o eti¢kim\npitanjima 1 pitanjima sukoba interesa;\n\ndonosi odluke o iznosu ¢lanarine 1", " naknade za Prijatelje Kluba;\n\nq. moze osnivati savjetodavne odbore 1 povjerenstva za potrebe ucinkovitieg rada\nKluba, a u aktu o osnivanju odreduje njihov sastav, trajanje mandata, svrhu 1 zadace;\n\nr. daje prethodnu suglasnost Predsjedniku 1 Upravi za donoSenje Pravilnika o\ndjelokrugu 1 unutarnjem ustrojstvu Kluba u njegovom dielu kojim se ureduje\ndjelokrug rada pojedinih ¢lanova Uprave;\n\ns. donosi Poslovnik o radu Nadzornog odbora te druge opée", " akte unutar djelokruga\nsvog rada;\n\nt. podnosi Skup§Stin1 prijedloge za imenovanje Pocasnog Predsjednika, pocasna\nodlikovanja Clanova Kluba za doprinos Klubu ili za dugotrajno Clanstvo;\n\nu. obavljai druge poslove u skladu sa zakonima, ovim Statutom 1 opcim aktima Kluba.\n\nClanak 40.\n\n(1) Sjednice Nadzornog odbora saziva Predsjednik Nadzornog odbora, a u slucaju njegove\nsprijecenosti Zamyenik Predsjednika Nadzornog odbora, a u_ slucaju_ sprijecenos", "ti\nPredsjednika Nadzornog odbora 1 Zamjenika Predsjednika Nadzornog odbora najstariji (po\ndatumu rodenja) Clan Nadzornog odbora.\n\n(2) Sjednice Nadzornog odbora sazivaju se prema potrebi, a najmanje 10 (deset) puta godisnje.\n(3) Sjednica Nadzornog odbora mora Sse sazvati:\na. kada to pisanim zahtjevom zatrazi vecina Clanova Nadzornog odbora;\n\nb. kada to pisanim zahtjevom zatrazi Predsjednik Kluba 1 to za ishodenje prethodne\nsuglasnosti za pravne po", "slove iznad iznosa od 3.000.000 EUR (tri miliyuna eura),\nishodenje prethodne suglasnosti za provizije 1 podjele kod transfera koje prelaze 10%\n(deset posto) vrijednosti ugovora te za izbor ili razrjeSenje Clanova Uprave Kluba;\n\nc. kada privremena sprijecenost Predsjednika Kluba traje dulje od 7 (sedam) dana;\n\nd. kada prestane mandat Predsjedniku Kluba iz razloga propisanih Clankom 44. ovog\nStatuta.\n\n(4) Predsjednik Nadzornog odbora ili osoba koja", " ga sukladno stavku 1. ovog ¢lanka Statuta\nzamjenjuje mora sazvati sjednicu Nadzornog odbora u roku od 24 (dvadeset Cetiri) sata od\nsaznanja za nastup okolnosti 1z stavka 3. ovog Clanka Statuta ili primitka pisanog zahtjeva\nvecine Clanova Nadzornog odbora ili Predsjednika Kluba, a sjednica Nadzornog odbora\nmora se odrzati najkasniye u roku od 3 (tri) dana od dana sazivanja.\n\n(5) Ako Predsjednik Nadzornog odbora ili osoba koje ga sukladno stavku 1", ". ovog ¢lanka Statuta\nzamjenjuje, u roku 1z stavka 4. ovog Clanka Statuta, ne sazove sjednicu na pisani zahtjev\nvecine Clanova Nadzornog odbora, sjednicu moze sazvati ve¢cina Clanova Nadzornog odbora\nna nacin da svi predlagatelji potpiSu poziv kojim se saziva sjednica Nadzornog odbora.\n\n(6) Ako Predsjednik Nadzornog odbora ili osoba koje ga sukladno stavku 1. ovog €lanka Statuta\nzamjenjuje, u roku 1z stavka 4. ovog Clanka Statuta, ne sazove sjedn", "icu na pisani zahtjev\nPredsjednika Kluba, Predsjednik Kluba ovlaSten je donijeti odluku bez prethodne\nsuglasnosti Nadzornog odbora.\n\n(7) Nadzorni odbor odlucuje pravovaljano ako je na sjednici nazo¢na natpolovic¢na vecina\nClanova, a odluke donosi vecinom glasova nazoénih Clanova.\n\n(8) U sluéaju izjednacenog broja glasova kod donoSenja odluka Nadzornog odbora odlucujuci\nje glas Predsjednika Nadzornog odbora ili osobe koje ga sukladno stavku |. ovo", "g ¢lanka\nStatuta zamjenjuje.\n\n(9) Nacin 1 uvjete svog rada Nadzorni odbor ureduje Poslovnikom o radu Nadzornog odbora.\n\nClanak 41.\n\n(1) Nadzorni odbor podnosi SkupStini redovito godiSnje izvjeSce glede svih nadleznosti\nNadzornog odbora, posebno nadzora rada Predsjednika Kluba 1 Uprave Kluba.\n\n(2) SkupStina moze zatraziti od Nadzornog odbora podnoSenje izvanrednog izvjeSéa.\n\nClanak 42.\nPredsjednik Nadzornog odbora:\n\na. saziva te predlaze dnevni re", "d sjednica Skup$Stine, sukladno Clanku 33. ovog Statuta,\nodlukama na referendumu 1 drugim razlozima za odrzavanje sjednica SkupStine 1z\novog Statuta;\n\nb. saziva te predlaze dnevni red sjednica Nadzornog odbora, osim u slucajevima\npropisanim odredbama ovog Statuta;\n\nCc. upoznaje javnost s radom 1 odlukama SkupStine Kluba;\n\nd. natemelju odluke Nadzornog odbora, podnosi prijedlog Statuta te drugih op¢cih akata\nkoje usvaja SkupStina, osim u slucajevi", "ma odredenim ovim Statutom;\n\ne. predsjeda sjednicama SkupStine 1 imenuje druge Clanove SkupStine u Radno\npredsjednistvo Skup$stine;\n\nf. na temelju odluke Nadzornog odbora, saziva izbore u Klubu, sukladno ¢lanku 50.\nstavku 7. ovog Statuta;\ng. zastupa Klub, sklapa 1 raskida ugovor o radu s izabranim Predsjednikom Kluba.\n\n3. PREDSJEDNIK KLUBA\n\nClanak 43.\n\n(1) Predsjednik Kluba predstavlja 1 zastupa Klub, provodi strateSke odluke, imenuje 1 razrjeSav", "a\nClanove Uprave te usmjerava 1 nadzire rad Uprave.\n\n(2) Mandat Predsjednika Kluba, osim u slucéajevima propisanim Clankom 44. ovog Statuta, je 5\n(pet) godina 1 ogranicen je na dva mandata.\n\n(3) Za svoj rad Predsjednik Kluba odgovara Nadzornom odboru 1 SkupStini Kluba.\n\n(4) Predsjednik Kluba odgovoran je za zakonitost rada Kluba, provodenje strateSkih odluka\nSkupStine 1 ostvarenje ciljeva Kluba utvrdenih Izbornim programom.\n\nClanak 44.\n\n(1) U slu", "céaju privremene sprijecenosti Predsjednika Kluba koja traje dulje od 7 (sedam) dana ili\nu slucéaju prestanka mandata Predsjednika Kluba iz razloga propisanih ¢lankom 30. to¢kama\na.-g. ovog Statuta, Nadzorni odbor duzan je, u rokovima 1z ¢lanka 40. stavka 4. ovog Statuta,\nodrzati sjednicu te na istoj sjednici izabrati osobu koja Ce privremeno zamyeniti\nPredsjednika Kluba u svim pravima, duznostima 1 ovlastima.\n\n(2) Osobu 1z stavka 1. ovog Clanka ", "Statuta, Nadzorni odbor moze izabrati izmedu Clanova\nNadzornog odbora, ¢lanova Uprave, ¢lanova SkupStine ili ¢lanova Kluba za koje ne postoje\nzapreke 1z Clanka 29. ovog Statuta.\n\n(3) Osoba iz stavka 1. ovog Clanka Statuta zamjenjuje Predsjednika Kluba do prestanka razloga\nprivremene sprijecenosti Predsjednika Kluba, a u slucajevima propisanim stavkom 4. 1 5.\novog Clanka Statuta do izbora novog Predsjednika Kluba.\n\n(4) Privremena sprijecenost Pred", "sjednika Kluba iz stavka 1. ovog ¢lanka Statuta moze trajati\nnajvise 6 (Sest) mjeseci. Ukoliko privremena sprijecenost Predsjednika Kluba traje dulje od\n6 (Sest) mjeseci, smatra se da je mandat Predsjednika Kluba prestao.\n\n(5) U sluéaju 1z stavka 4. ovog Clanka Statuta ili u slucaju prestanka mandata Predsjednika\nKluba 1z razloga propisanih ¢lankom 30. to¢kama a.-g. ovog Statuta, Nadzorni odbor duzan\nje odrzati sjednicu u rokovima iz Clanka 40. s", "tavka 4. ovog Statuta te na istoj sjednici\nraspisati poziv svim Clanovima Kluba, a za koje ne postoje zapreke iz Clanka 29. ovog\nStatuta, da najkasnije u roku od 30 (trideset) dana od objave poziva Nadzornom odboru\ndostave vlastitu kandidaturu za Predsjednika Kluba.\n\n(6) Nakon isteka roka 1z stavka 5. ovog Clanka Statuta, Nadzorni odbor duzan je odrzati sjednicu\nu rokovima iz Clanka 40. stavka 4. ovog Statuta, na kojoj Ce, izmedu zaprimljenih\nkan", "didatura, diskrecijskom ocjenom izabrati najvi8e 2 (dva) kandidata te odmah sazvati\nizvanrednu sjednicu SkupStine.\n\n(7) Nadzorni odbor prilikom donoSenja odluke o izboru kandidata, sukladno stavku 6. ovog\nClanka Statuta, primjenjuje kriterije prethodnog profesionalnog 1 radnog iskustva kandidata,\nobrazovanja, poznavanja organizacijske 1 upravljacke strukture Kluba, prethodnog radnog\niskustva na izvrsnim, nadzornim ili upravlja¢kim funkcijama u no", "gometnim ili drugim\nsportskim klubovima, slijedenja 1 provodenja izbornog programa izborne liste koja je na\nizborima ostvarila ve¢i broj glasova Clanova Kluba, a moze primjenjivati 1 druge kriterije.\n(8) Izvanredna sjednica SkupStine, a koja ¢e izabrati novog Predsjednika Kluba izmedu\nkandidata 1z stavka 6. ovog lanka Statuta, mora se odrzati najkasnije 5 (pet) dana od dana\nsazivanja.\n\n(9) Izvanredna sjednica SkupStine odlucuje pravovaljano ako j", "e na sjednici nazocéna\nnatpolovicéna vecina Clanova Skup$&tine, a odluku o izboru novog Predsjednika Kluba donosi\nvecinom glasova nazocnih ¢lanova SkupStine.\n\n(10) Novoizabranom Predsjedniku Kluba mandat traje do isteka mandata tijelima Kluba\ntiiekom kojeg je duzan sliyjediti 1 provoditi 1zborni program izborne liste koja je na izborima\nostvarila veci broj glasova Clanova Kluba.\n\nClanak 45.\nPredsjednik Kluba:\n\na. predstavlja 1 zastupa Klub samost", "alno 1 pojedina¢no u pravnom prometu, osim u\nposlovima za koje mu je potreban supotpis Clana Uprave 1/ili prethodna suglasnost\nNadzornog odbora;\n\nb. imenuje i razrjeSava Clanove Uprave te sklapa 1 raskida s njima ugovore o radu, uz\nprethodnu suglasnost Nadzornog odbora;\n\nc. usuradnji s Nadzornim odborom, odreduje operativne ciljeve 1 zaduzenja Clanovima\nUprave te nadzire njihovu provedbu;\n\nd. usmjerava i nadzire rad Uprave;\n\ne. usuradnji s Nadzor", "nim odborom, redovno provodi formalnu evaluaciju rada svakog\nClana Uprave;\n\nf. usuradnji s Upravom, predlaze Skup$Stini godisnji plan rada 1 financijski plan Kluba\nte je, nakon njihova usvajanja, odgovoran za njihovo provodenje;\n\ng. samostalno 1 pojedina¢no zastupa Klub u pravnim poslovima ukupne vrijednosti do\n100.000,00 EUR (sto tisuéa eura);\n\nh. zastupa Klub u pravnim poslovima ukupne vrijednosti iznad 100.000,00 EUR (sto\ntisu¢a eura) do 3.000", ".000,00 EUR (tri milijuna eura), uz supotpis jednog Clana\nUprave;\n\n1. zastupa Klub u pravnim poslovima pojedinacéne vrijednosti iznad 3.000.000,00 EUR\n(tri milijuna eura) te u poslovima kod kojih provizie 1 podjele kod transfera prelaze\n10% (deset posto) vrijednosti ugovora, uz prethodnu suglasnost Nadzornog odbora\nte uz supotpis jednog Clana Uprave;\n\nj. skrbi o zakonitosti 1 statutarnosti rada Kluba te 0 provodenju op¢ih nacela djelovanja\nKluba;", "\n\nk. u suradnji s Upravom priprema 1 podnosi SkupStini godisnje financijsko izvjesce 1\nizvjeSce o radu Kluba;\n\n1. usuradnji s Upravom, podnosi Nadzornom odboru kvartalna 1 godiSnja izvjeSéa te\ndodatna izvjeS¢a na zahtjev Nadzornog odbora;\n\nm. djeluje samostalno u okviru ovlasti definiranih ovim Statutom, pri Cemu je duzan\nsazvati sjednicu Uprave radi savjetovanja 1 odlucivanja u slucajevima koji ukljucuyu\npromjene strateSkog smjera Kluba, reorgan", "izaciju poslovanja, donoSenje planova\nzaposljavanja 1 svih odluka koje nadilaze njegove pojedinaéne ovlasti ili za koje ovim\nStatutom nye izricito propisana njegova samostalna nadleznost;\n\nn. obavljai druge poslove u skladu sa zakonima, ovim Statutom 1 opcim aktima Kluba.\n4. UPRAVA KLUBA\n\nClanak 46.\n\n(1) Uprava Kluba je izvrSno tiyelo koje operativno vodi poslovanje Kluba, u skladu sa\nsmjernicama 1 odlukama Predsjednika Kluba 1 Nadzornog odbora.\n", "\n(2) Uprava Kluba upravlja radom struénih sluzbi 1 zaposlenika Kluba u skladu s odredbama\novog Statuta, op¢cih akata Kluba te odlukama Predsjednika Kluba 1 Nadzornog odbora, kada\nje on odredbama ovog Statuta ovlaSten za takve odluke.\n\n(3) Uprava Kluba sastoji se od 2 (dva) do 4 (Cetiri) Clana koje imenuje 1 razrjeSava Predsjednik\nKluba, uz prethodnu suglasnost Nadzornog odbora.\n\n(4) Mandat Clanova Uprave, osim u slucéajevima 1z Clanka 30. tocaka ", "a., b., c., d., e. 1 g. Ovog\nStatuta, traje najdulje 5 (pet) godina te isti Clanovi mogu biti izabrani na nova mandatna\nrazdoblja.\n\n(5) Clanovi Uprave ne mogu biti lanovi drugih tijela Kluba.\n\n(6) Za svoj rad irad strucnih sluzbi Clanovi Uprave odgovorni su Predsjedniku Kluba, a zajedno\ns Predsjednikom Kluba odgovorni su Nadzornom odboru 1 Skup$tin1.\n\n(7) Uprava odluke donosi na na¢in propisan Clankom 47. ovog Statuta te zastupa Klub u pravnim\npo", "slovima pojedinaéne vrijednosti do 1znosa od 100.000,00 EUR (sto tisu¢éa eura) na nacin\nda Klub skupno zastupaju najmanje dva Clana Uprave.\n\nClanak 47.\n(1) Uprava odluke iz svoje nadleznosti u pravilu donosi na sjednicama Uprave.\n\n(2) Sjednice Uprave, prema potrebi, saziva bilo koji Clan Uprave, a moze ih sazvati 1 Predsjednik\nKluba ili osoba 1z lanka 44. stavka 1. ovog Statuta.\n\n(3) Predsjednik Kluba ili osoba iz ¢lanka 44. stavka 1. ovog Statut", "a duzna je sazvati sjednicu\nUprave prije donoSenja:\na. strateSkih odluka;\n\nb. odluka o pravnim poslovima pojedinaéne vrijednosti 1znad 500.000 EUR (petsto\ntisuca eura);\n\nc. odluka koje imaju za posljedicu promjenu organizacijske strukture ili sklapanje ili\nraskid ugovora sa zaposlenicima ili osobama koje obavljaju odredene poslove, a koje\nza svoj rad odgovaraju izravno Upravi;\n\nd. ostalih odluka za koje je odredbama ovog Statuta propisano da se d", "onose na\nsjednicama Uprave;\n\ne. odluka o izvjeScima koja Predsjednik 1 Uprava podnose Nadzornom odboru 1/ili\nSkup8stini.\n(4) Uprava je duzna odrzati minimalno 10 (deset) sjednica godiSnje.\n\n(5) Uprava na sjednici odlucuje pravovaljano ako je na sjednici nazo¢éna natpolovicna ve¢cina\nukupnog broja Clanova Uprave.\n\n(6) Predsjednik Kluba ima pravo biti obavijeSten o sjednicama Uprave te sudjelovati u radu\nsjednice Uprave s pravom glasa 1, ukoliko je", " prisutan na sjednici Uprave, smatra se dijelom\nkvoruma za odlu¢civanje.\n(7) Na sjednicama Uprave odluke se donose vecinom glasova nazoénih ¢lanova Uprave. U\nslucaju izjednacenog broja glasova Clanova Uprave odlucujuci je glas Predsjednika Kluba\nili osobe 1z Clanka 44. stavka 1. ovog Statuta.\n\n(8) Nacine 1 uvjete svog rada Uprava Kluba ureduje Poslovnikom o radu Uprave, uz suglasnost\nPredsjednika Kluba.\n\nClanak 48.\nUprava Kluba:\noperativno upravl", "ja radom Kluba 1 za svoj rad odgovorna je Predsjedniku Kluba;\n\nb. s Predsjednikom Kluba donosi Pravilnik o djelokrugu 1 unutarnjem ustrojstvu Kluba,\nkojim se ureduju nadleznosti ¢lanova Uprave 1 organizacija rada Kluba, a uz\nprethodnu suglasnost Nadzornog odbora za dio u kojem se ureduje djelokrug rada\npojyedinih Clanova Uprave;\n\nc. zastupa Klub u pravnim poslovima pojedinaéne vrijednosti do iznosa od 100.000,00\nEUR (sto tisuéa eura) na na¢cin da", " Klub skupno zastupaju najmanje dva Clana Uprave;\n\nd. u suradnji s Predsjednikom, priprema i predlaze SkupStini godiSnji plan rada 1\nfinancijski plan Kluba;\n\ne. u suradnji s Predsjednikom, priprema 1 podnosi SkupStini godiSnje financijsko\nizvjeSce 1 izvjeSce o radu Kluba;\n\nf. usuradnji s Predsjednikom, podnosi Nadzornom odboru kvartalna 1 godiSnja izvjeSca\nte dodatna izvjeS¢éa na zahtjev Nadzornog odbora;\n\ng. upravlja imovinom Kluba u okviru ovla", "sti 1 djelokruga svakog Clana Uprave;\n\nh. sklapairaskida ugovore o radu s ostalim zaposlenicima Kluba, osim s Predsjednikom\n1 Clanovima Uprave;\n\n1. donosi interne akte Kluba u skladu sa Statutom 1 odlukama nadleznih tiela Kluba;\n\nJ. organizira 1 nadzire sportsku, poslovnu 1 strucénu politiku Kluba, osim u pitanjima\nkoja su u iskljucivoj nadleznosti Predsjednika Kluba;\n\nk. osigurava redovito obavjeStavanje Clanova Kluba o radu 1 rezultatima Kluba ", "te\nodgovara na upite 1 inicijative Clanova;\n\nl. imenuje Clanove upravnog odbora Zaklade GNK Dinamo ,,Nema predaje“ 1 nadzire\nnjihov rad, u skladu s posebnim odlukama Skup$tine;\n\nm. obavlja1 druge poslove u skladu sa zakonima, ovim Statutom 1 opcim aktima Kluba.\n\nV. POCASNI PREDSJEDNIK KLUBA\n\nClanak 49.\n(1) Klub moze imati samo | (jednog) Poéasnog predsjednika Kluba u isto vrijeme.\n\n(2) Za Poéasnog predsjednika Kluba moze biti izabran Clan Kluba k", "oji je svojim izuzetnim\nsportskim, poslovnim ili druStvenim doprinosom pridonio razvoju, ugledu 1 vrijednostima\nKluba.\n\n(3) Kandidata za Pocasnog predsjednika Kluba, pisanim prijedlogom mogu predloziti Nadzorni\nodbor, najmanje 15 (petnaest) Clanova SkupStine ili Predsjednik Kluba.\n(4) Pocasnog predsjednika Kluba bira SkupStina, vecinom glasova nazoénih ¢lanova.\n(5) Poéasni predsjednik Kluba:\nPromice vrijednosti, identitet 1 tradiciyu Kluba;\n\nb. K", "ao predstavnik Kluba sudjeluje na svecanim dogadanjima, proslavama, ¢lanskim\nokupljanjima 1 drugim javnim prigodama;\n\nc. Moze biti gost na sastancima s predstavnicima drugih klubova, sponzorima,\npartnerima 1 predstavnicima nogometnih saveza;\n\nd. Ima pravo sudjelovati na sjednicama SkupStine, ali bez prava glasa;\n\ne. Na poziv Predsjednika Nadzornog odbora, moze sudjelovati na sjednicama\nNadzornog odbora, ali bez prava glasa;\n\nf. Moze biti savjetni", "k Predsjedniku Kluba 1 Nadzornom odboru o strateski vaznim\npitanjima.\n(6) Pocasni predsjednik Kluba ne sudjeluje u donoSenju odluka Kluba 1 ne obavlja izvrSne niti\nupravljacke funkcye.\n\n(7) Poéasni predsjednik Kluba ne smiye sudjelovati u izbornim kampanjama niti na bilo koji\nnacin iskazivati podrsku za pojedine izborne liste ili kandidate.\n\n(8) Mandat Poéasnog predsjednika Kluba nije vremenski ogranicen. Iznimno, SkupStina ga u\nslucaju djelovanj", "a protivno interesima, stabilnosti ili Casti 1 ugleda Kluba ili nastupa\nokolnosti 1z Clanka 29. ovog Statuta, na pisani prijedlog Nadzornog odbora, najymanje 15\n(petnaest) Clanova SkupStine ili Predsjednika Kluba, moze razrieSiti odlukom donesenom\ndvotrecinskom vecinom svih ¢lanova SkupStine.\n\n(9) Poéasni predsjednik ima pravo biti gost Kluba na svim domacim 1 gostujucim utakmicama\nKluba.\n\nVI. IZBORI I REFERENDUM\n\n1. IZBORI\n\nClanak 50.\n(1) Na izb", "orima ¢lanovi Kluba s pravom glasa biraju 50 (pedeset) Clanova SkupStine Kluba.\n\n(2) Pravo birati 1 biti birani (pravo glasa) na izborima imaju iskljucivo punoljetni 1 poslovno\nsposobni Clanovi Kluba, pod uvjetom da su isti bili Clanovi Kluba 1 u_ prethodnoj\nkalendarskoj godini.\n\n(3) Izbori mogu biti redovni 1 1zvanredni.\n\n(4) Redovni izbori odrzavaju se najraniye 180 (sto osamdeset) dana prije kraja redovnog\nmandata SkupStine, a najkasnije 90 (d", "evedeset) dana nakon isteka redovnog mandata\nSkupStine te se moraju sazvati najkasnije 45 (Cetrdeset pet) dana prije dana odrzavanja\nizbora.\n\n(5) Izvanredni izbori sazivaju se najkasnije u roku od 7 (sedam) dana od dana nastupa sljyedecih\nokolnosti:\n\na. odluke SkupStine donesene dvotrecinskom ve¢cinom svih ¢lanova Skup$stine;\nb. dainakon Sto se iscrpi broj svih zamjenskih ¢lanova Skup$stine, sukladno ¢lanku 35.\nstavku 5. ovog Statuta, bro} Clanov", "a SkupStine padne ispod 26 (dvadeset Sest);\n\nc. od dana upisa novog Statuta ili izmjena 1/ili dopuna Statuta u Registar udruga\nRepublike Hrvatske, kojima se miyenjaju tiyela Kluba, njihov broj Clanova,\nnadleznosti 1 ovlasti ili trajanje mandata od strane nadleznog tijela Grada Zagreba.\n\n(6) Izvanredni izbori 1z stavka 5. ovog Clanka Statuta moraju se sazvati najkasnije 21 (dvadeset\njedan) dan prije dana odrzavanja izbora.\n\n(7) Izbore, osim u sluc", "ajevima propisanim odredbama ovog Statuta, raspisuje Nadzorni odbor\nputem Predsjednika Nadzornog odbora Kluba ili osobe koja ga sukladno Clanku 33. stavku\n1. ovog Statuta zamjenjuje.\n\n(8) Izbore provodi Izborno povjerenstvo sastavljeno od 5 (pet) ¢lanova Kluba s pravom glasa\nkoje, na temelju pojedinaénih kandidatura Clanova Kluba bira Nadzorni odbor. U slucaju da\nse ne prijavi dovoljan bro} kandidata, Nadzorni odbor izabire preostale Clanove Izbo", "rnog\npovjerenstva izmedu Clanova Kluba s pravom glasa.\n\n(9) Nadzorni odbor moze razrijeSiti Izborno povjerenstvo ili pojedine njegove Clanove 1z\nrazloga propisanih odredbama ovog Statuta 1 Pravilnika o izborima u GNK ,,Dinamo“.\n\n(10) Mandat Clanova Izbornog povjerenstva traje od dana njihovog izbora od strane\nNadzornog odbora do izbora Predsjednika Kluba, Predsjednika Nadzornog odbora,\nZamjenika Predsjednika Nadzornog odbora 1 ostalih €lanova Nad", "zornog odbora na izborno}]\nsjednici SkupStine.\n\nClanak 51.\n\n(1) Izbori se provode na temelju izbornih lista koje sadrze najmanje 46 (Cetrdeset Sest), a najviSe\n55 (pedeset pet) kandidata za Clanove SkupStine Kluba, pri Cemu svaka izborna lista obvezno\nsadrzi:\n\na. Kandidata za Predsjednika Kluba koji je ujedno 1 nositelj te izborne liste, na listi\nobvezno naveden pod rednim brojem | (jedan);\n\nb. Kandidata za Predsjednika Nadzornog odbora, na listi", " obvezno naveden pod rednim\nbrojem 2 (dva);\n\nKandidata za Zamjenika Predsjednika Nadzornog odbora, na listi obvezno naveden\npod rednim brojem 3 (tri);\n\n©\n\nd. Kandidate za ostale Clanove Nadzornog odbora, na listi obvezno navedeni pod\nrednim brojevima od 4 (etir1) do 10 (deset);\n\ne. Preostale kandidate za Clanove SkupStine, na listi obvezno navedeni pod rednim\nbrojevima od (11) jedanaest do najmanje 46 (Cetrdeset Sest), a najyviSe do 55 (pedeset\n\n", "pet).\n(2) Svaka izborna lista, pored obveznog sadrzaja iz stavka 1. ovog Clanka Statuta, obvezno\nsadrzi 1:\na. plan 1 program upravljanja Klubom koji mora biti dostupan Clanovima Kluba\nnajkasniyje 15 (petnaest) dana prije dana odrzavanja redovnih izbora, a 5 (pet) dana\n\nprije dana odrzavanja izvanrednih izbora te mora sadrzavati 1 Zivotopis kandidata 1z\nstavka 1. tocaka a.-d. ovog Clanka Statuta;\n\nb. potpise podrske najmanje 100 (sto) punoljetnih ", "1 poslovno sposobnih Clanova Kluba\ns vazecim Clanstvom u trenutku potpisivanja, pod uvjetom da su isti bili Clanovi\nKluba i u prethodnoj kalendarskoj godini.\n(3) Potpisima podrske, u smislu stavka 2. tocke b. ovog Clanka Statuta, ne smatraju se potpisi\nsamih kandidata na izbornoj listi, a potpisi podrske nuzno sadrzavaju ime 1 prezime, brojeve\nClanskih iskaznica te potpis davatelja podrske.\n\n(4) Izborne liste moraju se dostaviti Izbornom povjeren", "stvu najkasnije 20 (dvadeset) dana prije\ndana odrzavanja redovnih izbora, a najkasniyje 7 (sedam) dana prije dana odrzavanja\nizvanrednih izbora.\n\n(5) Izborne liste koje su dostavljene nakon isteka roka 1z stavka 4. ovog lanka Statuta ili izborne\nliste koje ne sadrzavaju sve potrebne podatke 1z stavaka 1.-3. ovog ¢lanka Statuta, Izborno\npovjerenstvo nece smatrati vazecima te iste ne mogu sudjelovati na izborima.\n\n(6) Ukoliko se do isteka roka 1z s", "tavka 4. ovog Clanka Statuta ne kandidira niti jedna izborna\nlista ili niti jedna kandirana izborna lista ne sadrzava sve potrebne podatke 1z stavaka 1.-3.\novog Clanka Statuta, svi rokovi 1z Clanaka 50. 151. ovog Statuta produljuju se za 30 (trideset)\ndana.\n\nClanak 52.\n\n(1) Neovisno o broju izbornih lista koje su se kandidirale na izborima, ¢lanovima SkupStine\nKluba postaju kandidati s dviyu izbornth lista koje su ostvarile najve¢i broj dobivenih", " glasova\nclanova Kluba.\n\n(2) Broj kandidata sa svake od dviju izbornih lista iz stavka 1. ovog ¢lanka Statuta koji postayu\nClanovima SkupStine odreduje se proporcionalno broju dobivenih glasova ¢lanova Kluba,\npri Cemu se kao ukupan broj glasova Clanova Kluba u obzir uzimaju iskljucivo glasovi koje\nsu ostvarile dvije izborne liste 1z stavka 1. ovog ¢lanka Statuta.\n\n(3) U sluéaju da se broj Clanova SkupStine, primjenom metode proporcionalnog izracu", "na broja\nClanova SkupStine ne moze matematicki izraziti kao ciyeli broj, ve¢é sadrzi decimalni broj,\n¢clanom SkupStine postaje kandidat izborne liste koja je na izborima ostvarila veci broj\ndobivenih glasova ¢lanova Kluba.\n\n(4) Jedna izborna lista, neovisno o rezultatima izbora, moze imati najviSe 45 (Cetrdeset pet)\nClanova SkupStine.\n\n(5) U sluéaju da se na izborima, do isteka roka od najkasnije 20 (dvadeset) dana prije dana\nodrzavanja redovnih ", "izbora, a najkasnijye 7 (Ssedam) dana prije dana odrzavanja izvanrednih\nizbora, kandidira samo jedna izborna lista, Clanovima SkupStine postaju:\n\na. 45 (€etrdeset pet) kandidata za Clanove SkupStine s jedine kandidirane izborne liste;\nb. 5 (pet) povjerenika Kluba koje izabiru ¢lanovi Kluba s liste povjerenika Kluba.\n\n(6) U slucéaju da u prvom krugu izbora niti jedna od viSe kandidiranih izbornih lista ne dobije\nvise od 50% (pedeset posto) glasova", " €lanova Kluba ili u slucaju da su dvije izborne liste s\nnajvecim brojem dobivenih glasova Clanova Kluba ostvarile identi¢an broj dobivenih\nglasova, saziva se drugi krug izbora na kojima sudjeluju dvije izborne liste koje su u prvom\nkrugu izbora ostvarile najveci broj dobivenih glasova ¢lanova Kluba, a koji se mora odrzati\nnajkasniye u roku od 15 (petnaest) dana od dana odrzavanja prvog kruga izbora.\n\n(7) U sluéaju da bi, sukladno rezultatima izb", "ora 1 primjeni metode proporcionalnog izracuna\nbroja Clanova Skup&tine, ¢lanovima SkupStine trebalo postati vise od 45 (Cetrdeset pet)\nkandidata s jedne izborne liste, Clanovima Skup$&tine postaju:\n\na. 45 (€etrdeset pet) kandidata za Clanove SkupStine s pobjednicke izborne liste;\nb. preostalih 5 (pet) Clanova SkupStine popunjava na na¢cin da:\n\n- €lanovima Skup&stine postaju kandidati s druge izborne liste, pri Cemu se, u\nslucaju da se broj Clanov", "a Skup$&tine te izborne liste ne moze matematick1 1zraziti\ncijelim brojem, vec sadrzi decimalni broj, zaokruzivanje vr8i na nacin da se bro]\nClanova Skup$&tine s druge izborne liste zaokruzuje se na veci cijeli bro};\n\n- preostalim ¢lanovima SkupStine postaju povjerenici Kluba koje izabiru ¢Clanovi\nKluba s liste povjerenika Kluba.\n\n(8) U sluéaju da su pojedini kandidati na izbornim listama 1z Clanka 51. ovog Clanka Statuta\nujedno 1 povjerenici Klu", "ba, isti ne mogu sudjelovati na izborima na listi povjerenika Kluba\nniti biti izabrani kao Clanovi SkupStine sukladno stavku 5. 16. ovog ¢lanka Statuta.\n\n(9) Detalje izbornih postupaka 1 referenduma, kao 1 rad Izbornog povjerenstva ureduje Pravilnik\no izborima u GNK ,,Dinamo“.\n\nClanak 53.\n\n(1) Izborna sjednica SkupStine odrzava se najkasniye u roku od 15 (petnaest) dana od dana\nodrzavanja izbora 1 u drugim slucajevima propisanim ovim Statutom te ", "na istoj, a sukladno\nrezultatima izbora te odredbama ovog Statuta, izabire Predsjednika Kluba, Predsjednika\nNadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te ostale Clanove Nadzornog\nodbora.\n\n(2) Kandidati za Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika\nNadzornog odbora te ostalih Clanova Nadzornog odbora su kandidati s izborne liste koja je,\nsukladno €lanku 52. stavku 2.13. ovog Statuta, ostvarila ve¢ci br", "oj Clanova u SkupSstini.\n\n(3) Odluku o izboru Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamyjenika\npredsjednika Nadzornog odbora te ostalih Clanova Nadzornog odbora izborna Skup§tina\ndonosi vecinom glasova svih ¢lanova Skup$&tine.\n\n(4) U sluéaju da kandidati iz stavka 2. ovog ¢lanka ne budu izabrani vecinom glasova svih\nClanova Skup§Stine provodi se drugi krug glasovanja na kojemu Clanovi SkupStine glasuju\nizmedu kandidata s obje izborne", " liste, a u slucaju 1zjednacenog broja glasova za Predsjednika\nKluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te\nostalih Clanova Nadzornog odbora smatraju se izabrani kandidati s izborne liste koja je\nostvarila veci broj dobivenih glasova ¢lanova Kluba.\n\n(5) Nakon Sto bude izabran, Predsjednik Kluba prestaje biti Clanom SkupStine 1 na mjestu Clana\nSkupStine zamjenjuje ga na istoj sjednici SkupStine prvi sljedeci Cla", "n po redosliyedu sa\npopisa kandidata za Clanove SkupStine iste liste, koji do tada sudjeluje kao promatrac.\n\nClanak 54.\n\n(1) U sluéaju da se na izborima niti u rokovima 1z ¢lanka 51. stavka 6. ovog Statuta ne kandidira\nniti jedna vazeca izborna lista, svi Clanovi Kluba s pravom glasa postaju Op¢éa SkupStina\nKluba koja ¢e izabrati Predsjednika Kluba, te Predsjednika Nadzornog odbora, Zamjenika\nPredsjednika Nadzornog odbora 1 Clanove Nadzornog odbo", "ra Kluba koji ¢e dalje prema\novom Statutu izabrati ostala tijela 1 djelovati unutar svojih statutarnih nadleznosti.\n\n(2) U sluéaju 1z stavka 1. ovog Clanka Statuta, Opcu SkupStinu Kluba, u roku od 15 (petnaest)\ndana od isteka mandata svim tijelima Kluba, izuzev Clanovima Uprave, duzan je sazvati\nzadnji Predsjednik Kluba ili zadnji Predsjednik Nadzornog odbora, a ako isto ne ucine, Opcu\nSkupStinu Kluba duzna je sazvati bilo koja osoba od ostalih o", "soba ovlaStenih za zastupanje\nupisana u Registar udruga Republike Hrvatske. Iznimno, ukoliko ni jedna od prethodno\nnavedenih osoba, u roku od 15 (petnaest) dana od isteka mandata svim tiyelima Kluba, ne\nsazove Opcu Skup$Stinu Kluba, istu moze sazvati bilo koji od zadnjih Clanova Nadzornog\nodbora ili bilo koji od Clanova zadnjeg saziva SkupStine ili Pocasni predsjednik Kluba.\n\n(3) Sazivatel) odreduje mjesto (u pravilu u sjediStu Kluba ili na stadi", "onu Kluba) 1 vrijeme\nodrzavanja Skup§Stine, predlaze dnevni red, te njome predsjeda 1 imenuje Radno\npredsjednistvo 1 zapisni¢ara. Svakih 100 (sto) ¢lanova Kluba s pravom glasa moze do\npocetka Opée Skup§Stine Kluba pisanim prijedlogom predloziti kandidata za Predsjednika\nKluba, a ako to ne ucine, kandidata za Predsjednika Kluba predlaze sazivatelj. Nakon Sto\nbude izabran, Predsjednik Kluba na Op¢éoj SkupStini Kluba predlaze sve Clanove Nadzornog\no", "dbora iz redova ¢lanova Kluba s pravom glasa.\n\n(4) Opéa SkupStina Kluba nema kvoruma za odlucivanje, a odluke donosi vecinom danih\nglasova.\n\n(5) Mandat tijela Kluba izabranih na Opcoj SkupStini Kluba je 2 (dvije) godine.\n\n(6) Sljedeci redovni izbori moraju se odrzati na nacin propisan Clancima 50.-52. ovog Statuta, a\nmogu Sse sazvati 1 prije kraja mandata tijelima Kluba izabranih na Opcoj SkupStini Kluba.\n\n2. REFERENDUM\n\nClanak 55.\n\n(1) Referendu", "m svih ¢lanova Kluba s pravom glasa (dalje u tekstu: Referendum) mora se\nraspisati prethodno donoSenju odluke SkupStine o:\n\na. promjeni naziva Kluba u dyelu ,,Dinamo“;\nb. promjeni grba (znaka) Kluba;\nc. promjeni boje Kluba;\nd. promyeni trajne lokacie stadiona;\ne. statusnim promjenama (preoblikovanje, pripajanje, spajanje il1 podjela) Kluba;\nf. dobrovoljnog prestanka rada Kluba;\n(2) Referendum iz stavka 1. ovog ¢lanka Statuta mora se raspisati na ", "pisani zahtjev:\na. Dvotrecinske vecine svih Clanova SkupStine;\nb. 20% (dvadeset posto) svih Clanova Kluba s pravom glasa.\n\n(3) Na pisani zahtjev 20% (dvadeset posto) svih €lanova Kluba s pravom glasa mora se raspisati\n1 referendum radi donoSenja odluke o raspisivanju izvanrednih izbora u Klubu.\n\n(4) Na referendumu 1z stavaka 1. 1 3. ovog Clanka Statuta mora sudjelovati naymanje 50 %\n(pedeset posto) svih Clanova Kluba s pravom glasa, a odlucuje se", " dvotrecinskom vecinom\ndanih glasova.\n\n(5) Potrebnim se postotkom od 20% (dvadeset posto) svih Clanova Kluba s pravom glasa, u\nsmislu odredaba stavka 2. tocke b. te stavaka 3.14. ovog Clanka Statuta, smatra broj Clanova\nKluba u kalendarskoj godini u kojoj se referendum raspisuje ili u kalendarskoj godini koja\nprethodi kalendarskoj godini u kojoj se referendum raspisuje, ovisno 0 tome u kojoj je\nkalendarskoj godini broj €lanova Kluba s pravom glas", "a vec.\n\n(6) Referendum 1z stavaka 1. 1 2. ovog Clanka Statuta, raspisuje Nadzorni odbor u roku od 21\n(dvadeset jedan) dan od zaprimanja valjanog pisanog zahtjeva iz stavka 2. ovog Clanka\nStatuta, a provodi ga Izborno povjerenstvo.\n\n(7) Nakon referenduma, Predsjednik Nadzornog odbora mora sazvati sjednicu SkupStine u roku\nod 15 (petnaest) dana radi provedbe referendumskih odluka.\nVII. RJESAVANJE SPOROVA I SUKOBA INTERESA\n\nClanak 56.\n\n(1) Postupak ", "pred Nadzornim odborom za rjeSavanje statutarnih 1 ostalih sporova te sukoba\ninteresa moze pisanim 1 obrazlozenim zahtjevom pokrenuti svaki Clan tijela Kluba, ako\nsmatra da postoji spor ili sukob interesa u Klubu.\n\n(2) Nadzorni odbor o zahtjevu odlucuje u roku od 60 (Sezdeset) dana od dana zaprimanja\nzahtjeva.\n\n(3) Nadzorni odbor u svom radu na odgovarajuci nacin primjenjuje odredbe Zakona o mirnom\nryeSavanju sporova.\n\n(4) Odluka Nadzornog odbora", " o sukobu interesa je konaéna.\n\n(5) Nadzorni odbor odlukom odreduje nacin razrjeSavanja statutarnih 1 ostalih sporova te\nutvrdenog sukoba interesa.\n\n(6) Ako Nadzorni odbor utvrdi da je Predsjednik Kluba u sukobu interesa, predlaze SkupStini\nKluba sankcyu ili razrjeSenje te raskid ugovora.\n\n(7) Ako Nadzorni odbor utvrdi da su ¢lanovi Uprave u sukobu interesa, predlaze Predsjedniku\nKluba sankcyu ili razrjeSenje te raskid ugovora.\n\n(8) Ako Nadzorni ", "odbor utvrdi da su zaposlenici Kluba u sukobu interesa, predlaze Predsjedniku\nKluba sankcyu ili razrjeSenje te otkaz ugovora.\n\n(9) U sluéaju da odlucuje o sukobu interesa Clana Nadzornog odbora, taj Clan Nadzornog odbora\nne sudjeluje u donoSenju odluke.\n\nVIII. IMOVINA, NACIN STJECANJA I RASPOLAGANJE IMOVINOM\n\nClanak 57.\n(1) Imovinu Kluba Cine:\n\na. novéana sredstva koja je Klub stekao uplatom Clanarina, naknada Prijatelja Kluba,\ndobrovoljnim prilo", "zima 1 darovima;\n\nb. novcéana sredstva koja Klub stekne obavljanjem djelatnosti kojima se ostvaruju\nciljevi, obavljanjem djelatnosti 1 gospodarskih djelatnosti, financiranjem programa 1\nprojekata Kluba 1z drzavnog proracuna 1 proracuna jedinica lokalne 1 podrucne\n(regionalne) samouprave te fondova 1/ili 1z inozemnih i1zvora;\n\nc. nekretnine 1 pokretne stvari Kluba;\nd. druga prava ustanovljena u korist Kluba.\n\n(2) Klub moze raspolagati svojom imovi", "nom samo za ostvarivanje ciljeva 1 obavljanjem\ndjelatnosti odredenih ovim Statutom, u skladu sa zakonima 1 posebnim propisima.\n\n(3) ViSak prihoda nad rashodima koje Klub ostvari mora se koristiti iskljucivo za obavljanje 1\nunapredenje djelatnosti Kluba kojima se ostvaruju ciljevi Kluba, utvrdeni ovim Statutom,\nsukladno zakonu.\nClanak 58.\n\n(1) Odluke o stjecanju ili otudivanju pokretnina 1 nekretnina donose Predsjednik 1 Uprava, na\nnacin propisan ", "ovim Statutom.\n\n(2) Poslovne odluke u vezi koriStenja financijskih sredstava tijekom kalendarske godine provodi\nUprava Kluba koja o tome, na na¢cin propisan ovim Statutom, izvjeScuje Nadzorni odbor 1\nSkupStinu.\n\n(3) Predsjednik 1 Uprava odgovorni su za zakonitost kori8tenja 1 raspolaganja imovinom, a\nposebice financijskih sredstava Kluba.\n\n(4) Sva dokumentacija o materiyalno-financijskom poslovanju Kluba ¢uva se u zakonskim\nrokovima s posebnom pa", "znjom u arhivi Kluba.\n\nIX. PRESTANAK POSTOJANJA KLUBA\n\nClanak 59.\n\n(1) Klub prestaje postojati odlukom SkupStine u skladu s rezultatima provedenog referenduma\nili u drugim slucajevima predvidenim zakonom.\n\n(2) U slucaju prestanka postojanja Kluba preostala imovina pripada udruzi, ustanovi, zakladi ili\ndrugoj pravnoj osobi koja ima iste ili sli¢ne statutarne ciljeve, a prema odluci SkupStine.\n\nClanak 60.\n(1) Likvidatora Kluba imenuje 1 opoziva Sku", "pStina Kluba.\n\n(2) Likvidator zastupa Klub u postupku likvidacije te se otvaranjem likvidacijskog postupka\nupisuje u Registar udruga Republike Hrvatske kao osoba ovlaStena za zastupanje Kluba do\nokonéanja postupka likvidacije 1 brisanja Kluba iz registra udruga.\n\n(3) Osoba koja se bira za likvidatora treba imati potrebnu strucnost 1 iskustvo, s obzirom na\nnadleznost likvidatora te ne smije imati zapreke 1z Zakona o sportu ili Zakona o udrugama.\n\n", "(4) Pokretanjem postupka likvidaciye Kluba prestajyu ovlaStenja tijela 1 osoba ovlaStenih za\nzastupanje Kluba.\n\n(5) Postupak likvidacie Kluba provodi likvidator sukladno odredbama Zakona o udrugama.\n\nX. PRIJELAZNE I ZAVRSNE ODREDBE\n\nClanak 61.\n\n(1) Ovaj Statut stupa na snagu danom upisa u Registar udruga Republike Hrvatske.\n\n“— wy © ye oe\n\nPravilniku o izborima u GNK ,,Dinamo“ od strane postojeceg Izbornog povjerenstva koje Ce\nga provoditi, a u v", "ezi izbora ovlasti Nadzornog odbora imati postoje¢i Izvrsni odbor,\nnadleznosti 1 ovlasti trayu do izbora tijela Kluba sukladno odredbama ovog Statuta.\n\n(3) Sva tyela Kluba mogu se, putem Nadzornog odbora, obratiti SkupStini za autenti¢no\ntumacenje odredaba Statuta 1 akata koje ona donosti.\n(4) Op¢i akti Kluba moraju se usuglasiti s odredbama ovog Statuta u roku od 90 (devedeset)\ndana od dana donoSenja Statuta.\n\nU Zagrebu.....\n"]