{"STATUT GRAĐANSKOG NOGOMETNOG KLUBA \"DINAMO\"": "**OSNOVNE ODREDBE**\n\nČlanak 1.\n\nOvim Statutom uređuju se: naziv i sjedište udruge; područje i ciljevi djelovanja; zastupanje; djelatnost; gospodarska djelatnost; način osiguranja javnosti djelovanja udruge; uvjeti i način učlanjivanja; prestanak članstva; prava, obveze i odgovornosti članova; popis članova; tijela udruge, njihov sastav i način sazivanja sjednica; izbor, opoziv, ovlasti, odgovornost, način odlučivanja i trajanje mandata; način rješavanja sporova i sukoba interesa unutar udruge; način sazivanja Skupštine u slučaju isteka mandata; izbor i opoziv likvidatora; prestanak postojanja udruge; imovina, način stjecanja i raspolaganja imovinom; postupak s imovinom u slučaju prestanka postojanja udruge te ostala pitanja od značaja za udrugu.\n\nČlanak 2.\n\n['(1) Naziv Udruge je: Građanski nogometni klub \"Dinamo\".', '(2) Skraćeni naziv Udruge je: GNK \"Dinamo\".', '(3) Građanski nogometni klub \"Dinamo\" profesionalni sportski nogometni klub.', '(4) Sjedište kluba je u Zagrebu, Maksimirska cesta 128.']\n\nČlanak 3.\n\n['(1) Građanski nogometni klub \"Dinamo\" (u daljnjem tekstu: Klub) je udruga registrirana u Registru udruga Republike Hrvatske i Evidenciji pravnih osoba u sportu.', '(2) Klub je neprofitna pravna osoba.']\n\nČlanak 4.\n\n(1) Klub ima pečat.\n\n(2) Pečat je okruglog oblika, promjera 35 mm, sa ispisanim nazivom i mjestom sjedišta Kluba po obodu pečata i znakom u sredini.\n\nČlanak 5.\n\n['(1) Obilježja Kluba su znak/amblem/grb i plava boja, a koja slijede izgled obilježja i sportsku tradiciju Prvog hrvatskog građanskog športskog kluba Zagreb, odnosno 1. HŠK Građanskog.', '(2) Znak/amblem/grb Kluba je kružnog oblika i simbolizira oblik nogometne lopte, a što ukazuje na osnovnu djelatnost Kluba.', '(3) Osnova znaka/amblema/grba sastavljena je od dva polukruga: povijesnog hrvatskog grba s naizmjeničnim crvenim i bijelim poljima i tradicionalnog u plavoj boji Grada Zagreba s bijelim slovom \\'d\\' koje predstavlja početno slovo naziva Kluba \"Dinamo\".', '(4) Sve linije unutar znaka/amblema/grba i rub znaka/amblema/grba su u boji zlata.', '(5) Klub baštini sportsku povijest i rezultate nastale pod imenima 1. HŠK Građanski, NK \"Dinamo\", NK HAŠK-Građanski i NK Croatia.']\n\nČlanak 6.\n\n['(1) O promjeni imena, grba, boje, lokacije stadiona, preoblikovanja, pripajanja, spajanja ili podjele Kluba i dobrovoljnog prestanka rada Kluba saziva se obvezujući referendum svih punoljetnih i poslovno sposobnih članova Kluba, tako da na njemu mora sudjelovati najmanje 70 % članova Kluba s pravom glasa, a odlučuje se običnom većinom.', '(2) Referendum svih članova Kluba mora sazvati Predsjednik Kluba u slučajevima iz st. 1. ovog članka.']\n\nČlanak 7.\n\nKlub zastupaju Predsjednik, Dopredsjednik i Uprava, sukladno odredbama ovog Statuta.\n\nČlanak 8.\n\n(1) Klub:\n\n['a. postupa sukladno Pravilima nogometne igre koje je donio Međunarodni nogometni savez BOARD (IFAB);', 'b. poštuje načela privrženosti, integriteta i sportskog ponašanja kao izraza fairplaya;', 'c. poštuje statut, pravilnike i odluke FIFA-e i UEFA-e i Hrvatskog nogometnog saveza (HNS) u svako vrijeme;', 'd. priznaje nadležnost Arbitražnog suda za sport (CAS) u Lausanni (Švicarska), kao što je utvrđeno relevantnim odredbama Statuta FIFA-e, UEFA-e:', 'e. priznaje nadležnost Arbitražnog suda HNS-a i sukladno tome podnosit će sve sporove nacionalnih razmjera, koji su nastali iz ili u vezi s primjenom Statuta ili pravilnika HNS-a, u posljednjoj instanci samo tim arbitražama, koje rješavaju svoje sporove, isključujući svaki redovni sud, osim ukoliko je to izričito zabranjeno važećim zakonodavstvom u Republici Hrvatskoj.', '(2) U slučaju sporova za koje su nadležna pravosudna tijela FIFA-e, UEFA-e, CAS-a, Arbitražnog suda Saveza ili pravnih tijela Saveza, Klub se obvezuje da spor neće iznositi pred redovne sudove.', '(3) Klub poštuje sve odluke nadležnih tijela HNS-a, FIFA-e i UEFA-e i CAS-a.']", "CILJEVI, PODRUČJE DJELOVANJA SUKLADNO CILJEVIMA, DJELATNOST I GOSPODARSKE DJELATNOSTI": "Članak 9.\n\n['(1) Ciljevi Kluba su:', ['a. okupljanje građana, djece i mladeži kroz škole nogometa:', 'b. razvoj i unapređenje nogometa te postizanje vrhunskih sportskih rezultata;', 'c. sudjelovanje u nogometnim natjecanjima u zemlji i inozemstvu;', 'd. stručno i profesionalno osposobljavanje i usavršavanje sportskih djelatnika:', 'e. stvaranje potrebnih uvjeta za bavljenje nogometom, trening, organizaciju stručnog rada i natjecanje svih ekipa Kluba.'], '(2) Klub može podržavati mušku, žensku i veteransku nogometnu ekipu, futsal ekipu te ostale varijacije s ciljem razvoja i popularizacije nogometnog sporta.', '(3) Klub sukladno ciljevima djeluje na području sporta.']\n\nČlanak 10.\n\nDjelatnosti Kluba su:\n\n['a. sudjelovanje u profesionalnim ili amaterskim natjecanjima na lokalnoj, državnoj i međunarodnoj razini u nogometnom sportu za sve uzraste:', 'stručno-pedagoški rad sa svim uzrastima sportaša, osobito kroz nogometne škole; organizirano vođenje treninga i sportskih priprema;', 'c. osposobljavanje i usavršavanje vlastitog stručnog i pedagoškog kadra;', 'd. stvaranje materijalnih, tehničkih infrastrukturnih i drugih uvjeta za bavljenje nogometnim sportom; upravljanje, održavanje i skrb o daljnjoj izgradnji sportskih objekata kojima Klub raspolaže;', 'e. osiguravanje svih potrebnih uvjeta za sudjelovanje u natjecanju prema uvjetima za licenciranje HNS-a i UEFE (stručno-pedagoški trenerski kadrovi, administrativni kriteriji, sportski kriteriji, infrastrukturni kriteriji i financijski kriteriji);', 'f. suradnja sa sudačkim, trenerskim i drugim stručnim sportskim organizacijama na lokalnoj, državnoj i međunarodnoj razini;', 'g. suradnja s drugim nogometnim i sportskim klubovima:', 'h. suradnja s tijelima državne te lokalne i regionalne vlasti, pravnim i fizičkim osobama u ispunjavanju sportskih interesa i ciljeva;', 'i. organizirano okupljanje članstva Kluba svih uzrasta;', 'j. izdavanje biltena, glasila, monografija, priručnika i drugih tiskovina vezano uz nogometni sport i Klub;', 'k. poticanje i promicanje nogometa kao sporta u skladu s aktima strateškog planiranja razvoja sporta na nacionalnoj razini, odnosno nacionalnom strategijom razvoja sporta i nacionalnim planom razvoja sporta te strateškim dokumentima donesenim na područnoj (regionalnoj) razini, a osobito sporta djece i mladeži, te zdravstveno usmjerenog tjelesnog vježbanja i zdravstveno usmjerene tjelesne aktivnosti sportaša;', 'I. sudjelovanje u ostvarivanju uvjeta za provođenje zdravstvene skrbi sportaša te sudjeluje u edukaciji sportaša o antidopingu:', 'm. provođenje edukaciju, informiranje i savjetovanje sportaša, sportskih djelatnika, građana i ostalih sudionika u sportu o pitanjima bitnim za bavljenje sportskim aktivnostima i djelatnostima:', 'n. poduzimanje aktivnosti za sprječavanje negativnih pojava u sportu, posebno za sprječavanje nasilja u sportu i kršenja prava djece;', 'o. promicanje stručnog rada u sportu, te sudjelovanje u unapređenju stručnog rada i skrbi o osposobljavanju stručnih djelatnika;', 'p. unos i ažuriranje podataka za koje je nadležan Klub u Nacionalni informacijski sustav u sportu;', 'q. obavlja i druge poslove, djelatnosti i zadaće određene zakonom i ovim Statutom.']", "Članak 11.": {"Članak 12.": "Klub može osnivati trgovačka društva prema odredbama Zakona o trgovačkim društvima, kao i druge oblike pravnih osoba u skladu s posebnim propisima, ako je to u cilju osiguranja materijalnih uvjeta rada i razvoja Kluba."}, "Članak 13.": ["(1) Djelovanje Kluba je javno, a ostvaruje se putem:", ["a. internetskih stranica Kluba, aplikacija i društvenih mreža,", "b. javnih medija,", "c. povjerenika Kluba,", "d. ostalih načina informiranja sukladno odluci Uprave Kluba."], "(2) Članove Kluba pravodobno se obavještava o radu Kluba, aktima i odlukama njegovih tijela posebnim izvješćima te skupovima za članove koji se organiziraju najmanje jednom godišnje što je definirano Pravilnikom o članstvu.", "(3) O načinu javnosti rada Kluba i obavještavanja članova, Uprava Kluba donosi odluku"], "**ČLANSTVO**": {"Članak 25.": ["(1) Članovi klupskih tijela ne mogu biti osobe za koje postoji zapreka iz čl. 111. i 112. Zakona o sportu i iz čl. 19. st. 2. i 3. Zakona o udrugama.", "(2) Članovi klupskih tijela uz razloge iz st. 1. ne mogu biti osobe:", ["a. koje su aktivni nogometni sudac, ili osoba koja je to bila u posljednje 3 (tri) godine;", "b. koje ne mogu biti članovi Uprave odnosno nadzornog odbora dioničkog društva prema odredbama Zakona o trgovačkim društvima i Zakona o sprječavanju sukoba interesa u obnašanju javnih dužnosti;", "c. koji su dioničari ili članovi drugog nogometnog kluba;", "d. koje svojim djelovanjem mogu neposredno utjecati na sustav natjecanja u odgovarajućem sportu, a osobito sportaši koji su profesionalni prema Zakona o sportu, menadžeri i posrednici u sportu, kao i osobe koje su to bile u razdoblju od posljednjih godinu dana;", "e. koje su posljednjih godinu dana bile članovi ili članovi tijela pravne osobe koja obavlja djelatnost organiziranja sportske kladionice;", "f. koje s menadžerima i posrednicima u istome sportu i članovima pravnih osoba te članovima tijela pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica djeluju zajednički;"], "g. koje imaju ili su posljednjih godinu dana imale sklopljen ugovor sa nogometašem ili nogometnim trenerom na temelju kojega ostvaruje pravo na dio prihoda koji proizlaze iz obavljanja djelatnosti nogometaša ili nogometnog trenera;", "h. koje su ovlaštene za zastupanje u pravnoj osobi koja sukladno Zakonu o sportu ima sklopljene ugovore o ulaganju u fizičke osobe u nogometu;", "i. koje su u posljednje tri godine pravomoćno kažnjene za kaznena djela ili prekršaje u sportu i u vezi sa sportom i sportskim natjecanjima;", "j. koje su pravomoćno osuđene na kaznu zatvora u trajanju od najmanje 6 (šest) mjeseci za neko od kaznenih djela počinjena s namjerom, a nije primijenjena uvjetna osuda godinu dana od odsluženja kazne;", "k. koje ne ispunjavaju druge uvjete propisane Zakonom o sportu i drugim zakonima.", "koje su aktivni igrač, trener ili zaposlenik Kluba, a ako to postanu tijekom mandata u tijelima Kluba, prestaje im mandat i članstvo u tijelu, osim članovima Uprave Kluba.", "(3) Svaki član Kluba koji ulazi u bilo koja tijela Kluba mora potpisati izjavu kojom izjavljuje da za njega ne vrijede gore navedeni uvjeti te da će u slučaju nastupa gore navedenih uvjete odmah obavijestiti Upravu Kluba."]}, "Članak 26.": ["(1) Mandat članovima klupskih tijela prestaje i prije isteka roka u slučaju:", ["a. pisane ostavke ili zapisnikom konstatirane ostavke danom zaprimanja ostavke odnosno ovjerom zapisnika;", "b. izbora novog saziva klupskog tijela;", "c. potpunog ili djelomičnog gubitka poslovne sposobnosti;", "d. nastupa okolnosti iz članka 21. i 25. ovog Statuta;", "e. nastupa druge okolnosti zbog koje više ne može biti članom klupskog tijela."], "(2) Na mjesto člana Skupštine koji je prestao biti član Skupštine prije isteka mandata na koji je izabran imenuje se novi član s popisa zamjenskih članova Skupštine u obje izborne jedinice. U slučaju da se iscrpi broj zamjena, Skupština nastavlja funkcionirati s brojem preostalih članova Skupštine.", "(3) Novoimenovanom članu Skupštine prema st. 2. ovog članka, mandat traje do isteka mandata Skupštine.", "(4) Novoizabranom članu Izvršnog odbora mandat traje do isteka mandata Izvršnog odbora.", "(5) Novoizabranom članu Nadzornog odbora mandat traje do isteka mandata Nadzornog odbora."], "SKUPŠTINA": "", "Članak 27.": ["(1) Skupština je najviše tijelo upravljanja Klubom.", "(2) Skupštinu sačinjava 60 predstavnika članova Kluba, na način da:", "25 članova Skupštine biraju svi članovi Kluba na izborima te lista s najviše glasova ulazi u cijelosti u Skupštinu", "35 članova Skupštine bira Izvršni odbor iz redova prijavljenih kandidata tajnim glasovanjem"], "Članak 33.": {"Članak 34.": ["(1) Predsjednik Kluba imenuje radno predsjedništvo od 3 člana, koje rukovodi radom Skupštine.", "(2) Dopredsjednik kojeg imenuje Predsjednik Kluba je predsjedavajući Skupštine.", "(3) Na Izbornoj Skupštini, nakon odabira Izvršnog odbora i Dopredsjednika, dosadašnjeg Dopredsjednika na mjestu predsjedavajućeg, zamjenjuje novoizabrani.", "(4) O radu sjednice vodi se zapisnik koji se trajno čuva u arhivi Kluba, a kojeg potpisuju predsjedavajući tom sjednicom i zapisničar.", "(5) Jedan od članova Uprave, ovlašten za zastupanje Kluba dostavlja zapisnik sa sjednica Skupštine nadležnom uredu koji vodi registar udruga."]}, "IZVRŠNI ODBOR": "", "Članak 37.": ["(1) Izvršni odbor Kluba je izvršno tijelo Skupštine kojoj odgovara za svoj rad.", "(2) Izvršni odbor zalaže se za načela:", ["zakonitosti,", "transparentnosti i javnosti poslovanja,", "sprječavanje sukoba interesa,", "učinkovit unutarnji nadzor,", "jačanje osobne odgovornosti,", "društveno odgovorno poslovanje."], "(3) Izvršni odbor se sastoji od 13 članova iz redova članova Skupštine.", "(4) Iz redova članova Skupštine, Predsjednik Kluba imenuje 10 članova Izvršnog odbora po svom odabiru, a 2 člana imenuje nositelj druge liste koja sačinjava Skupštinu.", "(5) Mandat članova Izvršnog odbora i Predsjednika je 4 (četiri) godine.", "(6) U slučaju prestanka članstva u Izvršnom odboru iz bilo kojeg razloga prema ovom Statutu, Predsjednik ili nositelj druge liste, ovisno s čije liste su članovi Izvršnog odbora kojima je prestalo članstvo, imenuje druge članove Izvršnog odbora iz Skupštine."], "Članak 38.": "Izvršni odbor Kluba:\n\n['a. provodi odluke, zaključke i preporuke Skupštine;', 'b. predlaže izmjene i dopune Statuta, osim u slučajevima iz čl. 36. ovog Statuta', 'c. predlaže i usvaja opće akte Kluba, ako ovim Statutom nije drugačije određeno;', 'd. predlaže Skupštini program razvoja, politiku i smjernice rada Kluba;', 'e. imenuje, sklapa ugovor, kao i razrješava predsjednika Uprave i članove Uprave Kluba;', 'f. nadzire rad Uprave i daje joj suglasnost za pravne poslove iznad ukupnog iznosa 3 milijuna eura;', 'g. osniva po potrebi savjetodavne pododbore i povjerenstva sastavljene od članova Kluba, zaposlenika Kluba i stručnjaka koji nisu članovi Kluba, za potrebe kvalitetnije kontrole rada Kluba (Odbor za internu reviziju i kontrolu, Odbor za korporativna i strateška pitanja, Odbor za imenovanja zaslužnih igrača i trenera i sl.) te se obvezuje u odluci o osnivanju pododbora i/ili povjerenstva navesti njihov sastav, zadaću, vrijeme za koje se osnivaju i odgovornost za obavljanje poslova;', 'h. odlučuje i o drugim pitanjima koje mu odredi Skupština.']\n\nČlanak 39.\n\n['(1) Izvršni odbor svoje poslove obavlja na sjednicama koje saziva Predsjednik ili član Izvršnog odbora kojeg odredi Predsjednik prema potrebi, a najmanje jednom mjesečno.', '(2) Izvršni odbor odlučuje većinom glasova nazočnih članova pod uvjetom da je na sjednici prisutna natpolovična većina svih članova.']", "Članak 40.": "Način i uvjete svog rada Izvršni odbor uređuje Poslovnikom.", "PREDSJEDNIK KLUBA": "Članak 41.\n\n['(1) Predsjednik Kluba:', ['a. saziva sjednice Skupštine Kluba i Izvršnog odbora te predlaže dnevni red, osim u slučajevima određenih ovim Statutom;', 'b. brine se o upoznavanju javnosti s radom Skupštine Kluba;', 'c. u suradnji s Izvršnim odborom, utvrđuje prijedlog Statuta i drugih općih akata koje usvaja Skupština Kluba, osim u slučajevima iz čl. 36.', 'd. imenuje članove Izvršnog odbora sukladno čl. 37. st. 4. ovog Statuta i predlaže Skupštini Kluba njihovo razrješavanje;', 'e. saziva izbore u Klubu;', 'f. obavlja i druge poslove u skladu sa zakonima, ovim Statutom i aktima Kluba.'], '(2) U bilo kojim slučajevima istovremene spriječenosti Predsjednika i Dopredsjednika duljim od 6 mjeseci, Izvršni odbor mora sazvati Skupštinu koja će izabrati novog Predsjednika u roku od 3 mjeseca nakon proteka tog roka.']\n\nČlanak 42.\n\n['(1) Predsjednik Kluba po svojoj funkciji je član i predsjednik Izvršnog odbora.', '(2) Mandat Predsjednika Kluba je 4 (četiri) godine i za svoj rad je odgovoran Skupštini Kluba.']\n\n(3) Predsjednik Kluba predstavlja i zastupa Klub u zemlji i inozemstvu.\n\n(4) Predsjednik Kluba iz redova Izvršnog odbora imenuje Dopredsjednika, koji rukovodi sjednicama Skupštine i koji ga zamjenjuje u svim ovlastima u slučaju njegove spriječenosti.\n\nČlanak 43.\n\n['(1) Skupština Kluba na redovnoj sjednici većinom prisutnih članova Skupštine može imenovati počasnog predsjednika Dinama na temelju poslovnih i sportskih zasluga i rezultata.', '(2) Mandat počasnog predsjednika je neograničen. U izuzetnim slučajevima može ga razriješiti Skupština.', '(3) Počasni predsjednik Kluba ima pravo sudjelovati na sjednicama Skupštine, ali nema pravo glasa.']\n\nNADZORNI ODBOR\n\nČlanak 44.\n\n['(1) Nadzorni odbor:', ['a. skrbi o financijskom poslovanju Kluba te raspolaganju njegovom imovinom;', 'b. skrbi o provođenju odredbi Statuta, općih akata Kluba i pravnom poslovanju Kluba o čemu može tražiti izvješća tijela Kluba;', 'c. stegovno je tijelo u drugom stupnju vezano uz članska prava i obveze te donosi konačnu odluku o stegovnoj mjeri;', 'd. obavlja i druge poslove u skladu sa zakonima, ovim Statutom i Pravilnikom o izborima;', 'e. rješava sukobe interesa i sporove unutar Kluba;', 'f. obavještava klupska tijela o neusuglašenosti rada ili akata sa Statutom i drugim aktima Kluba, o čemu, ako se ne isprave, obavještava Skupštinu koja donosi obvezujuću odluku o usklađivanju rada i akata.'], '(2) Članovi klupskih tijela koja odlučuju u stegovnom postupku ne sudjeluju u njemu kada su predmet stegovnih postupaka.']\n\nČlanak 45.\n\n['(1) Nadzorni odbor se sastoji se od 3 člana, koji između sebe biraju predsjednika.', '(2) Predsjednik Nadzornog odbora saziva sjednice i predlaže dnevni red.', '(3) Nadzorni odbor donosi odluke većinom glasova svih članova.', '(4) Mandat članova Nadzornog odbora je 4 (četiri) godine.']\n\nČlanak 46.\n\n(1) Članovi Nadzornog odbora ne mogu biti članovi drugih klupskih tijela.\n\n(2) Nadzorni odbor podnosi Skupštini Kluba redovito godišnje izvješće.\n\n(3) Skupština Kluba može zahtijevati od Nadzornog odbora podnošenje izvanrednog izvješća.\n\nČlanak 47.\n\nNačine i uvjete svog rada Nadzorni odbor uređuje Poslovnikom.", "Članak 48.": ["(1) Članove Nadzornog odbora na temelju samostalnih kandidatura poslanih Izbornom povjerenstvu bira Izvršni odbor na način propisan u Pravilniku o izborima. S liste prijavljenih kandidata prvo jednog člana Nadzornog odbora bira 10 članova Izvršnog odbora koje je izabrao Predsjednik, a zatim ostala dva člana Nadzornog odbora bira dva člana Izvršnog odbora s druge liste koja sačinjava Skupštinu. U slučaju da se ne prijavi dovoljno kandidata, Predsjednik Kluba predlaže kandidate Skupštini.", "(2) Skupština razrješava članove Nadzornog odbora ako ne prihvati izvješće Nadzornog odbora.", "(3) Odluku o neprihvaćanju izvješća Nadzornog odbora, Skupština donosi većinom glasova prisutnih članova Skupštine."], "**UPRAVA KLUBA**": {"Uprava Kluba:": ["a. predlaže Izvršnom odboru Pravilnik o djelokrugu i unutarnjem ustrojstvu Kluba;", "b. organizira obavljanje stručnih, tehničkih i pomoćnih poslova Kluba i vodi poslovnu, sportsku i stručnu politiku Kluba, za koje odgovara Izvršnom odboru;", "c. samostalno sklapa pravne poslove do ukupnog iznosa 3 milijuna eura, a za veće ukupne iznose mora ishoditi prethodnu suglasnost Izvršnog odbora, te poduzima druge pravne radnje u ime i za račun Kluba;", "d. rukovodi i nadzire rad zaposlenika Kluba;", "e. brine se o provođenju odluka Skupštine i Izvršnog odbora;", "f. podnosi financijska godišnja i druga izvješća Skupštini Kluba;", "g. donosi akte sukladno Statutu i odlukama klupskih tijela;", "h. osigurava redovito obavještavanje članova Kluba o radu i rezultatima Kluba;", "i. upravlja imovinom Kluba;", "j. sklapa ugovore i poduzima pravne radnje u ime i za račun Kluba;", "k. utvrđuje uvjete za sklapanje i raskid ugovora s igračima;", "I. donosi odluke o organiziranju turnira, odigravanju prijateljskih utakmica te o mjestu i vremenu održavanja priprema igrača;", "m. donosi odluke o izvanrednom nagrađivanju igrača i ostalih zaposlenika Kluba za postignute rezultate;", "n. predlaže Izvršnom odboru godišnji financijski i poslovni plan te podnosi kvartalna izvješća o provedbi tog plana;", "o. obavlja i druge poslove sukladno ovom Statutu i odlukama klupskih tijela;"], "Članak 52.": ["(1) Za svoj rad i rad stručnih službi članovi Uprave Kluba odgovorni su Izvršnom odboru.", "(2) Članovi Uprave Kluba ne mogu biti članovi drugih klupskih tijela."]}, "RJEŠAVANJE SPOROVA I SUKOBA INTERESA": "Članak 54.\n\n(1) Postupak pred Nadzornim odborom za rješavanje statutarnih i ostalih sporova te sukoba interesa može zahtjevom pokrenuti svako klupsko tijelo, odnosno svaki član Kluba ako smatra da postoji spor ili sukob interesa u Klubu.\n\n['(2) Nadzorni odbor o zahtjevu odlučuje u roku od 60 dana od dana podnošenja zahtjeva.', '(3) Nadzorni odbor u svom radu na odgovarajući način primjenjuje odredbe Zakona o mirenju.', '(4) Odluka Nadzornog odbora o sukobu interesa je konačna.', '(5) Ako pronađe da postoji sukob interesa, Nadzorni odbor određuje i način razrješavanja utvrđenog sukoba interesa.', '(6) Sva klupska tijela mogu se obratiti Skupštini za tumačenje odredbi Statuta i akata koje ona donosi.']", "IMOVINA, NAČIN STJECANJA I RASPOLAGANJE IMOVINOM": "", "Članak 55.": ["(1) Imovinu Kluba čine:", ["a. novčana sredstva koja je Klub stekao uplatom članarina, dobrovoljnim prilozima i darovima;", "novčana sredstva koja Klub stekne obavljanjem djelatnosti kojima se ostvaruju ciljevi, obavljanjem djelatnosti i gospodarske djelatnosti, financiranjem programa i projekata Kluba iz državnog proračuna i proračuna jedinica lokalne i područne (regionalne) samouprave te fondova i/ili iz inozemnih izvora;", "c. nekretnine i pokretne stvari Kluba;", "d. druga prava ustanovljena u korist Kluba."], "(2) Klub može raspolagati svojom imovinom samo za ostvarivanje ciljeva i obavljanjem djelatnosti određenih Statutom Kluba, u skladu sa zakonom.", "(3) Višak prihoda nad rashodima koje Klub ostvari koristi se za ostvarivanje ciljeva utvrđenih ovim Statutom."], "PRESTANAK POSTOJANJA KLUBA": "Članak 57.\n\n(1) Klub prestaje postojati odlukom Skupštine u skladu s rezultatima provedenog referenduma, ili u drugim slučajevima predviđenim zakonom.\n\n(2) U slučaju prestanka postojanja Kluba preostala imovina pripada udruzi, ustanovi, zakladi ili drugoj pravnoj osobi koja ima iste ili slične statutarne ciljeve, a prema odluci Skupštine u skladu s rezultatima referenduma.", "Članak 58.": "(1) Likvidatora Kluba imenuje i opoziva Skupština Kluba.\n\n(2) Likvidator zastupa Klub u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u registar udruga kao osoba ovlaštena za zastupanje Kluba do okončanja postupka likvidacije i brisanja Kluba iz registra udruga.\n\n(3) Osoba koja se bira za likvidatora treba imati potrebnu stručnost i iskustvo, s obzirom na nadležnost likvidatora te ne smije imati zapreke iz čl. 112. Zakona o sportu i čl. 19. st. 2. i 3. Zakona o udrugama.\n\n(4) Pokretanjem postupka likvidacije Kluba prestaju ovlaštenja tijela i osoba ovlaštenih za zastupanje Kluba.\n\n(5) Postupak likvidacije Kluba provodi likvidator sukladno odredbama Zakona o udrugama.", "PRIJELAZNE I ZAVRŠNE ODREDBE": "Članak 59.\n\n['(1) Statut stupa na snagu danom donošenja.', '(2) Opći akti i ostali potrebni akti Kluba vezani za izbore u Klubu moraju se usuglasiti s odredbama ovog Statuta, kao i ustrojiti Izborno povjerenstvo od strane Izvršnog odbora sačinjene prema prethodnom Statutu, prije datuma prvih izbora koji će ustrojiti tijela Kluba prema ovom Statutu. Tijela Kluba ustrojena po prethodnom Statutu djeluju do ustroja novih tijela Kluba prema ovom Statutu nakon prvih izbora u Klubu.']\n\nU Zagrebu, 21.12.2023.\n\nPREDSJEDNIK KLUBA dipl. ing. Mirko Barišić"}