["Na temelju ¢lanka 27. Statuta Hrvatskog olimpijskog odbora, a u skladu s élancima 45. i 46. Zakona o sportu (Narodne novine br.141/2022) i élanka 13. Zakona o udrugama (Narodne novine br. 74/2014., 70/2017.,98/2019. i 151/2022. ), SkupStina Hrvatskog olimpijskog odbora, na svojoj 41. sjednici odrzanoj 6. studenog 2015. godine, donijela je Statut Hrvatskog olimpijskog odbora (broj: 928/15, od 6. studenog 2015. ), a odluke o izmjenama i dopunama Statuta Hrvatskog olimpijskog odbora usvojene su na 43. sjednici Skup&tine Hrvatskog olimpijskog odbora odrzanoj 29. veljacée 2016. godine, (broj: 216/16 od 01. oZujka 2016. ), na 50. sjednici Skupstine Hrvatskog olimpijskog odbora odrzanoj 28. velja¢e 2018. godine (broj: 358/2018 od 19.04.2018. }, na 55. sjednici Skupstine Hrvatskog olimpijskog odbora odrzanoj 8. srpnja 2020. (broj: 438/20 od 10. 07.2020. ), na 58. elektroniékoj sjednici Skupstine Hrvatskog olimpijskog odbora dana 5. studenog 2020. godine (broj: 761/20 od 19.11.2020. ), na 65. s", "jednici SkupStine Hrvatskog olimpijskog odbora odrzanoj 13. rujna 2022. godine (broj: 1029/2022 od 13.09.2022. ), na 67. sjednici SkupStine Hrvatskog olimpijskog odbora odrzanoj 27. veljace 2023. godine (broj: 267/2023 od 03.03.2023), na 69. elektroni¢ékoj sjednici Skupstine Hrvatskog olimpijskog odbora odrzanoj elektronickim glasovanjem Clanova Skupstine HOO-a u razdoblju od 09.-14.kolovoza 2023. (broj: 1082/2023 od 30.08.2023.)\n\nkao i na 73. sjednici Skupstine Hrvatskog olimpijskog odbora odrzanoj 09. srpnja 2024. godine (Klasa; 030-08/24-01/3, urbroj: 442-01-05-24-1) slijedom kojih se utvrduje\n\nSTATUT\n\nHRVATSKOG OLIMPUSKOG ODBORA\n\nprocisceni tekst\n\n\n\n1. IZVORISNE OSNOVE Olimpijski pokret u Hrvatskoj je joS 1894. poceo promicati Franjo Buéar, no ideja o prijemu u medunarodnu olimpijsku obitelj mogla se ostvariti tek uspostavom samostalne Republike Hrvatske. Izrazavajuci stoljetnu Zelju hrvatskih sportasa i sportskih djelatnika da Hrvatska bude priznatim ¢lanom Medunarodnog olimpijsko", "g odbora na sjednici Hrvatskog olimpijskog odbora, odrzanoj 10. rujna 1991. godine u Zagrebu je utemeljen Hrvatski olimpijski odbor i usvojena su Pravila Hrvatskog olimpijskog odbora. Hrvatski olimpijski odbor osnovali su nacionalni sportski savezi 29 olimpijskih sportova i tri udruzenja. Odluka o privremenom priznanju Hrvatskog olimpijskog odbora donesena je 17. sijecnja 1992. godine u Lausannei od strane predsjednika i ¢etiri potpredsjednika Medunarodnog olimpijskog odbora, a u skladu s ovlastima koje im je povjerio Izvrsni odbor Medunarodnog olimpijskog odbora, na sastanku 4., 5. i 6. prosinca 1991. godine u Lausannei. Navedenom odlukom Medunarodni olimpijski odbor pozvao je Hrvatski olimpijski odbor da sudjeluje na 16. Zimskim olimpijskim igrama u Albertvilleu i na Igrama 25. olimpijade u Barceloni. Potpuno priznanje Hrvatskog olimpijskog odbora uslijedilo je na 101. zasjedanju Medunarodnog olimpijskog odbora u Monacu, 24. rujna 1993. godine.\n\nIl. TEMELNE ODREDBE\n\nElanak 1.\n\nStatut", "om Hrvatskog olimpijskog odbora (dalje u tekstu: Statut) ureduje se naziv, sjediste, zastupanje, izgled peéata, ciljevi i djelatnosti kojima se ostvaruju ciljevi, ustrojstvo i nacin rada, €lanstvo i nagin ostvarivanja prava i obveza €lanova, natin uporabe i zastite simbola i obiljezja Medunarodnog olimpijskog odbora i Hrvatskog olimpijskog odbora, naéin osiguranja javnosti rada, natin stjecanja i raspolaganja imovinom, prestanak postojanja, postupak s imovinom u sluaju prestanka postojanja, te druga pitanja u vezi s djelokrugom i zadaéama Hrvatskog olimpijskog odbora.\n\nClanak 2. (1) Hrvatski olimpijski odbor (dalje u tekstu: HOO) je krovno sportsko udruZenje u Republici Hrvatskoj, u koje se udruzuju nacionalni sportski savezi, sportske zajednice u Zupanijama i Gradu Zagrebu te druge pravne osobe Cija je djelatnost od znaéaja za promicanje sporta i olimpijskog pokreta u Republici Hrvatskoj, sukladno ovom Statutu, a prema naéelima olimpijskog pokreta i Olimpijske povelje\n\n(2) HOO je obve", "zan postovati odredbe Olimpijske povelje i odluke Medunarodnog olimpijskog odbora (dalje u tekstu: MOO) kao vrhovnog tijela olimpijskog pokreta.\n\n(3) HOO se obvezuje, sukladno zadaéama i ulozi_na_nacionalnoj_razini, sudjelovati u aktivnostima promicanja mira i Zena u sportu. Isto se tako obvezuje podrZavati i poticati promidzbu sportske etike, boriti se protiv dopinga i pokazivati odgovornu brigu za pitanja okoliga.\n\n(4) Da bi ispunio svoju zadaéu, HOO moie suradivati s vladinim, odnosno drZavnim tijelima u Republici Hrvatskoj s kojima uspostavlja skladne odnose, pri €emu ta aktivnost ne smije biti u suprotnosti s Olimpijskom poveliom. HOO suraduje is neviadinim tijelima u Republici Hrvatskoj, koja djeluju ili su povezana s djelatnoéu HOO-a.\n\n(5) HOO mora éuvati svoju autonomiju i oduprijeti se pritiscima svake vrste od politickih, pravnih, vjerskih, ekonomskih i drugih pritisaka koji su u suprotnosti s Olimpijskom poveljom.\n\n(6) HOO je élan Udruzenja nacionalnih olimpijskih odbora (AN", "OC), Europskih olimpijskih odbora (EOC), Medunarodnog odbora Mediteranskih igara (ICMG), Europske nevladine sportske organizacije (ENGSO), Medunarodnog fair play odbora (IFPC) i Europskog fair play pokreta (EFPM).\n\nClanak 3. (1) HOO je u svom djelovanju samostalan.\n\n(2) HOO se ustrojava i djeluje sukladno odredbama Olimpijske povelje, Zakona o sportu i Zakona o udrugama.\n\n(3) HOO je neprofitna pravna osoba.\n\n(4) HOO se upisuje u Registar udruga Republike Hrvatske pri nadleznom upravnom tijelu Grada Zagreba, Registar neprofitnih organizacija pri Ministarstvu financija Republike Hrvatske, te u Eidenciji pravnih osoba u sportu.\n\nElanak 4. (1) Puni naziv je: Hrvatski olimpijski odbor.\n\n(2) Skraceni naziv je: HOO.\n\n(3) Osim punog i skraéenog naziva na hrvatskom jeziku, moze se koristiti i puni naziv na engleskom jeziku.\n\n(4) Puni naziv na engleskom jeziku je: Croatian Olympic Committee. (5) Skraceni naziv na engleskom jeziku je: NOC of Croatia.\n\n(6) Naziv na engleskom jeziku moze se koristi", "ti samo uz istodobno navodenje naziva na hrvatskom jeziku, koji se navodi na prvom mijestu.\n\n(7) U sluzbenoj uporabi HOO-a je hrvatski jezik i latiniéno pismo, dok se u korespondenciji s inozemstvom koristi engleski ili francuski jezik.\n\n(8) Puni naziv na francuskom jeziku je Comité Olympique Croate. (9) Skraéeni naziv na francuskom je: CNO Croate.\n\nElanak 5. (1) HOO djeluje na podruéju Republike Hrvatske.\n\n(2) SjediSte HOO-a je u Zagrebu, Odranska 1/1.\n\nElanak 6. HOO ne dopusta rasnu, etnicku, nacionalnu, vjersku, politiéku i spolnu diskriminaciju te krSenje sloboda i prava Covjeka i gradanina.\n\nGlanak 7. Za svoje obveze HOO odgovara cijelom svojom imovinom, u skladu sa zakonom.\n\nElanak 8. (1) HOO ima znak i zastavu odobrenu od Izvrsnog odbora Medunarodnog olimpijskog odbora.\n\n(2) Znak HOO-a sastoji se od tri elementa: rijeci Hrvatska (ili Croatia) iznad koje se nalazi pet olimpijskih krugova, a ispod rijeci je Sest crvenih kvadrata sastavljenih u obliku obrnutog trapeza.\n\n(3) Zastava", " HOO-a je bijele boje, omjera Sirine i duzine 1 prema 2, sa znakom HOO-a smjestenim u sredini zastave. Sredi&nja to¢ka znaka poklapa se s to¢kom u kojoj se sijeku dijagonale zastave. Zastavu, znak i himnu koje ée koristiti HOO u svojim aktivnostima, ukljucujuci i olimpijske igre, mora odobriti Izvr§ni odbor MOO-a.\n\nClanak 9. (1) HOO ima peat i Stambilj.\n\n(2) Peéat je okruglog oblika, promjera 30 mm, s ispisanim tekstom uz rub: “Hrvatski olimpijski odbor - Croatian Olympic Committee\", a u sredini se nalazi znak HOO-a.\n\n(3) Stambilj je pravokutnog oblika, dug 50 i Sirok 20 mm, s ispisanim tekstom: \"Hrvatski olimpijski odbor - Croatian Olympic Committee, Trg Kregimira Cosiéa 11, HR-10000\n\nZagreb\".\n\n€lanak 10. (1) HOO predstavija predsjednik HOO-a, a u njegovoj odsutnosti ili sprijecenosti dopredsjednik ili drugi lan Vijeéa kojeg odredi predsjednik, odnosno kojeg odredi Vijece HOO-a (dalje u tekstu: Vijece) u sluéaju nemoguénosti da predsjednik o tome odluéi.\n\n(2) U svim poslovima HOO zast", "upaju predsjednik HOO-a (dalje u tekstu: predsjednik) i glavni tajnik HOO-a (dalje u tekstu: glavni tajnik).\n\n(3) Odredene poslove zastupanja predsjednik odnosno glavni tajnik mogu prenijeti na treée osobe, na temelju pisane punomoéi, kojom se odreduju ovlasti i opseg zastupanja.\n\nClanak 11.\n\n(1) Rad HOO\n\n\n\na je javan.\n\n(2) Javnost rada osigurava se i ostvaruje na nacin utvrden ovim Statutom.\n\nIl. CIUEVI, PODRUCGJE DJELOVANJA SUKLADNO CILJEVIMA | DJELATNOST\n\nClanak 12.\n\n(1) Ciljevi HOO-a su: -  promicanje olimpijskih naéela, eti¢kih i moralnih normi u sportu\n\npoticanje i promicanje cjelokupnog hrvatskog sporta te njegovo predstavijanje pred MOO\n\nom i drugim odgovarajucim medunarodnim sportskim organizacijama i udruzenjima\n\n_ uskladivanje i poticanje aktivnosti nacionalnih sportskih saveza\n\nfazvoj i promicanje sporta na drZavnoj razini te poticanje i suradnja u provedbi aktivnosti u podrudju razvoja sporta na razini zupanija, gradova i opcina\n\n(2) HOO sukladno ciljevima djeluje na podru", "¢ju sporta.\n\n(3) Djelatnost HOO-a u ispunjavanju navedenih ciljeva je:\n\npoticanje i promicanje sporta i olimpizma u Republici Hrvatskoj,\n\nrazvijanje, promicanje i zaStita olimpijskog pokreta sukladno Olimpijskoj povelji promicanje temeljnih nacela i vrijednosti olimpizma u Republici Hrvatskoj, osobito u podruéjima sporta i obrazovanja, promicanjem olimpijskih obrazovnih programa na svim razinama skola, sportskih institucija i institucija tjelesnog odgoja kao i poticanjem stvaranja institucija posvecenih olimpijskom obrazovanju, kao Sto je to Hrvatska olimpijska akademija, olimpijski muzej i drugi programi, ukljucujuci i kulturne programe,\n\nkoji se odnose na olimpijski pokret.\n\npoticanje etickih i moralnih naéela, poStivanje Ijudskog dostojanstva, fair playa, tolerancije, nenasilja i kulture sporta\n\ndjelovanje na odrzavanju skladnih odnosa i suradnje s odgovarajucim drzavnim i nedrzavnim tijelima\n\nsudjelovanje u radu Nacionalnog vijeca za sport\n\nsudjelovanje u predlaganju i provodenju n", "acionalne strategije sporta i nacionalnog plana razvoja sporta, te u provedbi Nacionalnog programa sporta,\n\nsudjelovanje u predlaganju i ostvarivanju mjera za unapredenje i razvoj sporta provodenje postupka kategorizacije sportova za sportove koji su razvrstani u Nomenklaturi sportova i sportskih grana u nadleZnosti HOO-a i donoSenje odluke o\n\nrangiranju sportova i razvrstavanju u kategorije\n\nsudjelovanje u predlaganju i provodenju dijela programa javnih potreba u sportu drzavne razine\n\ndjelovanje na razvijanju prijateljstva, medusobnog razumijevanja i ravnopravnosti te izgradnji boljeg i mirnijeg svijeta\n\npoduzimanje mjera protiv svih oblika diskriminacije i nasilja u sportu zalaganje za ravnopravnost spolova u sportu poticanje sporta djece i mladih\n\npromocija sporta putem medija\n\nzalaganje za razvoj sportske rekreacije-sporta za sve\n\nuskladivanje i kontrola aktivnosti nacionalnih sportskih saveza i suradnja u provedbi aktivnosti u podrugju razvoja sporta sa sportskim zajednicama u Zu", "panijama i Gradu Zagrebu u ostvarivanju programa javnih potreba sporta drzavne razine, odnosno ukupnog programa sporta i utvrdene strategije razvoja sporta\n\npoticanje razvoja vrhunskih sportskih dostignuéa hrvatskih sportaga i njihovog sudjelovanja u nacionalnim ekipama na olimpijskim i mediteranskim igrama, svjetskim i europskim prvenstvima, te drugim velikim medunarodnim sportskim natjecanjima\n\nsudjelovanje u provedbi zdravstvene skrbi u sportu\n\nsudjelovanje u provedbi aktivnosti, pripadajucih pravila i postupaka za borbu protiv dopinga u sportu, kao i koriStenja supstanci te postupaka koje zabranjuje MOO ili medunarodni savezi\n\nzaStita i o¢uvanje éovjekova okolifa, te ukljuéenje u svjetski pokret u borbi protiv klimatskih promjena brigom i aktivnostima za postizanje odrzivog razvoja u sustavu sporta\n\nzastita povrsina i objekata za sport borba protiv svih oblika politiéke i komercijalne zloupotrebe sporta i sportaga\n\npoduzimanje aktivnosti i mjera zaétite djece u sportu te o svakom k", "réenju prava djece, osobito svim oblicima nasilja nad djecom, spolne zloporabe, zanemarivanja ili nehajnog postupanja, zlostavijanja ili izrabljivanja djece u sportskim natjecanjima ili u vezi sa sportom obavijestiti nadlezna tijela\n\nkoordiniranje lanova HOO-a pri izradi protokola za postupanje u slu¢aju nasilja medu djecom u sportskim klubovima\n\nsudjelovanje u organiziranju i poticanju znanstvenih i razvojnih projekata u sportu\n\nutvrdivanje sustava, uvjeta i naéela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj\n\nsudjelovanje u organiziranju olimpijskih igara i drugih velikih medunarodnih sportskih natjecanja i priredbi\n\npoticanje i poduzimanje aktivnosti za unapredenje strucnog rada u sportu i skrbi o osposobljavanju i usavrsavanju strucnih djelatnika u sportu te obrazovanje sportskih djelatnika u svrhu promicanja temeljnih naéela olimpizma putem programa HOO-a i Hrvatske olimpijske akademije, kao i drugih odgovarajucih ustanova i organizacija\n\nprovedba struén", "og nadzora nad radom trenera koji su financirani kroz program javnih potreba u sportu drzavne razine\n\nkontrola i izvjestavanje tijela drzavne uprave nadleZnog za sport o ucinku svih programa, a posebno razvojnih programa za sportase i trenere koji su financiranji kroz program javnih potreba u sportu drzavne razine\n\nnadzor nad struénim radom nacionalnih sportskih saveza, sukladno ¢lanku 110. Zakona o sportu\n\nutvrdivanje nomenklature sportova\n\ndostavljanje podataka u Nacionalni informacijski sustav u sportu\n\npoduzimanje aktivnosti za primjenu medunarodnih sportskih pravila te donoSenje akata u vezi s njihovom primjenom\n\ndjelovanje na povezivanju Republike Hrvatske putem sporta s drugim drzavama radi zblizavanja s drugim narodima, zblizavanja sportasa i drugih sudionika u sportu\n\n€uvanje neovisnosti i autonomije HOO\n\na i sporta odupiranjem pritiscima svake vrste od politickih, pravnih, vjerskih, ekonomskih i drugih pritisaka koji su u suprotnosti s Olimpijskom poveljom\n\nobavijanje i drugi", "h zadaca koje su utvrdene zakonom, ovim statutom i drugim propisima.\n\n(4) Osim djelatnosti iz stavka 3. ovog élanka HOO moze obavijati i gospodarsku djelatnost odnosno marketinsku djelatnost, kao dio aktivnosti promocije sporta radi osiguranja sredstava za financiranje zadaéa i ostvarenja ciljeva HOO-a. HOO svoju gospodarsku djelatnost ne smije obavijati radi stjecanja dobiti. Ukoliko u obavijanju svoje gospodarske djelatnosti HOO ostvari dobit, ona se mora koristiti iskljuéivo za obavljanje i unapredenje djelatnosti HOO-a, kojima se ostvaruju ciljevi HOO-a, utvrdeni ovim Statutom, sukladno zakonu.\n\nClanak 13. (1) HOO ima iskljucive ovlasti predstavijanja hrvatskog sporta na olimpijskim igrama, te svjetskim, europskim i regionalnim visesportskim natjecanjima koja se odrzavaju pod pokroviteljstvom MOO-a ili Europskih olimpijskih odbora.\n\n(2) HOO je duzan sudjelovati na natjecanjima navedenim u prethodnom stavku ovog ¢lanka, u skladu s Olimpijskom poveljom.\n\n(3) HOO stvara, organizira i ", "vodi svoje delegacije na olimpijske igre, te svjetska, europska i regionalna visesportska natjecanja koja se odrzavaju pod pokroviteljstvom MOO-a ili EOC-a, te je odgovoran za ponaSanje Clanova delegacije.\n\n(4) HOO odluéuje o prijavi sportaga koje su predloZili njihovi nacionalni sportski savezi. Izbor sportaSa temelji se ne samo na sportskom dostignucu veé i na njihovim sposobnostima da budu primjer mladosti svoje zemlje. O uskladenosti prijava nacionalnih sportskih saveza s odredbama Olimpijske povelje brine HOO\n\n(5) HOO ustrojava i vodi sluzbenu evidenciju o osvajaéima medalja na olimpijskim igrama i zimskim olimpijskim igrama te svjetskim prvenstvima u olimpijskim sportovima i disciplinama.\n\n(6) HOO izdaje uvjerenje iz evidencije iz stavka 5. ovog élanka na zahtjev sportaSa osvajaéa medalje u svrhu ostvarivanja prava na trajnu novéanu mjeseénu naknadu osvajaca medalja na olimpijskim igrama i svjetskim prvenstvima u olimpijskim sportovima i disciplinama, sukladno odredbama Zakona o ", "sportu.\n\n(7) HOO vodi sluzbenu evidenciju o trenerima i izbornicima koji su obavijali struéne poslove vodenja sportaéa ili ekipe na sportskom natjecanju, odnosno olimpijskim igrama /i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama/, i koji su zasluzni za medalju koja je osvojena na olimpijskim igrama te izdaje uvjerenje izbornicima i trenerima, na njihov zahtjev, u svrhu ostvarivanja prava na trajnu mjeseénu novéanu naknadu, sukladno odredbama Zakona o sportu.\n\n(8) HOO je iskljucivo ovlagten da odabere i imenuje grad koji se moze prijaviti za organizaciju Olimpijskih igara u Republici Hrvatskoj.\n\n(9) HOO usvaja i primjenjuje Svjetski kodeks protiv dopinga, na taj nacin osiguravajuci da strategije i pravila HOO-a protiv dopinga, élanstvo i zahtjevi financiranja, te rezultati upravljackih postupaka budu u skladu sa Svjetskim kodeksom protiv dopinga i postuju sve uloge i odgovornosti nacionalnog olimpijskog odbora koji su navedeni unutar Svjetskog kodeksa protiv ", "dopinga.\n\n(10) HOO ima zadacu &tititi olimpijsko vlasnistvo te je odgovoran Medunarodnom olimpijskom odboru za postivanje pravila i dopunskih propisa pravilima Olimpijske povelje vezanim uz skrb za zaStitu prava koja se odnose na olimpijske igre i olimpijskom viasnistvo, koje obuhvaéa olimpijski simbol, olimpijsku zastavu, olimpijsko geslo, olimpijske znakove, olimpijsku himnu, olimpijski plamen i olimpijske baklje te olimpijske oznake na podrucju Republike Hrvatske, a ovlasten je poduzimati mjere za zabranu korigtenja olimpijskog vlasnigtva, ako je to u suprotnosti s pravilima ili dopunskim propisima Olimpijske povelje.\n\n(11) HOO utvrduje svoju opredijeljenost i spremnost poduzimanja aktivnosti za podrzavanje integriteta sporta, ukljuéujuci za&titu gistih sportasa i poStenog natjecanja, kao i za borbu protiv manipulacije natjecanjima pridrZavajuéi se normi Kodeksa olimpijskog pokreta o sprjecavanju manipulacije sportskim natjecanjima, sukladno pripadaju¢em opéem aktu HOO-a, pri éemu z", "ahtijeva od svojih Glanova da u€ine isto.\n\nElanak 14. (1) HOO-u je Zakonom o sportu, povjerena javna oviast za utvrdivanje kategorija sportasa i donoSenje rjesenja o kategorizaciji sportasa.\n\n(2) HOO ustrojava i vodi registar kategoriziranih sportasa.\n\nIv. €LANSTVO\n\nElanak 15.\n\n(1) Clanovi HOO\n\n\n\na su:\n\nnacionalni sportski savezi\n\nsportske zajednice u Zupanijama te Gradu Zagrebu\n\ndruge pravne osobe Cija je djelatnost od interesa za razvoj hrvatskog sporta i olimpijskog pokreta sukladno ovom Statutu.\n\n(2) Odluku o uélanjenju u HOO donosi Skupstina HOO-a (dalje u tekstu: SkupStina).\n\n(3) Popis Clanova HOO-a vodi se elektronicki, a za svaku Clanicu Saveza obvezno sadrii: e podatak o nazivu ¢lana\n\nOIB élana\n\ndatum pristupanja HOO\n\n\n\nu\n\nkategoriji Clanstva\n\ndatum prestanka Clanstva (za one Clanove koji nisu vise clanovi HOO-a)\n\n(4) Popis élanova HOO-a je dostupan na uvid svim Clanovima i nadleZnim tijelima, na njihov zahtjev.\n\nClanak 16. (1) Clanovi HOO-a samostalne su, autonomne udruge s p", "ravnom osobnog¢u i odredenim pravima, obvezama i odgovornostima u HOO-u, koje iskazuju: -  svojim ustrojem, programskom i poslovnom djelatnoscu -  osiguravanjem financijskih sredstava i drugih uvjeta za svoju djelatnost\n\npravom odlu¢ivanja iz svog djelokruga.\n\n(2) Clanovi HOO-a mogu biti punopravni, pridruzeni i privremeni te poéasni élanovi.\n\nPunopravni élanovi\n\nClanak 17. (1) Punopravni élanovi HOO-a mogu biti: nacionalni sportski savez, sportska zajednica u Zupanijama i Gradu Zagrebu ako ispunjava slijedeée kriterije i uvjete:\n\n1. Nacionalni sportski savez:\n\nda je medunarodnu federaciju istog sporta priznao MOO ili da je uélanjena u pripadajuée udruzenje medunarodnih sportskih federacija / SportAccord\n\nda je osnovan sukladno Zakonu o sportu i Zakonu o udrugamai registriran kod nadleznog upravnog tijela Zupanije odnosno Grada Zagreba\n\nda je svrha osnivanja i djelovanja razvoj i unapredenje, Sirenje i promicanje sporta u Republici Hrvatskoj prema naéelima sporta i olimpizma\n\nda ima ti", "jela saveza izabrana i registrirana sukladno statutu, Zakonu o sportu i Zakonu o udrugama, te da ima opée akte utvrdene navedenim zakonima i usvojene od nadleznih tijela saveza\n\nda ima osigurane kadrovske i struéne te osnovne materijalne uvjete za rad i djelovanje\n\nda drugi nacionalni savez istog sporta nije uélanjen u HOO\n\nda prihvaéa Statut HOO\n\na.\n\n2. Sportska zajednica Zupanije i Grada Zagreba (dalje u tekstu: sportska zajednica):\n\nda je osnovana sukladno Zakonu o sportu i Zakonu o udrugama i registrirana kod nadleznog upravnog tijela Zupanije odnosno Grada Zagreba\n\nda je svrha osnivanja i djelovanja razvoj i unapredenje, Sirenje i promicanje cjelokupnog sporta na podrugju njenog djelovanja prema naéelima sporta i olimpizma\n\ndaima tijela sportske zajednice izabrana i registrirana sukladno statutu, Zakonu o sportu i Zakonu o udrugama\n\nda prihvaéa Statut HOO\n\na. (2) Punopravni élan HOO\n\na je i Hrvatski klub olimpijaca, ako ispunjava slijedece uvjete:\n\nda je osnovan sukladno Zakonu o ", "sportu i Zakonu o udrugama i registriran kod nadleznog upravnog tijela Zupanije odnosno Grada Zagreba\n\nda je svrha osnivanja i djelovanja razvoj i unapredenje sporta i olimpizma\n\nda ima tijela Kluba izabrana i registrirana sukladno statutu, Zakonu o sportu i Zakonu udrugama\n\nda prihvaéa Statut HOO\n\na. Pridruzeni élanovi Elanak 18. PridruZeni Clanovi HOO\n\na mogu biti:\n\n1. Nacionalni sportski savez koji ne ispunjava kriterije i uvjete iz Clanka 17. tocke 1. u alinejama 1.15. ako SkupStina odluci da je njihovo udlanjenje od interesa za hrvatski sport u cijelosti.\n\n2. Pravna osoba - udruga i ustanova Cija je djelatnost od znacenja za hrvatski sport (dalje u tekstu: udruga) ako ispunjava slijedece kriterije i uvjete:\n\nda je odgovarajucu medunarodnu udrugu priznao MOO ili da je uclanjen u pripadajuce udruZenje medunarodnih sportskih federacija / SportAccord\n\nda je osnovana sukladno zakonu i registrirana pri nadleznom tijelu\n\nda je svrha osnivanja i djelovanja udruge doprinos razvoju i unapre", "denju, Sirenju i promicanju cjelokupnog sporta u skladu s naéelima sporta i olimpizma\n\ndaima osigurane kadrovske, struéne i osnovne materijalne uvjete za rad i djelovanje\n\nda prihvaéa Statut HOO\n\na. Elanak 19.\n\n(1) Zahtjevu za uélanjenje nacionalni sportski savez i sportska zajednica ili udruga prilazZu dokaze o ispunjavanju kriterija i uvjeta navedenih u Clancima 17. i 18. ovog Statuta, a naroCito:\n\nStatut\n\nrjeSenje o upisu u registar nadleznog tijela\n\nobavijest Drzavnog zavoda za statistiku o razvrstavanju poslovnog subjekta u djelatnosti\n\npopis ¢lanova\n\npodatke o osobama ovlaStenim za zastupanje i predstavljanje\n\nopis osnovnih znacajki sporta, dosadasnjeg djelovanja saveza ili udruge, te opci akt o\n\nsustavu, uvjetima i organizaciji sportskih natjecanja tog sporta kad zahtjev za uclanjenje podnosi nacionalni sportski savez.\n\n(2) Ukoliko za odredeni jedan sport djeluje jedna medunarodna federacija tog sporta koju je priznao MOO ili koja je uélanjena u pripadajuce udruzenje medunarodni", "h sportskih federacija - - SportAccord, a u Republici Hrvatskoj se iz takvog sporta samovoljnim izdvajanjem (cijepanjem) osnuje drugi ili vise saveza, HOO neée udovoljiti zahtjevima novoosnovanih saveza ili udruga za uélanjenje u HOO.\n\nPrivremeni Clanovi\n\nElanak 20.\n\n(1) SkupStina moze privremeno priznati novi nacionalni sportski savez na rok od dvije godine ili drugo razdoblje koje utvrdi Skupstina, a u kojem ce HOO pratiti djelovanje podnositelja zahtjeva za udlanjenje, a nakon kojeg u sluéaju da nije donesena odluka o prijemu u ¢clanstvo HOO-a, privremeno priznanje automatski gubi valjanost. Za vrijeme privremenog élanstva pripadajuci nacionalni sportski savez ima prava i duznosti kao i pridruzeni ¢lanovi HOO-a. Vijece HOO-a ovlaSteno je donijeti opéi akt o naéinu i postupku na koji se utvrduje ispunjenje uvjeta iz ovog Statuta za prijem u élanstvo HOO-a kao i o uvjetima za promjenu statusa élana HOO-a iz privremenog u pridruzeno, odnosno punopravno ili obrnuto.\n\n(2) Odredba prethod", "nog stavka ovog élanka ne primjenjuje se ako prijem za uélanjenje podnosi nacionalni sportski savez ¢ija je medunarodna federacija istog sporta ukljuéena u program\n\nolimpijskih igara.\n\nElanak 21. (1) Clanovi HOO-a u ostvarivanju zajednickih interesa, zadaéa i poslova, odredenih zakonom, ovim Statutom i Olimpijskom poveljom imaju prava i obveze:\n\nsudjelovati u radu HOO\n\na i njegovih tijela i davati prijedloge radi Sto uspjesnijeg ostvarivanja ciljeva i zadaéa HOO\n\na\n\nbirati predstavnike u Skup8tinu u skladu s odredbama ovog Statuta\n\nprovoditi aktivnosti kojima se ostvaruju zadaée i ciljevi utvrdeni ovim Statutom\n\nsudjelovati u utvrdivanju i provodenju dijela programa javnih potreba u sportu drZavne razine u nadleZnosti HOO\n\na te prema vlastitom sudjelovanju u tom programu ostvarivati pravo na financiranje programskih zada¢éa iz sredstava HOO\n\na u skladu s odredbama Zakona o sportu kojima se definiraju javne potrebe u sportu na drZavnoj razini u nadleZnosti HOO\n\na i kriterijima koje utvr", "duje HOO, a sukladno odredbama op¢ih akata HOO\n\na, te na zahtjev HOO\n\na, dostavljati izvjeSéa u dijelu programa javnih potreba sporta drZavne razine u kojem sudjeluje élan HOO\n\na\n\ndostavljati HOO\n\nu statut kao i svaku izmjenu i dopunu statuta, na prethodno misljenje radi utvrdivanja suglasnosti da je statut lana HOO\n\na suglasan sa Statutom HOO\n\na i Zakonom o sportu, a prije registracije pri nadleznom upravnom tijelu Zupanije odnosno Grada Zagreba.\n\nuskladiti opéi akt o sustavu, uvjetima i organizaciji sportskih natjecanja u pojedinom sportu s op¢im aktom HOO\n\na o naéelima i osnovnim elementima sustava sportskih natjecanja u Republici Hrvatskoj\n\nprovoditi odluke i zakljuéke HOO\n\na i njegovih tijela te odgovarati za njihovo izvrsavanje\n\nostvarivati druga prava i izvrSavati druge obveze u skladu sa zakonom i ovim Statutom.\n\n(2) Pridruzeni €lanovi HOO-a imaju prava, obveze i odgovornosti utvrdene prethodnim stavkom ovog élanka, osim:\n\nprava odlugivanja u Skupstini\n\n(3) SkupStina moze na pr", "ijedlog Vije¢a HOO-a donijeti odluku da se prava i obveze ¢lana HOO-a nad kojim je otvoren steéajni postupak stavijaju u mirovanje, osim prava na financiranje odredenih programskih zada¢a sportskog programa Clana HOO-a u steéaju, o ¢cijem opsegu i namjeni odlucuje Vije¢e HOO-a, u okviru usvojenog proracuna HOO-a\n\n(4) Kod utvrdivanja prethodnog misljenja na Statut, odnosno izmjene i dopune Statuta Clana HOO-a, slijedom odredbe stavka 1. alineja 5. ovog clanka, HOO ¢e poStovati specifi¢nosti pojedinog sporta, nacionalnog sportskog saveza ili lokalne sportske zajednice, koje su isti unijeli u Statut.\n\nPoéasni ¢lanovi €lanak 22. (1) Za poéasne élanove HOO-a Skupstina imenuje fizicke osobe narotito zasluzne za dugogodisnji doprinos uspjesnom djelovanju HOO-a, razvoju sporta i olimpizma, na temelju posebnog akta na prijedlog Vijeca. (2) Poéasni élanovi mogu sudjelovati u radu SkupStine bez prava glasa. Prestanak ¢lanstva €lanak 23. (1) Clanu HOO-a prestaje élanstvo: - na vlastiti pisani obra", "zloZeni zahtjev ¢lana\n\nbrisanjem iz registra nadleznog upravnog tijela Zupaanije odnosno Grada Zagreba\n\nkada vise ne udovoljava osnovnim uvjetima za élanstvo u HOO\n\nu iz lanka 17. i 18. ovog Statuta.\n\npokretanjem stecajnog postupka\n\n13\n\nako se rjeSenjem nadleZnog upravnog tijela Zupanije odnosno Grada Zagreba utvrdi da je Clan prestao djelovati\n\n— iskljuéenjem iz HOO\n\na. (2) U sluéaju pokretanja stezajnog postupka nad nacionalnim sportskim savezom, HOO odlukom Vijeéa HOO\n\na preuzima skrb o nacionalnoj sportskoj ekipi te poduzima potrebne\n\naktivnosti za zaStitu interesa sportaga i stecenih prava na medunarodnoj razini.\n\nClanak 24.\n\nKada Clan HOO\n\n\n\na svojim djelovanjem:\n\nne ostvaruje ciljeve i zadace zbog kojih je osnovan\n\nne pridrzava se ili kr3i naéela i pravila Olimpijske povelje i ovog Statuta\n\nne izvrSava ine provodi odluke i zakljucke tijela HOO\n\na,\n\nne djeluje sukladno Zakonu o sportu i Zakonu o udrugama, odnosno nema tijela izabrana i registrirana sukladno navedenim zakonima i/i", "li nema opée akte propisane zakonom i usvojene od nadlegnih tijela,\n\npodlijeze mjerama i sankcijama utvrdenim ovim Statutom.\n\nElanak 25. (1) Radi djelovanja iz clanka 24. Ovog Statuta, Clanovima HOO-a mogu se izre¢i: a) miere:\n\nupozorenje\n\nopomena b) sankcije:\n\nsuspenzija\n\n_ iskljuéenje iz élanstva HOO\n\na.\n\n(2) Izricanje mjera ili sankcija utvrdenih u stavku 1. ovog Clanka zavisi o vrsti, teZini i stupnju udinjene povrede ili prekr&aja iz lanka 24. ovog Statuta, a primjenjuje se:\n\nZa lakSu povredu: upozorenje ili opomena\n\n2a tezu povredu: suspenzija ili iskljucenje iz lanstva HOO\n\na.\n\n(3) O izricanju mjere upozorenja ili opomene odlucuje Vijece.\n\nNa prvoj sljedecoj sjednici SkupStine, Vijece izvjestava o izrecenoj mjeri iz prethodnog stavka. (4) O suspenziji ili iskljuéenju iz Clanstva odlucuje SkupStina.\n\n(5) U sluéaju hitne potrebe Vijece moze izreci i sankciju suspenzije, o €emu konaénu odluku donosi SkupStina na prvoj sljedecoj sjednici koja se treba odrzati najkasnije u roku od 60", " dana.\n\n(6) Posebnim aktom HOO-a ureduju se pitanja provodenja postupka za utvrdivanje povreda ili\n\nprekrSaja iz ¢lanka 24. i izricanje odgovarajucih mjera i sankcija utvrdenih u stavku 1. ovog élanka.\n\nVv. USTROJSTVO\n\nGlanak 26.\n\n(1) Tijela HOO\n\n\n\na jesu:\n\n1. SkupStina 2. Predsjednik 3. Vijece 4. Nadzorni odbor 5. Eti¢ki odbor 6. Komisija sportaSa (2) Samostalno i nezavisno tijelo za rjeSavanje sporova koji se mogu pojaviti izmedu HOO-a i njegovih élanova vezano uz nadleZnosti HOO-a, kao i u pogledu povrede Olimpijske povelje, ovog Statuta i drugih opcih akata HOO-a je: Komisija za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i Clanica (3) Samostalno te operativno i institucionalno nezavisno tijelo za antidoping je: Zalbeno vijece za antidoping\n\n(4) Clanovi tijela HOO-a temeljem élanstva u njima, osim tijela iz stavka 3. ovog élanka, ne ostvaruju pravo na novéanu naknadu.\n\n(5) U tijelima HOO-a potrebno je osigurati sudjelovanje 40% osoba podzastupljenog spola.\n\n15\n\n1. Sku", "p$Stina\n\na) NadleZnosti SkupStine\n\nClanak 27.\n\nSkupstina je najvise upravijacko tijelo HOO-a koje obavija sljedeée zadace:\n\ndonosi Statut i opée akte te njihove izmjene i dopune utvrduje strategiju i politiku razvoja hrvatskog sporta u nadlezZnosti HOO-a\n\ndonosi odluke o uélanjenju u medunarodne sportske i nedrzavne asocijacije od interesa za HOO i hrvatski sport\n\nverificira uspostavljanje odnosa s drugim nacionalnim olimpijskim odborima\n\nodlucuje o isticanju kandidature za organizaciju olimpijskih igara, mediteranskih igara i drugih visesportskih natjecanja za koje je potrebno donijeti odluku\n\nodlu€uje o verifikaciji svojih élanova, izboru predsjednika i €etiri dopredsjednika, élanova Vijeéa, Clanova Nadzornog odbora, élanova Komisije za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i élanica, élanova Zalbenog vijeée za antidoping, vanjskog revizora i likvidatora, te donosi odluku o njihovom razrjeSenju\n\nodluuje o statusu svojih élanova - uélanjenju, sankcijama i prestanku", " élanstva\n\ndonosi op¢i akt kojim se utvrduju naéela i osnovni elementi sustava sportskih natjecanja u Republici Hrvatskoj\n\nimenuje Eti¢ki odbor i osniva Hrvatsku olimpijsku akademiju osniva posebna povjerenstva za izvrsavanje odredenih zadaéa\n\nusvaja godisnje i viSegodisnje planove i programe dijela javnih potreba sporta drzavne razine u nadleznosti HOO-a, godi&nji financijski plan HOO-a, odnosno dio programa javnih potreba sporta drzavne razine u nadleZnosti HOO-a i financijski plan HOO-a za slijedecu godinu, kao i njegove izmjene i dopune, a iznimno u sluéaju potrebe privremeni financijski plan HOO-a, te izvjeSéa o izvrSenju programa i financijski izvjestaj za prethodnu godinu.\n\ndonosi projekt priprema i sudjelovanja na olimpijskim i zimskim olimpijskim igrama\n\ndonosi kriterije za lokalne sportske zajednice na razini gradova u odnosu na élanstvo u Odboru lokalnih sportskih zajednica\n\ndonosi odluku o promjeni ciljeva i djelatnosti, prestanku rada i raspodjeli preostale imovine\n\nobavlj", "a i druge poslove i zadace odredene zakonom, te je nadlezna i za sva pitanja za\n\nkoja nije utvrdena nadleznost drugih tijela HOO-a, kada se radi o pitanjima koja po svom zna¢aju upucuju na nadleznost najviseg tijela upravijanja HOO-a.\n\nb) Sastav SkupStine\n\nElanak 28.\n\n(1) SkupStinu Cine:\n\npo jedan predstavnik nacionalnih sportskih saveza, Zupanijskih sportskih zajednica i Grada Zagreba, te udruga i ustanova\n\ntri predstavnika Komisije sportasa\n\ntri predstavnika Hrvatskog kluba olimpijaca, natjecatelja na olimpijskim igrama\n\nGlanovi MOO\n\na u Hrvatskoj po funkciji\n\npoéasni élanovi MOO\n\na u Hrvatskoj po funkciji. (2) Pravo glasa u SkupSstini imaju svi predstavnici nacionalnih sportskih saveza iz lanka 17. ovog Statuta, sportskih zajednica zupanija i Grada Zagreba, sva tri predstavnika Komisije sportasa i\n\nHrvatskog kluba olimpijaca, te €lanovi MOO-a u Hrvatskoj.\n\n(3) Predstavnici Komisije sportSa se moraju povuci sa svojih mjesta u Skupstini HOO-a najkasnije krajem treée olimpijade nakon p", "osljednjih olimpijskih igara u kojima su sudjelovali.\n\n(4) Drzava i njezina tijela kao i druga tijela javne viasti i nedrzavnih institucija, sukladno Olimpijskoj povelji, ne mogu imenovati svoje predstavnike u SkupStinu.\n\nClanak 29. (1) Predstavnici nacionalnih sportskih saveza uclanjenih u medunarodne federacije olimpijskih sportova moraju imati vecinu glasova u Skup5Stini.\n\n(2) Radi provedbe odredbe stavka 1. ovog ¢lanka predstavnici nacionalnih sportskih saveza uclanjenih u medunarodne federacije olimpijskih sportova imaju po dva glasa u Skup&tini.\n\nClanak 30. (1) Za Elana SkupStine moze biti izabrana osoba koja ispunjava slijedece uvjete i kriterije:\n\nda je drzavijanin Republike Hrvatske\n\nda je afirmiran sportaé ili sportski djelatnik\n\nda prihvaca i promiée naéela i pravila Olimpijske povelje, Etickog i Medicinskog kodeksa, Svjetskog kodeksa protiv dopinga te ovog Statuta\n\ndase nije ogrijeSio o etiéke norme i naéela olimpijskog pokreta\n\nda nije kaZnjen disciplinskom kaznom nacional", "nog sportskog saveza, osim kazne koju su dobili sportaSi u sustavu natjecanja\n\ndanema zapreke iz élanka 114. odnosno élanka 111. stavci 1. i2. Zakonao sportu\n\nda nije zaposten ili angaziran po ugovoru o djelu ili drugom odgovarajucem ugovoru, u HOO\n\nu, odnosno u élanovima HOO\n\na, na teret sredstava financijskog plana HOO\n\na\n\n(2) Clanovi Skup&tine obvezni su potpisati posebnu izjavu o postivanju Olimpijske povelje i ovog Statuta.\n\n(3) Odbijanje potpisa izjave iz prethodnog stavka ovog Clanka ima znaéaj ostavke, te je élan HOO-a, kojeg predstavlja, duzan predloziti novog predstavnika.\n\n(4) Jedan élan SkupStine moje biti predstavnik, sto ukljucuje i zamjenu predstavnika, samo jednog Clana HOO-a.\n\nc) Mandat Skup8tine\n\nClanak 31. (1) Mandat SkupStine traje éetiri godine, a podinje teéi danom odrzavanja izborne sjednice Skupstine na kojoj se verificira vecina mandata predstavnika élanova HOO-a za novi saziv SkupStine.\n\n(2) Ista osoba moze biti ponovno izabrana u Skupstinu za novo mandatno ra", "zdoblje. Naknadno izabranom élanu Skup8tine mandat traje do isteka mandata saziva SkupStine za koji\n\nje izabran. (3) Iznimno, u sluéaju sprijeéenosti Clana Skupstine da sudjeluje na sjednici SkupStine, nadlezno tijelo nacionalnog sportskog saveza, sportske zajednice i udruge moze, na temelju pisane\n\nodluke, imenovati zamjenika za tu sjednicu.\n\n(4) Mandat zamjenskog élana za tu sjednicu podlijeze verifikaciji SkupStine.\n\nElanak 32. (1) Izbori predstavnika u Skup&tinu objavijuju se najkasnije 60 dana prije odrZavanja izborne SkupStine novog saziva.\n\n(2) Izbornu sjednicu SkupStine saziva predsjednik na temelju odluke Vijeca.\n\nClanak 33. (1) Clanovi Skup&tine sudjeluju u radu i odlucivanju zasnivajuci svoje stajaliste prije svega na:\n\nzahtjevima provodenja utvrdene strategije razvoja sporta u Republici Hrvatskoj\n\nzajednitkim obvezama i odgovornostima za ostvarivanje programa javnih potreba u sportu Republike Hrvatske\n\nteZnjama k ostvarivanju sportskih vrijednosti koje pridonose razvitku, a", "firmaciji ugledu hrvatskog sporta i Republike Hrvatske\n\nzajedniékim interesima svih udruzenih élanica i obvezi izvrSenja ciljeva i zadaca HOO\n\na utvrdenih zakonom, ovim Statutom i Olimpijskom poveljom.\n\n(2) Obveza je ¢lanova Skupstine u svakoj prigodi zastupati i Stititi interese HOO-a, hrvatskog sporta i olimpizma te interese udruge koju predstavijaju.\n\n(3) Clanovi Skup&tine duzni su prije svake sjednice Skupétine ili Odbora provesti konzultacije s udrugom koju predstavljaju oko materijala za tocke dnevnog reda na sjednicama.\n\n€lanak 34. Elanu Skup&tine mandat moze prestati: - — istekom trajanja mandata na koji je izabran -  gubitkom drzavijanstva Republike Hrvatske\n\npodnoSenjem neopozive ostavke\n\nopozivom od strane nacionalnog sportskog saveza, sportske zajednice odnosno udruge ¢iji je predstavnik\n\nnastupanjem okolnosti zbog kojih vise ne moZe obavijati duznost\n\nkada se utvrde uvjeti nespojivosti odredenih funkcija i duznosti u HOO\n\nu, odnosno njegovoj Struénoj sluzbi i njegovim tlan", "ovima\n\nako je élan SkupStine predstavnik saveza ili druge udruge nad kojom je pokrenut stecajni postupak\n\nrazrjesenjem.\n\nClanak 35. (1) U sluéajevima iz élanka 34. alineje 1. do 6. ovog Statuta, élanstvo prestaje automatski, bez provodenja posebnog postupka, verifikacijom stanja na sjednici SkupStine.\n\n(2) U sluéaju razrjeSenja iz élanka 34. alineje 8. ovog Statuta, mandat lana u SkupStini moze prestati u slucaju:\n\nako ne prihvaéa, ne promice, ne pridrZava se ili kr3i naéela i pravila Olimpijske povelje, Etickog, ili Medicinskog kodeksa, Svjetskog kodeksa protiv dopinga te ovog Statuta\n\nako svojim nedoliénim ponaganjem &teti interesima ili ugrozZava ugled HOO\n\na i olimpijskog pokreta u hrvatskoj javnosti ili na medunarodnom planu\n\nako tijekom dvije godine neopravdano izostaje sa sjednica Skup$tine, ili ne izvréava zada¢e koje proizlaze iz Statuta i odluka Skup$tine i njezinih tijela.\n\n(3) RazrjeSenje élana SkupStine zbog jednog ili vige razloga iz stavka 2. ovog élanka moze zatraziti n", "acionalni sportski savez, Zupanijska zajednica ili udruga, te élanovi Skupstine.\n\n(4) RazrjeSenje lana SkupStine zbog razloga iz élanka 34. alineja 7. ovog Statuta SkupStini prediaze Vijeée HOO-a.\n\n(5) U sluéaju kad razrjeSenje Clana Skupétine trazi élan Skupétine, takav zahtjev se stavija na razmatranje ako ga je podrialo najmanje petnaest élanova SkupStine s pravom glasa.\n\nClanak 36. (1) Odluku o prestanku élanstva u SkupStini zbog jednog ili vie utvrdenih razloga iz élanka 35. stavka 2. ovog Statuta, donosi Skupétina na temelju pisanog zahtjeva ovlastenog tijela ili osobe iz Clanka 35. stavka 3. ovog Statuta, dvotrecinskom vecinom glasova nazoénih élanova s pravom glasa na sjednici Skupstine.\n\n(2) Clan SkupStine o €ijem se prestanku élanstva u Skup$tini raspravlja, ima pravo prije glasovanja pred Skupstinom izloiiti svoj stav, a u sluéaju da osporava podneseni zahtjev za njegovo razrjeSenje moze zatraziti misljenje Etickog odbora, koje ée biti razmatrano na Skup8tini zajedno s podne", "senim zahtjevom za razrjeSenje.\n\n(3) RazrijeSeni lan Skupstine ne moze vise postati Elanom Skupétine niti Obavijati bilo koju drugu funkciju u HOO-u, ako je razrijeSen u skladu s élankom 35. stavcima 2. i 3. ovog Statuta.\n\n(4) Iskljuéeni élan MOO-a ne moze vige biti lan HOO-a.\n\nd) Sjednice SkupStine Clanak 37. (1) SkupStina HOO-a odlucuje o pitanjima iz svoje nadleznosti na sjednicama.\n\n20\n\n(2) Sjednice SkupStine saziva i predsjedava im predsjednik, a u sluéaju njegove odsutnosti ili sprijecenosti jedan od dopredsjednika kojeg on oviasti.\n\n(3) Izborne sjednice SkupStine saziva predsjednik, a predsjedava joj troclano radno\n\npredsjednistvo koje se bira izmedu ¢lanova SkupStine s pravom glasa. U radno predsjednistvo ne mogu biti birani kandidati za predsjednika HOO-a.\n\n(4) Sjednice SkupStine saziva predsjednik:\n\nkad ocijeni potrebnim, a najmanje dva puta godisnje\n\nnatemelju zakljucka Vijeca\n\nna obrazlozeni zahtjev najmanje jedne trecine Clanova SkupStine\n\nna obrazlozZeni pisani zahtjev Na", "dzornog odbora. (5) Skupstina moze pravovaljano odlucivati ako je na sjednici nazocan onaj broj ¢lanova SkupStine ¢iji ukupan broj glasova Cini za jedan glas vise od polovine ukupnog broja glasova élanova SkupStine s pravom glasa. (6) Clanu SkupStine na izbornoj sjednici SkupStine HOO\n\na, oduzet ¢ée se pravo glasa u sluéaju da je predstavnik Elana HOO\n\na koji nema urednu registraciju o vazecim mandatima tijela\n\nupravljanja i zastupanja.\n\n€lanak 38. (1) Sjednice SkupStine mogu biti redovne, izvanredne, tematske, svecane i izborne.\n\n(2) Izvanredne i tematske sjednice SkupStine saziva predsjednik na viastitu inicijativu, ili na temelju zakljuéka, odnosno zahtjeva iz Clanka 37. stavka 4. alineje 2. do 4. ovog Statuta.\n\n(3) Zahtjev za sazivanje izvanredne sjednice Skupstine mora sadrzavati prijedlog dnevnog reda i pisano obrazlozenje s prijedlogom tema za dnevni red sjednice.\n\n(4) Ako nadlezno tijelo SkupStine ovlasteno za sazivanje sjednice Skupstine, prema odredbi élanka 37. stavak 2., ne", " sazove izvanredu sjednicu Skupstine u roku od 30 dana od dana prijema zakljuéka, odnosno zahtjeva za sazivanje izvanredne sjednice postavijenog u skladu s odredbama ovog Statuta, inicijator moze sam sazvati trazenu izvanrednu sjednicu SkupStine.\n\n(5) Tematske sjednice SkupStine odrzavaju se osobito, radi razmatranja posebne problematike olimpijskih sportova, neolimpijskih sportova ili sporta na lokalnoj razini.\n\n(6) Sveéane sjednice Skupstine mogu se sazvati povodom Velikog dana hrvatskog sporta 17.\n\nsijeénja, odnosno drugog datuma kojeg odredi Vijeée HOO-a, te Hrvatskog olimpijskog dana 10. rujna.\n\n21\n\n(7) Izborne sjednice Skupétine odrzavaju se svake éetiri godine, nakon odrzanih olimpijskih igara.\n\n(8) U sluéaju isteka mandata tijelima HOO-a, SkupStinu HOO-a saziva zadnja osoba za zastupanje upisana u Registar udruga ili najmanje 1/3 punopravnih élanova HOO-a, koje su upisane u popis clanova HOO-a prije isteka mandata tijelima HOO-a.\n\nClanak 38.4 (1) Iznimno, u sluéaju izvanrednih ", "okolnosti i u hitnim slu€ajevima, odnosno u situacijama kad je odluka Skup&tine hitna, a nema dovoljno vremena ili drugih uvjeta da se odrzi redovna sjednica Skupétine, SkupStina moze donijeti odluku glasovanjem élanova SkupStine bez neposrednog dolaska ¢lanova SkupStine na sjednicu, izjaSnjavanjem o prijedlogu odluke putem e-maila (elektroniéka sjednica).\n\n(2) Za organizaciju navedene elektroniéke sjednice dostavlja se prijedlog ili pitanje ¢lanu Skup8tine s prijedlogom da se izjasni ,Za“, ,,Protiv” ili ,SuzdrZan“ u odnosu na prijedlog odluke koju je potrebno usvojiti na hitan naéin bez sazivanja sjednice.\n\n(3) Takve odluke zahtijevaju prihvacanje od strane vecine svih élanova SkupStine HOO-a s Pravom glasa, ukljuéujuéi provedbu odredbe iz élanka 29. stavak 2. Statuta, ali iskljucujuci primjenu odredbe lanka 31. stavak 3. Statuta.\n\n(4) O elektroniékoj sjednici sastaviti ée se, a zatim i verificirati, zapisnik na slijedeéoj redovnoj sjednici Skupstine HOO-a.\n\n€lanak 39. (1) SkupStina d", "onosi odluke dvotrecinskom vecinom glasova nazoénih élanova na SkupStini s pravom glasa, u slijedecim sluéajevima:\n\nkod donoSenja Statuta HOO\n\na kao i njegovih izmjena i dopuna\n\nkod odlugivanja o prestanku élanstva u Skup8tini u skladu s élankom 36. stavak 1. ovog Statuta.\n\n(2) Odluku o prestanku rada HOO-a donosi SkupStina dvotrecinskom vecinom ukupnog broja glasova Clanova u Skupétini s pravom glasa.\n\n(3) O svim drugim pitanjima, osim stavaka 1. i 2. Ovog Clanka, Skup3tina donosi odluke vecinom glasova nazoénih élanova s pravom glasa na sjednici SkupStine.\n\n(4) U sluéaju jednakog broja glasova zai protiv odlucuje glas predsjedavajuéeg SkupStine.\n\nClanak 40. Glasovanje u Skup8tini je javno osim:\n\n22\n\nako SkupStina dvotrecinskom vecinom glasova nazocnih Clanova s pravom glasa, odlugi da je glasovanje o pojedinim pitanjima tajno i\n\nkad se glasuje o izboru tijela HOO\n\na, a broj predlozenih kandidatata je veci od broja osoba koje se bira za pojedino tijelo. €lanak 41. Kada se radi o:\n\nula", "njenju HOO\n\na u MOO i asocijacije njegovih Clanova\n\n— isticanju kandidature za organizaciju olimpijskih igara\n\nuspostavljanju odnosa s drugim nacionalnim olimpijskim odborima\n\nprojektu priprema i sudjelovanja na olimpijskim igrama, kod odlugivanja se uzimaju u obzir samo glasovi Elanova SkupStine predstavnika nacionalnih sportskih saveza uclanjenih u medunarodne federacije olimpijskih sportova, ¢lanova Vijeca, predstavnika Komisije sportasa i Hrvatskog kluba olimpijaca. Clanak 42. Poslovnikom o radu Skupstine podrobnije se ureduju sazivanje, sadrzaj rada i tijek sjednica,\n\nprava, obveze i odgovornosti ¢lanova SkupStine u vezi sa sjednicom, kao i druga pitanja od znacenja za odrzavanje sjednica.\n\ne) Stalna radna tijela SkupStine\n\nElanak 43. Stalna radna tijela SkupStine jesu:\n\nodbor Ijetnih olimpijskih sportova\n\nodbor zimskih olimpijskih sportova\n\nodbor neolimpijskih sportova\n\nodbor lokalnih sportskih zajednica Clanak 44.\n\n(1) Odbor Ijetnih olimpijskih sportova cine élanovi SkupStine ko", "ji su predstavnici nacionalnih sportskih saveza Ciji su sportovi ukljuceni u program igara olimpijade (/jetne). U Odboru Ijetnih\n\n23\n\nolimpijskih sportova ne sudjeluju predstavnici nacionalnih sportskih saveza ¢iji sportovi su ukljuceni u program zimskih olimpijskih igara.\n\n(2) Odbor zimskih olimpijskih sportova eine élanovi SkupStine koji su predstavnici nacionalnih sportskih saveza Ciji su sportovi ukljugeni u program zimskih olimpijskih igara.\n\n(3) Odbor neolimpijskih sportova éine élanovi SkupStine koji su predstavnici svih neolimpijskih nacionalnih sportskih saveza, punopravnih i pridruzenih Clanova HOO-a koji nisu na programu igara olimpijade niti zimskih olimpijskih igara.\n\n(4) Odbor lokalnih sportskih zajednica gine élanovi Skup8tine koji su predstavnici sportskih zajednica u Zupanijama i Gradu Zagrebu te predstavnici sportskih zajednica u pojedinim gradovima prema odluci Skup8tine.\n\n(5) Svi Clanovi u stalnim radnim tijelima Skupétine pri odlugivanju raspolazu s jednim glasom. ", "(6) Stalna radna tijela Skup&tine sastaju se u pravilu prije sjednica Skupétine ili prema potrebi.\n\n(7) Odbori mogu, prema potrebi, djelovati zasebno ili zajednicki, sa drugim odborima, na svojim sjednicama.\n\n€lanak 45. (1) Sjednice stalnih radnih tijela Skup&tine saziva i predsjedava im jedan od élanova Vijeéa HOO- a iz redova predstavnika u Skup&tini HOO-a koji sukladno odredbi élanka 44. Statuta HOO-a cine pripadajuci odbor, a kojeg Skup&tina imenuje za predsjednika tog stalnog radnog tijela.\n\n(2) Stalno radno tijelo Skup&tine donosi poslovnik o svom radu.\n\nClanak 46. (1) Odbor Ijetnih olimpijskih sportova bavi se pitanjima u odnosu na sudjelovanje na igrama olimpijade, europskim i mediteranskim igrama, te drugim visesportskim priredbama pod pokroviteljstvom MOO-a za sve sportove koji su ukljuceni u program igara olimpijade, program europskih i mediteranskih igara, kao i drugim pitanjima aktivnosti tih nacionalnih sportskih saveza vezanih uz program javnih potreba u sportu na drzavn", "oj razini, a naro¢ito:\n\nrazmatra prijedlog kriterija za nastup_na igrama olimpijade, olimpijskim igrama mladih, europskim i mediteranskim igrama za sve sportove\n\nfazmatra prijedlog liste sudionika igara olimpijade, olimpijskih igara mladih, europskih i mediteranskih igara\n\nfazmatra prijedlog programa priprema za igre olimpijade, olimpijske igre mladih, europske i mediteranske igre\n\nrazmatra prijedlog liste potencijalnih i evidentnih kandidata za sudjelovanje na igrama olimpijade, olimpijskim igrama mladih, europskim i mediteranskim igrama\n\n24\n\nsudjeluje u pripremi kriterija za izradu dijela programa javnih potreba sportu na drzavnoj razini u nadleZnosti HOO\n\na\n\nrazmatra prijedlog financijskog plana HOO\n\na, u dijelu koji se odnosi na programe utvrdene ovim Clankom Satuta\n\nrazmatra prijedlog kriterija za kategorizaciju sportaSa\n\nrazmatra prijedlog naéela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj za nacionalne sportske saveze ¢lanove HOO\n\na.\n\n(2) Kad odbor |j", "etnih olimpijskih sportova razmatra pitanja u odnosu na europske odnosno mediteranske igre, u njegovu radu s pravom glasa sudjeluju i Clanovi SkupStine koji su predstavnici nacionalnih sportskih saveza koji nisu na programu igara olimpijade, ali su u programu europskih odnosno mediteranskih igara.\n\nElanak 47. Odbor zimskih olimpijskih sportova bavi se pitanjima u odnosu na sudjelovanje na zimskim olimpijskim igrama te drugim viSesportskim priredbama pod pokroviteljstvom MOO-a za sve sportove koji su ukljuceni u program zimskih olimpijskih igara, kao i drugim pitanjima aktivnosti tih nacionalnih sportskih saveza vezanih uz program javnih potreba u sportu na drzavnoj razini, a naroéito:\n\nrazmatra prijedlog kriterija za nastup na zimskim olimpijskim igrama i zimskim olimpijskim igrama mladih za sve sportove\n\nrazmatra prijedlog liste sudionika zimskih olimpijskih igara i zimskih olimpijskih igara mladih\n\nrazmatra prijedlog programa priprema za zimske olimpijske igre i zimske olimpijske igr", "e mladih\n\nrazmatra prijedlog liste potencijalnih i evidentnih kandidata za sudjelovanje na zimskim olimpijskim igrama i zimskim olimpijskim igrama mladih\n\nsudjeluje u pripremi kriterija za izradu dijela programa javnih potreba sportu na drzavnoj razini u nadleznosti HOO\n\na\n\nrazmatra prijedlog financijskog plana HOO\n\na, u dijelu koji se odnosi na programe utvrdene ovim Clankom Satuta\n\nrazmatra prijedlog kriterija za kategorizaciju sportasa\n\nrazmatra prijedlog nacela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj za nacionalne sportske saveze Clanove HOO\n\na.\n\n25\n\nElanak 48.\n\nOdbor neolimpijskih sportova bavi se pitanjima aktivnosti nacionalnih sportskih saveza sportova koji nisu ukljuéeni u program igara olimpijade, niti zimskih olimpijskih igara, a naroéito:\n\nsudjeluje u pripremi kriterija za izradu dijela programa javnih potreba u sportu drzavne razine u nadleZnosti HOO-a\n\nrazmatra prijedlog financijskog plana HOO-a u dijelu koji se odnosi na programe utvrdene ", "ovim élankom Satuta\n\nrazmatra prijedlog kriterija za kategorizaciju sportaga\n\nrazmatra prijedlog nacela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj za nacionalne sportske saveze élanove HOO-a.\n\nElanak 49.\n\nOdbor lokalnih sportskih zajednica bavi se pitanjima sporta na razini zupanija, gradova i opéina, a naro¢ito:\n\nrazmatra pitanja organizacije i djelovanja sporta na lokalnoj razini poti¢e medusobnu suradnju izmedu lokalnih sportskih zajednica\n\nrazmatra prijedlog financijskog plana HOO-a u dijelu koji se odnosi na programe poticanja razvoja sporta\n\npotice suradnju lokalnih sportskih zajednica i tijela lokalne i podruéne (regionalne) samouprave\n\npredlaze Skupétini kriterije za lokalne sportske zajednice na razini gradova u odnosu na €lanstvo u Odboru lokalnih sportskih zajednica.\n\nElanak 50.\n\n(1) Staina radna tijela Skup5tine mogu pravovaljano odlugivati ako je prisutna natpoloviéna vecina svih €lanova.\n\n(2) Sve odluke stalna radna tijela donose vecinom glaso", "va prisutnih Clanova.\n\n(3) U radu stalnih radnih tijela SkupStine obavezno sudjeluju predstavnici Struéne sluzbe HOO-a.\n\nClanak 51.\n\nMandat stalnih radnih tijela SkupStine traje paralelno s mandatom Skup3stine.\n\n26\n\n2. Predsjednik\n\nClanak 52. (1) Predsjednik obavija sljedece zadace i poslove:\n\npredstavija i zastupa HOO u zemlji i inozemstvu\n\nSaziva i predsjedava sjednicama SkupStine i Vijeca\n\npoduzima i potiée aktivnosti za promicanje olimpizma i primjenu Olimpijske povelje i ovog Statuta\n\npotiée aktivnosti na razvoju i unapredenju funkcioniranja djelatnosti hrvatskog sporta\n\npotpisuje protokole, konvencije i deklaracije medunarodnih sportskih i nevladinih asocijacija i institucija od interesa za hrvatski sport\n\npotpisuje opce akte HOO\n\na koje donosi SkupStina i Vijece\n\npotpisuje verificirane zapisnike odrzanih sjednica SkupStine i Vijeca kojima predsjeda\n\npredlaze SkupStini kandidate za dopredsjednike i clanove Vijeca i predlaze Vijecu kandidate za glavnog tajnika\n\npokrecée rjeSavanje", " pitanja razrjeSenja Clanova Vijeca te dopredsjednika\n\nvoditelj je delegacije HOO\n\na na olimpijskim, europskim i mediteranskim igrama i drugim viSesportskim priredbama kojima je nazocan\n\nizvrSava i druge aktivnosti i obveze sukladno odlukama i zakljuécima Skupstine i Vijeca, odredbama Olimpijske povelje i drugih medunarodnih propisa u sportu, opcim aktima HOO\n\na i ovim Statutom.\n\n(2) Za svoj rad predsjednik je odgovoran Skup$tini. (3) U sluéaju odsutnosti ili sprijecenosti predsjednika, zamjenjuje ga jedan od dopredsjednika\n\nkojeg oviasti predsjednik, odnosno kojeg odredi Vijece u sluéaju nemogucnosti da predsjednik o tome odludi.\n\nElanak 53. Za predsjednika moZe biti izabrana osoba koja udovoljava sljedecim uvjetima i kriterijima: - daje drzavljanin Republike Hrvatske\n\nda je ugledan sportski djelatnik\n\n27\n\nda viada jednim od sluzbenih jezika MOO\n\na, engleskim ili francuskim\n\nda se nije ogrijesio o etitke norme i moraina naéela olimpizma\n\nda prihvaéa ovaj Statut i Olimpijsku povelju\n\nd", "a nema zapreke iz élanka 114. odnosno 111. stavci 1. | 2. Zakona o sportu i élanka 19. stavci 2. i 3. Zakona o udrugama\n\nda je Clan Skup8tine.\n\nClanak 54. (1) Predsjednika bira SkupStina na naéin i po postupku utvrdenom posebnom odlukom SkupStine o provodenju izbora.\n\n(2) Mandat predsjednika traje éetiri godine i ista osoba moze biti ponovno izabrana za novo mandatno razdoblje.\n\n(3) Kandidate za predsjednika mogu istaci nacionalni sportski savezi, punopravni clanovi HOO-a udlanjeni u matiéne medunarodne federacije olimpijskih sportova izmedu svih élanova SkupStine s pravom glasa.\n\n(4) Za isticanje kandidata za predsjednika potrebno je najmanje 10 potpisa punopravnih élanova HOO-a o podrzavanju njegove kandidature.\n\n(5) Odluku o pokretanju postupka isticanja kandidata za predsjednika donosi Vijeée, kod redovnog izbora, zajedno s odlukom o sazivanju izborne sjednice Skupstine najmanje 60 dana prije termina odrzavanja sjednice, o éemu u dalinjem roku od osam dana obavjestava pisanim\n\npute", "m Clanove HOO\n\n\n\na.\n\nPoéasni predsjednik\n\nClanak 55.\n\nSkupStina moze, na prijedlog Vijeca izabrati za poéasnog predsjednika Hrvatskog olimpijskog odbora, osobu koja je kao predsjednik Hrvatskog olimpijskog odbora svojim izuzetnim radom doprinijela ugledu i razvoju Hrvatskog olimpijskog odbora i olimpijskog pokreta u Hrvatskoj i svijetu.\n\n3. Vijece Clanak 56. (1) Vijeée je izvr8no tijelo HOO-a koje obavija sljedece zadace i poslove:\n\nprediaze Statut i opée akte HOO\n\na te njihove izmjene i dopune\n\n28\n\nutvrduje akt kojim HOO sudjeluje u predlaganju i provodenju nacionalne strategije razvoja sporta i nacionalnog plana razvoja sporta, te utvrduje elemente za sudjelovanje u predlaganju i ostvarivanju mjera za unapredenje razvoja sporta\n\nimenuje glavnog tajnika na temelju provedenog natjecaja i razrjeSava ga\n\nimenuje osobe s posebnim ovlastima u stru¢nim sluzbama na prijedlog glavnog tajnika predlaze uclanjenje u medunarodne sportske i nedrzavne asocijacije od interesa za HOO inicira uspostav", "ljanje i odrzavanje odnosa s drugim nacionalnim olimpijskim odborima\n\npredlaze isticanje kandidature za organizaciju olimpijskih igara i drugih viSesportskih natjecanja o kojima odlucuje SkupStina\n\nprediaze godisnje i viSegodisnje programe javnih potreba sporta drzavne razine u nadleZnosti HOO-a, godiSnji financijski plan HOO-a, odnosno program javnih potreba sporta drzavne razine u nadleZnosti HOO-a i financijski plan HOO-a za slijedecu godinu, a iznimno u slucaju potrebe privremeni financijski plan HOO-a, te utvrduje prijedlog izvjeséa o izvrSenju programa i financijskog izvjeStaja za prethodnu godinu\n\nodobrava pokroviteljstvo HOO\n\n\n\na pod utvrdenim uvjetima\n\npredlaze uclanjenje novih élanova u HOO-a i utvrduje pravila postupka za prijem novih clanova\n\ndaje preporuke nacionalnim sportskim savezima za uClanjenje u medunarodne federacije\n\npredlaze pocasne Clanove HOO\n\n\n\na\n\nisti€ée kandidate za Clanstvo u tijelima MOO-a i drugim asocijacijama Ciji je HOO clan imenuje i opoziva predstavn", "ike HOO-a u drugim organizacijama, institucijama i tijelima\n\nutvrduje prijedlog projekta priprema i sudjelovanja hrvatskih sportasa na igrama olimpijade i zimskim olimpijskim igrama, a u slu¢éaju Zurne potrebe ovlasteno je utvrditi izmjene i dopune projekta, ukljucujuci i izmjene i dopune Kriterija za razvrstavanje sportasa u kategorije olimpijskih kandidata, koje se na prvoj slijedecoj sjednici SkupStine podnose na verifikaciju, te donosi projekt priprema i sudjelovanja hrvatskih sportasa na europskim i mediteranskim igrama, te drugim viSesportskim natjecanjima\n\nutvrduje sudionike olimpijskih igara, olimpijskih igara mladih, europskih i mediteranskih igara te drugih visesportskih natjecanja u nadleznosti HOO-a\n\nimenuje predsjednike i ¢lanove stalnih i povremenih radnih tijela Vijeca, te Clanove urednistva publikacija HOO-a i web redakcije HOO-a\n\n29\n\nodreduje predstavnike HOO-a za sudjelovanje na inozemnim ili tuzemnim skupovima\n\nodlucuje o naéinu stjecanja i kori8tenja sredstava u okv", "iru usvojenog programa i financijskog plana HOO-a\n\nrazmatra izvjeséa revizija\n\nutvrduje prijedlog odluke o promjeni ciljeva i djelatnosti, prestanku rada i raspodjeli imovine HOO-a\n\nupravija i raspolaze osnovnim sredstvima u vlasnistvu HOO-a izri€e mjere i sankcije u skladu s élankom 24. i 25. ovog Statuta\n\nimenuje Clanove Zirija za dodjelu “Nagrade HOO-a Matija Ljubek” i Nagrade ,,Drazen Petrovic” te raspisuje natjeéaj, odnosno objavu za dodjelu tih nagrada\n\nutvrduje nomenklaturu sportova u Republici Hrvatskoj, s podjelom na ekipne i pojedinaéne sportove\n\nutvrduje nagin provodenja postupka kategorizacije sportova u HOO-u za sportove koji su razvrstani u Nomenklaturi sportova i donosi odluku o rangiranju sportova i razvrstavanju u kategorije u nadleznosti HOO-a\n\nutvrduje nagin i postupak za provedbu nadzora nad stru€nim radom nacionalnih sportskih saveza\n\nutvrduje kriterije i nazin provedbe kontrole uginka svih programa koje realizira HOO, a posebno razvojnih programa za sportage i pro", "grame za trenere koji se financiraju kroz program javnih potreba u sportu drzavne razine\n\nutvrduje kriterije, naéin i postupak provedbe stru€nog nadzora nad radom trenera koji su financiranji kroz program javnih potreba u sportu drzavne rizine\n\nutvrdivanje prethodnog misljenja o postojanju interesa za prijam u_hrvatsko drzavljanstvo fiziéke osobe u sustavu sporta koja je strani drZavijanin, na trazenje tijela drzavne uprave nadleZnog za sport\n\nodlucuje 0 poslovodnom ustrojstvu struénih sluzbi HOO-a, te donosi opée akte o njihovom radu\n\ndonosi opée akte koji reguliraju pitanja iz nadleznosti Vijeéa HOO-a, te razmatra i odlucuje o pitanjima iz podrugja djelovanja HOO-a, a koja nisu u nadleznosti SkupStine ili kojeg drugog tijela HOO-a u skladu s odredbama ovog Statuta\n\ndonosi poslovnik o svom radu\n\n30\n\nobavijai druge zadaée i poslove koje mu povjeri Skupstina, odnosno koje su mu stavijene u nadleZnost ovim Statutom ili drugim aktom HOO\n\na\n\n(2) Vijeée za svoj rad odgovara Skup&tini.\n\nClan", "ak 57. (1) Vijeée éini 23 Elana, medu kojima su po funkciji:\n\npredsjednik\n\n€etiri dopredsjednika\n\nGlan MOO\n\na u Hrvatskoj\n\npredstavnik Komisije sportasa.\n\n(2) Cetiri dopredsjednika i ostale ¢lanove Vijeéa, na prijedlog predsjednika bira SkupStina, iz sastava SkupStine, pri Gemu se u predlaganju i biranju dopredsjednika i ¢lanova Vijeca treba voditi raéuna o odgovarajucoj zastupljenosti predstavnika Clanova HOO-a s pravom glasa u Skup&tini HOO-a (olimpijski sportovi, neolimpijski sportovi, sportske zajednice), ukljucujuci primjenu pravila 28. to¢éka 3. (1.2) Olimpijske povelje prema kojoj predstavnici nacionalnih sportskih saveza u¢élanjenih u medunarodne federacije olimpijskih sportova imaju vecinu u Vijec¢u HOO-a.\n\n(3) Ukoliko nema élana MOO-a u Hrvatskoj kao élana Vijeca HOO-a po funkciji, Skupstina bira lana Vijeca na to mjesto uvaZavajuci odredbu stvaka 1. ovog élanka.\n\nClanak 58. Za élana Vijeéa moze biti izabrana samo osoba koja udovoljava kriterijima i uvjetima iz ¢clanka 30. st", "avka 1. ovog Statuta.\n\nClanak 59.\n\nSlijedom odredaba Olimpijske povelje:\n\nvecinu od ukupnog broja élanova Vijeca cine Clanovi iz reda nacionalnih sportskih saveza uélanjenih u medunarodne federacije olimpijskih sportova te\n\nu Vijecu treba biti najmanje 40% zena od ukupnog boja Clanova Vijeca. Clanak 60. (1) Mandat Vijeéa traje paralelno mandatu SkupStine ¢etiri godine i ista osoba moze biti\n\nponovno izabrana za novo mandatno razdoblje.\n\n(2) Za sluéaj razrjeSenja Clana Vijeéa primjenjuju se odredbe Clanaka 34. i 35. ovog Statuta.\n\n31\n\n(3) Mandat élanu Vijeca prestaje i u sluéaju kad je osobi koja je élan Vijeéa prestao mandat lana Skup8tine.\n\n(4) Mandat Glanovima Vijeéa Prestaje i u sluéaju da predsjednik HOO-a podnese ostavku ili bude razrijeSen s te funkcije.\n\nClanak 61. (1) Vijece djeluje na sjednicama.\n\n(2) Za donoenje pravovaljanih odluka potrebna je nazoénost veéine od ukupnog broja élanova Vijeca.\n\n(3) Vijeée donosi odluke veéinom glasova nazoénih élanova, javnim glasovanjem.\n\n(4", ") Iznimno, od odredbe stavka 3. ovog Clanka dvotrecinskom vecinom glasova élanova Vijeéa donose se odluke o suspenziji lana Skuptine kao i o Poslovniku o radu Vijeéa.\n\n(5) U sluéaju jednakog broja glasova za i protiv, odluéuje glas predsjedavajuceg.\n\nClanak 62. (1) Sjednicama Vijeéa predsjedava predsjednik, a u sluéaju njegove odsutnosti ili sprijecenosti jedan od dopredsjednika kojeg on oviasti.\n\n(2) Poslovnikom o radu Vijeéa podrobnije se odreduju pitanja u vezi s odrZavanjem sjednica.\n\nClanak 63. (1) Sjednice Vijeéa saziva predsjednik prema potrebi, a najmanje Sest puta godignje.\n\n(2) Predsjednik je obvezan sazvati sjednicu Vijeéa i na obrazlozeni pisani zahtjev najmanje jedne trecine Clanova Vijeca.\n\n(3) Sjednice Vijeéa mogu biti radne ili sveéane.\n\n(4) Sjednice Vijeéa mogu biti otvorene ili zatvorene za javnost, zavisno o sadriaju i znaéenju predmeta koji su na raspravi, o €emu odlucuje Vijeée.\n\nClanak 64. (1) Za izvrSavanje odredenih zada¢a, Vijece svojom odlukom osniva stalna i ", "povremena radna tijela, odnosno povjerenstva.\n\n(2) Stalna radna tijela Vijeéa su: -  Zdravstvena komisija\n\nKomisija za ravnopravnost spolova u sportu\n\n32\n\nKomisija za sportsko graditeljstvo i okolis\n\nKomisija za medunarodne odnose\n\nKomisija za razvoj sporta\n\nKomisija za digitalizaciju i digitalne medije\n\nKomisija za marketing\n\nKomisija za informiranje i izdavastvo\n\nKomisija za dual karijeru u sportu (3) Povremena radna tijela ili povjerenstva osnivaju se za izvrsenje odredenih zada¢a.\n\n€lanak 65. (1) Odlukom o osnivanju radnih tijela Vijece odreduje njihov sastav, djelokrug i ovlasti.\n\n(2) Na radna tijela Vijeca ne moze se prenijeti odlucivanje u pitanjima koja su ovim Statutom stavljena u nadleZnost Vijeca.\n\n(3) Vijece imenuje predsjednike radnih tijela i na njihov prijedlog imenuje Clanove. (4) Vijece verificira programe rada, usvaja prijedloge i izvjeSca radnih tijela.\n\n(5) Vijeée postavlja tajnike radnih tijela, u pravilu iz sastava strucnih sluzbi HOO-a, na prijedlog glavnog tajni", "ka.\n\nClanak 66. Clanovi Vijeéa izvrSavaju zadace koje im nalozi Skup&tina, Vijece ili predsjednik.\n\nElanak 67. Obveza je ¢lanova Vijeéa u svakoj prigodi zastupati i Stititi interese HOO-a, cjelokupnog hrvatskog sporta i olimpijskog pokreta.\n\n4. Nadzorni odbor\n\nElanak 68. Nadzorni odbor Hrvatskog olimpijskog odbora (dalje u tekstu: Nadzorni odbor) tijelo je HOO-a sa zadacom:\n\nnadzora nad djelatnoséu HOO\n\na\n\nprovjere zakonitosti u radu i materijalno\n\nfinancijskom poslovanju u HOO\n\nu\n\n33\n\nnadzora izvrSavanja odluka i zakljuéaka Skup3Stine i Vijeéa\n\nfazmatranje revizorskog izvjeSéa vanjskog revizora i usvajanje revizorskog izvjeSéa unutarnjeg revizora\n\nkontrola provedbe naloga revizija i davanje uputa i zadaéa unutarnjoj reviziji\n\nprovjere pridrZavanja utvrdenih normi i akata HOO\n\na i postivanja ovog Statuta.\n\nClanak 69. (1) €lanove Nadzornog odbora bira SkupStina tajnim glasovanjem na naéin i po postupku utvrdenom posebnom odlukom Skupstine o provodenju izbora u HOO-u.\n\n(2) Za izbor élano", "va Nadzornog odbora mogu biti predlozeni samo kandidati punopravnih €lanova HOO-a koji nisu élanovi Skup8tine i drugih tijela HOO-a, kao i osobe koje nisu zaposlene ili angazirane po ugovoru o djelu ili drugom odgovarajuéem ugovoru, u HOO-u, odnosno u €lanovima HOO-a, na teret sredstava proracuna HOO-a.\n\nElanak 70. (1) Nadzorni odbor broji pet élanova.\n\n(2) Clanovi Nadzornog odbora na prvoj konstituirajucoj sjednici biraju svog predsjednika.\n\n(3) Mandat Nadzornog odbora traje Cetiri godine i ista osoba mode biti ponovno birana u novom mandatnom razdobliju.\n\n(4) Nadzorni odbor radi na sjednicama, koje saziva predsjednik Nadzornog odbora slanjem pisanog poziva i materijala za toéke dnevnog reda, najmanje pet dana prije dana odrzavanja sjednice Nadzornog odbora.\n\n(5) Za pravovaljano donoSenje odluka potrebno je da na sjednici Nadzornog odbora bude nazocno vise od polovice élanova Nadzornog odbora. Odluke se donose vecinom glasova nazo¢nih élanova Nadzornog odbora. U sluéaju jednakog broja", " glasova ,,za“ ili »protiv’ odluéuje glas predsjednika odnosno lana koji rukovodi radom Nadzornog odbora.\n\nElanak 71. Nadzorni odbor svoje zadaée iz lanka 68. ovog Statuta obavlja nad djelatnoSéu: - HOO-a i njegovih tijela\n\n€lanova HOO\n\na u dijelu koji je u nadleznosti HOO\n\na, odnosno kod pravnih i fiziékih osoba kojima je HOO namjenski doznacio sredstva, u dijelu tih doznaéenih sredstava.\n\nElanak 72. Radi izvorne informiranosti i uspjesnog djelovanja:\n\n34\n\npredsjedniku Nadzornog odbora dostavlja se poziv s materijalima za sjednice Vijeca\n\npredsjednika i ¢lanove Nadzornog odbora poziva se na sjednice Skupstine\n\npredsjednik i ¢lanovi Nadzornog odbora dobivaju zapisnike sjednica Vijeca i SkupStine.\n\nClanak 73. (1) Nagin rada Nadzornog odbora propisuje se poslovnikom o radu koji donosi Nadzorni odbor.\n\n(2) Struéne, administrativne i tehnicke poslove za Nadzorni odbor obavijaju strucne sluzbe HOO-a.\n\n(3) Struéna sluzba HOO-a, kao i predsjednik i glavni tajnik duzZni su dostaviti na uvid sv", "e trazene dokumente potrebne za rad Nadzornog odbora.\n\n5. Eti¢ki odbor\n\nElanak 74. (1) HOO osniva Etiéki odbor kao nezavisno tijelo HOO-a osnovano radi razvijanja i modernizacije osnova etickih pravila u sportu, temeljenih na vrijednostima i principima zajaméenim Olimpijskom poveljom i ovim Statutom, te skrbi o pridrZavanju i postivanju nacéela i pravila Olimpijske povelje, Statuta HOO-a i drugih opcih akata od strane ¢lanova Skupstine HOO-a, drugih tijela u njihovom radu kao i ostalih sudionika u sportu.\n\n(2) Eti¢ki odbor ima pet élanova, a imenuje ih Skup$tina na prijedlog élanova HOO-a i/ili €lanova Skup$tine.\n\n(3) Clanovi Etiékog odbora ne mogu biti osobe koje su élanovi Skup&tine HOO-a ili bilo kojeg drugog upravljaékog tijela HOO-a, kao ni osobe koje imaju zapreke utvrdene ¢lankom 111. stavci 1. i 2. Zakona o sportu.\n\n(4) Mandat Etickog odbora traje éetiri godine, a iste osobe mogu biti ponovno imenovane za ¢lana Eti¢kog odbora.\n\n(5) Etiéki odbor sudi u vijecu. Predsjednik Eti¢ko", "g odbora saziva sjednice vijeca, a odluke se donose vecinom glasova svih Clanova vijeéa Etickog odbora.\n\n(6) Posebnim aktom SkupStne ureduju se pitanja ustrojstva, djelokruga i natina rada Etitkog odbora.\n\n6. Komisija sportaSa HOO\n\n\n\na\n\nClanak 75. Komisija sportaSa HOO-a (dalje u tekstu: Komisija sportaSa) je stalno tijelo HOO-a, koje se osniva sukladno odredbama Olimpijske povelje i Smjernica MOO-a za osnivanje komisija sportaga nacionalnih olimpijskih odbora, éija misija je predstavljanje misljenja sportaSa i njihovo\n\n35\n\naktivno sudjelovanje u tijelima HOO-a, koje treba osigurati da se pri dono&enju odluka HOO-a uzmu u obzir migljenja i stavovi sportaga.\n\nClanak 76.\n\nDjelovanje Komisije sportasa obuhvaéa:\n\nfazmatranje pitanja koja se odnose na sportage i davanje prijedloga i miSljenja tijelima HOO\n\na\n\nZastupanje prava i interesa sportaSa i davanje preporuka\n\npoduzimanje aktivnosti za obrazovanje sportaga i rjeSavanje drugih pitanja znaéajnih za sportase\n\nodrzavanje kontakata s Komis", "ijom MQO\n\na i EOO\n\na za sportaSe te Hrvatski klubom olimpijaca\n\npromovira i poti¢e aktivnosti za primjenu i poStovanje Etickog kodeksa MOO\n\na\n\nsuradnju sa sportskim komisijama nacionalnih sportskih saveza i Hrvatskim klubom olimpijaca\n\n_ biranje predsjednika Komisije sportaéa, tri predstavnika u Skupstinu HOO\n\na i medu njima jednog Clana Vijecéa HOO\n\na\n\nsudjelovanje u predlaganju sportaga\n\nkandidata Republike Hrvatske za sportske komisije MOO\n\na i EOO\n\na, sukladno kriterijima koje utvrduje MOO i EOO\n\nsuradnju u aktivnostima za primjenu i postovanje pravila Olimpijske povelje MOO\n\na, koja se odnose na sportase, borbu protiv svakog oblika diskriminacije i nasilja u sportu, kao i protiv uporabe supstanci i te postupaka koje zabranjuje MOO ili medunarodni savezi\n\ndjelovanje na razvijanju prijateljstva, medusobnog razumijevanja i ravnopravnosti te izgradnji fair play odnosa u sportu i Zivotu.\n\nClanak 77. (1) Clanove Komisije sportaSa biraju sporta$i izmedu predlozenih kandidata koje su pred", "loZile sportske komisije nacionalnih sportskih saveza olimpijskih i neolimpijskih sportova punopravnih clanova HOO-a.\n\n(2) Jedan nacionalni sportski savez, odnosno jedan sport mode imati u Komisiji sportaga samo jednog élana.\n\n(3) U Komisiji sportaga trebaju biti zastupljena ravnopravno oba spola, koliko god je to moguée.\n\n(4) Komisija sportaSa je sastavijena od: -  Sest élanova — predstavnika Ijetnih olimpijskih sportova, medu kojima su tri sportasice i tri sportasa -  dva lana — predstavnika zimskih olimpijskih sportova, medu kojima je jedna sportasica i\n\njedan sportag -  dva Clana — predstavnika neolimpijskih sportova, medu kojima je jedna sportagica i jedan\n\nsportas\n\n(5) Elanovi Komisije sportasa po svojoj funkciji su: -  €lan Komisije MOO-a za sportage - lan Komisije EOO-a za sportage.\n\n36\n\n(6) Za Elana Komisije sportaSa moZe biti birana osoba koja ispunjava slijedece uvjete:\n\ndaje drzavijanin Republike Hrvatske\n\ndau vrijeme izbora ima navrsenih 18 godina Zivota\n\ndanije kaznjavana", " zbog dopinskih prekrSaja\n\ndanema prepreke iz lanka 111. stavci 1. | 2. Zakona o sportu\n\ndase osoba ukoliko je kandidat olimpijskih sportova, u vrijeme isticanja kandidature za izbor élana Komisije sportasa aktivno natjece u reprezentativnoj vrsti nacionalnog sportskog saveza punopravnog élana HOO\n\na, u sportu na programu igara olimpijade odnosno zimskih olimpijskih igara, te da je nastupila na igrama olimpijade odnosno zimskim olimpijskim igrama koje prethode izboru za Clana Komisije sportaéa ili na igrama olimpijade odnosno zimskim olimpijskim igrama Cetiri godine prije provedbe izbora\n\ndase osoba ukoliko je kandidat neolimpijskih sportova, u vrijeme isticanja kandidature za izbor élana Komisije sportasa aktivno natjece u reprezentativnoj vrsti nacionalnog sportskog saveza neolimpijskog sporta Ciji nacionalni sportski savez je punopravni Clan HOO\n\na, te da je u razdoblju od prethodne éetiri godine prije provedbe izbora, nastupila kao natjecatelj na sluzenom prvenstvu svijeta organizi", "ranom pod ingerencijom pripadajuce medunarodne sportske federacije.\n\nElanak 78.\n\nbirani.\n\n(2) Clanovi Komisije sporta’a HOO-a medu sobom biraju predsjednika Komisije sporta’a svake €etiri godine, odnosno kada predsjedniku istekne mandat ili kada mu iz drugih razloga prestane mandat u Komisiji.\n\n(3) Mandat élanova Komisije sportaSa po funkciji traje dok traje njihov status Clana Komisije MOO-a i/ili EOO-a za sportaée.\n\n(4) Izbori za Elanove Komisije sportaSa odrzavaju se glasovanjem sportaSa za vrijeme igara olimpijade, odnosno zimskih olimpijskih igara. Izbori Clanova Komisije sportasa neolimpijskih sportova organizira se na dan osnivanja HOO-a, 10. rujna svake Cetiri godine, odnosno drugog odgovarajuéeg termina ako izbore nije moguce provesti tog dana iz opravdanih razloga, organiziranjem posebnog glasovanja za izbor sportasa i sportaSice-predstavnika neolimpijskih sportova. Glasovanje se organizira na odvojenim listama za sportase igara olimpijade, zimskih olimpijskih igara i sportaS", "e neolimpijskih sportova. Kandidate na liste za glasovenje predlazu komisije sportaSa nacionalnih sportskih saveza, u kojima su te komisije osnovane.\n\n(5) Vijeée HOO-a ima pravo, na prijedlog predsjednika HOO-a predloziti do najvise dva kandidata na listu sportaSa o kojima se glasuje za izbor clanova Komisije sportasa, koji se isticu ukoliko je odredeni sport propustio kandidirati sportaSa koji ispunjava uvjete za uvrstenje na listu kandidata, a njegove sposobnosti i rezultati, kao i rezultati pripadajuceg sporta opravdavaju takvu kandidaturu, pri Cemu kandidat mora ispunjavati sve uvjete za uvrstenje na listu kandidata utvrdene pravilnikom o radu Komsije sportasa.\n\n37\n\n(6) Komisija sportasa djeluje na sjednicama Komisije. Sjednice Komisije sporta&a organiziraju se najmanje dva puta godiSnje. Rad na sjednici Komisije sportaSa valjano se odvija ako je na toj sjednici nazoéna najmanje polovina élanova Komisije sportaSa, a odluke, zakljuéci i preporuke Komisije se usvajaju vecinom glasova", " nazoénih élanova.\n\n(7) Odredbe koje utvrduju izbore kao i djelovanje Komisije sporta’a utvrduju se posebnim pravilnikom o radu Komisije sportaga koji donosi Skupstina HOO-a.\n\nClanak 79. brisan\n\n€lanak 80. brisan\n\nClanak 81. brisan\n\n€lanak 82. brisan Komisija za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i élanica\n\n€lanak 83. (1) Komisija za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i élanica je nezavisno tijelo HOO-a koje rjeSava sporove koji se mogu pojaviti izmedu HOO-a i njegovih élanova vezano uz nadleznosti HOO-a te skrbi o pridrZavanju i postivanju nagela i pravila Olimpijske povelje, Statuta HOO-a i drugih op¢ih akata, sukladno élanku 25. ovog Statuta, od strane:\n\n€lanova HOO\n\na\n\nanova tijela HOO\n\na\n\n€lanova radnih tijela HOO\n\na\n\nsportaéa i trenera korisnika programa HOO\n\na i\n\ndrugih korisnika prava (s osnove radno\n\npravnog statusa u ¢lanovima HOO\n\na, sudjelovanja u financiranju sredstvima HOO\n\na i sliéno).\n\n(2) Komisiju za rjeSavanje disciplinski", "h pitanja i prijepora izmedu HOO-a i élanica éini deset\n\nClanova, od toga pet élanova prvostupanjskog tijela i pet clanova drugostupanjskog tijela, koje\n\nimenuje na vrijeme od éetiri godine Skupétina HOO-a, na prijedlog Vijeéa HOO-a iz redova\n\nistaknutih pravnika poznavatelja sporta i sportskog sustava. Svako vijece radi u sastavu od po tri\n\nClana (predsjednik i dva élana).\n\n(3) Komisija za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i élanica sudi u vijeéu,\n\nsukladno odredbi prethodnog stavka, a sjednice svakog vijeca saziva predsjednik pripadajuceg\n\nvijeca. Odluke se donose vecinom glasova svih élanova pripadajuceg vijeca.\n\n(4) Posebnim aktom SkupStne ureduju se pitanja ustrojstva, djelokruga i na¢ina rada Komisije za\n\nrjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i élanica.\n\n38\n\n(5) Zalba na spor do kojeg dode prigodom ili u svezi s olimpijskim igrama iskljucivo se podnosi Sportskom arbitraznom sudu u Lausanni sukladno Kodeksu sportske arbitraze. Rok za pod", "noSenje Zalbe je dvadeset jedan (21) dan nakon primitka odluke koja se odnosi na Zalbu.\n\nNezavisno tijelo za antidoping\n\nZalbeno vijeée za antidoping\n\nClanak 83.A. Zalbeno vijece za antidoping samostalno je te operativno i institucionalno nezavisno tijelo koje djeluje pri Hrvatskom olimpijskom odboru nadlezno za postupanje i odlucivanje o zalbama u odnosu na sporove i pitanja koja proizlaze iz ili su u vezi s hrvatskim nacionalnim pravilima za antidoping i pripadajucim propisima. Postupak pred Zalbenim Vijeéem za antidoping ureduje se pripadajucim Pravilnikom\n\nVI. GLAVNI TAJNIK Elanak 84. Glavni tajnik obavija duZnost profesionalno, a imenuje ga na temelju javnog natjecaja Vijece HOO-a. €lanak 85. (1) Glavni tajnik imenuje se na odredeno vrijeme, u pravilu na Cetiri godine, a ista osoba moze biti ponovno imenovana za glavnog tajnika.\n\n(2) HOO i glavni tajnik zakljuéuju ugovor o radu na odredeno vrijeme, kojim odreduju medusobna prava obveze i odgovornosti.\n\n(3) Glavni tajnik ostvaruje ", "prava iz radnog odnosa u Strucnoj sluzbi HOO-a. Elanak 86. Za glavnog tajnika moZe biti imenovana osoba koja ispunjava sljedece uvjete i kriterije: - da je drzavljanin Republike Hrvatske - da posjeduje visoku struénu spremu -  daima najmanje pet godina radnog iskustva na rukovodecim poslovima - da vlada jednim od sluzbenih jezika MOO-a, engleskim ili francuskim - dase nije ogrijesio o eticke norme i moralna na¢éela sporta i olimpizma\n\nda nema zapreke iz Clanka 114. odnosno 111. stavci 1. i 2. Zakona o sportu i ¢lanka 19. stavci 2.13. Zakona o udrugama\n\n39\n\nprednost pri izboru ima osoba koja poznaje sustav i djelovanje sporta, koja je ugledni sportski djelatnik i koja ima iskustva na rukovodecim poslovima u sportu.\n\n€lanak 87.\n\nGlavni tajnik, provodi i osigurava provodenje opcih akata i programa HOO-a, te odluka i zakljucaka Skupstine, Vijeéa i predsjednika HOO-a, te osobito obavija slijedece poslove i zadace:\n\nzastupa HOO u zemiji i inozemstvu, a u pojednim situacijama, a po ovlasti Vi", "jeéa ili predsjednika, i predstavlia HOO\n\nsklapa ugovore i poduzima pravne radnje u ime i za raéun HOO-a odgovoran je za zakonitost rada HOO-a organizira i koordinira pripremu materijala za sjednice Skup$tine i Vijeéa\n\nodgovoran je za podnogenje prijedioga godisnjeg programskog i financijskog izvijeSéa Skupstini HOO-a,\n\nobvezan je tijekom poslovne godine provesti samoprocjenu udinkovitosti i djelotvornosti funkcioniranja sustava financijskog upravljanja i kontrola HOO-a\n\nodgovoran je za pravodobnu provedbu zaklju€aka i odluka Skup&tine i Vijeéa, obavjeStava nositelje zadaéa o odlukama i zakljuécima, te obavjestava Vijeée i SkupStinu\n\n0 izvrSenju odluka i zakljuéaka\n\nOdgovoran je za podnoSenje dokumenata nadleznim tijelima sukladno propisima, te za dostavljanje zapisnika s redovne sjednice SkupStine Saveza nadleZnom uredu\n\nkoordinira radom radnih tijela Vijeéa i skrbi o provodenju njihovih zakljucaka sudjeluje u radu Vijeéa bez prava glasa poduzima aktivnosti za izvrSavanje zadaéa i obv", "eza élanova HOO-a\n\norganizira i koordinira suradnju s MOO-om, njegovim tijelima i ostalim asocijacijama ¢iji je HOO élan\n\norganizira i koordinira suradnju s drugim nacionalnim olimpijskim odborima predlaze rjeSenja za unapredenja djelatnosti i poslovanja HOO-a\n\npredlaze Vijecu opéi akt o ustrojstvu i radu Strucne sluzbe HOO-a kao i imenovanje rukovoditelja Struénih sluzbi HOO-a\n\n40\n\nprovodi aktivnosti za javnost rada HOO\n\na\n\nlan je vodstva delegacije HOO\n\na na olimpijskim igrama, europskim i mediteranskim igrama i drugim viSesportskim priredbama\n\nobavija i druge poslove iz svog djelokruga i po odlukama Skup$Stine, predsjednika i Vijeca.\n\nElanak 88. (1) O svim ugovorima i isplatama u vrijednostima vecim od 6.636 EUR-a kao i o svim isplatama izvrSenim mimo usvojenog proracuna, glavni tajnik duzZan je izvijestiti Vijece na prvoj slijedecoj sjednici.\n\n(2) Za svoj rad i poslovanje glavni tajnik je odgovoran Vijecu i predsjedniku.\n\nVil. STRUCNA SLUZBA Elanak 89. (1) Za obavijanje poslova HOO", "-a osniva se Struéna sluzba.\n\n(2) Struéna sluzba HOO-a obavlja struéne, administrativne i tehni¢ke poslove, zadace iz podrucja sporta i medunarodnih sportskih odnosa i aktivnosti te izvrsava obveze utvrdene zakonima, propisima i odlukama HOO-a.\n\nElanak 90. Ustrojstvo i naéin rada Struéne sluzbe ureduje se opcim aktom kojeg donosi Vijece.\n\n€lanak 91. (1) Struéna sluzba HOO-a moze, osim poslova za potrebe HOO-a, obavijati odredene strucne i ostale poslove za druge subjekte na ugovornim osnovama.\n\n(2) Radom Struéne sluzbe rukovodi glavni tajnik, koji podnosi izvjes¢e o radu Stru¢ne sluzbe Vije¢u HOO-a po potrebi i /ili zahtjevu Vije¢a HOO-a.\n\nVill. HRVATSKA OLIMPUSKA AKADEMUJA\n\nClanak 92. Radi sustavnog poticanja i promicanja olimpizma, promidzbe olimpijskih na¢ela, fair playa i tolerancije, sudjelovanja u realizaciji programa Olimpijske solidarnosti te provedbe stru¢nog osposobljavanja i usavrSavanja osoba koje obavijaju stru¢ne poslove u sportu, a sukladno Olimpijskoj povelji, posebnim ", "aktom SkupStine HOO-a osniva se Hrvatska olimpijska akademija.\n\n41\n\nIX. HRVATSKI FAIR PLAY ODBOR\n\nElanak 93. (1) Hrvatski fair play odbor je nezavisno tijelo koje djeluje pri Hrvatskom olimpijskom odboru, Ciji Clanovi su predstavnici osnivata HOO-a i Hrvatskog zbora sportskih novinara.\n\n(2) Hrvatski fair play odbor promovira i razvija fair play u sportu i svakodnevnom Zivotu, potice afirmaciju op¢ih eti¢kih vrijednosti te poduzima aktivnosti za postupanje i ponaSanje svih sudionika u sportu na principima tolerancije i medusobnog postovanja, u skladu s pravilima i na€elima Olimpijske povelje, odredbama Statuta HOO-a, pravilima Medunarodnog fair play odbora i Europskog fair play pokreta.\n\nX. ZAKLADA HRVATSKIH SPORTASA\n\nClanak 94. (1) Zakladu hrvatskih sportaga, sa statusom samostalne pravne osobe, osnovao je HOO, u suradnji s Hrvatskim klubom olimpijaca i Sportskim novostima.\n\n(2) Zaklada hrvatskih sportaga je osnovana i djeluje radi ostvarivanja opéekorisne i dobrotvorne svrhe davanjem ", "novéane i druge potpore sportasima, a iznimno i trenerima kao i élanovima obitelji sportasa, koji su tijekom ili nakon svoje sportske karijere ostali bez moguénosti da viastitim sredstvima ostvare osnovne uvjete za egzistenciju, uvjete stanovanja, lijecenja, stvaranja mogucnosti za zapoiljavanje, pomoé u stvaranju uvjeta za Skolovanje __ ili osposobljavanje i sl.\n\nXi. SREDSTVA I FINANCIRANJE\n\nClanak 95. (1) Imovinu HOO-a gine novéana sredstva, nepokretne i pokretne stvari te druga imovinska prava.\n\n(2) Osnovu financiranja djelatnosti i programa HOO-a i Clanova HOO-a gine prihodi ostvareni viastitom djelatno&¢u, iz sredstava drzavnog proraéuna i drugih izvora u skladu sa zakonom (prihod od igara na sreéu itd. ).\n\n(3) Za izvrSavanje programskih zada¢a i aktivnosti élanova HOO-a od zajednickog interesa, koji su Zakonom o sportu oznaéeni kao javne potrebe sporta drZavne razine i o éijem je izvrSenju duZan skrbiti HOO, sredstva osigurava HOO.\n\n(4) HOO se za realizaciju programa HOO-a moze k", "ratkoroéno zaduZiti o €emu odluku donosi Vijece HOO-a, na razdoblje od najduze 12 mjeseci u sluéajevima kada se tekuéim priljevima sredstava ne mogu pokriti dospjele obveze, a do visine utvrdene financijskim planom HOO-a, dok odluku o dugoroénom zaduzenju HOO-a donosi Skupstina HOO-a sukladno propisima. Ugovor o kratkoroénom odnosno dugoroénom zaduZenju temeljem navedenih odiuka\n\n42\n\nzakljuéuje glavni tajnik HOO-a ili druga osoba ovlastena za zastupanje HOO-a, odnosno osoba koju osoba ovlastena za zastupanje HOO-a za to ovlasti temeljem posebnog akta, a do visine utvrdene financijskim planom HOO-a.\n\nElanak 96. Za ostvarivanje programskih zadaca iz ¢lanka 21. stavka 1. alineje 4. ovog Statuta HOO osigurava élanovima HOO-a sredstva na temelju akta o kriterijima i mjerilima programiranja i financiranja javnih potreba sporta drzavne razine u nadleZnosti HOO-a, i to za:\n\nsluzbene nastupe i kvalifikacijska natjecanja, zavrsne pripreme reprezentativnih selekcija i pojedinaca za olimpijske igr", "e, svjetska i europska prvenstva i kupove, mediteranske igre, medunarodna natjecanja mladezi, sluzbene medudrzavne susrete, drzavna prvenstva te ostale sportske priredbe i manifestacije od zajednickog ili opceg interesa\n\nzdravstvenu zastitu, dopingku kontrolu, dopunsku prehranu (vitaminizaciju) te osiguranje, testiranje i opremanje sportasa\n\npermanentnu skrb o posebno talentiranim mladim sportasima i olimpijskim kandidatima, kao i o trenerima korisnicima razvojnih programa HOO\n\na\n\npodmirivanje troskova élanarina i kotizacija medunarodnim sportskim asocijacijama, sudjelovanja u radu tijela matiénih medunarodnih federacija i dijela troSkova poslovanja.\n\nElanak 97. (1) Proraéunska sredstva i ostala sredstva ostvarena u skladu sa zakonom su namjenska i mogu se samo tako koristiti.\n\n(2) Sredstva ostvarena na olimpijskom programu i od olimpijske solidarnosti koriste se namjenski prema vaZecim propisima MOO-a i HOO-a.\n\n(3) Sredstvima koja HOO ostvari vlastitom djelatnoS¢u, raspolaze HOO i kor", "isti ih za unapredenje djelatnosti HOO-a i njegovih élanova, primjenom vazecih akata i odluka SkupStine i Vijeca.\n\n(4) Vlastita sredstva HOO-a se sukladno usvojenom financijskom planu od strane nadleznog tijela mogu dodijeliti i za druge pravne osobe koje provode programe koji su od znacaja za hrvatski sport i provedbu zadaéa HOO-a (pravne osobe osnovane od strane HOO-a i druge prvane osobe).\n\nElanak 98. (1) Raspored planiranih sredstava za ostvarivanje programskih aktivnosti HOO-a vrsi se godisnjim programom i financijskim planom HOO-a, na temelju akta o kriterijima i mjerilima programiranja i financiranja sporta drzavne razine.\n\n(2) Izmjene i dopune financijskog plana obvezno se provode u slucaju zna¢ajnih odstupanja nastalih prihoda i rashoda u odnosu na planirane, a posebice u sluéaju nastanka novih obveza\n\n43\n\nza koje sredstva nisu osigurana, odnosno smanjenja prihoda, a Vijeée HOO-a je nadlezno utvrditi Sto se smatra znagajnim odstupanjem nastalih prihoda i rashoda u odnosu na pl", "anirane, sukladno posebnom opcem aktu, sukladno odredbama élanka 70. stavci 9., 10. § 11. Zakona o sportu.\n\n(3) Naredbodavac za izvrSenje programa i financijskog plana je glavni tajnik.\n\n(4) Glavni tajnik duZan je na svakoj redovnoj sjednici Skupstine podnijeti izvijesée o ostvarivanju financijskog plana.\n\n(5) Glavni tajnik takoder je duzan na svakoj sjednici izvjeStavati Vijece HOO-a o financijskom poslovanju HOO-a.\n\n(6) Godisnji_ financijski izvjeStaj HOO-a, usvaja Skup$tina i predaje se Ministarstvu financija, odnosno drugoj instituciji koju Ministarstvo financija ovlasti za zaprimanje i obradu financijskih izvjestaja, a javno se objavijuje putem Registra neprofitnih organizacija i na sluzbenoj mreznoj stranici HOO-a.\n\n(7) Nad godignjim financijskim izvjeStajem HOO-a provodi se revizija sukladno propisima, a revizorsko izvjesée o obavljenoj reviziji godisnjeg financijskog izvjeStaja se podnosi Skupétini HOO-a.\n\nXI. = KONTROLA POSLOVANJA\n\nElanak 99. Nad godisnjim financijskim izvjesc", "em i poslovanjem HOO-a obavezno se provodi (vanjska) revizija.\n\nClanak 100. (1) U Struénoj sluzni osniva se i djeluje posebna sluzba unutarnje revizije, koja djeluje prema uputama Nadzornog odbora.\n\n(2) Unutarnja revizija HOO-a obavijat ce unutarnje revizije u skladu s medunarodnim revizijskim standardima za unutarnju reviziju kao i propisima i smernicama koje ureduju unutarnju reviziju za javni sektor u Republici Hrvatskoj. Unutarnja revizija obavija se u HOO-u, te kod pravnih i fiziékih osoba kojima je HOO namjenski doznacio sredstva, u dijelu tih namjenski doznaéenih sredstava.\n\nXH. NACIN RJESAVANJA SPOROVA, SUKOBA INTERESA | NESPOJIVOST ODREDENIH POSLOVA | FUNKCHA\n\nClanak 101. Kada postoji spor izmedu HOO-a i njegovih Clanova, kao i spor na nacionalnoj razini koji nastane iz ili u vezi s primjenom ovog Statuta i opcih akata HOO-a, koji nije moguce rijesiti sporazumno, odnosno koji nije moguce rijegiti na naéin utvrden odredbama ovog Statuta, rjeSavanje spora se povjerava Komisiji z", "a rjeSavanje disciptinskih pitanja i prijepora izmedu HOO-a i €lanica. 44\n\n€lanak 102.\n\nSukladno odredbama Zakona o sportu, Zakona o javnoj nabavi te drugim pripadajucim propisima, a u odnosu na nadleZnosti tijela HOO-a utvrduje se zastita opceg interesa hrvatskog sporta, sportaSa i HOO-a u odnosu na_ pojedinatne interese pojedinaca, Clanova HOO-a i élanova tijela HOO-a, te se sukladno odredbama ovog Statuta utvrduje da su Clanovi tijela HOO- a kao i Struéne sluzbe HOO-a duzne i odgovorne voditi brigu o postojanju eventualnog sukoba interesa u radu tijela HOO-a ili obnaSanja odredene duznosti u HOO-u, kao i poduzeti odgovarajuce radnje i postupke za njihovo sprjecavanje i otklanjenje. O postojanju sukoba interesa u HOO-u odluku donosi Vijece HOO-a.\n\nXIV. JAVNOST RADA\n\n€lanak 103.\n\n(1) Rad HOO\n\n\n\na je javan.\n\n(2) Javnost rada ostvaruje se:\n\npravodobnim dostavijanjem materijala za raspravu ¢lanovima tijela HOO\n\na i drugim pozvanim osobama koji se na njih mogu odnositi\n\nobavjestavanjem sr", "edstava javnog informiranja o odrzavanju sjednica\n\nobavjeStavanjem javnosti o radu i poslovanju HOO\n\na putem sredstava informiranja i na tiskovnim konferencijama\n\nobjavom Statuta, opcih akata HOO\n\na te informacija na mreZnim stranicama HOO\n\na\n\nna druge prigodne nacine.\n\n(3) Iznimno, kada to zahtijeva sadrzaj dnevnog reda, sjednice Vijeca mogu biti zatvorene za javnost.\n\nGlanak 104. _ briSe se\n\nXV. NAGRADE I PRIZNANJA\n\nElanak 105. (1) Nagrada Hrvatskog olimpijskog odbora Matija Ljubek (dalje u tekstu: Nagrada HOO-a Matija Ljubek) najvige je drustveno sportsko priznanje koje se dodjeljuje svake godine, u znak priznanja i €asti za osobit doprinos razvoju sporta u Republici Hrvatskoj, kao nagrada za Zivotno djelo, najzasluZnijim pojedincima te udrugama za dugogodisnje djelovanje u sportu.\n\n45\n\n(2) Poslovnikom o dodjeli Nagrade HOO-a Matija Ljubek ureduje se postupak raspisivanja natjecaja za dodjelu Nagrade HOO, uvjeti i nacin predlaganja kandidata te rad Zirija.\n\nClanak 106. (1) HOO za sv", "aku godinu proglaSava najuspjeSnije sportage, odnosno izabire i proglasava najuspjesnije pojedince i ekipe, zene i muSkarce, a za izuzetan doprinos promicanju Hrvatske u svijetu pojedinca-muSkarca ili Zenu, ili ekipu, sportasa i sportagicu navjeéa nada hrvatskog sporta, te najuspjeSnijeg trenera.\n\n(2) Pravilnikom o izboru i proglaSenju najuspjeSnijih hrvatskih sportaSa i trenera ureduju se na¢cin i postupak sluZbenog izbora i proglaSenja najuspjesnijih hrvatskih sportaga za postignute najvece sportske dosege i izuzetan doprinos promicanju Hrvatske u svijetu u tijeku jedne godine.\n\nClanak 107. (1) Nagrada ,,Drazen Petrovié“ Je nagrada koja se dodjeljuje najuspjesnijem sportagu i sportasici, ekipi mladih dobnih kategorija, sportskom paru, Stafeti ili posadi te sportasu i sportagici najvecoj nadi hrvatskog sporta, primjenom kriterija najvrednijih plasmana postignutih tijekom nekoliko prethodnih godina u sportskoj karijeri sportaga, sportagica odnosno ekipa mladih dobnih kategorija na sluz", "benim medunarodnim sportskim natjecanjima.\n\n(2) Pravilnikom o izboru i proglaSenju najuspjeSnijih sportaga mladih dobnih kategorija - Nagrada ,,Drazen Petrovié” ureduje se postupak, uvjeti i nacin predlaganja kandidata, te izbor i postupanje Odbora za izbor i proglagenje najuspjeSnijih sportasa mladih dobnih kategorija,..\n\nClanak 108. HOO moze ustanoviti i druge nagrade i priznanja Sto se ureduje posebnim aktom koji donosi\n\nVijece.\n\nXVI. PRESTANAK\n\nClanak 109. (1) HOO prestaje s radom kada se ispune zakonom propisane pretpostavke ili ako to odludi SkupStina dvotrecinskom vecinom glasova svih élanova Skuptine s pravom glasa.\n\n(2) U sluéaju prestanka s radom o imovini HOO-a odluéuje Skup$tina sukladno zakonu.\n\n(3) Ako SkupStina ne donese odluku iz prethodnog stavka, u sluéaju prestanka rada HOO-a, imovina HOO-a prelazi u vlasnigtvo sportske udruge koja ¢e nastaviti djelatnost nacionalnog olimpijskog odbora na podrugju Republike Hrvatske.\n\n(4) Ukoliko sportska udruga iz prethodnog stavka ", "neée postojati, imovinu HOO-a pruzet ée Republika Hrvatska. Ako je HOO primio financijska sredstva iz proraéuna ili iz drugih javnih\n\n46\n\nizvora, u sluéaju prestanka postojanja, ostatak sredstava vratit ¢e se u proracun iz kojeg su financijska sredstva dodijeljena.\n\nLikvidator\n\n€lanak 110. (1) Likvidator je fiziéka osoba koju bira i opoziva Skupstina HOO-a u skladu s odredbama ovog Statuta.\n\n(2) SkupStina HOO-a moze odluéiti da likvidator HOO-a bude i pravna osoba. (3) Osobu koja se bira za likvidatora HOO-a, predlaze predsjednik HOO-a, uvaZavajuci potrebnu struénost i iskustvo te osobe, s obzirom na nadleZnosti likvidatora, a koja ne smije imati zapreke\n\niz élanka 19, stavci 2. i 3. Zakona o udrugama.\n\n(4) Pokretanjem postupka likvidacije HOO-a prestaju ovlastenja tijela i osoba ovlastenih za zastupanje HOO-a.\n\n(5) Likvidator zastupa HOO u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u Registar udruga kao osoba ovlaStena za zastupanje HOO-a do okonéanja postup", "ka\n\nlikvidacije i brisanja HOO\n\n\n\na iz Registra udruga.\n\n(6) Likvidator likvidaciju HOO-a provodi u skladu s odredbama Zakona o udrugama.\n\nXVII. ZAVRSNE ODREDBE\n\nClanak 111. (1) Promjene i dopune ovog Statuta vrse se na nacin i po postupku predvidenom za njihovo donoSenje.\n\n(2) Tumagéenje ovog Statuta daje SkupStina. (3) Svi opi akti HOO-a i njegovih élanova uskladit ée se s odredbama ovog Statuta u roku od\n\nSest mjeseci od dana stupanja Statuta na snagu.\n\n€lanak 112. (1) Statut HOO-a mora se podnijeti na odobrenje MOO-u, kao i naknadne promjene ili izmjene Statuta HOO-a, po proceduri koju propisuje Olimpijska povelja.\n\n(2) Ako postoji sumnja o znaéenju ili tumacenju Statuta, ili ako postoji proturjecénost izmedu ovog Statuta i Olimpijske povelje, mjerodavan je tekst Olimpijske povelje.\n\n47\n\nClanak 113. (1) Statut stupa na snagu danom donoSenja, a primjenjuje se danom upisa u Registar udruga Republike Hrvatske, osim odredbe iz élanka 59, alineja druga, koja se slijfedom preporuka Medun", "arodnog olimpijskog odbora stavija u Statut s primjenom od slijedeci izbora u HOO-u (2024).\n\n(2) Danom stupanja na snagu ovog Statuta Hrvatskog olimpijskog odbora - protixéeni tekst, prestaje vaziti Statut HOO-a — proéigéeni tekst broj: 268/23 od 3.3.2023.\n\nGlavni tajnik \\\n\n| Hrvatskog olimpijskog odbora\n\nHrvatskog olimpijskog odbora\n\nmr.sc. Siniga Krajaé dr.sc. Zlatko Matega\n\nMhd\n\nKlasa; 030\n\n\n\n08/24\n\n\n\n01/3\n\nUr. Broj; 442\n\n\n\n01\n\n\n\n05\n\n\n\n24\n\n\n\n2\n\n48"]