"[\"Na temeljem \\u010dlanka 13. Zakona o udrugama (Narodne novine 74/14, 70/17., 98/19. i 151/22, \\u010dlanka 37. Zakona o sportu (Narodne novine 141/22), Skup\\u0161tina Hrvatskog judo saveza, na sjednici odr\\u017eanoj dana, 20. prosinca 2023. godine donosi # STATUT HRVATSKOG JUDO SAVEZA #### I. OP\\u0106E ODREDBE #### \\u010clanak 1. Ovim Statutom utvr\\u0111uju se odredbe o nazivu, sjedi\\u0161tu, o zastupanju, izgledu pe\\u010data, o ciljevima i podru\\u010dju djelovanja Hrvatskog judo saveza, (u daljnjem tekstu: Savez) sukladno ciljevima, djelatnostima kojima se osiguravaju ciljevi, kao i gospodarske djelatnosti koje se obavljaju sukladno zakonu, na\\u010din osiguranja javnosti rada, \\u010dlanstvo Saveza, tijela Saveza, djelokrug i na\\u010din rada, a u svrhu ostvarivanja potreba i interesa judo sporta, kao i na\\u010din predstavljanja Republike Hrvatske u pripadaju\\u0107em me\\u0111unarodnom sportskom udru\\u017eenju, prestanku postojanja Saveza, o imovini, na\\u010dinu stjecanja i raspolaganju imovinom, o postupku s imovinom u slu\\u010daju prestanka postojanja Saveza te drugim pitanjima va\\u017enim za Savez. Savez je jedini nacionalni sportski savez koji poti\\u010de i promi\\u010de judo i vrijednosti judo sporta u Republici Hrvatskoj. Savez je osnovan 12. o\\u017eujka 1961. godine u Zagrebu pod nazivom Judo savez Hrvatske. Izraze koji se koriste u ovom statutu, a imaju rodno zna\\u010denje, odnose se jednako na \\u017eenski i mu\\u0161ki rod. #### \\u010clanak 2. Naziv Saveza je: HRVATSKI JUDO SAVEZ. Skra\\u0107eni naziv Saveza je: HJS. Pored naziva na hrvatskom jeziku, Savez \\u0107e u me\\u0111unarodnim odnosima koristiti naziv na engleskom jeziku: CROATIAN JUDO FEDERATION. Pored skra\\u0107enog naziva na hrvatskom jeziku, Savez \\u0107e u me\\u0111unarodnim odnosima koristiti skra\\u0107eni naziv na engleskom jeziku: CRO JUDO. #### \\u010clanak 3. Savez djeluje na teritoriju Republike Hrvatske. Sjedi\\u0161te Saveza je u gradu Zagrebu. Odluku o adresi Saveza kao i promjeni adrese Saveza, ure\\u0111uje se Odlukom koju donosi Upravni odbor Saveza. #### \\u010clanak 4. Savez je neprofitna pravna osoba, upisana u Registar udruga Republike Hrvatske pri nadle\\u017enom gradskom uredu Grada Zagreba, Registar neprofitnih organizacija pri Ministarstvu financija Republike Hrvatske i Evidenciju pravnih osoba u sportu. ## \\u010clanak 5. Savez je samostalan u ostvarivanju svojih ciljeva utvr\\u0111enih ovim Statutom, a za svoje obveze odgovara cijelom svojom imovinom u skladu sa zakonom. Savez se ustrojava i djeluje sukladno odredbama Zakona o sportu i Zakona o udrugama. #### \\u010clanak 6. Savez predstavljaju i zastupaju predsjednik Saveza i glavni tajnik Saveza. Iznimno, Upravni odbor Saveza na prijedlog predsjednika Saveza mo\\u017ee i druge osobe ovlastiti za zastupanje. #### \\u010clanak 7. Savez ima pe\\u010dat. Uporaba, izgled i \\u010duvanje pe\\u010data ure\\u0111uju se odlukom koju donosi Upravni odbor Saveza. #### \\u010clanak 8. Savez ima znak i zastavu. Opis znaka i zastave Saveza te uporaba i za\\u0161tita, ure\\u0111uju se odlukom koju donosi Upravni odbor Saveza. #### \\u010clanak 9. Savez je osniva\\u010d i punopravni \\u010dlan Hrvatskog olimpijskog odbora (HOO). Savez je \\u010dlan Me\\u0111unarodne judo federacije (IJF) i Europske judo unije (EJU). Savez se mo\\u017ee u\\u010dlaniti ili udru\\u017eiti i u druge doma\\u0107e i me\\u0111unarodne organizacije i udruge kad je to od interesa za judo sport, a nije u suprotnosti s drugim zakonskim propisima kao i propisima me\\u0111unarodnih organizacija kojih je \\u010dlan. #### \\u010clanak 10. U Savezu nije dozvoljen niti jedan vid diskriminacije (klupski, rasni,\", \"mo\\u017ee u\\u010dlaniti ili udru\\u017eiti i u druge doma\\u0107e i me\\u0111unarodne organizacije i udruge kad je to od interesa za judo sport, a nije u suprotnosti s drugim zakonskim propisima kao i propisima me\\u0111unarodnih organizacija kojih je \\u010dlan. #### \\u010clanak 10. U Savezu nije dozvoljen niti jedan vid diskriminacije (klupski, rasni, nacionalni, etni\\u010dki, spolni, vjerski, politi\\u010dki i drugi), te sprje\\u010davanje sloboda i prava \\u010dovjeka i gra\\u0111anina. ## II. CILIEVI, PODRU\\u010cJE DJELOVANJE SUKLADNO CILIEVIMA I DJELATNOST SAVEZA Svojim djelovanjem Savez ima za cilj brigu i ostvarenje programa javnih potreba u judo sportu, stvaranje i provedbu pozitivne politike promicanja i razvoja judo sporta u Republici Hrvatskoj i inozemstvu, sukladno Zakonu, te ostalim propisima i zakonima Republike Hrvatske. #### 1. CILIEVI SAVEZA ## \\u010clanak 11. ## Ciljevi Saveza su: - razvitak i promicanje judo kao sporta i juda kao edukativne i inkluzivne metode, - stvaranje uvjeta za postizanje vrhunskih dometa u judo sportu, - \\u0161irenje aktivnosti judo sporta osobito djece i mlade\\u017ei, - razvijanje i promicanje me\\u0111usobne suradnje udru\\u017eenih \\u010dlanica Saveza, - promicanje i ostvarivanje nacionalne i me\\u0111unarodnih sportskih veza i suradnje, - ostvarivanje uvjeta za edukaciju sporta\\u0161a, trenera i sudaca, - sudjelovanje u borbi protiv dopinga, kori\\u0161tenja supstanci i zabranjenih postupaka u judo sportu, a u skladu sa svjetskim kodeksom protiv dopinga, - promicanje odgojnih zada\\u0107a u judo sportu u duhu fair-play-a, razumijevanja, tolerancije i odgovornosti kroz bavljenje judom, sprje\\u010davanje svih oblika nasilja u sportu pogotovo prema djeci i mladima, - promicanje olimpijskih ideala. #### 2. DJELATNOST SAVEZA #### \\u010clanak 12. Savez u ispunjavanju navedenih ciljeva svojim djelovanjem: - sudjeluje, provodi i utvr\\u0111uje politiku razvoja judo sporta u Republici Hrvatskoj, - poti\\u010de i promi\\u010de judo sporta u skladu s aktima strate\\u0161kog planiranja razvoja sporta na nacionalnoj razini, odnosno nacionalnom strategijom razvoja sporta i nacionalnim planom razvoja sporta, - utvr\\u0111uje sustava, uvjete i organizaciju sportskih natjecanja u judu, u skladu s na\\u010delima i elementima sustava koje je op\\u0107im aktom utvrdio Hrvatski olimpijski odbor, a prema pravilima sporta i normama me\\u0111unarodnih sportskih udru\\u017eenja, - predstavlja judo sport pred sportskim i dr\\u017eavnim tijelima Republike Hrvatske, te odgovaraju\\u0107im me\\u0111unarodnim sportskim udru\\u017eenjima. - sura\\u0111uje s odgovaraju\\u0107im krovnim me\\u0111unarodnim udru\\u017eenjima, - sura\\u0111uje s Hrvatskim paraolimpijskim odborom, Hrvatskim savezom slijepih i slabovidnih, Hrvatskim \\u0161kolskim sportskim savezom i Hrvatskim akademskim sportskim savezom. - sudjeluje u provedbi programa javnih potreba sporta u Republici Hrvatskoj i u provedbi nacionalnog programa sporta, - sudjeluje u pripremanju godi\\u0161njih i vi\\u0161egodi\\u0161njih planova i programa razvoja judo sporta na podru\\u010dju Republike Hrvatske, - nadgleda ukupnu djelatnost u judo sportu, - organizira nacionalna judo prvenstava, neposredno ili preko svojih \\u010dlanica, te me\\u0111unarodna natjecanja i priredbi, - utvr\\u0111uje i provodi sustav, uvjete i organizaciju judo natjecanja u Republici Hrvatskoj, - organizira nastupanje hrvatske judo reprezentacije na odgovaraju\\u0107im me\\u0111unarodnim natjecanjima, - promi\\u010de i provodi nacionalne projekte vezane uz odgoj i obrazovanje djece i mladih, temeljene na principima i vrijednostima juda kao olimpijskog sporta, te poti\\u010de i druge posebne projekte u cilju borbe protiv ovisnosti, smanjenja nasilja i promicanja zdravog na\\u010dina \\u017eivota, - uskla\\u0111ivanje aktivnosti svojih \\u010dlanica i pru\\u017eanje stru\\u010dnu pomo\\u0107\", \"- promi\\u010de i provodi nacionalne projekte vezane uz odgoj i obrazovanje djece i mladih, temeljene na principima i vrijednostima juda kao olimpijskog sporta, te poti\\u010de i druge posebne projekte u cilju borbe protiv ovisnosti, smanjenja nasilja i promicanja zdravog na\\u010dina \\u017eivota, - uskla\\u0111ivanje aktivnosti svojih \\u010dlanica i pru\\u017eanje stru\\u010dnu pomo\\u0107 u radu, - utvr\\u0111uje djelovanje na pitanjima koja se odnose na registraciju, status i stegovnu odgovornost sporta\\u0161a i drugih sportskih djelatnika i stru\\u010dnih osoba u judo sportu, - djeluje na unapre\\u0111ivanju i skrbi zdravstvene za\\u0161tite sporta\\u0161a, - brine za odr\\u017eivi razvoj judo sporta, - skrb o sportsko rekreativnim aktivnostima u judo sportu - sudjeluje u prikupljanju i a\\u017euriranju informacija za Nacionalni informacijski sustav u sportu, - na tra\\u017eenje tijela dr\\u017eavne uprave nadle\\u017enog za sport daje prethodno mi\\u0161ljenje o postojanju interesa za prijam u hrvatsko dr\\u017eavljanstvo fizi\\u010dke osobe u sustavu sporta koja je strani dr\\u017eavljanin, - djeluje na stvaranju materijalnih, kadrovskih i drugih uvjeta u smislu unaprje\\u0111enja i postizanja vrhunskih judo dostignu\\u0107a i rezultata, - \\u00b7 skrbi o vrhunskim sporta\\u0161ima i nacionalnim judo ekipama, - utvr\\u0111uje plan potreba stru\\u010dnih kadrova u judo sportu, organizira i provodi osposobljavanje stru\\u010dnih kadrova u judo sportu, - provodi stru\\u010dno usavr\\u0161avanje i licenciranje stru\\u010dnih kadrova, - vodi stru\\u010dne i administrativne poslova vezano uz osobe koje obavljaju stru\\u010dne poslove u judo sportu, - organizira i provodi promid\\u017ebenu, izdava\\u010dku i informativnu djelatnost u judo sportu, po potrebi izdaje stru\\u010dne knjige, \\u010dasopise i publikacije, te skuplja dokumentaciju i povijesne podatke vezane za judo sport, - prati aktualna pitanja financiranja judo sporta, te nadle\\u017enim tijelima predla\\u017ee poduzimanje odre\\u0111enih mjera, - prati, razmatra i predla\\u017ee politiku kori\\u0161tenja, odr\\u017eavanja i izgradnje objekata za judo sport, - organizira vo\\u0111enje i upravljanje objektima koji su mu povjereni ili ih ima u vlasni\\u0161tvu, - u znak priznanja za razvoj, promicanje i uspjeh u judo sportu daje priznanja, pohvale i nagrade, - sudjeluje u borbi protiv dopinga, kori\\u0161tenja supstanci i zabranjenih postupaka u judo sportu, a u skladu sa svjetskim kodeksom protiv dopinga, uklju\\u010duju\\u0107i i po\\u0161tivanje pravila nacionalnog tijela nadle\\u017enog za borbu protiv dopinga, a osobito vezano uz provedbu testiranja, - poti\\u010de provedbu eti\\u010dkih i moralnih na\\u010dela, po\\u0161tivanje ljudskog dostojanstva, fair playa, tolerancije, za\\u0161tite djece u sportu, nenasilja i kulture sporta, - poduzima mjera protiv svih oblika diskriminacije i nasilja u sportu, - zala\\u017ee se za ravnopravnost spolova u sportu, - obavlja i druge poslove koji su mu povjereni sukladno Zakonu o sportu, Zakonu o udrugama i ostalim propisima Republike Hrvatske. #### \\u010clanak 13. Savez ima javnu ovlast za dono\\u0161enje op\\u0107ih akata, kojima se ure\\u0111uje: - sustav judo natjecanja i to najmanje jednu godinu prije po\\u010detka primjene tog sustava, - materijalni, tehni\\u010dki i stru\\u010dni uvjeti za u\\u010dlanjenje judo udruga u \\u010dlanstvo Saveza, - na\\u010din licenciranja stru\\u010dnih kadrova u judo sportu sukladno Zakonu o sportu, - na\\u010din registracije sporta\\u0161a, - prava i obveze sporta\\u0161a, trenera, sudaca i \\u010dlanica Saveza, - pravo nastupa stranih sporta\\u0161a za sportske klubove u judo sportu u Republici Hrvatskoj, - stegovna odgovornost osoba u sustavu judo sporta, - druga pitanja iz nadle\\u017enosti Saveza\", \"kadrova u judo sportu sukladno Zakonu o sportu, - na\\u010din registracije sporta\\u0161a, - prava i obveze sporta\\u0161a, trenera, sudaca i \\u010dlanica Saveza, - pravo nastupa stranih sporta\\u0161a za sportske klubove u judo sportu u Republici Hrvatskoj, - stegovna odgovornost osoba u sustavu judo sporta, - druga pitanja iz nadle\\u017enosti Saveza sukladno Zakonu o sportu te pravilima svjetskog i europskog saveza judo sporta. #### \\u010clanak 14. Radi uspje\\u0161nog izvr\\u0161avanja djelatnosti utvr\\u0111enih u ovom Statutu, Savez sura\\u0111uje sa nadle\\u017enim tijelima dr\\u017eavne vlasti i drugim odgojno-obrazovnim i stru\\u010dnim ustanovama te drugim fizi\\u010dkim i pravnim osobama. Savez mo\\u017ee obavljati i druge djelatnosti, osim djelatnosti iz oblasti judo sporta, sukladno propisima kojima je to ure\\u0111eno. Savez, kao pravna osoba koja djeluju u sustavu sporta, du\\u017ean je poduzimati mjere za\\u0161tite djece u sportu, u svojim programima i postupanju kao i u djelovanju i postupanju \\u010dlanica Saveza, te o svakom kr\\u0161enju prava djece, posebice svim oblicima nasilja nad djecom, spolne zloporabe, zanemarivanja ili nehajnog postupanja, zlostavljanja ili izrabljivanja djece u sportu mora obavijestiti policiju, nadle\\u017eno tijelo za socijalnu skrb odnosno druga nadle\\u017ena tijela. #### 3. GOSPODARSKA DJELATNOST SAVEZA #### \\u010clanak 15. Savez mo\\u017ee radi obavljanja gospodarskih djelatnosti osnovati trgova\\u010dko dru\\u0161tvo, zadrugu, druge gospodarske subjekte, a uzajamne odnose urediti ugovorom. Savez gospodarske djelatnost mo\\u017ee obavljati pored djelatnosti kojima se ostvaruju njegovi ciljevi utvr\\u0111eni statutom, ali ih ne mo\\u017ee obavljati radi stjecanja dobiti za svoje \\u010dlanove ili tre\\u0107e osobe. Ako u obavljanju gospodarskih djelatnosti Savez ostvari vi\\u0161ak prihoda nad rashodima, on se mo\\u017ee upotrijebiti isklju\\u010divo za ostvarenje ciljeva Saveza utvr\\u0111enih Statutom. ## III. \\u010cLANSTVO, USTROJ I DJELOVANJE SAVEZA #### \\u010clanak 16. Za primitak u \\u010dlanstvo Saveza potrebno je ispunjavati sljede\\u0107e uvjete: da je svrha njegova osnivanja i djelovanja razvoj i unapre\\u0111enje, \\u0161irenje i promicanje judo sporta na podru\\u010dju njegova djelovanja prema na\\u010delima juda i olimpizma, - da je osnovan sukladno Zakonu, te uredno registriran kod nadle\\u017enog tijela dr\\u017eavne uprave i ostalim registrima sukladno Zakonu i Statutu. - da ima pravo kori\\u0161tenja ili je vlasnik sportskog objekta koji udovoljava propisima judo sporta, koji udovoljava uvjetima za sigurnost i zdravlje sporta\\u0161a i drugih osoba za bavljenje judo sportom, - da ima ugovorene odnose s osobom koja ima propisanu stru\\u010dnu spremu, odnosno koja je osposobljena za obavljanje stru\\u010dnih poslova u judo sportu u skladu sa Zakonom o sportu, - da prihva\\u0107a Statut i druge op\\u0107e akte Saveza, Statut i pravila Hrvatskog olimpijskog odbora kao i pripadaju\\u0107ih me\\u0111unarodnih sportskih udru\\u017eenja, - na\\u010dela i pravila Olimpijske povelje, Eti\\u010dkog i Medicinskog kodeksa, te Svjetskog kodeksa protiv dopinga (WADA). ## \\u010clanak 17. \\u010clanice Saveza sukladno odredbama ovog Statuta su judo klubovi, \\u017eupanijski judo savezi, gradski judo savezi i Zagreba\\u010dki judo savez. \\u010clanice Saveza sukladno odredbama ovog Statuta mogu biti i strukovne sportske udruge u istome sportu, udruge sportskih klubova istog sporta i ranga natjecanja te udruge u koje se udru\\u017euju sporta\\u0161i i treneri istog sporta, sukladno odredbama ovog Statuta. ## \\u010clanak 18. \\u010clanstvo u savezu mo\\u017ee biti privremeno i punopravno. Izme\\u0111u dvije sjednice Skup\\u0161tine Saveza, odluku o prijemu u privremeno \\u010dlanstvo donosi Upravni odbor Saveza po\", \"udruge sportskih klubova istog sporta i ranga natjecanja te udruge u koje se udru\\u017euju sporta\\u0161i i treneri istog sporta, sukladno odredbama ovog Statuta. ## \\u010clanak 18. \\u010clanstvo u savezu mo\\u017ee biti privremeno i punopravno. Izme\\u0111u dvije sjednice Skup\\u0161tine Saveza, odluku o prijemu u privremeno \\u010dlanstvo donosi Upravni odbor Saveza po ispunjavanju uvjeta iz \\u010dlanka 20. ovog Statuta. Privremeni \\u010dlan Saveza ima sva prava i obaveze punopravnog \\u010dlana Saveza osim prava odlu\\u010divanja u tijelima saveza. Status punopravnih \\u010dlanica Saveza stje\\u010du se po dono\\u0161enju odluke Skup\\u0161tine o prijemu u \\u010dlanstvo. ## \\u010clanak 19. Zahtjevu za u\\u010dlanjenje potrebno je prilo\\u017eiti: - odluku skup\\u0161tine o udru\\u017eivanju u Savez, - presliku statuta kluba/saveza/udruge uskla\\u0111enim s ovim Statutom, - presliku rje\\u0161enja o upisu u Registar udruga Republike Hrvatske, - izvadak iz Evidencije pravnih osoba u sportu, - presliku rje\\u0161enja o upisu u registar neprofitnih organizacija pri Ministarstvu financija Republike Hrvatske, - presliku o obavijesti Dr\\u017eavnog zavoda za statistiku o razvrstavanju prema NKD-u, - broj bankovnog ra\\u010duna na obrascu banke, - popis (ime, prezime, OIB, datum i godina ro\\u0111enja) o klupskoj registraciji najmanje dvadeset (20) aktivnih \\u010dlanova, - podatke o osobama ovla\\u0161tenim za zastupanje (kontakt e-mail, mobitel), - potvrdu ili ugovor o pravu kori\\u0161tenja sportskog objekta, te udovoljava uvjetima za sigurnost i zdravlje sporta\\u0161a i drugih osoba za bavljenje judo sportom, - presliku ugovorenih odnosa s osobom koja ima propisanu stru\\u010dnu spremu odnosno koja je osposobljena za obavljanje stru\\u010dnih poslova u judo sportu u skladu sa Zakonom o sportu, - Izjava o prihva\\u0107anju Statuta Saveza i drugih op\\u0107ih akata Saveza, i pravila pripadaju\\u0107ih me\\u0111unarodnih sportskih udru\\u017eenja, na\\u010dela i pravila Olimpijske povelje, Eti\\u010dkog i Medicinskog kodeksa, te Svjetskog kodeksa protiv dopinga (WADA), - potvrdu o uplati godi\\u0161nje \\u010dlanarine Savezu. ## \\u010clanak 20. Savez vodi popis svojih \\u010dlanica. Glavni tajnik Saveza zadu\\u017een je za a\\u017euriranje evidencije \\u010dlanica, te objavi na mre\\u017enoj stranici Saveza. Popis \\u010dlanica vodi se elektroni\\u010dki, a za svaku \\u010dlanicu Saveza obvezno sadr\\u017ei: - naziv \\u010dlanice, - adresu \\u010dlanice, - \\u00b7 datum primitka i prestanka u \\u010dlanstvo, - kategoriju \\u010dlanstva, - kontakt telefon i elektronske adrese \\u010dlanice, - OIB \\u010dlanice. Popis \\u010dlanica Saveza dostupan je svim \\u010dlanicama i nadle\\u017enim tijelima, na njihov zahtjev. ## \\u010clanak 21. ## \\u010clanice imaju pravo: - imati svoje predstavnike u Skup\\u0161tini Saveza, - predlagati, birati i biti birani u tijela Saveza, - sudjelovati u radu stru\\u010dnih tijela Saveza, - sudjelovati na natjecanjima u organizaciji Saveza sukladno va\\u017ee\\u0107im op\\u0107im aktima Saveza, - sudjelovati na stru\\u010dnim seminarima, te\\u010dajevima i ostalim doga\\u0111anjima sukladno op\\u0107im aktima Saveza, - biti informirane o svim relevantnim zbivanjima u podru\\u010dju judo sporta dostupnim Savezu. #### Obveze \\u010dlanica su: - aktivno sudjelovati u realizaciji pojedinih dijelova godi\\u0161njeg plana rada Saveza prihva\\u0107aju\\u0107i du\\u017enosti organizatora pojedinih natjecanja i ostalih aktivnosti predvi\\u0111enih programom Saveza kao i op\\u0107im aktima, - aktivo sudjelovati sa \\u010dlanstvom na najmanje tri (3) natjecanja u teku\\u0107oj godini sukladno kalendaru Saveza (obaveza se odnosi na \\u010dlanice iz \\u010dlanka 18., stavak 1.), - sudjelovati na stru\\u010dnim seminarima, te\\u010dajevima i ostalim doga\\u0111anjima sukladno op\\u0107im aktima Saveza, - podnositi tra\\u017eena izvje\\u0161\\u0107a, - uredno pla\\u0107ati\", \"kao i op\\u0107im aktima, - aktivo sudjelovati sa \\u010dlanstvom na najmanje tri (3) natjecanja u teku\\u0107oj godini sukladno kalendaru Saveza (obaveza se odnosi na \\u010dlanice iz \\u010dlanka 18., stavak 1.), - sudjelovati na stru\\u010dnim seminarima, te\\u010dajevima i ostalim doga\\u0111anjima sukladno op\\u0107im aktima Saveza, - podnositi tra\\u017eena izvje\\u0161\\u0107a, - uredno pla\\u0107ati \\u010dlanarinu te podmirivati druge financijske obveze utvr\\u0111ene odlukama Upravnog odbora ili op\\u0107im aktima Saveza, - na zahtjev Saveza, obavezne su omogu\\u0107iti svojim \\u010dlanovima sudjelovanje u aktivnostima Saveza, - uskladiti svoj Statut i op\\u0107e akte s ovim Statutom i drugim op\\u0107im aktima Saveza, druge obveze koje odredi Upravni odbor ili Skup\\u0161tina Saveza. ## \\u010clanak 22. \\u010clanica Saveza, kao niti bilo tko drugi ne mo\\u017ee organizirati doma\\u0107a ili me\\u0111unarodna sportska natjecanja, priredbe i druge aktivnosti u judo sportu bez prethodne suglasnosti Saveza. Ukoliko \\u010dlanica ne bude izvr\\u0161avala svoje obveze pokrenut \\u0107e se stegovni postupak sukladno Pravilniku o stegovnoj odgovornosti Saveza. #### \\u010clanak 23. \\u010clanstvo u Savezu privremene i punopravne \\u010dlanice prestaje: - na vlastiti zahtjev uz obrazlo\\u017eenje, - ako se utvrdi da je \\u010dlan prestao djelovati sukladno Statutu, - ako nije odr\\u017eao skup\\u0161tinu najmanje dvije godine, - ako se broj \\u010dlanova smanji ispod broja odre\\u0111enog za primanje u \\u010dlanstvo, - ako \\u010dlan svojim djelovanjem znatno ote\\u017eava ostvarivanja ciljeva i djelatnosti Saveza, - prestankom postojanja \\u010dlana. Odluku o brisanju iz \\u010dlanstva za privremene \\u010dlanove donosi Upravni odbor Saveza, dok za punopravne \\u010dlanove donosi Skup\\u0161tina Saveza. Prestankom \\u010dlanstva ne prestaju financijske obveze koje je dotada\\u0161nji \\u010dlan imao prema Savezu, a koje su nastale do trenutka prestanka \\u010dlanstva. ## IV. USTROJ I UPRAVLJANJE U SAVEZU ## \\u010clanak 24. U Savezu djeluju sljede\\u0107a tijela: - Skup\\u0161tina Saveza, - Predsjednik Saveza, - Upravni odbor Saveza, - \\u00b7 Glavni tajnik Saveza, - Nadzorni odbor Saveza, - Stegovna komisija Saveza, - \\u00b7 Stalne i ad hoc komisije. Kod izbora \\u010dlanova tijela Saveza, potrebno je voditi brigu o: - stru\\u010dnoj osposobljenosti, znanjima i drugim kvalitetama osoba u odnosu na ciljeve i nadle\\u017enosti Skup\\u0161tine, Upravnog odbora, Nadzornog odbora, Stegovne komisije odnosno drugih tijela saveza, - nepostojanje prepreka sukladno Zakonu o sportu i Zakonu o udrugama kao i ovim Statutom, - po\\u0161tivanju slu\\u017ebene preporuke Me\\u0111unarodnog olimpijskog odbora o potrebi zastupljenosti odre\\u0111enog broja \\u017eena u sastavu tijela Saveza, odnosno osigurati zastupljenost do 40% osoba podzastupljenog spola. ## 4.1. Skup\\u0161tina Saveza ## \\u010clanak 25. Skup\\u0161tina Saveza je najvi\\u0161e tijelo upravljanja Savezom. ## Skup\\u0161tinu sa\\u010dinjavaju: - po jedan predstavnik \\u010dlanice Saveza, sukladno \\u010dlanku 17. ovog Statuta, a prema popisu \\u010dlanica Saveza, te ukoliko \\u010dlanice na dan odr\\u017eavanja izborne sjednice Skup\\u0161tine imaju urednu registraciju s va\\u017ee\\u0107im mandatima tijela upravljanja i zastupanja i podmire materijalne i/ili financijske, te druge obveze prema Savezu, - sedam (7) \\u010dlanova Upravnog odbora Saveza. ## 4.1.1. Predstavnici u Skup\\u0161tini Saveza ### \\u010clanak 26. Predstavnik u Skup\\u0161tini Saveza mo\\u017ee biti osoba: - koja je dr\\u017eavljanin Republike Hrvatske, - koja je navr\\u0161ila 18 godina i potpuno je poslovno sposobna, koja se nije ogrije\\u0161ila o eti\\u010dke norme i na\\u010dela olimpijskog pokreta, - koja prihva\\u0107a Statut Saveza, Statut Hrvatskog olimpijskog odbora, Statut i pravila pripadaju\\u0107eg me\\u0111unarodnog\", \"26. Predstavnik u Skup\\u0161tini Saveza mo\\u017ee biti osoba: - koja je dr\\u017eavljanin Republike Hrvatske, - koja je navr\\u0161ila 18 godina i potpuno je poslovno sposobna, koja se nije ogrije\\u0161ila o eti\\u010dke norme i na\\u010dela olimpijskog pokreta, - koja prihva\\u0107a Statut Saveza, Statut Hrvatskog olimpijskog odbora, Statut i pravila pripadaju\\u0107eg me\\u0111unarodnog sportskog udru\\u017eenja, na\\u010dela i pravila Olimpijske povelje, te Svjetskog kodeksa protiv dopinga (WADA), - koja nema zapreke iz \\u010dlanka 111. stavci 1. i 2. odnosno iz \\u010dlanka 114. Zakona o sportu. Predstavnici u Skup\\u0161tini Saveza za svoj rad odgovorni su Skup\\u0161tini i \\u010dlanici \\u010diji su predstavnici. Na Izbornoj sjednici Skup\\u0161tine \\u010clanovi Upravnog odbora ne mogu biti predstavnici u Skup\\u0161tini. ## 4.1.2. Nadle\\u017enosti Skup\\u0161tine ### \\u010clanak 27. Skup\\u0161tina obavlja slijede\\u0107e poslove: - utvr\\u0111uje strategiju razvoja judo sporta u Republici Hrvatskoj, u skladu s aktima strate\\u0161kog planiranja razvoja sporta na nacionalnoj razini, - bira predsjednika Saveza, dopredsjednika, \\u010dlanove Upravnog odbora, \\u010dlanove Nadzornog odbora i \\u010dlanove Stegovne komisije, te donosi odluku o njihovom razrje\\u0161enju, - bira radna tijela Skup\\u0161tine Saveza, - usvaja godi\\u0161nje i vi\\u0161egodi\\u0161njeg programe judo sporta dr\\u017eavne razine, odnosno programe rada Saveza, - usvaja financijski plan, - usvaja financijsko izvje\\u0161\\u0107e, - donosi Pravilnik o stegovnoj odgovornosti, - donosi odluku u prijem i prestanku punopravnog \\u010dlanstva u Savezu, - utvr\\u0111uje materijalne, tehni\\u010dke i stru\\u010dne uvjete za u\\u010dlanjenje sportskih klubova u \\u010dlanstvo Saveza, - donosi Statut Saveza, kao i njegove izmjene i dopune, te druge op\\u0107e akte za koje je ovim Statutom ili odlukom Skup\\u0161tine utvr\\u0111ena nadle\\u017enost Skup\\u0161tine odnosno koje pravilnike Upravni odbor Saveza predlo\\u017ei Skup\\u0161tini na dono\\u0161enje, - pravilnik o sustavu uvjetima i organizaciji natjecanja u judo sportu na prijedlog Upravnog odbora Saveza, - donosi odluku o udru\\u017eivanju u me\\u0111unarodne i nacionalne sportske organizacije koje djeluju u judo sportu ili su s njim povezane, - odlu\\u010duje o promjeni ciljeva i djelatnosti, gospodarskih djelatnosti, prestanku rada i raspodjeli preostale imovine Saveza u slu\\u010daju prestanka rada Saveza, - donosi odluku o imenovanju i razrje\\u0161enju po\\u010dasnih odnosno zaslu\\u017enih \\u010dlanova Saveza, - donosi odluku o prestanku rada Saveza, - obavlja i druge poslove i zada\\u0107e odre\\u0111ene zakonom, Statutom Hrvatskog olimpijskog odbora i ovim Statutom, te je nadle\\u017ena i za sva pitanja za koja eksplicitno nije utvr\\u0111ena statutarna nadle\\u017enost drugih tijela Saveza, kada se radi o pitanjima koja po svom zna\\u010daju upu\\u0107uju na nadle\\u017enost najvi\\u0161eg tijela upravljanja Savezom. ## 4.1.3. Sjednice Skup\\u0161tine #### \\u010clanak 28. Skup\\u0161tina Saveza odlu\\u010duje o pitanjima iz svoje nadle\\u017enosti na sjednicama. Sjednice Skup\\u0161tine saziva i predsjedava im predsjednik, a u slu\\u010daju njegove odsutnosti ili sprije\\u010denosti, dopredsjednik. Sjednicama Skup\\u0161tine predsjedava tro\\u010dlano radno predsjedni\\u0161tvo (predsjedavaju\\u0107i i dva \\u010dlana radnog predsjedni\\u0161tva), koje predla\\u017ee predsjednik ili dopredsjednik Saveza, a bira ih Skup\\u0161tina. Zapisnik sjednice Skup\\u0161tine vodi zapisni\\u010dar, a potpisuju ga predsjednik Saveza, dva (2) ovjerovitelja i zapisni\\u010dar. Zapisni\\u010dara i ovjerovitelje zapisnika bira Skup\\u0161tina. Utvr\\u0111ivanje pravovaljanosti mandata \\u010dlanova Skup\\u0161tine provodi Verifikacijska komisija u sastavu predsjednik i dva \\u010dlana Verifikacijske komisije, a bira ih Skup\\u0161tina. Za provo\\u0111enje izbora zadu\\u017eena je Izborna komisija u sastavu predsjednik i dva \\u010dlana Izborne komisije, \\u010dlanovi Verifikacijske komisije mogu biti i \\u010dlanovi Izborne komisije,\", \"Zapisni\\u010dara i ovjerovitelje zapisnika bira Skup\\u0161tina. Utvr\\u0111ivanje pravovaljanosti mandata \\u010dlanova Skup\\u0161tine provodi Verifikacijska komisija u sastavu predsjednik i dva \\u010dlana Verifikacijske komisije, a bira ih Skup\\u0161tina. Za provo\\u0111enje izbora zadu\\u017eena je Izborna komisija u sastavu predsjednik i dva \\u010dlana Izborne komisije, \\u010dlanovi Verifikacijske komisije mogu biti i \\u010dlanovi Izborne komisije, a bira ih Skup\\u0161tina. Prije utvr\\u0111ivanja dnevnog reda sjednice predsjednik Verifikacijske komisije konstatira na osnovu predanih evidencijskih listi\\u0107a, i izvje\\u0161\\u0107a Verifikacijske komisije, postojanje kvoruma, odnosno nazo\\u010dnosti vi\\u0161e od polovice ukupnog broja \\u010dlanova Skup\\u0161tine neophodnih za pravovaljano odlu\\u010divanje. Poslije usvajanja dnevnog reda prelazi se na raspravu o pojedinim to\\u010dkama redoslijedom koji je utvr\\u0111en. Na Skup\\u0161tini se o svakoj to\\u010dci dnevnog reda otvara rasprava prije nego \\u0161to se o njoj odlu\\u010duje. O pojedinom se pitanju raspravlja sve dok ima prijavljenih govornika, a potom predsjedavaju\\u0107i raspravu zaklju\\u010duje tekstom akta ili odluke koja se stavlja na glasovanje. Kad rasprava o nekim pitanjima traje du\\u017ee, predsjedavaju\\u0107i mo\\u017ee ograni\\u010diti trajanje izlaganja. Sjednice Skup\\u0161tine mogu biti redovne, elektroni\\u010dke, izvanredne, sve\\u010dane i izborne. Zahtjev za sazivanje sjednice Skup\\u0161tine, uz pisani zahtjev, mo\\u017ee podnijeti Upravni odbor, Nadzorni odbor ili najmanje 1/2 \\u010dlanica Saveza. Zahtjev mora sadr\\u017eavati prijedlog dnevnog reda i pisano obrazlo\\u017eenje s potpisima \\u010dlanova Upravnog ili Nadzornog odbora ili potpisima 1/2 \\u010dlanica Saveza. Ako predsjednik ne sazove sjednicu Skup\\u0161tine u roku od 30 dana od dana prijema zahtjeva za sazivanje sjednice Skup\\u0161tine Saveza postavljenog u skladu s odredbama ovog Statuta, predlagatelj mo\\u017ee sam sazvati tra\\u017eenu sjednicu Skup\\u0161tine u roku od 30 dana, po isteku roka od 30 dana. Sve\\u010dane sjednice Skup\\u0161tine mogu se sazvati povodom obilje\\u017eavanja odre\\u0111enog povijesnog datuma za Savez, odnosno iz druge potrebe iste prirode. Izborne sjednice Skup\\u0161tine odr\\u017eavaju se svake \\u010detiri (4) godine. Izbornim sjednicama Skup\\u0161tine predsjedava tro\\u010dlano radno predsjedni\\u0161tvo koje se bira izme\\u0111u \\u010dlanova Skup\\u0161tine. U slu\\u010daju isteka mandata tijelima Saveza, Skup\\u0161tinu Saveza saziva zadnja osoba za zastupanje upisana u Registar udruga ili najmanje 1/3 \\u010dlanica Saveza koje su upisane u popis \\u010dlanica Saveza prije isteka mandata tijelima Saveza. Izvanredna sjednica Skup\\u0161tine Saveza je skup\\u0161tina koja se saziva sukladno odredbama ovog \\u010dlanka, a odnosi se na sjednicu iz prethodnog stavka ovog \\u010dlanka. #### \\u010clanak 29. Poziv se objavljuje na mre\\u017enim stranicama Saveza najkasnije 10 dana prije odr\\u017eavanja sjednice Skup\\u0161tine. Poziv s predlo\\u017eenim dnevnim redom i materijalima, s oznakom dana, po\\u010detka i mjesta odr\\u017eavanja sjednice Skup\\u0161tine Saveza, \\u0161alju se \\u010dlanicama Saveza najkasnije 10 dana prije odr\\u017eavanja sjednice Skup\\u0161tine elektroni\\u010dkom po\\u0161tom. Rok za dostavu materijala mo\\u017ee biti i kra\\u0107i od 10 dana, a dio materijala se mo\\u017ee dostaviti i na samoj sjednici Skup\\u0161tine saveza. #### \\u010clanak 30. Skup\\u0161tina mo\\u017ee pravovaljano odlu\\u010divati ako je na sjednici nazo\\u010dna natpolovi\\u010dna ve\\u0107ina \\u010dlanova Skup\\u0161tine. U slu\\u010daju da u zakazano vrijeme po\\u010detka rada Skup\\u0161tine ne bude prisutna natpolovi\\u010dna ve\\u0107ina \\u010dlanova Skup\\u0161tine pri\\u010dekat \\u0107e se jedan sat, ukoliko i nakon toga sjednici Skup\\u0161tine ne prisustvuje natpolovi\\u010dna ve\\u0107ina \\u010dlanova Skup\\u0161tine, ista se ne\\u0107e odr\\u017eati. Odluke Skup\\u0161tine se donose javnim glasovanjem. Odluka Skup\\u0161tine je donesena ako za nju glasuje ve\\u0107ina nazo\\u010dnih \\u010dlanova na sjednici Skup\\u0161tine. O radu sjednice Skup\\u0161tine vodi se zapisnik, kojeg potpisuje\", \"pri\\u010dekat \\u0107e se jedan sat, ukoliko i nakon toga sjednici Skup\\u0161tine ne prisustvuje natpolovi\\u010dna ve\\u0107ina \\u010dlanova Skup\\u0161tine, ista se ne\\u0107e odr\\u017eati. Odluke Skup\\u0161tine se donose javnim glasovanjem. Odluka Skup\\u0161tine je donesena ako za nju glasuje ve\\u0107ina nazo\\u010dnih \\u010dlanova na sjednici Skup\\u0161tine. O radu sjednice Skup\\u0161tine vodi se zapisnik, kojeg potpisuje izabrani zapisni\\u010dar na sjednici Skup\\u0161tine saveza, te zapisnik ovjeravaju dva ovjerovitelja zapisnika, tako\\u0111er izabranih na sjednici Skup\\u0161tine Saveza, koji se trajno \\u010duva u arhivi Saveza. Zapisnik sa sjednice Skup\\u0161tine Saveza dostavlja se svim \\u010dlanicama Saveza u materijalima za sljede\\u0107u Skup\\u0161tinu, te podlije\\u017ee verifikaciji na slijede\\u0107oj sjednici Skup\\u0161tine saveza. ## \\u010clanak 31. Upravni odbor mo\\u017ee donijeti odluku glasovanjem \\u010dlanova Skup\\u0161tine bez neposrednog dolaska Banova Skup\\u0161tine na sjednicu, izja\\u0161njavanjem o prijedlogu odluka putem elektroni\\u010dka po\\u0161te ili video poziva, koji omogu\\u0107ava identifikaciju \\u010dlanova i evidenciju njihova prisustva te dvosmjernu komunikaciju. Za organizaciju navedene elektroni\\u010dke sjednice dostavlja se prijedlog odluka \\u010dlanovima Skup\\u0161tine s prijedlogom da se izjasne \\\"Za\\\", \\\"Protiv\\\" ili \\\"Suzdr\\u017ean\\\" o predlo\\u017eenoj odluci. Takve odluke zahtijevaju prihva\\u0107anje od strane ve\\u0107ine svih \\u010dlanova Skup\\u0161tine Saveza s pravom glasa. O elektroni\\u010dkoj sjednici sastaviti \\u0107e se, a zatim i verificirati, zapisnik na slijede\\u0107oj redovnoj sjednici Skup\\u0161tine Saveza. #### 4.1.4. Mandat Skup\\u0161tine ## \\u010clanak 32. Mandat Skup\\u0161tine Saveza traje \\u010detiri (4) godine, a po\\u010dinje te\\u0107i danom verifikacije mandata predstavnika \\u010dlanice za \\u010dlanove Skup\\u0161tine Saveza. lsta osoba mo\\u017ee biti ponovno izabrana u Skup\\u0161tinu za novo mandatno razdoblje. U slu\\u010daju sprije\\u010denosti predstavnika \\u010dlanice u Skup\\u0161tini Saveza, \\u010dlanica Saveza vr\\u0161i izbor zamjenskog predstavnika \\u010dlanice za sjednicu Skup\\u0161tine Saveza. Predstavnik u Skup\\u0161tini Saveza ima pravo na samo jedan glas kao \\u010dlan Skup\\u0161tine Saveza. #### \\u010clanak 33. Zamjenskom predstavniku \\u010dlanice na sjednici Skup\\u0161tine Saveza, oduzet \\u0107e se pravo glasa u slu\\u010daju da \\u010dlanica Saveza nema urednu registraciju o va\\u017ee\\u0107im mandatima tijela upravljanja i zastupanja. Canica Saveza du\\u017ena je do po\\u010detka sjednice Skup\\u0161tine dostaviti Savezu dokaz, odnosno kopiju re\\u0161enja ili izvod iz Registra udruga Republike Hrvatske iz kojeg je mogu\\u0107e utvrditi urednu registraciju sva\\u017ee\\u0107im mandatima tijela upravljanja i zastupanja te \\u010dlanice. ## \\u010clanak 34. \\u010canovi Skup\\u0161tine sudjeluju u radu i odlu\\u010divanju temelje\\u0107i se na: - aktivnom predlaganju prijedloga zaklju\\u010daka u cilju doprinosa unapre\\u0111enju razvoja judo sporta u Republici Hrvatskoj, - zahtjevima provo\\u0111enja utvr\\u0111ene politike i strategije razvoja judo sporta u Republici Hrvatskoj, - provedbi zajedni\\u010dkih obveza i odgovornosti pri ostvarivanje planova juda, a posebno za ostvarivanje programa javnih potreba sportu Republike Hrvatske, u dijelu judo sporta, - te\\u017enjama k ostvarivanju sportskih vrijednosti koje pridonose razvoju, afirmaciji i ugledu hrvatskog juda i Republike Hrvatske, - zajedni\\u010dkim interesima svih udru\\u017eenih \\u010dlanica i obvezi izvr\\u0161enja ciljeva i zada\\u0107a Saveza utvr\\u0111enih Zakonom i ovim Statutom. Predstavnik \\u010dlanice \\u2013 \\u010dlan Skup\\u0161tine Saveza ima prava i obveze: - sudjelovati u radu Skup\\u0161tine i drugih tijela u koje je izabran, - odlu\\u010divati o pitanjima o kojima odlu\\u010duje Skup\\u0161tina, - izvje\\u0161tavati \\u010dlanice koje predstavlja o radu Skup\\u0161tine i o svom radu u Skup\\u0161tini Saveza i drugih tijela Saveza, - pokretati raspravu o pitanjima iz djelokruga Skup\\u0161tine i predlagati odgovaraju\\u0107e odluke, - sudjelovati u izvr\\u0161avanju zada\\u0107a utvr\\u0111enih odlukama Skup\\u0161tine, - tra\\u017eiti stru\\u010dnu\", \"- odlu\\u010divati o pitanjima o kojima odlu\\u010duje Skup\\u0161tina, - izvje\\u0161tavati \\u010dlanice koje predstavlja o radu Skup\\u0161tine i o svom radu u Skup\\u0161tini Saveza i drugih tijela Saveza, - pokretati raspravu o pitanjima iz djelokruga Skup\\u0161tine i predlagati odgovaraju\\u0107e odluke, - sudjelovati u izvr\\u0161avanju zada\\u0107a utvr\\u0111enih odlukama Skup\\u0161tine, - tra\\u017eiti stru\\u010dnu pomo\\u0107 od tijela Saveza, - obveza je \\u010dlanova Skup\\u0161tine u svakoj prigodi zastupati i \\u0161tititi interese Saveza, judo sport i olimpizam, te interese udruge koju predstavlja. ## 4.2. Predsjednik Saveza #### \\u010clanak 35. Mandat predsjednika traje \\u010detiri (4) godine i iste osobe mogu biti ponovno birane za novo mandatno razdoblje. Predsjednik obavlja sljede\\u0107e zada\\u0107e i poslove: - predstavlja i zastupa Savez u zemlji i inozemstvu, - saziva i predsjedava sjednicama Skup\\u0161tine i Upravnog odbora Saveza, te potpisuje akte, odluke i zapisnike koje oni donose, - odgovoran je za zakonitost rada Saveza i ispunjavanje zakonom, drugim propisima ili ugovorima utvr\\u0111enih obveza Saveza, - skrbi o izvr\\u0161enju odluka i zaklju\\u010daka Skup\\u0161tine i Upravnog odbora, - podnosi izvje\\u0161\\u0107a o svom i radu Upravnog odbora Skup\\u0161tini Saveza, - odgovoran je za podno\\u0161enje prijedloga godi\\u0161njeg financijskog plana i financijskog izvje\\u0161\\u0107a Skup\\u0161tini Saveza za prethodnu godinu, - wodi poslove sukladno odlukama Skup\\u0161tine i Upravnog odbora Saveza, - poti\\u010de aktivnosti razvoja i promocije judo sporta, - predla\\u017ee Skup\\u0161tini kandidate za dopredsjednika, \\u010dlanove Upravnog odbora, Nadzornog odbora i Stegovne komisije Saveza, - pokre\\u0107e rje\\u0161avanje pitanja razrje\\u0161enja \\u010dlanova Upravnog odbora Saveza, - sklapa ugovore i poduzima pravne radnje u ime i za ra\\u010dun Saveza, - obavlja i druge zada\\u0107e po ovlasti Skup\\u0161tine i Upravnog odbora Saveza utvr\\u0111ene op\\u0107im aktima i ovim Statutom, ili koje su u svezi s funkcijom predsjednika. #### \\u010clanak 36. Predsjednik Saveza odgovoran je za svoj rad Skup\\u0161tini i Upravnom odboru. Dogredsjednik Saveza zamjenjuje odsutnog ili sprije\\u010denog predsjednika Saveza u obavljanju poslova i zada\\u0107a, utvr\\u0111enih prethodnim \\u010dlankom, kojeg za to ovlasti predsjednik ili Upravni odbor. ## \\u010clanak 37. Za predsjednika mo\\u017ee biti izabrana osoba koja udovoljava sljede\\u0107im uvjetima i kriterijima: - da je dr\\u017eavljanin Republike Hrvatske, - da je potpuno poslovno sposobna, - da je ugledan sportski djelatnik, - da se nije ogrije\\u0161ila o eti\\u010dke norme i na\\u010dela sporta i olimpijskog pokreta, - da prihva\\u0107a Statut Saveza, Statut Hrvatskog olimpijskog odbora, Statut i pravila pripadaju\\u0107ih me\\u0111unarodnih sportskih udru\\u017eenja, na\\u010dela i pravila Olimpijske povelje, te Svjetskog kodeksa protiv dopinga (WADA), - da nema prepreke iz Zakona o sportu, - koja nema zapreke iz \\u010dlanka 111. stavci 1. i 2. odnosno iz \\u010dlanka 114. Zakona o sportu, - da poznaje jedan svjetski jezik koji je u slu\\u017ebenoj uporabi me\\u0111unarodnog sportskog udru\\u017eenja prema odredbama Statuta tih udru\\u017eenja. #### \\u010clanak 38. Predsjednika bira Skup\\u0161tina, a na temelju pisanog prijedloga kandidata, koji imaju pravo podnijeti danice. Pisani prijedlog kandidata treba podr\\u017eati 10 \\u010dlanica Saveza, s tim da ista \\u010dlanica mo\\u017ee podr\\u017eati istodobno samo jednog kandidata. U su\\u010daju redovnog izbora predsjednika Saveza, kao i u slu\\u010daju izvanrednih izbora, \\u010dlanice Saveza du\\u017ene su Uredu Saveza dostaviti pisani prijedlog kandidata za predsjednika s obrazlo\\u017eenjem najvasnije 60 dana prije odr\\u017eavanja sjednice Skup\\u0161tine. O prispjelim prijedlozima\", \"10 \\u010dlanica Saveza, s tim da ista \\u010dlanica mo\\u017ee podr\\u017eati istodobno samo jednog kandidata. U su\\u010daju redovnog izbora predsjednika Saveza, kao i u slu\\u010daju izvanrednih izbora, \\u010dlanice Saveza du\\u017ene su Uredu Saveza dostaviti pisani prijedlog kandidata za predsjednika s obrazlo\\u017eenjem najvasnije 60 dana prije odr\\u017eavanja sjednice Skup\\u0161tine. O prispjelim prijedlozima kandidata za predsjednika Saveza, Ured Saveza du\\u017eno je obavijestiti sve savje \\u010dlanice u roku od 15 dana po isteku roka za dostavu pisanih prijedloga kandidata. Plo je za predsjednika istaknuto vi\\u0161e kandidata, od kojih u prvom krugu glasovanja niti jedan ne dobije potrebnu ve\\u0107inu glasova \\u010dlanova Skup\\u0161tine, u drugom krugu glasovanja na izbornu se listu dobili najve\\u0107i broj glasova. ## \\u010clanak 39. da predsjednik, kojeg je izabrala Skup\\u0161tina ne izvr\\u0161ava svoje obveze sukladno odredbama Statuta, svojim radom te\\u017ee povrijede zakon, odredbe Olimpijske povelje, odredbe Statuta ili svojim djelovanjem sprje\\u010davaju provo\\u0111enje odluka Skup\\u0161tine, Pojedlog za razrje\\u0161enje predsjednika slijedom odredbe iz stavka 1. ovog \\u010dlanka mogu podnijeti danice Saveza pisanim zahtjevom koji treba podr\\u017eati 1/2 \\u010dlanica Saveza, a predsjednika mo\\u017ee se podr\\u017eati i na temelju njegovog osobnog zahtjeva. Tazrje\\u0161enju predsjednika odlu\\u010duje Skup\\u0161tina na izvanrednoj sjednici koju saziva ovla\\u0161teno tijelo sukradno odredbama ovog Statuta. su\\u010daju trajne sprije\\u010denosti ili podno\\u0161enja neopozive ostavke predsjednika zamjenjuje za redsjednik, ali najdu\\u017ee do nove izborne sjednice Skup\\u0161tine Saveza koja se odr\\u017eava u roku od 90 zama od nastupanja navedenih okolnosti. ## 4.3. Upravni odbor #### \\u010clanak 40. I zavni odbor je upravno tijelo Saveza koje obavlja slijede\\u0107e poslove i zada\\u0107e. ## Utvr\\u0111uje: - prijedlog strategije razvoja judo sporta u RH, - prijedlog Statuta, odnosno njegovih izmjena i dopuna, koje donosi skup\\u0161tina Saveza, - prijedlog godi\\u0161njeg i vi\\u0161egodi\\u0161njeg plana judo sporta na dr\\u017eavnoj razini, odnosno program rada Saveza, koje donosi skup\\u0161tina Saveza, - financijski plan, uvjete i na\\u010din kori\\u0161tenja financijskog plana, koje donosi skup\\u0161tina Saveza, - financijsko izvje\\u0161\\u0107e, koje donosi skup\\u0161tina saveza. #### Donosi: - \\u00b7 godi\\u0161nji kalendar natjecanja i op\\u0107e uvjete za sudjelovanje na tim natjecanjima, - odluku o prijemu u privremeno \\u010dlanstvo Saveza, - op\\u0107e akte koji reguliraju pitanja iz nadle\\u017enosti Upravnog odbora, te razmatra i odlu\\u010duje o pitanjima iz podru\\u010dja djelovanja Saveza, koja nisu u nadle\\u017enosti Skup\\u0161tine ili kojeg drugog tijela Saveza u skladu s odredbama ovog Statuta, - odluku o dodjeli nagrada i priznanja u judo sportu Republike Hrvatske, - mjere i aktivnosti za unapre\\u0111enje i stvaranje najpovoljnijih materijalnih i financijskih uvjeta za realizaciju planova Saveza, - odluku o adresi Saveza kao i promjeni adrese Saveza, - odluku o uporabi, izgledu i \\u010duvanju pe\\u010data Saveza, - odluku o opisu znaka i zastave Saveza, te uporabi i njihovoj za\\u0161titi, - Pravilnik o financijskom materijalnom poslovanju saveza, - Pravilnik o licenciranju trenera, - Pravilnik o stegovnoj odgovornosti, - Suda\\u010dki pravilnik, - odluku o sudjelovanju sportskih klubova i sporta\\u0161a iz Republike Hrvatske u vi\\u0161edr\\u017eavnim ili inozemnim regionalnim sustavima natjecanja, - Pravilnike za druga pitanja iz svoje nadle\\u017enosti sukladno Zakonu o sportu te pravilima Me\\u0111unarodne judo federacije i Europske judo unije, - odluku o prijemu u privremeno \\u010dlanstvo Saveza, - op\\u0107e akte koji reguliraju pitanja iz nadle\\u017enosti Upravnog odbora,\", \"sporta\\u0161a iz Republike Hrvatske u vi\\u0161edr\\u017eavnim ili inozemnim regionalnim sustavima natjecanja, - Pravilnike za druga pitanja iz svoje nadle\\u017enosti sukladno Zakonu o sportu te pravilima Me\\u0111unarodne judo federacije i Europske judo unije, - odluku o prijemu u privremeno \\u010dlanstvo Saveza, - op\\u0107e akte koji reguliraju pitanja iz nadle\\u017enosti Upravnog odbora, te razmatra i odlu\\u010duje o pitanjima iz podru\\u010dja djelovanja Saveza, koja nisu u nadle\\u017enosti Skup\\u0161tine ili kojeg drugog tijela Saveza u skladu s odredbama ovog Statuta, - mjere i aktivnosti za unapre\\u0111enje i stvaranje najpovoljnijih materijalnih i financijskih uvjeta za realizaciju planova Saveza, #### Imenuje: - glavnog tajnika Saveza na temelju provedenog javnog natje\\u010daja i razrje\\u0161ava ga, - likvidatora Saveza i razrje\\u0161ava ga, - predstavnika Saveza u Skup\\u0161tini Hrvatskog olimpijskog odbora, te predstavnike u drugim organizacijama, institucijama i tijelima i razrje\\u0161ava ih, - stru\\u010dno-trenersku komisiju, komisiju sporta\\u0161a, natjecateljsku komisiju, suda\\u010dku komisiju, komisiju za kate i pojaseve, komisiju za \\u0161kolski sport, komisiju za \\u017eene, komisiju za inkluzivni judo, te donosi odluku o djelokrugu njihova rada i ovlasti, - ostala radna tijela Saveza, a mo\\u017ee imenovati i stalne ili povremene komisije, odnosno radne grupe za koje se uka\\u017ee potreba, te donosi odluku o djelokrugu njihova rada i ovlasti. #### Predla\\u017ee: - udru\\u017eivanje u me\\u0111unarodne i nacionalne sportske organizacije, - program osnovne djelatnosti judo sporta kao i drugih djelatnosti Saveza sukladno propisima, - pravilnik o sustavu uvjetima i organizaciji natjecanja u judo sportu, Skup\\u0161tini Saveza, - osobe za progla\\u0161enje po\\u010dasnog i zaslu\\u017enog \\u010dlana Saveza. #### Odlu\\u010duje o: - organizaciji i na\\u010dinu obavljanja stru\\u010dnih, administrativno-tehni\\u010dkih i pomo\\u0107nih poslova za potrebe Saveza i udru\\u017eenih \\u010dlanica, - \\u00b7 isticanju kandidature za organizaciju me\\u0111unarodnih natjecanja u RH, - davanju suglasnosti udru\\u017eenim \\u010dlanicama i \\u010dlanovima za sudjelovanje na me\\u0111unarodnim natjecanjima. - davanju inicijative za odr\\u017eavanje redovne, elektroni\\u010dke, izborne, izvanredne ili sve\\u010dane Sjednice Skup\\u0161tine. #### Provodi i skrbi o: - provo\\u0111enju odluka i zaklju\\u010daka Skup\\u0161tine ako ovim Statutom, ili samim odlukama i zaklju\\u010dcima to nije povjereno drugom tijelu Saveza, - izvr\\u0161avanju financijskog plana Saveza, rasporedu i kori\\u0161tenju sredstava, - organizaciji i realizaciji strategije i svih planova Saveza i odgovoran je za njihovo izvr\\u0161enje, - upravlja pokretnom i nepokretnom imovinom Saveza, - razmatra pitanja iz rada udru\\u017eenih \\u010dlanica i poduzima odgovaraju\\u0107e mjere za unapre\\u0111enje njihova rada, kao i za otklanjanje nepravilnosti u radu, - obavlja i druge poslove i zada\\u0107e odre\\u0111ene Statutom ili drugim op\\u0107im aktima Saveza, odnosno odlukom Skup\\u0161tine Saveza. Upravni odbor za svoj rad odgovara Skup\\u0161tini. #### \\u010clanak 41. Isrami odbor ima sedam (7) \\u010dlanova, me\\u0111u kojima je po funkciji predsjednik Saveza. de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la\", \"de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n del composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n del composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3n de la composici\\u00f3 da lista kandidata za \\u010dlanove Upravnog odbora, koju je predlo\\u017eio predsjednik, ne bude ad strane Skup\\u0161tine, pojedina\\u010dno \\u0107e se glasovati o svakom pojedinom kandidatu, a predla\\u017ee onoliko novih kandidata koliko ih ne bude prihva\\u0107eno s liste. Upravnog odbora izvr\\u0161avaju zada\\u0107e utvr\\u0111ene ovim Statutom, odnosno koje im nalo\\u017ei Upravni odbor ili predsjednik, u skladu s aktima saveza i zakonom. \\ud83d\\udcb7 \\ud83d\\ude11 \\u010dlanova Upravnog odbora u svakoj prigodi zastupati i \\u0161tititi interese Saveza i judo sporta. ## \\u010clanak 42. Mandat Canova Upravnog odbora traje \\u010detiri (4) godine i ista osoba mo\\u017ee biti ponovno izabrana za mandatno razdoblje. da \\u010dlan Upravnog odbora ne izvr\\u0161ava svoje obveze sukladno odredbama Statuta, isti mo\\u017ee da \\u010dlan Upravnog odbora. Tamesen e \\u010dlana Upravnog odbora vr\\u0161i se na isti na\\u010din kao i njegovo biranje. e po\\u0161te \\u010dlanova Upravnog odbora. za razrje\\u0161enje \\u010dlana Upravnog odbora, slijedom odredbe stavka 2. ovog \\u010dlanka, mo\\u017ee dati za razrje\\u0161eni \\u010dlan Upravnog odbora, a \\u010dlan Upravnog odbora mo\\u017ee biti razrije\\u0161en i na osobni razrije\\u0161enog \\u010dlana Upravnog odbora bira se novi \\u010dlan po istom postupku po kojem je Upravnog odbora koji je razrije\\u0161en, odnosno koji je prestao s obavljanjem funkcije \\u010dlana odbora, a mandat novoizabranog \\u010dlana Upravnog odbora traje do kraja\", \"\\u010dlan Upravnog odbora, a \\u010dlan Upravnog odbora mo\\u017ee biti razrije\\u0161en i na osobni razrije\\u0161enog \\u010dlana Upravnog odbora bira se novi \\u010dlan po istom postupku po kojem je Upravnog odbora koji je razrije\\u0161en, odnosno koji je prestao s obavljanjem funkcije \\u010dlana odbora, a mandat novoizabranog \\u010dlana Upravnog odbora traje do kraja mandata tog #### \\u010clanak 43. occor djeluje na sjednicama, a mo\\u017ee djelovati i izja\\u0161njavanjem telefonski ili putem e pravovaljanih odluka potrebna je nazo\\u010dnost, odnosno telefonsko izja\\u0161njavanje ili e putem elektronske po\\u0161te ve\\u0107ine od ukupnog broja \\u010dlanova Upravnog odbora. donosi odluke javnim glasovanjem, a odluka je donesena ve\\u0107inom glasova prisutnih putem odbora ili ve\\u0107inom glasova telefonskog izja\\u0161njavanja ili izja\\u0161njavanja putem 17 Sjednicama Upravnog odbora predsjedava predsjednik, a u slu\\u010daju njegove odsutnosti ili sprije\\u010denosti dopredsjednik. Sjednice Upravnog odbora saziva predsjednik. ## 4.4. Glavni tajnik ## \\u010clanak 44. Savez ima glavnog tajnika kojeg svojom odlukom neposredno imenuje Upravni odbor Saveza, nakon provedenog javnog natje\\u010daja, sukladno Zakonu, a imenuje se do opoziva. Glavni tajnik svoju funkciju obavlja profesionalno, a prava i obveze izme\\u0111u Saveza i glavnog tajnika ure\\u0111uju se ugovorom o radu. ## \\u010clanak 45. Za glavnog tajnika mo\\u017ee biti birana osoba koja ispunjava sljede\\u0107e uvjete: - \\u00b7 da je dr\\u017eavljanin Republike Hrvatske, - da ima visoku stru\\u010dnu spremu dru\\u0161tvenog smjera prema va\\u017ee\\u0107im propisima o akademskim i stru\\u010dnim nazivima i akademskom stupnju, - da ima 5 godina iskustva na upravlja\\u010dkim poslovima, - da je dokazani sportski du\\u017enosnik ili djelatnik, - da poznaje hrvatski i svjetski judo sport i funkcioniranje njihovih asocijacija, - da poznaje rad na osobnom ra\\u010dunalu, - da se nije ogrije\\u0161io o eti\\u010dke norme i moralna na\\u010dela sporta i olimpizma, - da nema zapreke iz \\u010dlanka 111. stavci 1. i 2. odnosno iz \\u010dlanka 114. Zakona o sportu, - da se slu\\u017ei jednim od slu\\u017ebenih jezika Me\\u0111unarodne judo federacije. ## \\u010clanak 46. Gavni tajnik sudjeluje u radu Skup\\u0161tine, Upravnog odbora i svih drugih tijela Saveza. Sami tajnik provodi i osigurava provo\\u0111enje op\\u0107ih akata i programa Saveza te odluka i zaklju\\u010daka Sup\\u0161tine Saveza, Upravnog odbora i predsjednika Saveza, te osobito obavlja sljede\\u0107e poslove i zada\\u0107e: - zastupa i predstavlja Savez, - odgovoran je za zakonitost rada Saveza i ispunjavanje zakonom, drugim propisima ili ugovorima utvr\\u0111enih obveza Saveza, - odgovoran je za podno\\u0161enje prijedloga godi\\u0161njeg financijskog plana i financijskog izvije\\u0161\\u0107a Skup\\u0161tini Saveza, - nalogodavac je za izvr\\u0161enje financijskog plana Saveza, - obavlja stru\\u010dne i administrativne poslove, - odgovara za pripremu materijala za sjednice tijela Saveza, - vodi poslove sukladno odlukama Skup\\u0161tine i Upravnog odbora Saveza, - odgovoran je za podno\\u0161enje dokumenata nadle\\u017enim tijelima sukladno propisima, te za dostavljanje zapisnika s redovne sjednice Skup\\u0161tine saveza nadle\\u017enom uredu, - skrbi o suradnji Saveza s pripadaju\\u0107im me\\u0111unarodnim organizacijama judo sporta, te savezima tog sporta drugih dr\\u017eava, - sura\\u0111uje s ministarstvima i drugim dr\\u017eavnim tijelima, Hrvatskim olimpijskim odborom i drugim organizacijama va\\u017enim za judo sport, - sura\\u0111uje s \\u010dlanicama Saveza na razvoju i unapre\\u0111enju judo sporta, - vodi i a\\u017eurira evidenciju \\u010dlanica Saveza, te je odgovoran za omogu\\u0107avanje svakodnevnog uvida i davanje podataka o aktualnom \\u010dlanstvu u Savezu,\", \"sura\\u0111uje s ministarstvima i drugim dr\\u017eavnim tijelima, Hrvatskim olimpijskim odborom i drugim organizacijama va\\u017enim za judo sport, - sura\\u0111uje s \\u010dlanicama Saveza na razvoju i unapre\\u0111enju judo sporta, - vodi i a\\u017eurira evidenciju \\u010dlanica Saveza, te je odgovoran za omogu\\u0107avanje svakodnevnog uvida i davanje podataka o aktualnom \\u010dlanstvu u Savezu, - sklapa ugovore i poduzima pravne radnje u ime i za ra\\u010dun Saveza, - organizira pristup medijima, - provodi usvojene planske dokumente Saveza, osigurava javnost rada Saveza, - organizira i rukovodi poslovima Ureda Saveza, - obavlja i druge poslove utvr\\u0111ene Statutom, drugim op\\u0107im aktima ili odlukama Skup\\u0161tine, Upravnog odbora i predsjednika Saveza. Glavni tajnik za svoj rad odgovara Upravnom odboru. ## \\u010clanak 47. Glavni tajnik mo\\u017ee biti razrije\\u0161en du\\u017enosti ako svojim radom neopravdano ne izvr\\u0161ava odnosno odbije izvr\\u0161avati odluke Upravnog odbora. Odluku o razrje\\u0161enju donosi Upravni odbor Saveza. Inicijativu za razrje\\u0161enje du\\u017enosti Glavnog tajnika mogu dati predsjednik Saveza, Upravni odbor i Nadzorni odbor Saveza. Do razrje\\u0161enja mo\\u017ee do\\u0107i i na vlastiti zahtjev Glavnog tajnika Saveza. ## 4.5. Nadzorni odbor #### \\u010clanak 48. Nadzorni odbor se sastoji od tri (3) \\u010dlana, predsjednik i dva (2) \\u010dlana. Mandat Nadzornog odbora traje 4 godine. Kandidate za \\u010dlanove Nadzornog odbora predla\\u017ee predsjednik Saveza, pri \\u010demu kandidati trebaju ispunjavati uvjete utvr\\u0111ene odredbom \\u010dlanka 26. stavak 1. ovog Statuta. \\u010clan Nadzornog odbora ne mo\\u017ee biti \\u010dlan drugog radnog tijela Saveza. #### \\u010clanak 49. Nadzorni odbor je ovla\\u0161ten za: - kontrolu provo\\u0111enja zakonitosti u radu i poslovanju Saveza, - nadzor materijalno-financijskog poslovanja Saveza, - nadzor izvr\\u0161avanja odluka i zaklju\\u010daka Skup\\u0161tine i Upravnog odbora, - poduzimanje drugih mjera u svezi sa svojim poslovima, zada\\u0107ama i djelokrugom rada. Ured Saveza, kao i druga tijela Saveza, du\\u017eni su Nadzornom odboru pru\\u017eiti sve tra\\u017eene i potrebne podatke, omogu\\u0107iti uvid u dokumentaciju i osigurati uvjete za rad. Nadzorni odbor je za svoj rad odgovoran Skup\\u0161tini Saveza kojoj podnosi izvje\\u0161\\u0107e o svom radu. O uo\\u010denim nepravilnostima Nadzorni odbor obavje\\u0161tava Ured Saveza, Upravni odbor, odnosno Skup\\u0161tinu Saveza kao i tijelo u \\u010dijem je radu nastala nepravilnost. Ako se utvr\\u0111ena nepravilnost ne otkloni u roku od 30 dana od zaprimljenog zahtjeva, Nadzorni odbor je du\\u017ean o tome obavijestiti ovla\\u0161tena dr\\u017eavna tijela. Nadzorni odbor djeluje na sjednicama, a odluke, zaklju\\u010dke i preporuke donosi natpolovi\\u010dnom ve\\u0107inom \\u010dlanova Nadzornog odbora. ## 4.6. Stegovna komisija ## \\u010clanak 50. Stegovna komisija Saveza je tijelo koje odlu\\u010duje o stegovnoj odgovornosti \\u010dlanova i osoba koje sudjeluju u programima Saveza, provodi stegovne postupke u prvom stupnju, a temeljem Pravilnika o stegovnoj odgovornosti koji donosi Skup\\u0161tina Saveza. #### \\u010clanak 51. Stegovna komisija se sastoji od tri (3) \\u010dlana, predsjednik i dva (2) \\u010dlana a bira ih Skup\\u0161tina Saveza, na prijedlog predsjednika Saveza, na mandat od \\u010detiri godine. Kandidati za \\u010dlanove Stegovne komisije trebaju ispunjavati uvjete utvr\\u0111ene odredbom \\u010dlanka 26. stavak 1. ovog Statuta. Stegovna komisija donosi odluke ve\\u0107inom glasova. Stegovna komisija odlu\\u010duje o stegovnoj odgovornosti \\u010dlanica Saveza, kao i fizi\\u010dkih osoba koje sudjeluju u radu tijela ili programu Saveza, zbog po\\u010dinjenih povreda prava i obveza utvr\\u0111enih odredbama ovog Statuta, odredbama Pravilnika o stegovnoj odgovornosti\", \"uvjete utvr\\u0111ene odredbom \\u010dlanka 26. stavak 1. ovog Statuta. Stegovna komisija donosi odluke ve\\u0107inom glasova. Stegovna komisija odlu\\u010duje o stegovnoj odgovornosti \\u010dlanica Saveza, kao i fizi\\u010dkih osoba koje sudjeluju u radu tijela ili programu Saveza, zbog po\\u010dinjenih povreda prava i obveza utvr\\u0111enih odredbama ovog Statuta, odredbama Pravilnika o stegovnoj odgovornosti te drugih akata Saveza, sa slijede\\u0107im djelokrugom: - prima prijave za pokretanje stegovnog postupka koje ula\\u017eu \\u010dlanice i drugi sudionici Saveza, - provodi stegovne postupke u I. stupnju inicirane po prijavi ili po slu\\u017ebenoj du\\u017enosti, provodi mjere utvr\\u0111ene Pravilnikom o stegovnoj odgovornosti, - prati i predla\\u017ee izmjene i dopune Pravilnika o stegovnoj odgovornosti Saveza. - obavlja i druge zada\\u0107e, temeljem odluka Skup\\u0161tine, koje su u djelokrugu njenog rada. \\u017dalba na odluku Stegovne komisije se u roku od 15 dana od primitka odluke podnosi Upravnom odboru Saveza koji stegovni postupak rje\\u0161ava u II. stupnju. Odluka Upravnog odbora saveza povodom \\u017ealbe je kona\\u010dna. #### \\u010clanak 52. Stegovna komisija za svoj rad i djelovanje odgovara Skup\\u0161tini. ## V. NA\\u010cIN RJE\\u0160AVANJA SPOROVA I SUKOBA INTERESA UNUTAR SAVEZA ## \\u010clanak 53. Sukladno odredbama Zakona o sportu, Zakonu o udrugama, te drugim pripadaju\\u0107im propisima, kao i u odnosu na nadle\\u017enosti tijela Saveza i za\\u0161titu op\\u0107eg interesa u odnosu na pojedina\\u010dne interese \\u010dlanova, Upravni odbor Savez samostalno odlu\\u010duje o na\\u010dinu rje\\u0161avanja sporova nastalih u vezi s obavljanjem sportske djelatnosti judo sporta. #### VI. UNUTARNJI NADZOR ## \\u010clanak 54. \\u010clanovi Saveza sami nadziru rad Saveza. Ako \\u010dlanica Saveza ili druga osoba koja sudjeluje u radu ili programu Saveza smatra da je odlukom ili postupanjem nekog tijela Saveza povrije\\u0111en Statut ili drugi op\\u0107i akt Saveza, ovla\\u0161tena je na to upozoriti Ured Saveza ili Upravni odbor Saveza, te zahtijevati da se nepravilnosti otklone. Ako se upozorenje ne razmotri u roku od 30 dana od dana dostavljenog pisanog zahtjeva, i po zahtjevu ne odgovori, odnosno ako se u tom roku ne o\\u010dituje nadle\\u017eno tijelo Saveza i nepravilnosti ne otklone u daljnjem roku od 30 dana, \\u010dlanica, odnosno druga osoba koja sudjeluje u radu ili programu Saveza, a podnijela je zahtjev za otklanjanje nepravilnosti, mo\\u017ee podnijeti tu\\u017ebu nadle\\u017enom sudu prema sjedi\\u0161tu udruge radi za\\u0161tite svojih prava propisanih statutom Saveza. ## VII. IMOVINA I MATERIJALNO-FINANCIJSKO POSLOVANJE #### \\u010clanak 55. Imovinu Saveza \\u010dine nekretnine, pokretna imovina, prava i nov\\u010dana sredstva. Savez vodi poslovne knjige i sastavlja financijska izvje\\u0161\\u0107a prema propisima kojima se ure\\u0111uje na\\u010din financijskog poslovanja i vo\\u0111enja ra\\u010dunovodstva neprofitnih organizacija. Savez osigurava nov\\u010dana sredstva od gospodarske djelatnosti, dijela \\u010dlanarine, kotizacije, sredstava ostvarenih od programskih sredstava Hrvatskog olimpijskog odbora, sredstava od sponzora, dotacija, donacija, fondova i drugih izvora sukladno zakonu. #### \\u010clanak 56. Nov\\u010dana sredstva Saveza nalaze se na njegovim poslovnim ra\\u010dunima. Raspodjela ukupnih financijskih sredstava vr\\u0161i se financijskim planom u skladu s programom rada. Prora\\u010dunska sredstva strogo su namjenska i mogu se koristiti isklju\\u010divo za poslove i zada\\u0107e prihva\\u0107ene godi\\u0161njim programom i financijskim planom i rashodima prora\\u010dunskih sredstava. Mogu\\u0107om razlikom prihoda i rashoda ostvarenom obavljanjem gospodarskih djelatnosti, sukladno odredbama ovog Statuta i pripadaju\\u0107ih propisa, raspolagati \\u0107e Upravni odbor, sukladno programu i financijskom planu\", \"rada. Prora\\u010dunska sredstva strogo su namjenska i mogu se koristiti isklju\\u010divo za poslove i zada\\u0107e prihva\\u0107ene godi\\u0161njim programom i financijskim planom i rashodima prora\\u010dunskih sredstava. Mogu\\u0107om razlikom prihoda i rashoda ostvarenom obavljanjem gospodarskih djelatnosti, sukladno odredbama ovog Statuta i pripadaju\\u0107ih propisa, raspolagati \\u0107e Upravni odbor, sukladno programu i financijskom planu Saveza, a ona mo\\u017ee biti kori\\u0161tena isklju\\u010divo u svrhu ostvarivanja ciljeva Saveza. Eventualno ostvareni vi\\u0161ak prihoda nad rashodima u poslovanju raspore\\u0111uje se financijskim planom na slijede\\u0107u godinu u svrhu unapre\\u0111enja judo sporta. Financijski plan Saveza donosi, mijenja i dopunjuje Skup\\u0161tina Saveza. Naredbodavac za izvr\\u0161enje financijskog plana je glavni tajnik Saveza, a Upravni odbor mo\\u017ee svojom odlukom utvrditi i druge osobe s ovla\\u0161tenjima u materijalno-financijskom poslovanju. Materijalno-financijsko poslovanje Saveza organizira se i vodi u skladu sa zakonom i op\\u0107im aktima Saveza. Godi\\u0161nji financijski izvje\\u0161taj Saveza usvaja Skup\\u0161tina i predaje se Ministarstvu financija, odnosno drugoj instituciji koju Ministarstvo financija ovlasti za zaprimanje i obradu financijskih izvje\\u0161taja, a javno se objavljuje putem Registra neprofitnih organizacija sukladno zakonskim propisima. ## \\u010clanak 57. Savez mo\\u017ee stjecati nekretnine, pokretnu imovinu i prava. Savez mo\\u017ee raspolagati svojom imovinom samo za ostvarivanje ciljeva i obavljanje djelatnosti odre\\u0111enih ovim Statutom, u skladu sa zakonom. Za svoje obveze Savez odgovara cjelokupnom imovinom. \\u010clanice Saveza i \\u010dlanovi njegovih tijela ne odgovaraju za obveze Saveza. Nad Savezom se mo\\u017ee provesti ste\\u010daj, sukladno zakonu. ## VIII. SIGURNOST, ZA\\u0160TITA I RED NA SPORTSKIM NATJECANJIMA #### \\u010clanak 58. Sporta\\u0161i i treneri, suci i druge slu\\u017ebene osobe na natjecanju, te \\u010dlanovi upravlja\\u010dkih tijela \\u010dlanica Saveza i Saveza, du\\u017eni su svojim javnim nastupima popularizirati sportske ideje i pona\\u0161anje, koji isklju\\u010duju eventualno izbijanje sukoba ili nereda na sportskim natjecanjima. \\u010clanice Saveza i Savez, organizatori sportskih natjecanja, du\\u017eni su u pripremama za organizaciju kao i u samom odr\\u017eavanju natjecanja poduzeti sve mjere kako bi se na natjecanju osigurala sigurnost natjecatelja i gledatelja i otklonila mogu\\u0107nost eventualnih sukoba ili nereda na sportskom natjecanju. Za primjenu ove odredbe odgovorna je osoba ovla\\u0161tena za zastupanje organizatora natjecanja, ukoliko Savez ili nadle\\u017eno tijelo organizatora u tu svrhu izri\\u010dito ne ovlaste drugo tijelo, odgovaraju\\u0107u slu\\u017ebu ili osobu, odgovornu za pripremu i provedbu mjera sigurnosti, za\\u0161tite sudionika natjecanja te reda na sportskom natjecanju. Organizatori iz prethodne to\\u010dke du\\u017eni su za vrijeme natjecanja osigurati medicinsku pomo\\u0107 za sve sudionike, odnosno nazo\\u010dnost osobe osposobljene i ovla\\u0161tene za pru\\u017eanje medicinske pomo\\u0107i. Pona\\u0161anja \\u010dlanova Saveza, suprotno odredbama stavka 1. ovog \\u010dlanka predstavljaju stegovni prijestup u skladu s Pravilnikom o stegovnoj i materijalnoj odgovornosti Saveza. ## IX. STRU\\u010cNI I ADMINISTRATIVNI POSLOVI ### \\u010clanak 59. Za obavljanje stru\\u010dnih, tehni\\u010dkih, administrativnih i drugih poslova Saveza mo\\u017ee se anga\\u017eirati potreban broj djelatnika koji poslove mogu obavljati volonterski, honorarno ili profesionalno, anga\\u017eiranjem odre\\u0111enog broja vanjskih suradnika ili izvr\\u0161itelja koji poslove mogu obavljati volonterski, honorarno ili profesionalno, a obavljanje odre\\u0111enog posla mo\\u017ee se povjeriti i odgovaraju\\u0107oj vanjskoj pravnoj osobi, temeljem odluke Upravnog odbora, Predsjednika ili Glavnog tajnika Saveza, a sukladno zakonskim propisima. Stru\\u010dne poslove izbornika i trenera u Savezu mogu obavljati osobe koje imaju odgovaraju\\u0107u stru\\u010dnu spremu za obavljanje stru\\u010dnih poslova u judo sportu, odnosno\", \"ili profesionalno, a obavljanje odre\\u0111enog posla mo\\u017ee se povjeriti i odgovaraju\\u0107oj vanjskoj pravnoj osobi, temeljem odluke Upravnog odbora, Predsjednika ili Glavnog tajnika Saveza, a sukladno zakonskim propisima. Stru\\u010dne poslove izbornika i trenera u Savezu mogu obavljati osobe koje imaju odgovaraju\\u0107u stru\\u010dnu spremu za obavljanje stru\\u010dnih poslova u judo sportu, odnosno osobe koje su osposobljene i usavr\\u0161ene za obavljanje stru\\u010dnih poslova u sportu sukladno Zakonu o sportu i pripadaju\\u0107im propisima. Sredstva za pla\\u0107e i rad djelatnika u Savezu osiguravaju se financijskim planom u skladu s financijskim planom Saveza i Hrvatskog olimpijskog odbora. Uredom Saveza rukovodi glavni tajnik Saveza. Na Ured Saveza se ne mogu prenositi poslovi i zada\\u0107e o kojima odlu\\u010duju tijela Saveza. ## X. JAVNOST RADA #### \\u010clanak 60. Javnost rada ostvaruje se upoznavanjem svojih \\u010dlanica i drugih zainteresiranih tijela i organizacija odnosno javnosti o projektima, odlukama, smjernicama i zaklju\\u010dcima tijela Saveza. Obavje\\u0161tavanje javnosti i \\u010dlanstva vr\\u0161i se objavljivanjem op\\u0107ih i drugih akata Saveza, na mre\\u017enim i dru\\u0161tvenim stranicama Saveza, a mo\\u017ee biti i u \\u010dasopisu, biltenu ili drugom tiskanom mediju Saveza, kao i objavom informacija u sredstvima javnog priop\\u0107avanja. Sednice skup\\u0161tine Saveza su otvorene za javnost i \\u010dlanice Saveza. Javnost se samo iznimno mo\\u017ee sklju\\u010diti sa sjednica Skup\\u0161tine Saveza u slijede\\u0107im slu\\u010dajevima: - kada se raspravlja o pitanjima koja predstavljaju poslovnu tajnu, - kada se to zbog osobito va\\u017enih razloga odlu\\u010di na sjednici Skup\\u0161tine Saveza. Sjednice Upravnog odbora Saveza su zatvorene za javnost i \\u010dlanice Saveza. Javnost i \\u010dlanice Saveza se samo iznimno mogu uklju\\u010diti u rad sjednica Upravnog odbora Saveza u slijede\\u0107im slu\\u010dajevima: - po pozivu predsjednika Saveza, - po unaprijed predlo\\u017eenoj temi za raspravu, odobrenoj od strane predsjednika Saveza, - kada se za to zbog osobito va\\u017enih razloga odlu\\u010di Upravni odbor Saveza. Sjednice Nadzornog odbora Saveza su zatvorene za javnost i \\u010dlanstvo. Javnost i \\u010dlanice Saveza se samo iznimno mogu uklju\\u010diti u rad sjednica Nadzornog odbora Saveza i to u slijede\\u0107im slu\\u010dajevima: - po pozivu predsjednika Nadzornog odbora Saveza, - po unaprijed predlo\\u017eenoj temi za raspravu, odobrenoj od strane predsjednika Nadzornog odbora Saveza, - kada se za to zbog osobito va\\u017enih razloga odlu\\u010di Nadzorni odbor Saveza. Sjednice Stegovne komisije Saveza su zatvorene za javnost i \\u010dlanstvo. Javnost i \\u010dlanice Saveza se samo iznimno mogu uklju\\u010diti u rad sjednica Stegovne komisije Saveza u slijede\\u0107im slu\\u010dajevima: - po pozivu predsjednika Stegovne komisije Saveza, - kada se za to zbog postupka koji se vodi, odlu\\u010di Stegovna komisija Saveza. Sjednice ostalih tijela Saveza su zatvorene za javnost i \\u010dlanstvo. Javnost i \\u010dlanice Saveza se samo iznimno mogu uklju\\u010diti u rad ostalih tijela Saveza. U slijede\\u0107im slu\\u010dajevima: - po pozivu predsjednika tijela Saveza, - po unaprijed predlo\\u017eenoj temi za raspravu, odobrenoj od strane predsjednika tijela Saveza. Obavje\\u0161tavanje javnosti vr\\u0161i se i objavljivanjem Statuta Saveza, popisa \\u010dlanica Saveza, odluka, op\\u0107ih i drugih akata iz \\u010dlanka 37. stavak 5. Zakona o sportu, te informacija na mre\\u017enim stranicama Saveza, objavom informacija putem glasila Saveza, objavom informacija u drugim sredstvima priop\\u0107avanja. Nastavno na odredbu prethodnog stavka Savez je du\\u017ean javno objaviti op\\u0107e akte Saveza kojima se\", \"Statuta Saveza, popisa \\u010dlanica Saveza, odluka, op\\u0107ih i drugih akata iz \\u010dlanka 37. stavak 5. Zakona o sportu, te informacija na mre\\u017enim stranicama Saveza, objavom informacija putem glasila Saveza, objavom informacija u drugim sredstvima priop\\u0107avanja. Nastavno na odredbu prethodnog stavka Savez je du\\u017ean javno objaviti op\\u0107e akte Saveza kojima se utvr\\u0111uju: - sustav natjecanja u judo i to najmanje jednu godinu prije po\\u010detka primjene tog sustava, - materijalni, tehni\\u010dki i stru\\u010dni uvjeti za u\\u010dlanjenje sportskih klubova u \\u010dlanstvo Saveza, - na\\u010din licenciranja stru\\u010dnih kadrova judo sukladno Zakonu o sportu, - na\\u010din registracije sporta\\u0161a, - prava i obveze sporta\\u0161a i \\u010dlanova Saveza, - pravo nastupa stranih sporta\\u0161a za sportske klubove u judo sporta u Republici Hrvatskoj, - stegovna odgovornost osoba u sustavu judo sporta, - prava i obveze sudaca, - druga pitanja iz nadle\\u017enosti Saveza sukladno Zakonu o sportu te pravilima me\\u0111unarodnog i europskog saveza judo sporta. ## XI. UTVR\\u0110IVANJE I DODJELJIVANJE PRIZNANJA I NAGRADA ### \\u010clanak 61. Za sportska i stru\\u010dna postignu\\u0107a u judo sporta Savez mo\\u017ee dodjeljivati priznanja i nagrade. Kriterije, vrste priznanja i nagrada, te na\\u010din predlaganja i dodjeljivanja donosi Upravni odbor Saveza. ### XII. PRESTANAK RADA SAVEZA ### \\u010clanak 62. Savez prestaje s radom kada se ispune Zakonom propisane pretpostavke ili odlukom Skup\\u0161tine Saveza. Odluka o prestanku rada Saveza donosi se ve\\u0107inom glasova ukupnog broja \\u010dlanova Skup\\u0161tine Saveza. U slu\\u010daju prestanka rada Saveza nekretnine, pokretna imovina i prava Saveza prelaze u vlasni\\u0161tvo sportske udruge koja \\u0107e nastaviti djelatnosti radi promicanja i razvitka judo sporta na podru\\u010dju Republike Hrvatske. Nov\\u010dana sredstva \\u0107e se upotrijebiti za podmirenje dospjelih obveza Saveza, a preostali iznos \\u0107e se raspodijeliti na jednake dijelove \\u010dlanicama Saveza Ako je Savez primio financijska sredstva iz prora\\u010duna ili iz drugih javnih izvora, u slu\\u010daju prestanka postojanja, ostatak sredstava vratit \\u0107e se u prora\\u010dun iz kojeg su financijska sredstva dodijeljena. #### XIII. LIKVIDATOR SAVEZA #### \\u010clanak 63. Likvidator je fizi\\u010dka ili pravna osoba koju imenuje i opoziva Upravni odbor Saveza. Pokretanjem postupka likvidacije Saveza prestaju ovla\\u0161tenja tijela i osoba ovla\\u0161tenih za zastupanje Saveza. Likvidator zastupa Savez u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u Registar udruga kao osoba ovla\\u0161tena za zastupanje Saveza do okon\\u010danja postupka likvidacije i brisanja Saveza iz Registra udruga. Postupak likvidacije saveza provodi likvidator sukladno odredbama Zakona o udrugama. Likvidator ne mo\\u017ee biti osoba za koju postoji zapreka iz Zakona o udrugama za obavljanje du\\u017enosti likvidatora udruge. ## V. PRIJELAZNE I ZAVR\\u0160NE ODREDBE ## \\u010clanak 64. Ovaj Statut, kao i njegove izmjene i dopune, donosi Skup\\u0161tina Saveza, nakon prethodno pribavljenog mi\\u0161ljenja Hrvatskog olimpijskog odbora na Statut, odnosno njegove izmjene i dopune. ## \\u010clanak 65. Tuma\\u010denje odredbi Statuta daje Skup\\u0161tina Saveza. ## \\u010clanak 66. Sve \\u010dlanice Saveza u Republici Hrvatskoj du\\u017ene su uskladiti svoje statute s ovim Statutom u roku do 30,dana od dana njegovog stupanja na snagu. #### \\u010clanak 67. Statut stupa na snagu danom usvajanja, kada prestaje va\\u017enost Statuta Saveza usvojenog na sjednici odr\\u017eanoj 29. o\\u017eujka 2015. godine. Svi op\\u0107i akti Saveza uskladit \\u0107e se s ovim Statutom u roku od 10\", \"statute s ovim Statutom u roku do 30,dana od dana njegovog stupanja na snagu. #### \\u010clanak 67. Statut stupa na snagu danom usvajanja, kada prestaje va\\u017enost Statuta Saveza usvojenog na sjednici odr\\u017eanoj 29. o\\u017eujka 2015. godine. Svi op\\u0107i akti Saveza uskladit \\u0107e se s ovim Statutom u roku od 10 mjeseci od njegovog usvajanja, o semu brine Ured Saveza. HRVATSKI JUDO SAVEZ Predsjednica dr.sc. Sanda \\u010corak, v.r. ![](_page_26_Picture_0.jpeg) REPUBLIKA HRVATSKA GRAD ZAGREB GRADSKI URED ZA OP\\u0106U UPRAVU I IMOVINSKO-PRAVNE POSLOVE Ovjerava se da je tekst Statuta u skladu sa Zakonom o udrugama temeljem rje\\u0161enja ovog Gradskog ureda KLASA:UP/I-230-01/23-04/2486, URBROJ: 251-04-12-24-2, od 22. sije\\u010dnja 2024. VODITELJICA ODJELA ZA REGISTRACIJU UDRUGA Nata\\u0161a Bramberger, dipl. jur\"]"