["* hd\ncae al de Nea *\n\na\n\n. ‘ .\n, hd s 5 ae i, .\n- ioe, bts “7 ae) - 7 . Ww Bry “,° ° e. . ee\neg tal! ~. 5 Me a \"2 ; hess Lan , a.\n‘2 i: ° as _ .\n: » ark ts “ a3 o) a\n\ne Y/\n@\nNa temelju Clanka 23. stavka 6. tocka 1. i to¢ka 5. Zakona o pravu na pristup informacijama (NN 25/13,\n85/15 i 69/22), (u daljnjem tekstu: Zakon), povodom zahtjeva korisnika prava na pristup informacijama\nMILJENKA CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb, sluzbenik za info", "rmiranje Hrvatskog judo saveza\n\n(u daljnjem tekstu: HJS), Ul. lvana Cankara 13, 10 000 Zagreb, O1B:67894852113, donosi dana 18. kolovoza\n2025.godine\n\nRJESENJE\n\nOdbijaju se svi zahtjevi MIJJENKA CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb, OIB:34665061509 za\npristup informacijama, podneseni dana 11. kolovoza 2025.g., u kojima podnositelj zahtjeva trazi od\nHRVATSKOG JUDO SAVEZA dostavu informacija o realizaciji judaSa (judoka) Dominika Druzeta, Ane", "\nViktorije Puljiz, Zlatka Kumri¢ i Barbare Mati¢ za kalendarske godine: 2020., 2021., 2022., 2023. i\n2024.godinu, zahtjev za dostavu informacija o realizaciji judasice (judoke) Nine Simic za kalendarske\ngodine: 2022., 2023. i 2024.godinu, te zahtjev za dostavu informacija o realizaciji judasice (judoke) Lare\nCvjetko za 2024.godinu.\n\nObrazlozenje\n\nKorisnik prava na pristup informacijama, MILJIENKO CVJETKO, Ulica Sv. Mateja 38, 10 O00 Zagreb,\nOIB:3", "4665061509 podnio je dana 11.08.2025.g. ukupno 25 zahtjeva za pristup informacijama u kojem\ntrazi od HRVATSKOG JUDO SAVEZA dostavu informacija o realizaciji judaSa (judoka) Dominika Druzeta,\nAne Viktorije Puljiz, Zlatka Kumri¢ i Barbare Matic za kalendarske godine: 2020., 2021., 2022., 2023. i\n2024.godinu, zahtjev za dostavu informacija o realizaciji judasice (judoke) Nine Simic za kalendarske\ngodine: 2022., 2023. i 2024.godinu, te zahtjev za dos", "tavu informacija o realizaciji judasice (judoke) Lare\nCvjetko za 2024.godinu.\n\nKorisnik prava na pristup informacijama poslao je e-mail dana 11.08.2025.g. koji je uputio na sljedece e\n\n- mail adrese: office@judo.hr , sluzbenik-informiranje@judo.hr ,\ndean.bogic@judo.hr,ivan.segedi@kif.unizg.hr,ivan.segedi@kif.hr,tadija.orlovic@odata.com.hrr,d.viasta\n@stucos.hr,ivan.jelencic1946@gmail.com,gkovacic23 @gmail.com,fernando.kirigin@ opatija.hr,kirigin@\n", "\nhotmail.com,ppi@pristupinfo.hr,pisarnica@pristupinfo.hr,marija.picek@pristupinfo.hr,\ntajnistvo@uskok.dorh.hr, Subject: Zahtjevi za pristup dokumentaciji za istrage i sudske postupke.\n\nKorisnik prava na pristup informacijama je dana 17. veljace 2025.g. podnio gotovo identicne zahtjeve -\nnjih 21., za sve osobe koje i u ovim zahtjevima pobrojava, s tim da je sada ukljucio dodatno i judasicu\n(judoku) Ninu Simi¢, te trazi istu dokumentaciju — realiza", "ciju po kalendarskim godinama. Dana\n03.03.2025.g. tijelo javne vlasti — Hrvatski judo savez- donio je Rjesenje kojim odbija podnositelja u odnosu\nna sve podnesene zahtjeve. Nije poznato da li je podnositelj zahtjeva na to Rjesenje kojim se kumulativno\nrjeSavalo od 21. zahtjevu podnio zalbu Povjereniku za informiranje.\n\n7 . . . RK ‘ . a - '\n- . .. . . . .? . os . Poh oe ar re Aen ve o . a e\n. wad al. ‘ Lt o\neres 4 See Soe : MQ. tee\n2 Nie: *. tache", "d .; yy <> pha by gt + . \".e. A\nyt A TE - _- S GAs see «=A\n4 a 5 ahs, .\n\n+\nae ea fs\n“eS\n\nghz: mi\n\nHRVATSKI JUDO SAVEZ » CROATIAN JUDO FEDERATION\n10000 ZAGREB = Ulica lvana Cankara 13 « tel: +385 1 301 23 49 + OIB: 67894852113 + e-mail: office@judo.hr » web: www.judo.hr\n\n.\n\nts Aw\n\noo\na e .\nar, Se 5\n* * we,\n“ cat, oy vere - .\nve . te ‘ ‘\n© oe TR - mo\n~ ‘2 — P —\nkel ene a\n% +\n\nCRON\nJUDO/Y\n@\nTekst e-maila od 11.08.2025.g. koji prati sada 25. podnesen", "a zahtjeva nejasan je i konfuzan u smislu\nrazloga trazenja pristupa informacijama, pa se tijelo javne viasti nece u ovom Rjesenju posebno referirati\nna taj tekst. Obzirom je u odnosu na podnositelja zahtjeva pravno situacija nepromijenjena, odnosno sve\n\nokolnosti su identi€ne onima u oZujku 2025.godine (trajanje sudskog postupka), to je tijelo javne vlasti\nodlucilo kako se u dispozitivu navodi.\n\nOdredbom Clanka 23. stavkom 6., tocka 1. Zakona o p", "ravu na pristup informacijama propisano je da ce\ntijelo javne viasti rjesenjem odbiti zahtjev ako se ispune uvjeti propisani u clanku 15. stavku 1. citiranog\nZakona.\n\nObzirom je situacija nepromijenjena, odnosno i dalje se pred Opcinskim kaznenim sudom u Zagrebu vodi\nkazneni postupak, poslovni broj: K-240/2022, privatni tuZitelj HJS, optuzenik Miljenko Cvjetko, datum\npokretanja postupka 18.02.2022.g., radi kaznenog djela iz cl.147 st.2. Kaznenog ", "zakona — Uvreda —\nkaznena djela protiv Casti i ugleda, to za vrijeme trajanja postupka tijelo javne viasti ima zakonsku obvezu\nogranicavanja pristupa informacijama. Zatrazene informacije referiraju se i na citirani kazneni postupak.\n\nNadalje, odredbom Clanka 23. stavkom 6. tockom 5. Zakona 0 pravu na pristup informacijama, propisano\nje da Ce tijelo javne viasti rjesenjem odbiti zahtjev ako jedan ili vise medusobno povezanih podnositelja\nputem jed", "nog ili vise funkcionalno povezanih zahtjeva ocito zloupotrebljava pravo na_ pristup\ninformacijama, a osobito kada zbog ucestalih zahtjeva za dostavu istih ili istovrsnih informacija ili zahtjeva\nkojima se trazi velik broj informacija dolazi do opterecivanja rada i redovitog funkcioniranja tijela javne\nviasti.\n\nPodnositelj je podnio istog dana 11.08.2025.g. ukupno 25 zahtjeva, koji zahtjevi su sadrzajno identicni u\nsmislu dokumenta koji se trazi ", "- realizacija, te U odnosu na veci broj osoba i za dugi vremenski period (\n2020—2024.g.), gdje bi sve i da nema sudskog kaznenog postupka kao zapreke udovoljavanja tolikom\n\nbroju zahtjeva, bilo evidentno opterecivanje rada i redovnog funkcioniranja tijela javne vlasti.\n\nPonaSsanje podnositelja u smislu podnosenja tolikog broja zahtjeva potvrduje da isti koristi pravo na\npristup informacijama suprotno njegovoj svrsi, odnosno zbog razloga koji se n", "e mogu povezati s javnim\ninteresom, te da isti ne postupa s ciljem pribavljanja informacija od javnog znacaja.\n\nS obzirom na prethodno navedeno, odluceno je kao u izreci ovoga rjesenja.\n\nUPUTA O PRAVNOM LUIJEKU: Protiv ovog rjegenja moze se izjaviti Zalba Povjereniku za informiranje u Zagrebu, Trg Zrtava fasizma 3, u roku od 15 dana od dana\ndostave RjeSenja. Zalba se izjavijuje putem tijela javne vlasti.\n\nSluzbenik za informiranje\n\nHRVATSKOG JUDO", " SAVEZA\npen Bogie\nral c.\nEID inal\n\nDostaviti:\nPostom na adresu MIUJENKO CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb\ne-mailom : miljenko.cvjetko@gmail.com\n\na . . + a Rot eo? J Ps sb og: + * . a *,\n_* » C . » a re ry 7 Sony aro :\n\n. wel” ~s eo ae ora € 7\n\n* 5\n\nRee BSN ee |\nHRVATSKI JUDO SAVEZ »- CROATIAN JUDO FEDERATION\n10000 ZAGREB = Ulica lvana Cankara 13 - tel: +385 1301 23 49 - OIB: 67894852113 + e-mail: office@judo.hr » web: www.judo.hr\n\n7*\n\no", "m :\n\n> #: wt .\nSa\n\n"]