["HRVATSKI SABOR \n\n1964 \n\nNa temelju članka 89. Ustava Republike Hrvatske, donosim \n\nODLUKU \n\nO PROGLAŠENJU ZAKONA O SPORTSKOJ INSPEKCIJI \n\nProglašavam Zakon o sportskoj inspekciji, koji je Hrvatski sabor donio na sjednici 13. srpnja \n2012. godine. \n\nKlasa: 011-01/12-01/94 \n\nUrbroj: 71-05-03/1-12-2 \n\nZagreb, 18. srpnja 2012. \n\nPredsjednik \n\nRepublike \nHrvatske \n\nIvo Josipović, v. \nr. \n\nZAKON \n\nO SPORTSKOJ INSPEKCIJI \n\nI. OPĆE ODREDBE \n\nČlanak 1. \n\nOvim  se  Zakonom  uređuje  ustroj,  poslovi,  način  rada,  prava,  dužnosti  i  ovlasti  sportske \ninspekcije (u daljnjem tekstu: inspekcija). \n\nČlanak 2. \n\nInspekcija provodi  inspekcijski  nadzor nad provedbom  Zakona o sportu i  propisa donesenih \nna temelju njega te poduzima mjere i radnje za koje je ovlaštena ovim Zakonom. \n\nII. USTROJ INSPEKCIJE \n\nČlanak 3. \n\n \n \n\f(1) Inspekcijski nadzor u prvom stupnju obavljaju sportski inspektori i viši sportski inspektori \nu  uredima  državne  uprave  u  županijama,  odnosno  u  Gradskom  uredu  Gra", "da  Zagreba  (u \ndaljnjem  tekstu:  inspektori),  a  u  drugom  stupnju  državni  sportski  inspektori,  viši  državni \nsportski  inspektori  i  glavni  sportski  inspektor  ministarstva  nadležnog  za  sport  (u  daljnjem \ntekstu: državni inspektori). \n\n(2)  Iznimno  od  odredbe  stavka  1.  ovoga  članka,  poslove  inspekcijskog  nadzora  u  prvom \nstupnju mogu obavljati državni inspektori. \n\n(3) Protiv rješenja državnih inspektora donesenih u prvom stupnju nije dopuštena žalba, već \nse može pokrenuti upravni spor pred nadležnim upravnim sudom. \n\nČlanak 4. \n\n(1)  Inspekcija u ministarstvu  nadležnom  za poslove sporta (u daljnjem tekstu:  Ministarstvo) \nustrojava se kao unutarnja ustrojstvena jedinica u upravnoj organizaciji nadležnoj za sport u \nsastavu Ministarstva. \n\n(2)  Ustrojstvenom  jedinicom  inspekcije  iz  stavka  1.  ovoga  članka  rukovodi  glavni  sportski \ninspektor. \n\nČlanak 5. \n\n(1) Uvjeti za raspored na radno mjesto glavnoga sportskog inspektora su: završen diplomski", " \nsveučilišni  studij  ili  specijalistički  diplomski  stručni  studij  iz  područja  društvenih  znanosti, \nsedam godina radnog iskustva na odgovarajućim poslovima i položen državni stručni ispit. \n\n(2) Uvjeti za raspored na radno mjesto višega državnoga sportskog inspektora su: diplomski \nsveučilišni  studij  ili  specijalistički  diplomski  stručni  studij  iz  područja  društvenih  znanosti, \nčetiri godine radnog iskustva na odgovarajućim poslovima i položen državni stručni ispit. \n\n(3) Uvjeti za raspored na radno mjesto državnoga sportskog inspektora su: završen diplomski \nsveučilišni studij ili specijalistički diplomski stručni studij iz područja društvenih znanosti, tri \ngodine  radnog  iskustva  na  odgovarajućim  poslovima  i  položen  državni  stručni  ispit  za \nsportskog inspektora. \n\n(4)  Uvjeti  za  raspored  na  radno  mjesto  višega  sportskog  inspektora  su  završen  diplomski \nsveučilišni  studij  ili  specijalistički  diplomski  stručni  studij  iz  područja  društ", "venih  znanosti, \nčetiri godine radnog iskustva na odgovarajućim  poslovima i položen državni stručni ispit za \nsportskog inspektora. \n\n(5) Uvjeti za raspored na radno mjesto sportskog inspektora su: završen diplomski sveučilišni \nstudij  ili  specijalistički  diplomski  stručni  studij  iz  područja  društvenih  znanosti,  tri  godine \nradnog  iskustva  na  odgovarajućim  poslovima  i  položen  državni  stručni  ispit  za  sportskog \ninspektora. \n\nČlanak 6. \n\n(1) Inspektori obavljaju neposredno sve poslove iz nadležnosti sportske inspekcije osim onih \nza koje je ovim Zakonom određeno da ih obavljaju državni inspektori. \n\n\f(2)  Ako  inspektori  ne  obave  ili  djelomično  obave  pojedine  inspekcijske  poslove  iz  svoje \nnadležnosti, te poslove mogu neposredno obaviti državni inspektori ako ocijene da se na drugi \nnačin ne može osigurati izvršenje određenoga inspekcijskog posla. \n\n(3)  Državni  inspektori  imaju  sve  ovlasti  inspektora  koje  su  propisane  ovim  Zakonom  kada \nobav", "ljaju inspekcijski nadzor sukladno stavku 2. ovoga članka. \n\nČlanak 7. \n\n(1)  Osoba  koja  obavlja  inspekcijski  nadzor  ima  službenu  iskaznicu  i  znak  kojima  dokazuje \nslužbeno svojstvo, identitet i ovlasti. \n\n(2) Obrazac službene iskaznice i izgled znaka, način izdavanja i zamjene iskaznice, odnosno \nznaka te način vođenja očevidnika o izdanim iskaznicama i znakovima propisuje pravilnikom \nministar nadležan za sport (u daljnjem tekstu: ministar). \n\nČlanak 8. \n\n(1) O obavljenim inspekcijskim pregledima i poduzetim mjerama inspekcija vodi očevidnik. \n\n(2)  Obrazac  i  način  vođenja  očevidnika  iz  stavka  1.  ovoga  članka  propisuje  ministar \npravilnikom. \n\nIII. POSLOVI SPORTSKE INSPEKCIJE \n\nČlanak 9. \n\nU provedbi nadzora nad pravnim i fizičkim osobama u sustavu sporta koje podliježu nadzoru \ninspekcije,  inspektor  utvrđuje  stanje  u  vezi  s  obavljanjem  sportske  djelatnosti  sukladno \nodredbama Zakona o sportu, a osobito: \n\n1. izvršavaju li se u sustavu sporta zadaće ut", "vrđene Zakonom o sportu, \n\n2.  poštuju  li  se  propisi  o  upisu  u  registar  sportskih  djelatnosti,  registar  profesionalnih \nsportskih klubova, odnosno u drugi odgovarajući registar, \n\n3. ima li pravna osoba u sustavu sporta propisane opće akte i jesu li oni usklađeni sa zakonom \ni drugim propisom, \n\n4.  je  li  sastav  predstavničkog  i  izvršnog  tijela,  odnosno  tijela  upravljanja  i  nadzora  pravne \nosobe u sportu u skladu sa Zakonom o sportu i na temelju njega donesenih propisa, \n\n5.  postoje  li  za  osobe  koje  obavljaju  poslove  u  sportu  zapreke  u  smislu  odredaba  Zakona  o \nsportu, \n\n6.  donose  li  se  odluke  i  drugi  pojedinačni  akti  u  skladu  sa  Zakonom  o  sportu  i  na  temelju \nnjega donesenih propisa, \n\n7.  primjenjuju  li  se  odredbe  Zakona  o  sportu  i  na  temelju  njega  donesenih  propisa  u  vezi  s \nposljedicama pravomoćne osude i kaznenog postupka, \n\n\f8. obavlja li stručne poslove u sportu osoba koja za to ne ispunjava propisane uvjete, ", "\n\n9. obavlja li se sportska djelatnost u skladu s propisanim tehničkim i zdravstvenim uvjetima, \n\n10.  obavljaju  li  pravne  osobe  u  sportu  koju  drugu  djelatnost  osim  sportske  djelatnosti  bez \npropisanog odobrenja, \n\n11.  organiziraju  li  se  sportska  natjecanja  u  skladu  sa  Zakonom  o  sportu  i  na  temelju  njega \ndonesenih propisa, \n\n12.  imaju  li  osobe  koje  sudjeluju  u  sportskim  natjecanjima  odgovarajuću  zdravstvenu \nsposobnost koju je utvrdio ovlašteni liječnik sukladno sa Zakonom o sportu i na temelju njega \ndonesenih propisa, \n\n13. poštuju li se pravila o korištenju nedopuštenih sredstava (doping). \n\nIV. NAČIN RADA, PRAVA, DUŽNOSTI I OVLASTI SPORTSKE \nINSPEKCIJE \n\nInspekcijski postupak pokreće se po službenoj dužnosti. \n\nČlanak 10. \n\nČlanak 11. \n\n(1) Inspektor je dužan razmotriti predstavku ili drugu obavijest upućenu sportskoj inspekciji \nte procijeniti potrebu za pokretanjem inspekcijskog postupka. \n\n(2) O pokretanju postupka, odnosno o nepostojanju uv", "jeta za pokretanje postupka inspektor je \ndužan obavijestiti podnositelja najkasnije u roku od 30 dana od dana podnošenja predstavke. \n\n(3) Podnositelj predstavke ima pravo u roku od osam dana od dana primitka obavijesti izjaviti \nprigovor čelniku javnopravnog tijela u čijem se sastavu nalazi sportska inspekcija ako primi \nobavijest  da  prema  navodima  u  predstavci  ne  postoje  uvjeti  za  pokretanje  postupka  ili  ako \nobavijest ne primi u roku iz stavka 2. ovoga članka. \n\n(4)  Ako  je  postupak  pokrenut,  o  provedenom  nadzoru  i  poduzetim  mjerama  i  radnjama \ninspektor će izvijestiti podnositelja predstavke nakon završenoga inspekcijskog postupka. \n\nČlanak 12. \n\n(1) O početku obavljanja nadzora inspektor će obavijestiti odgovornu osobu u pravnoj osobi \nodnosno  fizičku  osobu  u  sustavu  sporta,  osim  ako  smatra  da  bi  obavještavanjem  umanjio \nučinkovitost nadzora. \n\n(2) Inspektor obavlja nadzor izravnim uvidom u opće i pojedinačne akte, te uvjete i način rada \npravn", "e osobe, odnosno fizičke osobe koje obavljaju sportsku djelatnost. \n\n\f(3)  Inspektor  ima  pravo  u  inspekcijskom  postupku  pregledati  dokumentaciju  i  evidencije, \nradne i poslovne prostorije i spise, isprave na temelju kojih može utvrditi identitet osoba koje \nobavljaju poslove za pravnu osobu te saslušati i uzeti izjave tih osoba. \n\nČlanak 13. \n\n(1)  Provodeći  inspekcijski  nadzor  inspektor  je  dužan  postupati  tako  da  se  čuva  zakonom  ili \ndrugim propisom utvrđena tajna. \n\n(2) Inspektor je dužan kao službenu tajnu čuvati dokumentaciju te činjenice i podatke koji su \nu  vezi  s  inspekcijskim  nadzorom,  kao  i  identitet  podnositelja  predstavke  odnosno  druge \nobavijesti ako on to zatraži. \n\nČlanak 14. \n\nOdgovorna osoba pravne osobe i fizička osoba u sustavu sporta dužna je inspektoru osigurati \nuvjete za provedbu nadzora te mu pružiti potrebne podatke, dokumente i obavijesti, a osobe \nkoje  obavljaju  poslove  u  pravnoj  osobi,  uvjete  za  obavljanje  nadzora  na ", " području  na  kojem \nradi te mu o tome pružiti podatke, dokumente i obavijesti. \n\nČlanak 15. \n\n(1) O obavljenom nadzoru i utvrđenom stanju inspektor sastavlja zapisnik. \n\n(2)  Zapisnik  iz  stavka  1.  ovoga  članka  sastavlja  se,  zaključuje  i  potpisuje  u  skladu  s \nodredbama Zakona o općem upravnom postupku, a treba sadržavati sve činjenice relevantne \nza ocjenu stanja vezano uz predmet nadzora. \n\nČlanak 16. \n\n(1)  Ako  nađe  da  je  povrijeđen  zakon  ili  drugi  propis,  inspektor  je  dužan  poduzeti  mjere \nodnosno  izvršiti  radnje  za  koje  je  ovlašten  zakonom  ili  drugim  propisom.  Mjere  i  radnje \npoduzimaju se na temelju stanja utvrđenog u zapisniku. \n\n(2)  Ako  tijekom  obavljanja  nadzora  utvrdi  nezakonitosti,  odnosno  nepravilnosti  u  radu  ili \npostupanju, a taj rad ili postupanje podliježe nadzoru sportske inspekcije, inspektor je dužan \nobaviti nadzor i nad tim radom ili postupanjem iako mu to nije bio predmet nadzora. \n\n(3)  Ako  ne  nađe  povredu  zak", "ona  ili  drugog  propisa,  inspektor  će  tu  činjenicu  upisati  u \nzapisnik. \n\nČlanak 17. \n\n(1) Ako uoči povredu propisa nad čijom primjenom nadzor obavlja druga inspekcija ili drugo \ntijelo državne uprave, inspektor će o povredi izvijestiti nadležnu inspekciju, odnosno nadležno \ntijelo državne uprave. \n\n(2) Ako uoči povredu pravila za čiju provedbu je nadležno neko od sportskih tijela, inspektor \nće o povredi izvijestiti to tijelo. \n\n\f(3) Ako ocijeni da postoji sumnja u počinjenje kaznenog djela, inspektor će o tome izvijestiti \nnadležno tijelo progona. \n\nČlanak 18. \n\n(1)  Na  temelju  utvrđenih  činjenica  inspektor  može  izreći  naredbu  ili  zabranu  te  izdati \nprekršajni  nalog,  odnosno  podnijeti  optužni  prijedlog  nadležnom  prekršajnom  sudu  ako  je \npovredom propisa počinjen prekršaj. \n\n(2) Naredbe i zabrane izriču se rješenjem. \n\n(3) Izdavanje prekršajnog naloga i podnošenje optužnog prijedloga provodi se pod uvjetima, \nna način i u postupku koje propisuje Zakon o pr", "ekršajima. \n\nČlanak 19. \n\n(1)  Inspektor  će  narediti  otklanjanje  propusta,  nedostataka,  odnosno  nepravilnosti  u \nodređenom roku: \n\n1. ako pravne osobe u sustavu sporta ne izvršavaju zadaće utvrđene Zakonom o sportu, \n\n2.  ako  nadzirana  fizička  ili  pravna  osoba  obavlja  sportsku  djelatnost,  a  nije  izvršila  upis  u \nregistar sportskih djelatnosti, odnosno drugi odgovarajući registar, \n\n3. ako nadzirana pravna osoba nema propisane opće akte, odnosno ako ti akti nisu usklađeni \nsa zakonom ili drugim propisom, \n\n4. ako nadzirana fizička ili pravna osoba ne obavlja sportsku djelatnost u skladu s propisanim \ntehničkim i zdravstvenim uvjetima, \n\n5. ako pravna osoba u sportu obavlja koju drugu djelatnost bez propisanog odobrenja, \n\n6. ako sportsko natjecanje nije organizirano u skladu sa Zakonom o sportu i na temelju njega \ndonesenih propisa, \n\n7. u drugim slučajevima kada je ta mjera propisana zakonom ili drugim propisom ili u drugim \nslučajevima kada se izricanjem te mjere ", "utvrđeno stanje može uskladiti sa zakonom ili drugim \npropisom  i  kada  se  tim  usklađenjem  posljedice  prouzročene  propustima,  nedostacima  ili \nnepravilnostima mogu otkloniti. \n\n(2) Ako nedostatak iz stavka 1. točke 2. ovoga članka ne bude otklonjen u ostavljenom roku, \ninspektor će zabraniti obavljanje sportske djelatnosti. \n\n(3)  Naredba  za  uklanjanje  nedostataka,  odnosno  nepravilnosti  iz  stavka  1.  točke  6.  ovoga \nčlanka  izriče  se  za  sljedeće  natjecanje  ako  uklanjanje  nedostataka,  odnosno  nepravilnosti  u \ntekućem natjecanju nije moguće. \n\nČlanak 20. \n\n\f(1)  Inspektor  će  nadziranoj  pravnoj  osobi  narediti  poništenje,  ukidanje  ili  oglašavanje \nništavnim  pojedinačnog  akta,  odluke  ili  drugoga  pojedinačnog  akta  ako  su  ispunjeni  uvjeti \npropisani  zakonom  te  ako  je  time  bitno  povrijeđen  zakon  ili  drugi  propis,  a  poduzimanjem \ndrugih mjera ne može se uspostaviti zakonito stanje. \n\n(2)  Ako  se  naredba  iz  stavka  1.  ovoga  člank", "a  ne  provede  u  ostavljenom  roku,  poništenje, \nukidanje ili oglašavanje ništavnim provest će inspektor. \n\nČlanak 21. \n\n(1)  Inspektor  će  nadziranoj  pravnoj  osobi  zabraniti  da  u  njoj  obavlja  poslove  član \npredstavničkog  ili  izvršnog  tijela,  odnosno  upravnog  ili  nadzornog  tijela  ako  za  tu  osobu \npostoji zapreka u smislu odredaba Zakona o sportu. \n\n(2) Protiv rješenja iz stavka 1. ovoga članka može se izjaviti žalba Ministarstvu. \n\nČlanak 22. \n\n(1)  Inspektor  će  nadziranoj  pravnoj  osobi,  odnosno  fizičkoj  osobi  koja  obavlja  samostalnu \ndjelatnost zabraniti: \n\n1. obavljanje poslova u sportu osobi za koju je utvrđena zapreka u smislu odredaba Zakona o \nsportu, \n\n2. obavljanje stručnih poslova osobi koja ne ispunjava propisane uvjete, \n\n3.  sudjelovanje  u  sportskim  natjecanjima  osobi  koja  nema  odgovarajuću  zdravstvenu \nsposobnost utvrđenu u skladu sa zakonom. \n\n(2)  Inspektor  će  izreći  zabranu  i  u  drugim  slučajevima  kada  je  za  to  ovlaš", "ten  zakonom  ili \ndrugim propisom. \n\nČlanak 23. \n\n(1) Protiv prvostupanjskog rješenja inspektora može se izjaviti žalba inspekciji u Ministarstvu \nnadležnom za poslove sporta. \n\n(2) Žalbu iz stavka 1. ovoga članka može izjaviti odgovorna osoba u pravnoj osobi i fizička \nosoba koja je bila predmet nadzora. \n\n(3)  Žalbu  iz  stavka  1.  ovoga  članka  može  izjaviti  i  fizička  osoba  u  pravnoj  osobi  kojoj  je \nrješenjem izrečena zabrana ili naređena druga obveza te druga fizička ili pravna osoba koja za \nto dokaže pravni interes. \n\n(4) Žalba iz stavka 1. ovoga članka odgađa izvršenje rješenja. \n\n(5) Iznimno od odredbe stavka 4. ovoga članka, žalba ne odgađa izvršenje rješenja ako je riječ \no poduzimanju hitnih mjera čije izvršenje se ne može odgađati. \n\n\f(6)  Protiv  prvostupanjskog  rješenja  državnog  inspektora  nije  dopuštena  žalba,  ali  se  može \npodnijeti tužba nadležnome upravnom sudu. \n\nČlanak 24. \n\n(1)  Hitnim  mjerama  u  smislu  članka  23.  stavka  5.  smatraju  se  ", "naredbe  i  zabrane  koje  se \nodnose na: \n\n1. obavljanje sportske djelatnosti u skladu s propisanim zdravstvenim i tehničkim uvjetima, \n\n2. zapreke u smislu odredaba Zakona o sportu, \n\n3. obavljanje stručnih poslova u sportskoj djelatnosti, \n\n4.  sudjelovanje  u  sportskim  natjecanjima  osobi  koja  nema  odgovarajuću  zdravstvenu \nsposobnost utvrđenu Zakonom o sportu. \n\n(2)  Inspektor  može  poduzeti  hitnu  mjeru  i  u  drugim  slučajevima  kada  procijeni  da  bi \nodgađanje izvršenja mjere prouzročilo štetu ili poremećaj koji se više ne bi mogao otkloniti. \n\n(3) Rješenje s naredbom ili zabranom iz stavka 1. i 2. ovoga članka može se donijeti i u tijeku \nnadzora  ukoliko  su  činjenice  na  kojima  se  utemeljuje  rješenje  utvrđene  ili  učinjene \nvjerojatnim, tada se izrečena mjera mora upisati u zapisnik. \n\n(4) U iznimno hitnim slučajevima, kada je riječ o poduzimanju mjera radi osiguranja javnog \nmira i sigurnosti ili radi otklanjanja neposredne opasnosti za život ili zdravlje ", "ljudi, odnosno \nštete na imovini, ili kada bi odgađanje izvršenja zbog donošenja pisanog rješenja prouzročilo \nkakvu štetu ili poremećaj koji se više ne bi mogli otkloniti bez posljedica, rješenje iz stavka 3. \novoga članka može se donijeti i usmeno. \n\n(5)  U  slučaju  iz  stavka  4.  ovoga  članka  u  zapisnik  se  upisuje  cijelo  rješenje,  a  odgovornu \nosobu u nadziranoj pravnoj osobi, odnosno nadziranu fizičku osobu, istodobno se upozorava \nda ima pravo tražiti pisani otpravak usmenog rješenja. \n\n(6)  Na  zahtjev  odgovorne  osobe  u  nadziranoj  pravnoj  osobi  ili  nadzirane  fizičke  osobe, \nusmeno rješenje izdat će se u pisanom obliku bez odgode, a najkasnije u roku od osam dana \nod dana donošenja usmenog rješenja. \n\nČlanak 25. \n\nZapisnik  i  rješenje  inspektor  je  dužan  dostaviti  osobama  koje  prema  odredbama  članka  23. \novoga  Zakona  mogu  izjaviti  žalbu  ili  pokrenuti  upravni  spor  protiv  rješenja  inspektora, \nodnosno državnog inspektora. \n\nČlanak 26. \n\n(1) ", " Za  ispunjenje  obveze  iz  rješenja  odgovorna  je  osoba  u  pravnoj  osobi,  odnosno  fizička \nosoba koja obavlja samostalnu djelatnost, a ako je rješenjem naređena kakva obveza fizičkoj \nosobi u pravnoj osobi za ispunjenje obveza odgovorna je i ta fizička osoba. \n\n\f(2) O ispunjenju obveze iz rješenja odgovorna osoba u pravnoj osobi, odnosno fizička osoba \nkoja  obavlja  samostalnu  djelatnost  dužna  je  u  roku  od  osam  dana  od  dana  isteka  roka  za \nispunjenje  obveze  pisano  izvijestiti  inspektora,  odnosno  državnog  inspektora  koji  je  donio \nrješenje. \n\n(3) Ako osoba iz stavka 2. ovoga članka ne izvijesti inspektora, odnosno državnog inspektora \nu propisanom  roku ili  ako inspektor, odnosno državni  inspektor posumnja u vjerodostojnost \nizvješća, obavit će kontrolni inspekcijski nadzor radi utvrđivanja pravog stanja stvari. \n\nČlanak 27. \n\nNaloge,  prijedloge,  prijave,  zahtjeve  i  izvješća  proizišla  iz  ovoga  Zakona  te  druge  naloge, \nprijedloge,  prijave,  ", "zahtjeve  i  izvješća  za  koje  je  ovlašten,  inspektor  podnosi  u  obliku \nobrazloženog  pisanog  odgovarajućeg  podneska,  ako  zakonom  ili  drugim  propisom  nije \ndrukčije propisano. \n\nČlanak 28. \n\n(1)  Inspektor  je  samostalan  u  odlučivanju,  u  vođenju  postupka,  obavljanju  radnji  i \npoduzimanju mjera za koje je ovlašten. \n\n(2) Nitko ne smije, koristeći se službenim položajem ili na drugi način inspektora ometati u \npokretanju  postupka  niti  smije  inspektoru  naređivati,  sprječavati  ga  ili  ometati  u  provedbi \nnadzora i poduzimanju mjera i radnji za koje je ovlašten. \n\nČlanak 29. \n\nInspektor je odgovoran ako ne poduzme mjere ili radnje koje je po zakonu ili drugom propisu \nbio dužan poduzeti ili ako prekorači ovlasti koje su mu dane zakonom ili drugim propisom, \nodnosno  ako  ne  podnese  prijavu  ili  ne  obavijesti  nadležna  državna  tijela  o  utvrđenim \nnedostacima kad je to dužan učiniti. \n\nČlanak 30. \n\n(1)  Glavni  inspektor  ovlašten  je  davati  naloge ", " i  naputke  za  rad,  pratiti  izvršenje  poslova, \nnadzirati  zakonitost  rada  i  postupanja  državnih  inspektora  te  s  tom  svrhom  tražiti  izvješća  i \nobrazloženja. \n\n(2) Ako utvrdi nezakonitost rada i postupanja, odnosno propust ili prekoračenje ovlasti, glavni \ninspektor naredit će obustavu daljnjih postupaka te poduzeti radnje za koje je ovlašten. \n\n(3) Ovlasti iz stavka 1. i 2. ovoga članka ima i rukovodeća osoba inspekcije u uredu državne \nuprave u županiji, odnosno Gradskom uredu Grada Zagreba prema inspektorima. \n\nV. KAZNENE ODREDBE \n\nČlanak 31. \n\n(1)  Novčanom  kaznom  u  iznosu  od  10.000,00  do  50.000,00  kuna  kaznit  će  se  za  prekršaj \npravna osoba, odnosno fizička osoba koja obavlja samostalnu djelatnost u sustavu sporta: \n\n\f1.  ako  ne  osigura  uvjete  za  provedbu  nadzora  ili  ako  inspektoru,  odnosno  državnom \ninspektoru ne pruži potrebne podatke i obavijesti, \n\n2.  ako  na  bilo  koji  način  sprječava  ili  ometa  inspektora,  odnosno  državnog  in", "spektora  u \nobavljanju nadzora ili poduzimanju mjera i radnji za koje je ovlašten, \n\n3. ako ne postupi po rješenju inspektora, odnosno državnog inspektora, \n\n4. ako u određenom roku ne izvijesti inspektora o ispunjenju obveze iz rješenja. \n\n(2)  Za  prekršaj  iz  stavka  1.  ovoga  članka  kaznit  će  se  i  odgovorna  osoba  u  pravnoj  osobi \nnovčanom kaznom u iznosu od 5.000,00 do 10.000,00 kuna. \n\nČlanak 32. \n\nNovčanom  kaznom  u  iznosu  od  1.000,00  do  5.000,00  kuna  kaznit  će  se  fizička  osoba  koja \nobavlja poslove za pravnu osobu u sustavu sporta: \n\n1. ako na svom području rada ne osigura uvjete za provedbu nadzora ili ako ne pruži potrebne \npodatke i obavijesti, \n\n2.  ako  na  bilo  koji  način  sprječava  ili  ometa  inspektora  u  obavljanju  nadzora  ili  u \npoduzimanju mjera i radnji za koje je ovlaštena, \n\n3. ako ne postupi po rješenju sportskog inspektora. \n\nVI. PRIJELAZNE I ZAVRŠNE ODREDBE \n\nČlanak 33. \n\n(1)  Državni  službenici  zatečeni  u  državnoj  službi  n", "a  dan  stupanja  na  snagu  ovoga  Zakona \ndužni  su  položiti  državni  stručni  ispit  u  roku  od  godinu  dana  od  dana  rasporeda  na  radno \nmjesto inspektora, državnog inspektora, odnosno glavnog sportskog inspektora. \n\n(2) Državni službenici iz stavka 1. ovoga članka koji ne polože državni stručni ispit u roku od \ngodinu  dana  od  dana  rasporeda  na  radno  mjesto  inspektora,  odnosno  državnog  inspektora, \nrasporedit  će  se  na  drugo  radno  mjesto  za  koje  ispunjavaju  propisane  uvjete,  a  ako  nema \nodgovarajućeg  radnog  mjesta,  stavit  će  se  na  raspolaganje  sukladno  propisima  o  državnim \nslužbenicima. \n\n(3)  U  državnu  službu  na  radno  mjesto  inspektora,  državnog  inspektora  i  glavnog  sportskog \ninspektora  može  se  primiti  i  osoba  koja  nema  položen  državni  stručni  ispit,  ali  ga  mora \npoložiti  u  roku  od  šest  mjeseci  od  isteka  probnog  rada.  U  protivnom  joj  prestaje  državna \nslužba istekom posljednjeg dana roka za polagan", "je ispita. \n\nČlanak 34. \n\nProvedbene  propise  iz  članka  7.  stavka  2.  i  članka  8.  stavka  2.  ovoga  Zakona  ministar  će \ndonijeti u roku od tri mjeseca od dana stupanja na snagu ovoga Zakona. \n\n\fOvaj Zakon stupa na snagu osmoga dana od dana objave u »Narodnim novinama«. \n\nČlanak 35. \n\nKlasa: 620-01/12-01/01 \n\nZagreb, 13. srpnja 2012. \n\nHRVATSKI SABOR \n\nPotpredsjednik \n\nHrvatskoga \nsabora \n\nJosip Leko, v. r. \n\n \n \n \n\f"]