["Na temelju članka 23. stavka 6. točka 1. i točka 5. Zakona o pravu na pristup informacijama (NN 25/13,\n85/15 i 69/22), (u daljnjem tekstu: Zakon), povodom zahtjeva korisnika prava na pristup informacijama\nMILJENKA CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb, službenik za informiranje Hrvatskog judo saveza\n(u daljnjem tekstu: HJS), Ul. Ivana Cankara 13, 10 000 Zagreb, OIB:67894852113, donosi dana 18. kolovoza\n2025.godine\nRJEŠENJE\nOdbijaju se svi z", "ahtjevi MILJENKA CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb, OIB:34665061509 za\npristup informacijama, podneseni dana 11. kolovoza 2025.g., u kojima podnositelj zahtjeva traži od\nHRVATSKOG JUDO SAVEZA dostavu informacija o realizaciji judaša (judoka) Dominika Družeta, Ane\nViktorije Puljiz, Zlatka Kumrić i Barbare Matić za kalendarske godine: 2020., 2021., 2022., 2023. i\n2024.godinu, zahtjev za dostavu informacija o realizaciji judašice (judoke) ", "Nine Simić za kalendarske\ngodine: 2022., 2023. i 2024.godinu, te zahtjev za dostavu informacija o realizaciji judašice (judoke) Lare\nCvjetko za 2024.godinu.\nObrazloženje\nKorisnik prava na pristup informacijama, MILJENKO CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb,\nOIB:34665061509 podnio je dana 11.08.2025.g. ukupno 25 zahtjeva za pristup informacijama u kojem\ntraži od HRVATSKOG JUDO SAVEZA dostavu informacija o realizaciji judaša (judoka) Dominik", "a Družeta,\nAne Viktorije Puljiz, Zlatka Kumrić i Barbare Matić za kalendarske godine: 2020., 2021., 2022., 2023. i\n2024.godinu, zahtjev za dostavu informacija o realizaciji judašice (judoke) Nine Simić za kalendarske\ngodine: 2022., 2023. i 2024.godinu, te zahtjev za dostavu informacija o realizaciji judašice (judoke) Lare\nCvjetko za 2024.godinu.\nKorisnik prava na pristup informacijama poslao je e-mail dana 11.08.2025.g. koji je uputio na sljedeće", " e\n- mail adrese: office@judo.hr , sluzbenik-informiranje@judo.hr ,\ndean.bogic@judo.hr,ivan.segedi@kif.unizg.hr,ivan.segedi@kif.hr,tadija.orlovic@odata.com.hrr,d.vlasta\n@stucos.hr,ivan.jelencic1946@gmail.com,gkovacic23@gmail.com,fernando.kirigin@opatija.hr,kirigin@\nhotmail.com,ppi@pristupinfo.hr,pisarnica@pristupinfo.hr,marija.picek@pristupinfo.hr,\ntajnistvo@uskok.dorh.hr, Subject: Zahtjevi za pristup dokumentaciji za istrage i sudske postupke.\nK", "orisnik prava na pristup informacijama je dana 17. veljače 2025.g. podnio gotovo identične zahtjeve -\nnjih 21., za sve osobe koje i u ovim zahtjevima pobrojava, s tim da je sada uključio dodatno i judašicu\n(judoku) Ninu Simić, te traži istu dokumentaciju – realizaciju po kalendarskim godinama. Dana\n03.03.2025.g. tijelo javne vlasti – Hrvatski judo savez- donio je Rješenje kojim odbija podnositelja u odnosu\nna sve podnesene zahtjeve. Nije poznato ", "da li je podnositelj zahtjeva na to Rješenje kojim se kumulativno\nrješavalo od 21. zahtjevu podnio žalbu Povjereniku za informiranje.Tekst e-maila od 11.08.2025.g. koji prati sada 25. podnesena zahtjeva nejasan je i konfuzan u smislu\nrazloga traženja pristupa informacijama, pa se tijelo javne vlasti neće u ovom Rješenju posebno referirati\nna taj tekst. Obzirom je u odnosu na podnositelja zahtjeva pravno situacija nepromijenjena, odnosno sve\nokoln", "osti su identične onima u ožujku 2025.godine (trajanje sudskog postupka), to je tijelo javne vlasti\nodlučilo kako se u dispozitivu navodi.\nOdredbom članka 23. stavkom 6., točka 1. Zakona o pravu na pristup informacijama propisano je da će\ntijelo javne vlasti rješenjem odbiti zahtjev ako se ispune uvjeti propisani u članku 15. stavku 1. citiranog\nZakona.\nObzirom je situacija nepromijenjena, odnosno i dalje se pred Općinskim kaznenim sudom u Zagreb", "u vodi\nkazneni postupak, poslovni broj: K-240/2022, privatni tužitelj HJS, optuženik Miljenko Cvjetko, datum\npokretanja postupka 18.02.2022.g., radi kaznenog djela iz čl.147 st.2. Kaznenog zakona – Uvreda –\nkaznena djela protiv časti i ugleda, to za vrijeme trajanja postupka tijelo javne vlasti ima zakonsku obvezu\nograničavanja pristupa informacijama. Zatražene informacije referiraju se i na citirani kazneni postupak.\nNadalje, odredbom članka 23.", " stavkom 6. točkom 5. Zakona o pravu na pristup informacijama, propisano\nje da će tijelo javne vlasti rješenjem odbiti zahtjev ako jedan ili više međusobno povezanih podnositelja\nputem jednog ili više funkcionalno povezanih zahtjeva očito zloupotrebljava pravo na pristup\ninformacijama, a osobito kada zbog učestalih zahtjeva za dostavu istih ili istovrsnih informacija ili zahtjeva\nkojima se traži velik broj informacija dolazi do opterećivanja rada", " i redovitog funkcioniranja tijela javne\nvlasti.\nPodnositelj je podnio istog dana 11.08.2025.g. ukupno 25 zahtjeva, koji zahtjevi su sadržajno identični u\nsmislu dokumenta koji se traži - realizacija, te u odnosu na veći broj osoba i za dugi vremenski period (\n2020—2024.g.), gdje bi sve i da nema sudskog kaznenog postupka kao zapreke udovoljavanja tolikom\nbroju zahtjeva, bilo evidentno opterećivanje rada i redovnog funkcioniranja tijela javne vla", "sti.\nPonašanje podnositelja u smislu podnošenja tolikog broja zahtjeva potvrđuje da isti koristi pravo na\npristup informacijama suprotno njegovoj svrsi, odnosno zbog razloga koji se ne mogu povezati s javnim\ninteresom, te da isti ne postupa s ciljem pribavljanja informacija od javnog značaja.\nS obzirom na prethodno navedeno, odlučeno je kao u izreci ovoga rješenja.\nUPUTA O PRAVNOM LIJEKU: Protiv ovog rješenja može se izjaviti Žalba Povjereniku za", " informiranje u Zagrebu, Trg Žrtava fašizma 3, u roku od 15 dana od dana\ndostave Rješenja. Žalba se izjavljuje putem tijela javne vlasti.\nSlužbenik za informiranje\nHRVATSKOG JUDO SAVEZA\nDEAN BOGIĆ\n___ __________________________\nDostaviti:\nPoštom na adresu MILJENKO CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb\ne-mailom : miljenko.cvjetko@gmail.com"]