{"**STATUT**": "", "**GRAĐANSKOG NOGOMETNOG KLUBA \"DINAMO\"**": {"**I. UVODNE ODREDBE**": "", "**Članak 1.**": {"**Članak 4.**": {"**Članak 5.**": ["(1) Klub je osnovan 26. travnja 1911. pod nazivom I. Hrvatski građanski športski klub u Zagrebu (u daljnjem tekstu: Građanski).", "(2) Obilježja Kluba su grb (znak) i plava boja, koja slijede izgled obilježja i sportsku tradiciju Građanskog.", "(3) Grb (znak) Kluba je kružnog oblika i simbolizira oblik nogometne lopte, a što ukazuje na osnovnu djelatnost Kluba.", "(4) Osnova grba (znaka) sastavljena je od dva polukruga: povijesnog hrvatskog grba s naizmjeničnim crvenim i bijelim poljima te tradicionalnog u plavoj boji Grada Zagreba s bijelim slovom \"d\" koje predstavlja početno slovo naziva Kluba u dijelu \"Dinamo\".", "(5) Sve linije unutar grba (znaka) i rub grba (znaka) su zlatne boje.", "(6) Žig Kluba prati obilježja grba, pečata i drugih znakova Kluba.", "(7) Iznimno od odredaba stavaka 3.-5. ovog članka Statuta, Klub može koristiti dijelove grba (znaka) kao sastavni dio drugih amblema odnosno znakova, pod uvjetom da se time ne vrijeđa ugled i dostojanstvo Kluba."], "**Članak 6.**": ["(1) Upravljanje Klubom temelji se na načelu demokratskog ustroja. Klubom, na način propisan odredbama ovog Statuta, upravljaju članovi Kluba, neposredno ili putem svojih izabranih predstavnika u tijelima Kluba..", "(2) O promjeni naziva Kluba u dijelu \"Dinamo\", grba (znaka), boje, trajne lokacije stadiona, preoblikovanja, pripajanja, spajanja ili podjele Kluba te dobrovoljnog prestanka rada Kluba raspisuje se, sukladno članku 55. ovog Statuta, referendum svih članova Kluba s pravom glasa."], "**Članak 7.**": "Klub zastupaju Predsjednik Kluba, Predsjednik Nadzornog odbora Kluba i Uprava Kluba, sukladno odredbama ovog Statuta."}}, "**Članak 8.**": "(1) Klub:\n\n['a. postupa sukladno Pravilima nogometne igre koje je donio Međunarodni nogometni savez BORD (IFAB);', 'b. poštuje načela privrženosti, integriteta i sportskog ponašanja kao izraza fairplaya;', 'c. poštuje statut, pravilnike i odluke FIFA-e i UEFA-e i Hrvatskog nogometnog saveza (HNS) u svako vrijeme;', 'd. priznaje nadležnost Arbitražnog suda za sport (CAS) u Lausanni (Švicarska), kao što je utvrđeno relevantnim odredbama Statuta FIFA-e, UEFA-e;', 'e. priznaje nadležnost Arbitražnog suda HNS-a i sukladno tome podnosit će sve sporove nacionalnih razmjera, koji su nastali iz ili u vezi s primjenom Statuta ili pravilnika HNS-a, u posljednjoj instanci samo tim arbitražama, koje rješavaju svoje sporove, isključujući svaki redovni sud, osim ukoliko je to izričito zabranjeno važećim zakonodavstvom u Republici Hrvatskoj.', '(2) U slučaju sporova za koje su nadležna pravosudna tijela FIFA-e, UEFA-e, CAS-a, Arbitražnog suda Saveza ili pravnih tijela Saveza, Klub se obvezuje da spor neće iznositi pred redovne sudove.', '(3) Klub poštuje sve odluke nadležnih tijela HNS-a, FIFA-e i UEFA-e i CAS-a.']", "**Članak 9.**": ["(1) Klub je neutralan po pitanjima politike i vjere.", "(2) Diskriminacija bilo koje vrste prema osobama temeljena na osnovi rase ili etničke pripadnosti, nacionalnog ili socijalnog podrijetla, vjere, spola, jeziku, političkog uvjerenja i ostalim razlozima propisanim posebnim propisima o suzbijanju diskriminacije zabranjena je te predstavlja razlog za isključenje iz Kluba u stegovnom postupku."]}, "**II. VIZIJA, MISIJA, SVRHA, CILJEVI, NAČELA TE PODRUČJE DJELOVANJA I DJELATNOSTI KLUBA**": "", "**Članak 10.**": {"(3) Društveni utjecaj i zajednica:": ["a. Biti središnje mjesto okupljanja članova, osobito djece i mladih, kroz organizaciju škola nogometa i poticanje sportskog načina života.", "b. Aktivno doprinositi lokalnoj zajednici kroz društveno odgovorne projekte, s posebnim naglaskom na mlade i ranjive skupine.", "c. Sustavno izgrađivati povjerenje među članovima i navijačima Kluba kroz otvoren dijalog i uključivanje u odlučivanje, temeljem participativnog modela upravljanja.", "(4) Klub sukladno ciljevima djeluje na području sporta."], "**Članak 16.**": ["(1) Djelovanje Kluba je javno, a ostvaruje se putem:", ["a. internetskih stranica Kluba, aplikacija i društvenih mreža;", "b. javnih medija;", "c. povjerenika Kluba;", "d. skupovima za članove koji se organiziraju najmanje jednom godišnje;", "e. ostalih načina informiranja sukladno odluci Uprave Kluba."], "(2) Članove Kluba pravodobno se obavještava o radu Kluba te aktima i odlukama njegovih tijela. Statut, Pravilnik o izborima u GNK \"Dinamo\" te godišnja financijska izvješća i revizorski nalazi moraju biti dostupni članovima Kluba na odgovarajući način.", "(3) O načinu javnosti rada Kluba i obavještavanja članova odluku donosi Uprava Kluba."]}, "**Članak 17.**": ["(1) Klub se može udružiti u saveze udruga, zajednice, mreže i u međunarodne udruge.", "(2) Odluku o udruživanju donosi Skupština Kluba."], "**III. ČLANOVI KLUBA, PRIJATELJI KLUBA I POVJERENICI KLUBA**": "", "**1. ČLANOVI KLUBA**": {"**Članak 21.**": {"**Članak 22.**": "Dužnosti i odgovornosti članova Kluba su:\n\n['a. poštovati načela djelovanja, Statut te druge akte i odluke Kluba;', 'b. podupirati Klub i aktivno sudjelovati u ostvarenju ciljeva Kluba;', 'c. obavijestiti Klub o promjeni osobnog imena te adresi prebivališta ili boravišta;', 'd. štititi ugled i dostojanstvo Kluba suzdržavajući se od ponašanja i radnji koje štete Klubu te njegovu ugledu, časti i dostojanstvu.']"}, "**Članak 23.**": "Igrači, članovi Uprave Kluba i zaposlenici Kluba koji su članovi Kluba te povjerenici Kluba, pored prava, dužnosti i odgovornosti iz članaka 21. i 22. ovog Statuta, imaju i druga prava, obveze i odgovornosti utvrđene ugovorima te odlukama tijela Kluba."}, "**Članak 24.**": {"**2. PRIJATELJI KLUBA**": "**Članak 26.**\n\n['(1) Prijatelj Kluba može postati fizička osoba iz zemlje ili inozemstva koja moralno i materijalno podupire načela djelovanja Kluba. Prijatelj Kluba nije član Kluba, no može, u skladu s propisima, uživati pogodnosti određene posebnim aktom Kluba.', '(2) Prijateljem Kluba postaje se upisom u Popis Prijatelja Kluba koji vodi stručna služba po odluci Uprave Kluba. Popis Prijatelja Kluba ne mora sadržavati OIB.', '(3) Prijatelji Kluba ne mogu birati ili biti birani u tijela Kluba, niti sudjelovati u izbornim postupcima ili referendumu, ali mogu biti izabrani u savjetodavne odbore i povjerenstva koje osniva Nadzorni odbor.', '(4) Prijatelju Kluba izdaje se iskaznica čiji izgled definira Uprava Kluba.', '(5) Prijatelj Kluba ne može biti osoba koja svojim ponašanjem i radnjama nanosi materijalnu ili nematerijalnu štetu Klubu te koja nasilničkim, diskriminatornim i rasističkim ponašanjem radnjama onemogućava ostvarenje ciljeva i obavljanje djelatnosti te šteti ugledu Kluba.', '(6) Prijatelji Kluba imaju pravo biti pravodobno obavještavani o radu Kluba i aktima i odlukama njegovih tijela na način propisan Statutom, posebnim aktima i odlukama Uprave te komunicirati pisano i putem skupova za članove s tijelima Kluba u okviru njihove nadležnosti i dobiti pravodobne odgovore, a dužni su poštivati Statut i druge akte Kluba, podupirati Klub te suzdržavati se od ponašanja i radnji koje štete Klubu i njegovu ugledu.', '(7) Osoba prestaje biti Prijateljem Kluba istekom kalendarske godine, temeljem izjave da ne želi više biti Prijatelj Kluba, smrću ili odlukom o prestanku statusa Prijatelja Kluba u stegovnom postupku sukladno odredbi članka 25. ovog Statuta. U slučaju da Prijatelj Kluba ispuni uvjete za članstvo i učlani se u Klub, prestaje mu status Prijatelja Kluba i briše se iz popisa Prijatelja Kluba.', '(8) Prijateljima Kluba mogu se izreći stegovne mjere opomena i prestanak statusa Prijatelja Kluba na način i pod uvjetima propisanim u članku 25. ovog Statuta.', '(9) Posebnim aktom Uprave Kluba detaljnije se uređuju pitanja vezana za proceduru stjecanja statusa Prijatelja Kluba, pogodnostima, obnavljanju i prestanku statusa Prijatelja Kluba.', '(10) Visinu naknade za Prijatelje Kluba određuje Nadzorni odbor, a jednaka je visini članarine za članove Kluba.']", "**3. POVJERENICI KLUBA**": "**Članak 27.**\n\n['(1) Povjerenik može biti svaki član Kluba koji je podnio zamolbu i koji ispunjava sljedeće uvjete:', ['a. da je punoljetna i poslovno sposobna osoba;', 'b. da je u trenutku podnošenja zamolbe član Kluba, pod uvjetom da je bio član Kluba i u prethodnoj kalendarskoj godini;', 'c. da je prije podnošenja zamolbe, u kalendarskoj godini u kojoj je podnio zamolbu, na njegovu preporuku u Klub učlanjeno najmanje 50 članova Kluba;', 'd. da ne postoje zapreke iz ovog Statuta.'], '(2) Odluku o imenovanju i razrješenju povjerenika donosi Uprava Kluba. Povjerenik može Upravi Kluba podnijeti i ostavku na mjesto povjerenika.', '(3) Povjerenik je dužan poticati učlanjivanje novih članova Kluba i upisivanje novih Prijatelja Kluba te ih izvještavati o drugim važnim temama koje se odnose na ostvarivanje ciljeva Kluba i obavljanje njegove djelatnosti te je dužan, u slučajevima propisanim člankom 52. ovog Statuta, sudjelovati na izborima kao kandidat za člana Skupštine Kluba.', '(4) Uprava Kluba svojim odlukama uređuje odnose s povjerenicima i s imenovanim povjerenikom može zaključiti ugovor o međusobnim pravima i obvezama.']", "**IV. TIJELA KLUBA**": "", "**Članak 28.**": {"**Članak 29.**": ["(1) Članovi tijela Kluba mogu biti samo punoljetni i poslovno sposobni članovi Kluba pod uvjetom da su isti bili članovi Kluba i u kalendarskoj godini koja prethodi godini u kojoj se održavaju izbori, osim u slučaju imenovanja članova Uprave Kluba.", "(2) Članovi klupskih tijela ne mogu biti osobe za koje postoje zapreke iz Zakona o sportu i Zakona o udrugama.", "(3) Članovi tijela Kluba niti Počasni predsjednik Kluba, uz razloge iz stavka 2. ovog članka Statuta ne mogu biti osobe:", ["a. koje su aktivni nogometni sudac, ili osoba koja je to bila u posljednje 3 (tri) godine;", "b. koje ne mogu biti članovi Uprave odnosno nadzornog odbora dioničkog društva prema odredbama Zakona o trgovačkim društvima i Zakona o sprječavanju sukoba interesa u obnašanju javnih dužnosti;", "c. koji su dioničari ili članovi drugog nogometnog kluba;", "d. koje svojim djelovanjem mogu neposredno utjecati na sustav natjecanja u nogometnom sportu, a osobito sportaši koji su profesionalci prema Zakonu o sportu, menadžeri i posrednici u sportu, kao i osobe koje su to bile u razdoblju od posljednjih godinu dana;", "e. koje su posljednjih godinu dana bile članovi ili članovi tijela pravne osobe koja obavlja djelatnost organiziranja sportske kladionice;", "f. koje s menadžerima i posrednicima u istome sportu i članovima pravnih osoba te članovima tijela pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica djeluju zajednički;", "g. koje imaju ili su posljednjih godinu dana imale sklopljen ugovor s nogometašem ili nogometnim trenerom na temelju kojega ostvaruje pravo na dio prihoda koji proizlaze iz obavljanja djelatnosti nogometaša ili nogometnog trenera ili djeluju zajednički s takvim osobama;", "h. koje su ovlaštene za zastupanje u pravnoj osobi koja sukladno Zakonu o sportu ima sklopljene ugovore o ulaganju u fizičke osobe u nogometu;", "i. koje su u posljednje tri godine pravomoćno kažnjene za kaznena djela ili prekršaje u sportu i u vezi sa sportom i sportskim natjecanjima;", "j. koje su pravomoćno osuđene na kaznu zatvora u trajanju od najmanje 6 (šest) mjeseci za neko od kaznenih djela počinjena s namjerom, a nije primijenjena uvjetna osuda godinu dana od odsluženja kazne;", "k. koje ne ispunjavaju druge uvjete propisane Zakonom o sportu i drugim zakonima;"], "l. koje su aktivni igrač, trener ili zaposlenik Kluba, a ako to postanu tijekom mandata u tijelima Kluba, prestaje im mandat i članstvo u tijelu Kluba, osim članovima Uprave Kluba za članstvo i zaposlenički odnos u Upravi, kao što niti Predsjedniku za njegov zaposlenički odnos i profesionalne dužnosti ne prestaje mandat i članstvo u tijelima koji proizlaze iz funkcije Predsjednika prema ovom Statutu.", "(4) Svaki član Kluba koji ulazi u bilo koje tijelo Kluba mora potpisati izjavu kojom izjavljuje da nema zapreka iz stavaka 2. i 3. ovog članka Statuta te da će u slučaju nastupa istih odmah obavijestiti Upravu Kluba.", "(5) Ukoliko se na izborima za Skupštinu Kluba kandidiraju zaposlenici Kluba, izbor u Skupštinu Kluba predstavlja razlog za prestanak ugovora o radu i/ili sličnih ugovora koje imaju zaključene s Klubom. Iznimno, ako se na izborima kao nositelj liste za svoj drugi mandat kandidira Predsjednik, ne prestaje mu ugovor tijekom izbornog postupka.", "(6) Članovi tijela Kluba, Počasni predsjednik Kluba, članovi Izbornog povjerenstva, povjerenici Kluba i članovi odbora koje osniva Nadzorni odbor mogu, prema odluci Uprave uz prethodno odobrenje Predsjednika Kluba, primati naknadu koja može biti i nagrada materijalne naravi, ili da s ostalim osobama koje Klub želi nagraditi, budu gosti na domaćim i/ili gostujućim utakmica Kluba."]}}, "**Članak 30.**": "Mandat članovima tijela Kluba prestaje istekom mandata ili:\n\n['a. smrću;', 'b. pisanom ili zapisnikom konstatiranom ostavkom;', 'c. razrješenjem;', 'd. trenutkom izbora novog saziva tijela Kluba;', 'e. gubitkom poslovne sposobnosti;', 'f. prestankom članstva u Klubu sukladno članka 24. stavaka 2. i 4. ovog Statuta;', 'g. nastupom okolnosti iz članka 29. stavaka 2. i 3. ovog Statuta.']", "**1. SKUPŠTINA**": {"**Članak 31.**": ["(1) Skupština je najviše tijelo Kluba.", "(2) Skupština se sastoji od 50 (pedeset) predstavnika članova Kluba izabranih na način propisan odredbama ovog Statuta.", "(3) Mandat članova Skupštine, osim u slučajevima propisanim člankom 30. točkama a., b., d., e., f. i g. ovog Statuta, je 5 (pet) godina te isti članovi mogu biti izabrani na novo mandatno razdoblje."], "**Članak 34.**": {"**Članak 35.**": {"**Članak 36.**": ["(1) Sjednicama Skupštine predsjeda Predsjednik Nadzornog odbora, a u slučaju njegove spriječenosti Zamjenik Predsjednika Nadzornog odbora, a u slučaju spriječenosti Predsjednika Nadzornog odbora i Zamjenika Predsjednika Nadzornog odbora najstariji (po datumu rođenja) nazočni član Nadzornog odbora (dalje u tekstu i: Predsjedavajući Skupštine). Iznimno, ako prestane mandat svim članovima Nadzornog odbora ili broj članova Nadzornog odbora padne ispod broja 5 (pet), Predsjedavajući Skupštine na izvanrednoj sjednici Skupštine je Predsjednik Kluba.", "(2) Skupština započinje verificiranjem konačnog popisa svih članova Skupštine, utvrđivanjem prisutnog broja članova Skupštine od strane Predsjedavajućeg Skupštine te izborom članova Radnog predsjedništva Skupštine.", "(3) Radno predsjedništvo Skupštine rukovodi Radom Skupštine, a sastoji se od Predsjedavajućeg Skupštine te 2 (dva) člana Skupštine koja izabire Predsjedavajući Skupštine.", "(4) Skupština sve verifikacije u svojoj nadležnosti obavlja javnim čitanjem u zapisnik.", "(5) Na izbornoj sjednici Skupštine, do izbora Predsjednika Kluba, Predsjednika Nadzornog odbora i Zamjenika Predsjednika Nadzornog odbora, sjednicom Skupštine predsjeda nositelj izborne liste koja je na izborima ostvarila veći broj glasova članova Kluba. Nakon izbora Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te ostalih članova Nadzornog odbora, nositelja izborne liste koja je na izborima ostvarila veći broj glasova članova Kluba zamjenjuje Predsjednik Nadzornog odbora kao predsjedavajućeg skupštine.", "(6) O radu sjednice Skupštine vodi se zapisnik koji se trajno čuva u arhivi Kluba, a kojeg potpisuju Predsjedavajući Skupštine i zapisničar.", "(7) Uprava dostavlja zapisnik sa sjednica Skupštine nadležnom uredu koji vodi registar udruga."]}}}, "**2. NADZORNI ODBOR**": {"**Članak 39.**": "Nadzorni odbor Kluba:\n\n['a. nadzire provedbu općih načela djelovanja Kluba te štiti i promiče njegov identitet, povijest, vrijednosti i članska prava;', 'b. skrbi o financijskom, pravnom i gospodarskom poslovanju Kluba te o raspolaganju njegovom imovinom;', 'c. radi procjene financijskog poslovanja Kluba mora angažirati neovisnog vanjskog revizora jednom godišnje. Izvješće neovisnog revizora sastavni je dio izvješća o radu Nadzornog odbora.', 'd. nadzire provedbu odluka Skupštine, strateških smjernica, godišnjeg plana rada, financijskog plana i Izbornog programa Kluba;', 'e. daje prethodnu suglasnost Predsjedniku Kluba za imenovanje i razrješenje članova Uprave;', 'f. pomaže Predsjedniku u određivanju operativnih i strateških ciljeva te zaduženja članovima Uprave i nadzire njihovu provedbu;', 'g. odobrava prijedlog Predsjednika i Uprave u vezi godišnjeg plana rada i financijskog plana Kluba te godišnjeg financijskog izvješća i izvješća o radu Kluba;', 'h. u suradnji s Predsjednikom, redovno provodi formalnu evaluaciju rada svakog člana Uprave, uzimajući u obzir ostvarenje ciljeva i poštivanje vrednota Kluba;', 'i. nadzire rad Predsjednika i Uprave te u vezi toga može izdavati naputke, i zahtijevati izvješća i dokumentaciju te sazivati dodatne koordinacijske sastanke;', 'j. daje prethodnu suglasnost za pravne poslove i zaduženja Kluba iznad iznosa od 3.000.000 EUR (tri milijuna eura) te za provizije i podjele kod transfera koje prelaze 10% (deset posto) vrijednosti ugovora;', 'k. obavještava nadležna tijela Kluba o neusklađenostima u radu ili aktima s odredbama Statuta i drugih akata te, ukoliko iste ne budu ispravljene, o tome izvješćuje Skupštinu;', 'l. saziva izbore putem Predsjednika Nadzornog odbora te osniva, nadzire i razrješava Izborno povjerenstvo i pojedine njegove članove isključivo iz razloga propisanih ovim Statutom i Pravilnikom o izborima u GNK \"Dinamo\" nakon čega provodi poziv za nove članove', 'm. rješava sukobe interesa i sporove unutar Kluba;', 'n. djeluje kao drugostupanjsko tijelo u stegovnim postupcima koji se odnose na članska prava i obveze te donosi konačne odluke o stegovnim mjerama;', 'o. predlaže izmjene i dopune Statuta, osim u slučajevima propisanim odredbama ovog Statuta, predlaže Pravilnik o izborima u GNK \"Dinamo\", kao i pravila o etičkim pitanjima i pitanjima sukoba interesa;', 'p. donosi odluke o iznosu članarine i naknade za Prijatelje Kluba;', 'q. može osnivati savjetodavne odbore i povjerenstva za potrebe učinkovitijeg rada Kluba, a u aktu o osnivanju određuje njihov sastav, trajanje mandata, svrhu i zadaće;', 'r. daje prethodnu suglasnost Predsjedniku i Upravi za donošenje Pravilnika o djelokrugu i unutarnjem ustrojstvu Kluba u njegovom dijelu kojim se uređuje djelokrug rada pojedinih članova Uprave;', 's. donosi Poslovnik o radu Nadzornog odbora te druge opće akte unutar djelokruga svog rada;', 't. podnosi Skupštini prijedloge za imenovanje Počasnog Predsjednika, počasna odlikovanja članova Kluba za doprinos Klubu ili za dugotrajno članstvo;', 'u. obavlja i druge poslove u skladu sa zakonima, ovim Statutom i općim aktima Kluba.']", "**Članak 40.**": ["(1) Sjednice Nadzornog odbora saziva Predsjednik Nadzornog odbora, a u slučaju njegove spriječenosti Zamjenik Predsjednika Nadzornog odbora, a u slučaju spriječenosti Predsjednika Nadzornog odbora i Zamjenika Predsjednika Nadzornog odbora najstariji (po datumu rođenja) član Nadzornog odbora.", "(2) Sjednice Nadzornog odbora sazivaju se prema potrebi, a najmanje 10 (deset) puta godišnje.", "(3) Sjednica Nadzornog odbora mora se sazvati:", ["a. kada to pisanim zahtjevom zatraži većina članova Nadzornog odbora;", "b. kada to pisanim zahtjevom zatraži Predsjednik Kluba i to za ishođenje prethodne suglasnosti za pravne poslove iznad iznosa od 3.000.000 EUR (tri milijuna eura),"], "ishođenje prethodne suglasnosti za provizije i podjele kod transfera koje prelaze 10% (deset posto) vrijednosti ugovora te za izbor ili razrješenje članova Uprave Kluba;", "c. kada privremena spriječenost Predsjednika Kluba traje dulje od 7 (sedam) dana;", "d. kada prestane mandat Predsjedniku Kluba iz razloga propisanih člankom 44. ovog Statuta.", "(4) Predsjednik Nadzornog odbora ili osoba koja ga sukladno stavku 1. ovog članka Statuta zamjenjuje mora sazvati sjednicu Nadzornog odbora u roku od 24 (dvadeset četiri) sata od saznanja za nastup okolnosti iz stavka 3. ovog članka Statuta ili primitka pisanog zahtjeva većine članova Nadzornog odbora ili Predsjednika Kluba, a sjednica Nadzornog odbora mora se održati najkasnije u roku od 3 (tri) dana od dana sazivanja.", "(5) Ako Predsjednik Nadzornog odbora ili osoba koje ga sukladno stavku 1. ovog članka Statuta zamjenjuje, u roku iz stavka 4. ovog članka Statuta, ne sazove sjednicu na pisani zahtjev većine članova Nadzornog odbora, sjednicu može sazvati većina članova Nadzornog odbora na način da svi predlagatelji potpišu poziv kojim se saziva sjednica Nadzornog odbora.", "(6) Ako Predsjednik Nadzornog odbora ili osoba koje ga sukladno stavku 1. ovog članka Statuta zamjenjuje, u roku iz stavka 4. ovog članka Statuta, ne sazove sjednicu na pisani zahtjev Predsjednika Kluba, Predsjednik Kluba ovlašten je donijeti odluku bez prethodne suglasnosti Nadzornog odbora.", "(7) Nadzorni odbor odlučuje pravovaljano ako je na sjednici nazočna natpolovična većina članova, a odluke donosi većinom glasova nazočnih članova.", "(8) U slučaju izjednačenog broja glasova kod donošenja odluka Nadzornog odbora odlučujući je glas Predsjednika Nadzornog odbora ili osobe koje ga sukladno stavku 1. ovog članka Statuta zamjenjuje.", "(9) Način i uvjete svog rada Nadzorni odbor uređuje Poslovnikom o radu Nadzornog odbora."], "**3. PREDSJEDNIK KLUBA**": {"**Članak 43.**": ["(1) Predsjednik Kluba predstavlja i zastupa Klub, provodi strateške odluke, imenuje i razrješava članove Uprave te usmjerava i nadzire rad Uprave.", "(2) Mandat Predsjednika Kluba, osim u slučajevima propisanim člankom 44. ovog Statuta, je 5 (pet) godina i ograničen je na dva mandata.", "(3) Za svoj rad Predsjednik Kluba odgovara Nadzornom odboru i Skupštini Kluba.", "(4) Predsjednik Kluba odgovoran je za zakonitost rada Kluba, provođenje strateških odluka Skupštine i ostvarenje ciljeva Kluba utvrđenih Izbornim programom."]}, "**Članak 44.**": {"**Članak 45.**": {"Predsjednik Kluba:": ["a. predstavlja i zastupa Klub samostalno i pojedinačno u pravnom prometu, osim u poslovima za koje mu je potreban supotpis člana Uprave i/ili prethodna suglasnost Nadzornog odbora;", "b. imenuje i razrješava članove Uprave te sklapa i raskida s njima ugovore o radu, uz prethodnu suglasnost Nadzornog odbora;", "c. u suradnji s Nadzornim odborom, određuje operativne ciljeve i zaduženja članovima Uprave te nadzire njihovu provedbu;", "d. usmjerava i nadzire rad Uprave;", "e. u suradnji s Nadzornim odborom, redovno provodi formalnu evaluaciju rada svakog člana Uprave;", "f. u suradnji s Upravom, predlaže Skupštini godišnji plan rada i financijski plan Kluba te je, nakon njihova usvajanja, odgovoran za njihovo provođenje;", "g. samostalno i pojedinačno zastupa Klub u pravnim poslovima ukupne vrijednosti do 100.000,00 EUR (sto tisuća eura);", "h. zastupa Klub u pravnim poslovima ukupne vrijednosti iznad 100.000,00 EUR (sto tisuća eura) do 3.000.000,00 EUR (tri milijuna eura), uz supotpis jednog člana Uprave;", "i. zastupa Klub u pravnim poslovima pojedinačne vrijednosti iznad 3.000.000,00 EUR (tri milijuna eura) te u poslovima kod kojih provizije i podjele kod transfera prelaze 10% (deset posto) vrijednosti ugovora, uz prethodnu suglasnost Nadzornog odbora te uz supotpis jednog člana Uprave;", "j. skrbi o zakonitosti i statutarnosti rada Kluba te o provođenju općih načela djelovanja Kluba;", "k. u suradnji s Upravom priprema i podnosi Skupštini godišnje financijsko izvješće i izvješće o radu Kluba;", "l. u suradnji s Upravom, podnosi Nadzornom odboru kvartalna i godišnja izvješća te dodatna izvješća na zahtjev Nadzornog odbora;", "m. djeluje samostalno u okviru ovlasti definiranih ovim Statutom, pri čemu je dužan sazvati sjednicu Uprave radi savjetovanja i odlučivanja u slučajevima koji uključuju promjene strateškog smjera Kluba, reorganizaciju poslovanja, donošenje planova zapošljavanja i svih odluka koje nadilaze njegove pojedinačne ovlasti ili za koje ovim Statutom nije izričito propisana njegova samostalna nadležnost;", "n. obavlja i druge poslove u skladu sa zakonima, ovim Statutom i općim aktima Kluba."]}}, "**4. UPRAVA KLUBA**": "", "**Članak 46.**": ["(1) Uprava Kluba je izvršno tijelo koje operativno vodi poslovanje Kluba, u skladu sa smjernicama i odlukama Predsjednika Kluba i Nadzornog odbora.", "(2) Uprava Kluba upravlja radom stručnih službi i zaposlenika Kluba u skladu s odredbama ovog Statuta, općih akata Kluba te odlukama Predsjednika Kluba i Nadzornog odbora, kada je on odredbama ovog Statuta ovlašten za takve odluke.", "(3) Uprava Kluba sastoji se od 2 (dva) do 4 (četiri) člana koje imenuje i razrješava Predsjednik Kluba, uz prethodnu suglasnost Nadzornog odbora.", "(4) Mandat članova Uprave, osim u slučajevima iz članka 30. točaka a., b., c., d., e. i g. Ovog Statuta, traje najdulje 5 (pet) godina te isti članovi mogu biti izabrani na nova mandatna razdoblja.", "(5) Članovi Uprave ne mogu biti članovi drugih tijela Kluba.", "(6) Za svoj rad i rad stručnih službi članovi Uprave odgovorni su Predsjedniku Kluba, a zajedno s Predsjednikom Kluba odgovorni su Nadzornom odboru i Skupštini.", "(7) Uprava odluke donosi na način propisan člankom 47. ovog Statuta te zastupa Klub u pravnim poslovima pojedinačne vrijednosti do iznosa od 100.000,00 EUR (sto tisuća eura) na način da Klub skupno zastupaju najmanje dva člana Uprave."]}, "**Članak 47.**": ["(1) Uprava odluke iz svoje nadležnosti u pravilu donosi na sjednicama Uprave.", "(2) Sjednice Uprave, prema potrebi, saziva bilo koji član Uprave, a može ih sazvati i Predsjednik Kluba ili osoba iz članka 44. stavka 1. ovog Statuta.", "(3) Predsjednik Kluba ili osoba iz članka 44. stavka 1. ovog Statuta dužna je sazvati sjednicu Uprave prije donošenja:", ["a. strateških odluka;", "b. odluka o pravnim poslovima pojedinačne vrijednosti iznad 500.000 EUR (petsto tisuća eura);", "c. odluka koje imaju za posljedicu promjenu organizacijske strukture ili sklapanje ili raskid ugovora sa zaposlenicima ili osobama koje obavljaju određene poslove, a koje za svoj rad odgovaraju izravno Upravi;", "d. ostalih odluka za koje je odredbama ovog Statuta propisano da se donose na sjednicama Uprave;", "e. odluka o izvješćima koja Predsjednik i Uprava podnose Nadzornom odboru i/ili Skupštini."], "(4) Uprava je dužna održati minimalno 10 (deset) sjednica godišnje.", "(5) Uprava na sjednici odlučuje pravovaljano ako je na sjednici nazočna natpolovična većina ukupnog broja članova Uprave.", "(6) Predsjednik Kluba ima pravo biti obaviješten o sjednicama Uprave te sudjelovati u radu sjednice Uprave s pravom glasa i, ukoliko je prisutan na sjednici Uprave, smatra se dijelom kvoruma za odlučivanje.", "(7) Na sjednicama Uprave odluke se donose većinom glasova nazočnih članova Uprave. U slučaju izjednačenog broja glasova članova Uprave odlučujući je glas Predsjednika Kluba ili osobe iz članka 44. stavka 1. ovog Statuta.", "(8) Načine i uvjete svog rada Uprava Kluba uređuje Poslovnikom o radu Uprave, uz suglasnost Predsjednika Kluba."], "**Članak 48.**": "Uprava Kluba:\n\n['a. operativno upravlja radom Kluba i za svoj rad odgovorna je Predsjedniku Kluba;', 'b. s Predsjednikom Kluba donosi Pravilnik o djelokrugu i unutarnjem ustrojstvu Kluba, kojim se uređuju nadležnosti članova Uprave i organizacija rada Kluba, a uz prethodnu suglasnost Nadzornog odbora za dio u kojem se uređuje djelokrug rada pojedinih članova Uprave;', 'c. zastupa Klub u pravnim poslovima pojedinačne vrijednosti do iznosa od 100.000,00 EUR (sto tisuća eura) na način da Klub skupno zastupaju najmanje dva člana Uprave;', 'd. u suradnji s Predsjednikom, priprema i predlaže Skupštini godišnji plan rada i financijski plan Kluba;', 'e. u suradnji s Predsjednikom, priprema i podnosi Skupštini godišnje financijsko izvješće i izvješće o radu Kluba;', 'f. u suradnji s Predsjednikom, podnosi Nadzornom odboru kvartalna i godišnja izvješća te dodatna izvješća na zahtjev Nadzornog odbora;', 'g. upravlja imovinom Kluba u okviru ovlasti i djelokruga svakog člana Uprave;', 'h. sklapa i raskida ugovore o radu s ostalim zaposlenicima Kluba, osim s Predsjednikom i članovima Uprave;', 'i. donosi interne akte Kluba u skladu sa Statutom i odlukama nadležnih tijela Kluba;', 'j. organizira i nadzire sportsku, poslovnu i stručnu politiku Kluba, osim u pitanjima koja su u isključivoj nadležnosti Predsjednika Kluba;', 'k. osigurava redovito obavještavanje članova Kluba o radu i rezultatima Kluba te odgovara na upite i inicijative članova;', 'l. imenuje članove upravnog odbora Zaklade GNK Dinamo \"Nema predaje\" i nadzire njihov rad, u skladu s posebnim odlukama Skupštine;', 'm. obavlja i druge poslove u skladu sa zakonima, ovim Statutom i općim aktima Kluba.']", "**V. POČASNI PREDSJEDNIK KLUBA**": {"**Članak 49.**": ["(1) Klub može imati samo 1 (jednog) Počasnog predsjednika Kluba u isto vrijeme.", "(2) Za Počasnog predsjednika Kluba može biti izabran član Kluba koji je svojim izuzetnim sportskim, poslovnim ili društvenim doprinosom pridonio razvoju, ugledu i vrijednostima Kluba.", "(3) Kandidata za Počasnog predsjednika Kluba, pisanim prijedlogom mogu predložiti Nadzorni odbor, najmanje 15 (petnaest) članova Skupštine ili Predsjednik Kluba.", "(4) Počasnog predsjednika Kluba bira Skupština, većinom glasova nazočnih članova.", "(5) Počasni predsjednik Kluba:", ["a. Promiče vrijednosti, identitet i tradiciju Kluba;", "b. Kao predstavnik Kluba sudjeluje na svečanim događanjima, proslavama, članskim okupljanjima i drugim javnim prigodama;", "c. Može biti gost na sastancima s predstavnicima drugih klubova, sponzorima, partnerima i predstavnicima nogometnih saveza;", "d. Ima pravo sudjelovati na sjednicama Skupštine, ali bez prava glasa;", "e. Na poziv Predsjednika Nadzornog odbora, može sudjelovati na sjednicama Nadzornog odbora, ali bez prava glasa;", "f. Može biti savjetnik Predsjedniku Kluba i Nadzornom odboru o strateški važnim pitanjima."], "(6) Počasni predsjednik Kluba ne sudjeluje u donošenju odluka Kluba i ne obavlja izvršne niti upravljačke funkcije.", "(7) Počasni predsjednik Kluba ne smije sudjelovati u izbornim kampanjama niti na bilo koji način iskazivati podršku za pojedine izborne liste ili kandidate.", "(8) Mandat Počasnog predsjednika Kluba nije vremenski ograničen. Iznimno, Skupština ga u slučaju djelovanja protivno interesima, stabilnosti ili časti i ugleda Kluba ili nastupa okolnosti iz članka 29. ovog Statuta, na pisani prijedlog Nadzornog odbora, najmanje 15 (petnaest) članova Skupštine ili Predsjednika Kluba, može razriješiti odlukom donesenom dvotrećinskom većinom svih članova Skupštine.", "(9) Počasni predsjednik ima pravo biti gost Kluba na svim domaćim i gostujućim utakmicama Kluba."], "**VI. IZBORI I REFERENDUM**": "", "**1. IZBORI**": "**Članak 50.**\n\n['(1) Na izborima članovi Kluba s pravom glasa biraju 50 (pedeset) članova Skupštine Kluba.', '(2) Pravo birati i biti birani (pravo glasa) na izborima imaju isključivo punoljetni i poslovno sposobni članovi Kluba, pod uvjetom da su isti bili članovi Kluba i u prethodnoj kalendarskoj godini.', '(3) Izbori mogu biti redovni i izvanredni.', '(4) Redovni izbori održavaju se najranije 180 (sto osamdeset) dana prije kraja redovnog mandata Skupštine, a najkasnije 90 (devedeset) dana nakon isteka redovnog mandata Skupštine te se moraju sazvati najkasnije 45 (četrdeset pet) dana prije dana održavanja izbora.', '(5) Izvanredni izbori sazivaju se najkasnije u roku od 7 (sedam) dana od dana nastupa sljedećih okolnosti:', ['a. odluke Skupštine donesene dvotrećinskom većinom svih članova Skupštine;'], 'b. da i nakon što se iscrpi broj svih zamjenskih članova Skupštine, sukladno članku 35. stavku 5. ovog Statuta, broj članova Skupštine padne ispod 26 (dvadeset šest);', 'c. od dana upisa novog Statuta ili izmjena i/ili dopuna Statuta u Registar udruga Republike Hrvatske, kojima se mijenjaju tijela Kluba, njihov broj članova, nadležnosti i ovlasti ili trajanje mandata od strane nadležnog tijela Grada Zagreba.', '(6) Izvanredni izbori iz stavka 5. ovog članka Statuta moraju se sazvati najkasnije 21 (dvadeset jedan) dan prije dana održavanja izbora.', '(7) Izbore, osim u slučajevima propisanim odredbama ovog Statuta, raspisuje Nadzorni odbor putem Predsjednika Nadzornog odbora Kluba ili osobe koja ga sukladno članku 33. stavku 1. ovog Statuta zamjenjuje.', '(8) Izbore provodi Izborno povjerenstvo sastavljeno od 5 (pet) članova Kluba s pravom glasa koje, na temelju pojedinačnih kandidatura članova Kluba bira Nadzorni odbor. U slučaju da se ne prijavi dovoljan broj kandidata, Nadzorni odbor izabire preostale članove Izbornog povjerenstva između članova Kluba s pravom glasa.', '(9) Nadzorni odbor može razriješiti Izborno povjerenstvo ili pojedine njegove članove iz razloga propisanih odredbama ovog Statuta i Pravilnika o izborima u GNK \"Dinamo\".', '(10) Mandat članova Izbornog povjerenstva traje od dana njihovog izbora od strane Nadzornog odbora do izbora Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora i ostalih članova Nadzornog odbora na izbornoj sjednici Skupštine.']\n\n**Članak 51.**\n\n['(1) Izbori se provode na temelju izbornih lista koje sadrže najmanje 46 (četrdeset šest), a najviše 55 (pedeset pet) kandidata za članove Skupštine Kluba, pri čemu svaka izborna lista obvezno sadrži:', ['a. Kandidata za Predsjednika Kluba koji je ujedno i nositelj te izborne liste, na listi obvezno naveden pod rednim brojem 1 (jedan);', 'b. Kandidata za Predsjednika Nadzornog odbora, na listi obvezno naveden pod rednim brojem 2 (dva);', 'c. Kandidata za Zamjenika Predsjednika Nadzornog odbora, na listi obvezno naveden pod rednim brojem 3 (tri);', 'd. Kandidate za ostale članove Nadzornog odbora, na listi obvezno navedeni pod rednim brojevima od 4 (četiri) do 10 (deset);', 'e. Preostale kandidate za članove Skupštine, na listi obvezno navedeni pod rednim brojevima od (11) jedanaest do najmanje 46 (četrdeset šest), a najviše do 55 (pedeset pet).'], '(2) Svaka izborna lista, pored obveznog sadržaja iz stavka 1. ovog članka Statuta, obvezno sadrži i:', ['a. plan i program upravljanja Klubom koji mora biti dostupan članovima Kluba najkasnije 15 (petnaest) dana prije dana održavanja redovnih izbora, a 5 (pet) dana prije dana održavanja izvanrednih izbora te mora sadržavati i životopis kandidata iz stavka 1. točaka a.-d. ovog članka Statuta;', 'b. potpise podrške najmanje 100 (sto) punoljetnih i poslovno sposobnih članova Kluba s važećim članstvom u trenutku potpisivanja, pod uvjetom da su isti bili članovi Kluba i u prethodnoj kalendarskoj godini.'], '(3) Potpisima podrške, u smislu stavka 2. točke b. ovog članka Statuta, ne smatraju se potpisi samih kandidata na izbornoj listi, a potpisi podrške nužno sadržavaju ime i prezime, brojeve članskih iskaznica te potpis davatelja podrške.', '(4) Izborne liste moraju se dostaviti Izbornom povjerenstvu najkasnije 20 (dvadeset) dana prije dana održavanja redovnih izbora, a najkasnije 7 (sedam) dana prije dana održavanja izvanrednih izbora.', '(5) Izborne liste koje su dostavljene nakon isteka roka iz stavka 4. ovog članka Statuta ili izborne liste koje ne sadržavaju sve potrebne podatke iz stavaka 1.-3. ovog članka Statuta, Izborno povjerenstvo neće smatrati važećima te iste ne mogu sudjelovati na izborima.', '(6) Ukoliko se do isteka roka iz stavka 4. ovog članka Statuta ne kandidira niti jedna izborna lista ili niti jedna kandirana izborna lista ne sadržava sve potrebne podatke iz stavaka 1.-3. ovog članka Statuta, svi rokovi iz članaka 50. i 51. ovog Statuta produljuju se za 30 (trideset) dana.']"}, "**Članak 52.**": {"**2. REFERENDUM**": "", "**Članak 55.**": ["(1) Referendum svih članova Kluba s pravom glasa (dalje u tekstu: Referendum) mora se raspisati prethodno donošenju odluke Skupštine o:", ["a. promjeni naziva Kluba u dijelu \"Dinamo\";", "b. promjeni grba (znaka) Kluba;", "c. promjeni boje Kluba;", "d. promjeni trajne lokacije stadiona;", "e. statusnim promjenama (preoblikovanje, pripajanje, spajanje ili podjela) Kluba;", "f. dobrovoljnog prestanka rada Kluba;"], "(2) Referendum iz stavka 1. ovog članka Statuta mora se raspisati na pisani zahtjev:", ["a. Dvotrećinske većine svih članova Skupštine;", "b. 20% (dvadeset posto) svih članova Kluba s pravom glasa."], "(3) Na pisani zahtjev 20% (dvadeset posto) svih članova Kluba s pravom glasa mora se raspisati i referendum radi donošenja odluke o raspisivanju izvanrednih izbora u Klubu.", "(4) Na referendumu iz stavaka 1. i 3. ovog članka Statuta mora sudjelovati najmanje 50 % (pedeset posto) svih članova Kluba s pravom glasa, a odlučuje se dvotrećinskom većinom danih glasova.", "(5) Potrebnim se postotkom od 20% (dvadeset posto) svih članova Kluba s pravom glasa, u smislu odredaba stavka 2. točke b. te stavaka 3. i 4. ovog članka Statuta, smatra broj članova Kluba u kalendarskoj godini u kojoj se referendum raspisuje ili u kalendarskoj godini koja prethodi kalendarskoj godini u kojoj se referendum raspisuje, ovisno o tome u kojoj je kalendarskoj godini broj članova Kluba s pravom glasa veći.", "(6) Referendum iz stavaka 1. i 2. ovog članka Statuta, raspisuje Nadzorni odbor u roku od 21 (dvadeset jedan) dan od zaprimanja valjanog pisanog zahtjeva iz stavka 2. ovog članka Statuta, a provodi ga Izborno povjerenstvo.", "(7) Nakon referenduma, Predsjednik Nadzornog odbora mora sazvati sjednicu Skupštine u roku od 15 (petnaest) dana radi provedbe referendumskih odluka."]}, "**VII. RJEŠAVANJE SPOROVA I SUKOBA INTERESA**": "**Članak 56.**\n\n['(1) Postupak pred Nadzornim odborom za rješavanje statutarnih i ostalih sporova te sukoba interesa može pisanim i obrazloženim zahtjevom pokrenuti svaki član tijela Kluba, ako smatra da postoji spor ili sukob interesa u Klubu.', '(2) Nadzorni odbor o zahtjevu odlučuje u roku od 60 (šezdeset) dana od dana zaprimanja zahtjeva.', '(3) Nadzorni odbor u svom radu na odgovarajući način primjenjuje odredbe Zakona o mirnom rješavanju sporova.', '(4) Odluka Nadzornog odbora o sukobu interesa je konačna.', '(5) Nadzorni odbor odlukom određuje način razrješavanja statutarnih i ostalih sporova te utvrđenog sukoba interesa.', '(6) Ako Nadzorni odbor utvrdi da je Predsjednik Kluba u sukobu interesa, predlaže Skupštini Kluba sankciju ili razrješenje te raskid ugovora.', '(7) Ako Nadzorni odbor utvrdi da su članovi Uprave u sukobu interesa, predlaže Predsjedniku Kluba sankciju ili razrješenje te raskid ugovora.', '(8) Ako Nadzorni odbor utvrdi da su zaposlenici Kluba u sukobu interesa, predlaže Predsjedniku Kluba sankciju ili razrješenje te otkaz ugovora.', '(9) U slučaju da odlučuje o sukobu interesa člana Nadzornog odbora, taj član Nadzornog odbora ne sudjeluje u donošenju odluke.']", "**VIII. IMOVINA, NAČIN STJECANJA I RASPOLAGANJE IMOVINOM**": "**Članak 57.**\n\n['(1) Imovinu Kluba čine:', ['a. novčana sredstva koja je Klub stekao uplatom članarina, naknada Prijatelja Kluba, dobrovoljnim prilozima i darovima;', 'b. novčana sredstva koja Klub stekne obavljanjem djelatnosti kojima se ostvaruju ciljevi, obavljanjem djelatnosti i gospodarskih djelatnosti, financiranjem programa i projekata Kluba iz državnog proračuna i proračuna jedinica lokalne i područne (regionalne) samouprave te fondova i/ili iz inozemnih izvora;', 'c. nekretnine i pokretne stvari Kluba;', 'd. druga prava ustanovljena u korist Kluba.'], '(2) Klub može raspolagati svojom imovinom samo za ostvarivanje ciljeva i obavljanjem djelatnosti određenih ovim Statutom, u skladu sa zakonima i posebnim propisima.', '(3) Višak prihoda nad rashodima koje Klub ostvari mora se koristiti isključivo za obavljanje i unapređenje djelatnosti Kluba kojima se ostvaruju ciljevi Kluba, utvrđeni ovim Statutom, sukladno zakonu.']\n\n**Članak 58.**\n\n['(1) Odluke o stjecanju ili otuđivanju pokretnina i nekretnina donose Predsjednik i Uprava, na način propisan ovim Statutom.', '(2) Poslovne odluke u vezi korištenja financijskih sredstava tijekom kalendarske godine provodi Uprava Kluba koja o tome, na način propisan ovim Statutom, izvješćuje Nadzorni odbor i Skupštinu.', '(3) Predsjednik i Uprava odgovorni su za zakonitost korištenja i raspolaganja imovinom, a posebice financijskih sredstava Kluba.', '(4) Sva dokumentacija o materijalno-financijskom poslovanju Kluba čuva se u zakonskim rokovima s posebnom pažnjom u arhivi Kluba.']", "**IX. PRESTANAK POSTOJANJA KLUBA**": {"**Članak 59.**": ["(1) Klub prestaje postojati odlukom Skupštine u skladu s rezultatima provedenog referenduma ili u drugim slučajevima predviđenim zakonom.", "(2) U slučaju prestanka postojanja Kluba preostala imovina pripada udruzi, ustanovi, zakladi ili drugoj pravnoj osobi koja ima iste ili slične statutarne ciljeve, a prema odluci Skupštine."], "**Članak 60.**": ["(1) Likvidatora Kluba imenuje i opoziva Skupština Kluba.", "(2) Likvidator zastupa Klub u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u Registar udruga Republike Hrvatske kao osoba ovlaštena za zastupanje Kluba do okončanja postupka likvidacije i brisanja Kluba iz registra udruga.", "(3) Osoba koja se bira za likvidatora treba imati potrebnu stručnost i iskustvo, s obzirom na nadležnost likvidatora te ne smije imati zapreke iz Zakona o sportu ili Zakona o udrugama.", "(4) Pokretanjem postupka likvidacije Kluba prestaju ovlaštenja tijela i osoba ovlaštenih za zastupanje Kluba.", "(5) Postupak likvidacije Kluba provodi likvidator sukladno odredbama Zakona o udrugama."]}, "**X. PRIJELAZNE I ZAVRŠNE ODREDBE**": "**Članak 61.**\n\n['(1) Ovaj Statut stupa na snagu danom upisa u Registar udruga Republike Hrvatske.', '(2) Postojećim tijelima Kluba, uključujući i provedbu prvih izbora prema ovom Statutu i Pravilniku o izborima u GNK \"Dinamo\" od strane postojećeg Izbornog povjerenstva koje će ga provoditi, a u vezi izbora ovlasti Nadzornog odbora imati postojeći Izvršni odbor, nadležnosti i ovlasti traju do izbora tijela Kluba sukladno odredbama ovog Statuta.', '(3) Sva tijela Kluba mogu se, putem Nadzornog odbora, obratiti Skupštini za autentično tumačenje odredaba Statuta i akata koje ona donosi.']\n\n| (4)<br>Opći akti Kluba moraju se usuglasiti s odredbama ovog Statuta u roku od 90 (devedeset)<br>dana od dana donošenja Statuta. |\n|----------------------------------------------------------------------------------------------------------------------------------|\n| U Zagrebu                                                                                                                        |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |\n|                                                                                                                                  |"}