"[\"# **NAJVA\\u017dNIJE TO\\u010cKE NOVOG STATUTA** ## **1. Demokratski statut** *Svi \\u010dlanovi Skup\\u0161tine biraju se na izborima od strane svih \\u010dlanova Kluba \\u010dime se trajno napu\\u0161ta praksa da Izvr\\u0161ni ili Nadzorni odbor imenuju \\u010dlanove Skup\\u0161tine, a osigurava se i obvezna prisutnost u Skup\\u0161tini i drugih glasova osim vladaju\\u0107ih. Ovo je prvi istinski demokratski Statut u povijesti GNK Dinama.* # **2. Neposredna volja \\u010dlanova** *Statut omogu\\u0107uje \\u010dlanovima da izravno i neposredno izaberu osobu koja \\u0107e voditi Klub i biti odgovorna za postignute rezultate prema izbornom programu koji je dobio povjerenje \\u010dlanova. Za razliku od dosada\\u0161njeg Statuta izborni legitimitet je spojen sa stvarnim utjecajem.* ## *3.* **Jasna mo\\u0107 i jasna odgovornost** *Nakon izborne pobjede, Predsjednik Kluba preuzima i veliku mo\\u0107 i veliku odgovornost. U njegovim su rukama svi alati potrebni za vo\\u0111enje Kluba onako kako smatra da je najbolje. Istodobno, jasno preuzima odgovornost za svoje odluke i rezultate koje Klub pod njegovim vodstvom postigne.* ## **4. Upravlja\\u010dka stabilnost** *Kada Predsjednik vodi Klub na temelju izbornog legitimiteta i programa kojeg se obvezao provesti, uz suradnju i nadzor isklju\\u010divo onih koji su taj program stvarali i s njim bili na istoj listi \\u2013 dakle, koji dijele istu ideju \\u2013 te kada imaju podr\\u0161ku Skup\\u0161tine, upravljanje Klubom je stabilno. Odluka da tijela slu\\u017ee, dok imaju demokratski legitimitet, provo\\u0111enju jednog cilja, temeljena je na izbornim praksama i \\u0161ire u dru\\u0161tvu i drugim nogometnim Klubovima sa sli\\u010dnim na\\u010dinom upravljanja. Nadzor nad takvim upravljanjem i programom koji su odabrali \\u010dlanovi ne mogu provoditi oni koji su na izborima bili u manjini ili nisu stvorili i zastupali istu ideju.* ## *5.* **Jednostavnost - manje tijela i razli\\u010ditih funkcija** *Nadzorni odbor i Izvr\\u0161ni odbor spajaju se u jedinstveno tijelo, a funkcije Predsjednika Kluba i glavnog i odgovornog za rad Uprave preuzima ista osoba. Tako\\u0111er, jedna osoba istodobno obna\\u0161a du\\u017enost predsjednika Nadzornog odbora i predsjedavaju\\u0107eg u Skup\\u0161tini, ne predvi\\u0111a se osnivanje npr. Eti\\u010dkog povjerenstva. Ove odluke pojednostavljuju i ujedinjuju tijela i funkcije s ciljem jednostavnijeg, jasnijeg i u\\u010dinkovitijeg upravljanja Klubom \\u0161to smatramo primjerenim za trenutnu fazu demokratskog i upravlja\\u010dkog razvoja Kluba. To, me\\u0111utim, ne zna\\u010di da se isto u budu\\u0107nosti ne\\u0107e mijenjati, a izborni proces, tijela i funkcije na slo\\u017eeniji na\\u010din razvijati.* ## **6. Za\\u0161tita \\u010dlanstva i izborne manjine** *Najja\\u010da za\\u0161tita \\u010dlanova od lo\\u0161eg upravljanja Klubom su izbori koji uvijek pru\\u017eaju priliku za promjenom vodstva. U najozbiljnijim scenarijima, za klju\\u010dna pitanja identiteta Kluba i rada trenutne vlasti u Klubu, \\u010dlanovi mogu pokrenuti referendum i njime \\u010dak i inicirati prijevremene izbore. U Skup\\u0161tini je manjini zajam\\u010deno najmanje 10% zastupni\\u010dkih mjesta, bez obzira na izborni rezultat. Svaki \\u010dlan Skup\\u0161tine \\u2014 uklju\\u010duju\\u0107i i predstavnike manjine \\u2014 ima pravo zatra\\u017eiti i dobiti sve podatke o poslovanju Kluba koji nisu poslovna tajna. Time se osigurava mogu\\u0107nost aktivnog sudjelovanja u radu Kluba, zastupanja alternativnih stavova i propitkivanja donesenih odluka.* # **NAJVA\\u017dNIJE KRITIKE NOVOG STATUTA** ## **Za\\u0161to ulaze samo dvije liste?** Zbog Zakona o udrugama koji nala\\u017ee da Predsjednik Kluba kao osoba koja ga zastupa mora biti izglasan u Skup\\u0161tini, a istovremeno \\u017eele\\u0107i po\\u0161tovati izravnu i neposrednu volju \\u010dlanova,\", \"sudjelovanja u radu Kluba, zastupanja alternativnih stavova i propitkivanja donesenih odluka.* # **NAJVA\\u017dNIJE KRITIKE NOVOG STATUTA** ## **Za\\u0161to ulaze samo dvije liste?** Zbog Zakona o udrugama koji nala\\u017ee da Predsjednik Kluba kao osoba koja ga zastupa mora biti izglasan u Skup\\u0161tini, a istovremeno \\u017eele\\u0107i po\\u0161tovati izravnu i neposrednu volju \\u010dlanova, jedini na\\u010din je da Predsjednik dolazi s liste koja je osvojila ve\\u0107inu u Skup\\u0161tini i da ga upravo ta ve\\u0107ina u Skup\\u0161tini potvrdi. Kako bi se to osiguralo, kao i da se mogu izabrati druga nu\\u017ena tijela i odlu\\u010divati o va\\u017enim pitanjima u Skup\\u0161tinu ulaze samo dvije liste, pri \\u010demu \\u010dlanovi jednoj daju ve\\u0107inu glasova. Na taj na\\u010din izbjegava se borba za glasove unutar Skup\\u0161tine i preglasavanja, dok se istovremeno po\\u0161tuje volja \\u010dlanova. Jedan od klju\\u010dnih amandmana koje smo usvojili predvi\\u0111a da se, ako nijedna lista ne osvoji ve\\u0107inu u prvom krugu, organizira drugi krug izbora s dvije liste koje su dobile najve\\u0107i broj glasova, \\u010dime se osigurava da jedna lista dobije vi\\u0161e od 50% glasova i formira vlast u Skup\\u0161tini. Pri izradi ovog prijedloga analizirali smo i statut Boca Juniorsa, jednog od najve\\u0107ih \\u010dlanskih klubova u svijetu. U skup\\u0161tini Boce pobjedni\\u010dka lista automatski dobiva 70% mjesta, \\u010dak i ako na izborima osvoji manje od 50% glasova i to zato \\u0161to izbori prvenstveno slu\\u017ee da se temeljem volje \\u010dlanova formira \\u010dvrsta vlast koja zbog takvih odredbi zatim ima stabilnost u upravljanju, uz stalnu odgovornost prema \\u010dlanovima. Sli\\u010dan princip \\u017eeljeli smo primijeniti i u Statutu GNK Dinama. ## **Za\\u0161to je Nadzorni odbor na istoj listi kao i Predsjednik i za\\u0161to nema oporbe u Nadzornom odboru?** \\u010clanovi na izborima demokratski biraju jedan program upravljanja na jedan mandat. Program stvaraju svi \\u010dlanovi liste, a Predsjednik se nakon izbora za Skup\\u0161tinu izdvaja iz Skup\\u0161tine i njoj, tj. Nadzornom odboru kao njezinoj produ\\u017eenoj ruci, odgovara za provo\\u0111enje tog programa. Time se osigurava da oni koji su dobili povjerenje \\u010dlanova i koji dijele istu izbornu ideju imaju ovlasti i odgovornost nadzirati njezino provo\\u0111enje. Kada bi se \\u010dlanovi NO-a birali odvojeno od izbora \\u010dlanova Skup\\u0161tine, moglo bi se dogoditi da NO sa\\u010dinjavaju ljudi koji ne podr\\u017eavaju izabranog predsjednika niti njegov program s kojim je pobijedio na izborima, \\u0161to je put u permanentnu nestabilnost upravljanja klubom. Predlo\\u017eeni sustav usmjeren je na u\\u010dinkovitost i stabilnostzbog \\u010dega brojni \\u010dlanski klubovi \\u010dlanove NO-a biraju na temelju cjelovitih lista, a ne pojedina\\u010dnih kandidatura. Ako vlast ne ispunjava o\\u010dekivanja, oporba je mo\\u017ee prozvati u Skup\\u0161tini, \\u010dlanovi je mogu smijeniti referendumom ili se odlu\\u010diti na davanje prilike drugoj opciji na sljede\\u0107im izborima. U Skup\\u0161tini se zadr\\u017eava pluralizam kroz proporcionalno sudjelovanje organizirane oporbe, no ona ne bi trebala biti kao parlament koji se bavi bezbrojnim temama, nego kao tijelo koje podr\\u017eava stabilnu, demokratski izabranu vlast usmjerenu prema glavnom cilju \\u2013 \\u0161to uspje\\u0161nijem sportskom rezultatu Kluba. Dodatno, javna revizija poslovanja obvezno se prezentira svim \\u010dlanovima. Takav sustav gdje s iste liste dolazi i Predsjednik te Nadzorni odbor, kakav primjerice koristi i Benfica, u praksi se pokazao uspje\\u0161nim i pru\\u017ea ravnote\\u017eu izme\\u0111u stabilnosti vlasti i demokratskog nadzora.\", \"usmjerenu prema glavnom cilju \\u2013 \\u0161to uspje\\u0161nijem sportskom rezultatu Kluba. Dodatno, javna revizija poslovanja obvezno se prezentira svim \\u010dlanovima. Takav sustav gdje s iste liste dolazi i Predsjednik te Nadzorni odbor, kakav primjerice koristi i Benfica, u praksi se pokazao uspje\\u0161nim i pru\\u017ea ravnote\\u017eu izme\\u0111u stabilnosti vlasti i demokratskog nadzora. ## **Za\\u0161to na izborima mo\\u017ee sudjelovati netko tko je \\u010dlan samo ove i pro\\u0161le godine?** Nikada ne\\u0107e biti idealnog omjera kada se radi o kalendarskim godinama, ali volja nekog \\u010dlana da, makar i unutar kratkog vremena dva puta obnovi \\u010dlanstvo i uredi tako svoj status zna\\u010di prije svega i volju da on participira u radu Kluba i to treba vrednovati. Pro\\u0161la su vremena nepovjerenja prema \\u010dlanovima i tra\\u017eenja lo\\u0161ih namjera. Od 56.000 \\u010dlanova Kluba, manje od polovice \\u010dine punoljetni i poslovno sposobni \\u010dlanovi koji su to bili i pro\\u0161le godine, odnosno \\u010dlanovi s pravom glasa. U po\\u010decima izgradnje demokratske kulture i \\u010dlanskog identiteta Kluba \\u017eeljeli smo uklju\\u010diti \\u0161to ve\\u0107i broj \\u010dlanova u demokratske procese. Zato smo odlu\\u010dili da pravo glasa imaju svi koji su bili \\u010dlanovi i u prethodnoj godini, umjesto da se uvjetuje vi\\u0161egodi\\u0161nje \\u010dlanstvo, \\u0161to bi zna\\u010dajno smanjilo broj onih koji mogu sudjelovati. Ova \\u0107e se odredba u budu\\u0107nosti sigurno razmatrati, s mogu\\u0107no\\u0161\\u0107u da se pravo glasa ve\\u017ee uz vi\\u0161e uzastopnih godina \\u010dlanstva. Tako\\u0111er, vrijedi istaknuti da u mnogim europskim \\u010dlanskim klubovima pravo glasa stje\\u010du oni koji su \\u010dlanovi samo godinu dana. # **Za\\u0161to su Predsjednik Skup\\u0161tine i Predsjednik Nadzornog odbora ista osoba?** U Statutu ne postoji funkcija Predsjednika Skup\\u0161tine, a skup\\u0161tinskom sjednicom u pravilu predsjeda Predsjednik NO kojemu je to tek jedna od du\\u017enosti. Osoba koja predsjeda sjednicom Skup\\u0161tine obavlja tek tehni\\u010dku funkciju i ne mora uvijek biti predsjednik NO. Predsjednik NO svoje stvarne nadle\\u017enosti ispunjava u NO. Ne treba nam inflacija razli\\u010ditih Predsjednika u Klubu bez jasnih du\\u017enosti. Nadzorni odbor neodvojivi je dio Skup\\u0161tine i s time se izbjegava nepotrebno udvostru\\u010davanje pozicija i jasno razdvaja nadle\\u017enost: predsjednik NO-a utje\\u010de isklju\\u010divo na rad tog tijela, dok na ostale procese u Skup\\u0161tini ne djeluje izvan svoje nadzorne uloge. Logi\\u010dno je i proceduralno ispravno da osoba koja vodi Skup\\u0161tinu vodi i tijelo koje je njezina produ\\u017eena ruka. Osim toga, unutar Skup\\u0161tine postoji dovoljan broj drugih \\u010dlanova koji, ako procijene da predsjednik NO-a odstupa od svojih ovlasti, mogu pokrenuti inicijativu za izvanrednu sjednicu ili izmijeniti dnevni red. ## **Uvodi li se verbalni delikt i za\\u0161to nema Eti\\u010dkog povjerenstva?** Pojam verbalni delikt ti\\u010de se isklju\\u010divo odnosa dr\\u017eave i pojedinca i potpuno je pogre\\u0161no i neprimjereno njegovo kori\\u0161tenje u vezi pravila pona\\u0161anja jednog privatnog udru\\u017eenja osoba s vlastitim pravilima ili mjerama, u kojima je udru\\u017eivanje potpuno dobrovoljno. U privatnim organizacijama, poput sportskih klubova, uobi\\u010dajeno je postojanje internih pravila pona\\u0161anja te stegovnih postupaka i sankcija. Svaka organizacija ima pravo odrediti svoja pravila i svatko ima pravo ne biti dio te organizacije. Bitno je naglasiti da, u slu\\u010daju izricanja bilo koje stegovne mjere \\u2013 posebno one najte\\u017ee, poput isklju\\u010denja \\u2013 \\u010dlan ima pravo, nakon \\u0161to iscrpi sve klupske instance, potra\\u017eiti za\\u0161titu i kod nadle\\u017enog\", \"i sankcija. Svaka organizacija ima pravo odrediti svoja pravila i svatko ima pravo ne biti dio te organizacije. Bitno je naglasiti da, u slu\\u010daju izricanja bilo koje stegovne mjere \\u2013 posebno one najte\\u017ee, poput isklju\\u010denja \\u2013 \\u010dlan ima pravo, nakon \\u0161to iscrpi sve klupske instance, potra\\u017eiti za\\u0161titu i kod nadle\\u017enog suda. U zadnje dvije godine nije se desio niti jedan slu\\u010daj koji je zahtijevao pokretanje stegovnog postupka i zbog toga nema niti smisla uspostavljanje dodatnog tijela koje bi se zvalo Eti\\u010dko povjerenstvo i koje bi se samo time bavilo. I najva\\u017enije, raspisivanjem doti\\u010dnih prekr\\u0161aja u Statutu nije bio cilj postavljanje temelja za sankcioniranje i isklju\\u010divanje \\u010dlanova ve\\u0107 gra\\u0111enje kulture \\u010dlanskog Kluba na na\\u010din da se jasnije komunicira da \\u010dlan Kluba ima druga\\u010dija prava, ali i obaveze od navija\\u010da Kluba.\"]"