{"REPUBLIKA HRVATSKA MINISTARSTVO PROSVJETE I ŠPORTA": "", "KONAČNI PRIJEDLOG ZAKONA O SPORTU": {"V. RAZLIKE IZMEĐU RJEŠENJA KOJA SE PREDLAŽU KONAČNIM PRIJEDLOGOM ZAKONA U ODNOSU NA RJEŠENJA IZ PRIJEDLOGA ZAKONA": "Posebna pozornost posvećena je primjedbama saborskih odbora i klubova stranaka koje su se odnosile na potrebu poboljšanja financiranja sporta i traženja da se predlože konkretna rješenja u Konačnom prijedlogu zakona. Zbog toga navodimo stavove saborskih odbora i klubova zastupnika kako slijedi.\n\nOdbor za obitelj, mladež i šport smatra da <u>Vlada treba još jednom dobro promisliti i ponuditi porezne olakšice koje bi motivirajuće djelovale na potencijalne sponzore.</u> Ukazano je da je nekada sport imao isti status kao kultura i da bi trebalo razmotriti mogućnost vraćanja tog statusa. Potrebno je tretiranje sporta u poreznom sustavu kao i kulture, što on svakako zaslužuje, te da su porezne olakšice bolji način pronalaženja sredstava za ulaganje u razvoj športa.\n\nOdbor za obrazovanje, znanost i kulturu navodi da se dio proračuna mora namijeniti sportu s napomenom da sve jedinice lokalne samouprave moraju u svojim proračunima predvidjeti sredstva za tu namjenu.\n\nOdbor za rad, socijalnu politiku i zdravstvo navodi da je <u>izdvajanje za sport od igara na sreću nedostatno</u> te da bi trebalo povećati sredstva za financiranje sporta osoba s invaliditetom.\n\nOdbor za turizam navodi da bi <u>trebalo poticati izgradnju sportskih objekata</u> koji bi bili, kako u funkciji raznovrsnosti turističke ponude, tako i zadovoljavanju potreba svih građana odnosnih područja, te <u>omogućiti da ulaganja u sportske objekte idu iz troškova poslovanja</u> investitora, a ne isključivo iz dobiti tih društava ili eventualnih kreditnih sredstava.\n\nKlub zastupnika Hrvatskog bloka (Krunoslav Gašparić) ukazuje da <u>porezni sustav</u> praktički ne priznaje šport u neki poseban sustav, dapače da ima pokušaja da se šport svrsta u kategoriju društvenih djelatnosti i aktivnosti na koje se gleda s podozrenjem, odnosno čak na sivu zonu pogodnu za pranje novca. <u>U osiromašenom gospodarstvu teško se može očekivati da bi se šport mogao financirati samo iz vlastitih izvora</u> zasnovanih na donacijama, članarinama i marketingu. U ovakvoj situaciji <u>spas za šport je stimulirati ulaganje kroz porezne olakšice, a o čemu ovaj prijedlog zakona nažalost ne govori ništa konkretno. Država bi morala financirati svakako obrazovanje, osposobljavanje i onu usku specijalizaciju, ona bi dakle morala <u>ići ka obrazovanju stručno-sportskih radnika</u>, ona mora <u>preuzeti gradnju sportskih objekata, financiranje globalnih natjecanja vrhunskih sportaša</u> itd. Postavljena su pitanja glede financiranja sporta i dat je odgovor. <u>Nudi li predlagatelj Zakona poboljšanje? Nude li se poreske olakšice koje bi motivirale potencijalne sponzore?</u> Nudi li se status športu sličan ili istovjetan onom kakav ima kultura? <u>Ne.</u></u>\n\nKlub zastupnika SDP (Branislav Tušek) navodi da je neizbježno <u>pitanje povećanje</u> sredstava za financiranje sporta. Nismo sigurni da zakon definira i rješava to pitanje.\n\nKlub zastupnika HSLS-a (Mario Kovač) ukazuje da treba postaviti pitanje koliko Hrvatska država izdvaja za šport. <u>Hrvatska</u> od 2000. godine u proračunu <u>za šport izdvaja sve manje sredstava. Godinama se planski ne izdvaja niti jedna kuna za potrebnu izgradnju športskih objekata. Po izdvajanjima iz bruto društvenog proizvoda na samom smo dnu europske ljestvice</u>\n\njer izdvajamo samo 0,3% BDP-a za šport, za razliku od niza tranzicijskih zemalja koje izdvajaju 0,6% BDP-a ili više. Jednako tako je i s izdvajanjima za sport od igara na sreću.\n\nKlub zastupnika HSS (Dr. Miroslav Furdek) navodi da je najbitnije iznalaženje kvalitetnijih izvora financiranja sporta je će inače sva ova kvalitetna zakonska rješenja biti samo mrtvo slovo na papiru. Klub misli da se treba povećati udio iz dobiti igara na sreću, da se trebaju uvesti porezne olakšice potencijalnim sponzorima i naravno ne zadnje ali vrlo bitno, treba se povećati izdvajanje iz državnog proračuna. Također da bi trebalo osigurati sportu isti status kao i kulturi.\n\nKlub zastupnika LIBRA-e (Dr. sc. Zrinjka Glovacki-Bernardi) smatra da prva saborska zadaća, koja proizlazi iz sustavnog bavljenja ovom problematikom, jest <u>da sport u narednom proračunu dobije drukčiji status i drukčije mjesto nego što ga je imao do sada u proračunima.</u> Isto tako <u>očekujemo prijedloge na koji način se financiranje sporta može poduprijeti iz drugih izvora, dakle donacijama,</u> iz sredstava Lutrije Hrvatske i slično. Navode da Hrvatska ima pojedinačne i ekipne velike sportske uspjehe, ali i da je činjenica da <u>Hrvatska u proračunu za sport izdvaja nedopustivo malo</u>.\n\nKlub zastupnika HDZ-a (Mr. Zlatko Mateša) ukazuje da <u>hrvatski sport</u> nema krize rezultata, ali <u>ima krizu financiranja organizacije.</u> Zabrinjavajuće je da u okviru vlastitog ministarstva šport sudjeluje sa svega 1% proračuna tog ministarstva. <u>Financiranje ovisi o Hrvatskom saboru i da zastupnici ne trebaju nikome slati poruke, već da se to moramo riješiti u <u>Hrvatskom saboru.</u> Sredstvima prikupljenim od uplata igara na sreću sve će udruge iz ovog izvora dobiti na neki način u postotku puno više nego šport. Zbroj svih udruga u Hrvatskoj, zbroj svih njihovih aktivnosti i zbroj svih njihovih članova nije ni približan broju ljudi koji se u Hrvatskoj bave športom. Šport je po broju sudionika glavna djelatnost uz svakodnevni rad kojim se neko u ovoj zemlji bavi. U pogledu donacija sport treba ima isti status kao kultura.</u>\n\nKlub zastupnika HSP HKDU (Mr. sc. Miroslav Rožić) navodi da je <u>financiranje športa</u> zapravo najveći problem ovoga Zakona i ono što je najvažnije za riješiti, jer ako se riješi financiranje sve drugo riješit će se puno lakše. Postići ćemo puno lakše konsenzus oko ostalih stvari. Šport bi trebao imati isti status kao i kultura.\n\nBez obzira na navedeno, a vezano za financiranje sporta kroz poreske olakšice i druge mjere, mora se navesti da nije moguće ta pitanja sustavno riješiti ovim Zakonom, već će se to rješavati zakonima i drugim propisima koji uređuju područje poreza, carina i druga financijska pitanja.\n\nNavodimo nove i izmijenjene odredbe koje su posljedica stavova saborskih odbora, stajališta stranačkih klubova i diskusija zastupnika iznesenih tijekom rasprave (prvog čitanja) u Hrvatskom saboru te mišljenja i prijedloga pojedinih ministarstva i ureda, kao i zaključaka na koordinacijama.\n\n['U sustav sporta uvrštena su visoka učilišta za školovanje kadrova u sportu (čl. 7.);', 'Zbog mogućeg sukoba interesa unesene su odredbe o vlasnicima kladionica i menadžerima sportaša kojima se ograničava sudjelovanje u tijelima upravljanja i zastupanju u sportskim klubovima i savezima (čl. 9.);', 'Iz istog razloga osobama koje neposredno mogu utjecati na uvjete, sustav i regularnost natjecanja tj. sportskim sucima, delegatima i povjerenicima propisano je ograničenje sudjelovanja u skupštinama i izvršnim tijelima sportskih saveza (čl. 18.);', 'Unesena je odredba kojom se po prvi puta u jednom zakonu o sportu spominju udruge navijača, kao oblik udruživanja građana u sustavu sporta (čl. 14.);', 'Dana je mogućnost osnivanja međužupanjiskih sportskih saveza ako ne postoje uvjeti za osnivanje županijskih sportskih saveza (čl. 16.);', 'Propisano je da se studentski sport može financirati i iz proračuna jedinica područne (regionalne) samouprave (čl. 21.);', 'Temeljem zaključaka saborskih odbora i usuglašenih prijedloga sportskih udruženja (saveza) osoba s invaliditetom unesene su odredbe kojima su stavljene u ravnopravan položaj sve vrste osoba s invaliditetom i svi nacionalni sportski savezi osoba s invaliditetom. Uz Hrvatski paraolimpijski odbor kao autonomni savezi uvršteni su Hrvatski sportski savez gluhih i Specijalna olimpijada.', 'U djelokrug Hrvatskog olimpijskog odbora unesene su odredbe o osiguravanju kadrovskih i materijalnih uvjeta i organiziranju istraživačko-razvojnog rada u sportu. Hrvatskom olimpijskom odboru dana je ovlast da daje mišljenja je li neka aktivnost sport, a radi učestalih pojava novih sportova odnosno aktivnosti za koje se zahtjeva status sporta (čl. 26.);', 'Hrvatskom olimpijskom odboru dano je ovlaštenje izdavanja javnih isprava rješenja o kategorizaciji vrhunskih sportaša na temelju općeg akta o kategorizaciji vrhunskih sportaša te je propisano za koje kategorije se obveze i prava odnose (čl. 42.);', 'Vrhunskim sportašima i osobama koje imaju odgovarajuću stručnu spremu ili su stručno osposobljene za stručne poslove u sportu otvorena je mogućnost služenja vojnog roka ili civilne službe po posebnim uvjetima, koje pravilnicima uređuju ministar obrane, ministar rada i socijalne skrbi i ministar nadležan za poslove sporta (čl. 46.);', 'Propisano je da se status sportskih sudaca, delegata, povjerenika i drugih osoba u funkciji sporta stječe na temelju općih akata nacionalnih sportskih saveza (čl. 48.);', 'Definiran je status dragovoljaca u sportu te određeno koja prava imaju za vrijeme dragovoljnog rada (čl. 49.);', 'Definiran je status menadžera sportaša i njihovih ugovora sa sportašima u sustavu sporta Hrvatske, te prava i ovlasti nacionalnih sportskih saveza, obveze menadžera sportaša i sportaša (čl. 50.);', 'Zbog izričitog zahtjeva Hrvatskog nogometnog saveza utemeljenog na pravilima UEF-e u Konačnom prijedlogu zakona nije predviđena mogućnost podjele dobiti dioničarima profesionalnog kluba, već se ona u cijelosti mora upotrijebiti za razvoj djelatnosti kluba (članak 84.);', 'U cilju sprečavanja nereda za vrijeme natjecanja u članku 107. preciznije su definirane nedopuštene radnje na sportskim objektima;', 'Uređena su pitanja u vezi s doping kontrolom životinja (konja) koje sudjeluju u sportskim natjecanjima kao i obveze klubova i organizatora (čl. 114.);', 'Utemeljeno je Povjerenstvo za borbu protiv dopinga u sportu kao stručno savjetodavno tijelo Vlade Republike Hrvatske. Propisan je izbor i broj članova. Povjerenstvo sustavno prati i koordinira akcije u borbi protiv dopinga i predlaže mjere za sprečavanje uzimanja dopinga (čl. 115.);', 'Sportski objekti od osobitog interesa za Republiku Hrvatsku mogu se utvrditi i nacionalnim programom sporta (čl. 122.);', 'Unesene su odredbe o sportskim zakladama i fundacijama jer se putem njih daje mogućnost unapređenja sporta kao općekorisne djelatnosti i ostvarenje općekorisnih sportskih svrha. Kroz zaklade i fundacije posebno se otvara mogućnost inozemnih i domaćih donacija (članak 133.).', 'Subjekti koji izvršavaju nacionalni program sporta ministarstvu nadležnom za poslove sporta dostavljaju izvješća o izvršenju utvrđenih obveza i provedbi programskih zadaća (članak 134.).', 'U prelaznim i završnim odredbama propisano je da amaterski sportski klubovi koji imaju uvjete za promjenu statusa u profesionalne klubove taj postupak trebaju dovršiti u roku od godinu dana od dana stupanja Zakona na snagu (članak 164.)..']\n\nVI. PRIJEDLOZI I MIŠLJENJA NA PRIJEDLOG ZAKONA\n\nKOJE PREDLAGATELJ NIJE PRIHVATIO\n\nS obzirom da su sportske zajednice važan čimbenik cielokupnog sustava sporta, nisu se mogla prihvatiti stajališta Odbora za obrazovanje, znanost i kulturu prema kojima bi ulogu zajednica u velikom dijelu trebala preuzeti tijela državne uprave nadležna za sport. Ovim se Zakonom gotovo u detalje propisuje metodologija predlaganja, usvajanja, financiranja, realizacije i kontrola izvršenja programa javnih potreba, a pobrojani su i poslovi kao i subjekti koji će te poslove obavljati (članci: 19, 20, 131, 132, 137 i 138). Prema tim odredbama sportske zajednice postaju stručni «servis» cjelokupnog sporta na području na kojem djeluju. One tako objedinjuju, izrađuju i zajednički program sporta predlažu poglavarstvu i skupštini na usvajanje, kontroliraju svoje članice u svezi s realizacijom usvojenog programa, izrađuju kriterije za vrednovanje programa javnih potreba u sportu, poglavarstvima redovito podnose izvješća o realizaciji odobrenih programa, a posve iz praktičnih razloga najčešće su i financijski servis cjelokupnog sustava sporta na svojem području, itd. S druge strane, još značajnija postaje uloga ureda državne uprave u županijama i gradu Zagrebu u svezi s upravnim i inspekcijski nadzorom u okviru kojeg je i nadzor nad kontrolom realizacije programa u sportskim zajednicama, što u proteklom razdoblju u pravilu nije činjeno. Upravo ovakva podjela uloga jamči kompetentnost, stručnost i transparentnost djelovanja svih čimbenika i poslova u svezi realizacije programa iavnih potreba sporta u županijama, gradovima i gradu Zagrebu.\n\nI uz sve sociološko-kulturne, odgojne, zdravstvene i druge vrijednosti, prijedlog Odbora za obitelj, mladež i sport o stalnoj zabrani točenja alkoholnih pića na stadionima, sportskim dvoranama i drugim sportskim objektima na kojima se svaki dan trenira i igra, nažalost nije moguće prihvatiti zbog mnogih razloga. Zalažemo se za dosljedno provođenje propisa o zabrani točenja alkohola maloljetnim osobama, čime se djelomično postiže očekivana svrha ovog vrijednog, ali za sada neprovedivog prijedloga.\n\nNije prihvaćen prijedlog Odbora za obitelj, mladež i šport da se u članku 3. briše odredba stavka 2. kao nepotrebna, jer Ustav Republike Hrvatske u članku 14. jamči ravnopravnost ljudi bez obzira na rasu, boju kože, spol, vjeru, nacionalnost, političko ili drugo uvjerenje. Ova odredba sastavni je dio i međunarodnih konvencija iz područja sporta, a sport kao specifična ljudska djelatnost, koju uređuje ovaj Zakon, još se jednom nedvosmisleno i izrijekom opredjeljuje i izjašnjava da je dostupan svima.\n\nNije bilo moguće prihvatiti primjedbu Odbora za obitelj, mladež i šport da djelovanje školskih sportskih klubova ne treba propisivati ministar nadležan za poslove sporta. Nije apsurdno da ministar nadležan za poslove prosvjete i sporta propisuje rad školskih sportskih klubova, upravo suprotno - apsurdno bi bilo kada rad i djelovanje školskih sportskih klubova ne bi propisivao nadležni ministar.\n\nSvjesni da je jedan od temeljnih postulata tržišnoga gospodarstva upravo raspodjela dobiti, ipak nije bilo moguće prihvatiti primjedbu da se profesionalnim sportskim klubovima ne može ograničavati raspodjela dobiti dioničarima. Profesionalni sportski klubovi u svakom su slučaju specifična sportska dioničarska društva i kao takva imaju neke posebnosti u odnosu na ostala trgovačka društva. Jedna od tih posebnosti je i ograničenje u smislu raspolaganja s ostvarenom dobiti, tako da se ona u cjelini mora utrošiti u razvoj kluba, što je zahtjev europskih sportskih asocijacija i nacionalnih sportskih saveza u sklopu kojih će i djelovati profesionalnih klubovi, a takva je praksa već godinama prisutna u gotovo svim europskim profesionalnim nogometnim klubovima.\n\nO pitanju davanja suglasnosti na organizaciju velikih sportskih priredbi u Hrvatskoj, smatramo da je dovoljna suglasnost Vlade Republike Hrvatske, ali bilo bi vrlo korisno kada bi nadležni saborski odbor, odnosno Hrvatski sabor održao tematsku raspravu i zauzeo stajalište o ovim pitanjima, jer je očit veliki interes za održavanje velikih svjetskih i europskih sportskih priredbi u Republici Hrvatskoj, za koje se kandidature često olako nude i prihvaćaju, a onda se\n\nnaknadno razmišlja o osiguravanju potrebnih dodatnih (proračunskih) sredstava, kojih naravno pod tim uvjetima nema.\n\nU odnosu na primjedbu zastupnika da o broju igrača profesionalaca u amaterskom klubu treba odlučiti nacionalni sportski savez, smatramo da to ne treba u potpunosti prepustiti nacionalnim sportskim savezima, jer bi bilo neprimjereno da u amaterskom klubu, primjerice, igra više od 50% profesionalaca, što se na novi način vrlo precizno rješava člankom 12. ovoga prijedloga Zakona. Ostala pitanja sustava natjecanja u kojem će zajedno nastupati profesionalni i amaterski sportski klubovi te pod kojim uvjetima, regulirat će nacionalni sportski savezi svojim aktima.\n\nU odnosu na prijedlog da bi Zakonom trebalo propisati optimalne sportske pripreme za olimpijske igre i slično, smatramo da je pitanje optimalnih priprema sportaša za pojedino natjecanje čisto stručno pitanje. To će se definirati kriterijima o vrednovanju pojedinog dijela javnih potreba u sportu i to zajednički pojedini nacionalni sportski savezi i Hrvatski olimpijski odbor\n\nČinjenica je da se ovim prijedlogom Zakona kao i dosadašnjim Zakonom jedino HOC «Bjelolasica» proglašava kao sportski objekt od posebnog interesa za državu i to pretežno zbog toga što je riječ o jedinom trgovačkom društvu u sportu koje je u vlasništvu Republike Hrvatske. Bilo je nekoliko prijedloga da se tu svrstaju još neki objekti. O tome spadaju li još neki sportski objekti u tu kategoriju, odlučit će Hrvatski sabor u postupku donošenja Nacionalnog programa sporta.\n\nNa primjedbu da Prijedlog Zakona nije odgovorio na pitanje što financira država, odnosno koje programe, a koje lokalna i područna samouprava, smatramo da se baš ovim prijedlogom Zakona u detalje člancima 131. i 132. definira koji su to programi javnih potreba koji se financiraju na lokalnoj odnosno državnoj razini. Osim toga ni u kom slučaju se ne bi smjeli financirati programi javnih programa u sportu raspisivanjem natječaja, jer bi to ugrozilo cjelokupnu sportsku djelatnost, koja u klubovima djeluje u višegodišnjem kontinuitetu, slično kao škole u sustavu obrazovanja.\n\nNije se mogla prihvatiti primjedba da strane pravne i fizičke osobe ne bi smjele imati mogućnost obavljanja sportskih djelatnosti u Hrvatskoj jer bi to bilo u suprotnosti sa zakonodavstvom Republike Hrvatske i postojećom praksom koja proizlazi iz našeg Ustava i zakona.\n\nNa prijedlog da se redovita zdravstvena zaštita sportaša, koja osobito pada na teret roditelja djece sportaša, ovim Zakonom riješi na drukčiji način, odgovaramo da je zdravstvena zaštita sportaša također dio javnih potreba sporta, te da se obvezni zdravstveni pregledi sportaša sufinanciraju sredstvima proračuna jedinica lokalne i područne (regionalne) samouprave u mjeri u kojoj je to moguće, a u pravilu se uvodi i participacija samih sportaša. S obzirom na ograničena proračunska sredstva, ne može se očekivati da se zdravstveni pregledi sportaša u potpunosti financiraju iz tog izvora i da se to ovim Zakonom utvrdi. Pod pojmom \"odgovarajuća edukacija iz sportske medicine\" smatra se da je imaju liječnici koji su završili specijalizaciju sportske medicine.\n\nKada se govori o prijenosu vlasništva na sportskim objektima, ovaj se Zakon ne bavi načinom na koji će vlasnik otuđiti pojedini sportski objekt, hoće li to na primjer biti natječajem ili pak pogodbom, jer to i nije materija ovog Zakona, ali se zbog zaštite objekta u smislu neopravdanog uklanjanja ili neprihvatljive promjene namjene u neke druge svrhe propisuju vrlo precizne odredbe koje bi to u potpunosti trebale onemogućiti.\n\nŠto se tiče sportskih objekata koji se nalaze na pomorskom dobru, smatramo da je radi zaštite njihove namjene kao i domicilnih sportskih klubova potrebno i ovim Zakonom predvidjeti njihov prioritet u odnosu na moguću dodjelu koncesije.\n\nU odnosu na primjedbu o mogućem sustavu natjecanja u kojem će zajedno nastupati sportaši profesionalci i amateri, ovaj Zakon samo načelno utvrđuje neka osnovna pravila, kao\n\nprimjerice u članku 12. gdje se kaže da za amaterski sportski klub može nastupati u istom trenutku najviše do 50% igrača profesionalaca. Ostala pravila sustava pojedinih natjecanja propisivat će svojim aktima nacionalni sportski savezi. U gotovo svim europskim zemljama postoje mješoviti sustavi natjecanja u kojima ravnopravno sudjeluju amaterski i profesionalni klubovi, te u jednom klubu igraju zajedno i amateri i profesionalci. Naravno, tamo gdje za to postoje određeni uvjeti postoje i čisto profesionalne lige. Kod nas će najvjerojatnije prevladati mješoviti sustav natjecanja i zbog toga se ta odluka prepušta svakom pojedinom nacionalnom sportskom savezu.\n\nPodržavamo prijedlog da se razmotri mogućnost zapošljavanja vrhunskih sportaša u javnim službama kao mogućnost za rješavanje njihovih osnovnih egzistencijalnih pitanja. U svakom slučaju to je jedna od mogućnosti za rješavanje tog statusnog pitanja vrhunskih sportaša. Smatramo, međutim, da je to pitanje više u domeni političkih odluka i dogovora nacionalnih sportskih saveza i Hrvatskog olimpijskog odbora s nadležnim tijelima vlasti i da to ne bi bilo moguće na zadovoljavajući način urediti ovim Zakonom.\n\nNismo mogli prihvatiti primjedbu da bi u Zakon trebalo unijeti odredbe o ženskom sportu «jer ... ženski sport jest diskriminiran kod nas». Ovaj Zakon ne dijeli sport na muški i ženski i ne diskriminira žene. Pravni položaj žena i muškaraca koji se bave sportom ili sportskim djelatnostima je ovim Zakonom izjednačen. Prema članku 3. stavku 2. \"Sport mora biti dostupan svima bez obzira na ... spol...\", a člankom 38., u definiciji se navodi \"Sportašica i sportaš\", što je, koliko nam je znano, prvi put da se na ovaj način u nekom zakonu o sportu izjednačuju žene i muškarci.\n\nIzraženu \"dvojbu prema lokalnoj samoupravi i njezinoj obvezi da osigura financijske, prostorne i druge uvjete za bavljenje sportom djece i mladih\" i \"kako će to jedinice lokalne samouprave moći ostvariti, osobito one čije gospodarstvo je nedostatno, a proračun ne osigurava dovoljno novca\", ne možemo prihvatiti. Naime, jedinice lokalne i područne (regionalne) samouprave koje su na temelju zakona stekle taj status, moraju osiguravati sredstva u proračunima za funkcioniranje odnosno obavljanje poslova iz svoje nadležnosti i djelokruga, pa i za navedeno u ovom Zakonu glede sporta djece i mladeži."}}