"[\"- NACRT PRIJEDLOGA - Na temelju Clanka 13. Zakona o udrugama (Narodne novine, br. 74/14, 70/17, 98/19 1 151/22) 1 Clanka 30. Zakona o sportu (Narodne novine, br. 141/22) na sjednici SkupStine Gradanskog nogometnog kluba Dinamo odrZanoj ... donesen je: STATUT GRADANSKOG NOGOMETNOG KLUBA ,,DINAMO\\u201d I. UVODNE ODREDBE Clanak 1. Ovim Statutom ureduju se: naziv 1 sjediSte udruge; podrucje 1 ciljevi djelovanja; zastupanje; djelatnost; gospodarska djelatnost; nacin osiguranja javnosti djelovanja udruge; uvjeti 1 nacin uclanjivanja; prestanak Clanstva; prava, obveze 1 odgovornosti Clanova; popis Clanova; tiela udruge, njihov sastav 1 nacin sazivanja sjednica; izbor, opoziv, ovlasti, odgovornost, nacin odlucivanja 1 trajanje mandata; nacin rjeSavanja sporova 1 sukoba interesa unutar udruge; nacin sazivanja SkupStine u slucaju isteka mandata; izbor 1 opoziv likvidatora; prestanak postojanja udruge; imovina, nacin stjecanja 1 raspolaganja imovinom; postupak s imovinom u slucaju prestanka postojanja udruge, nacin provodenja referenduma te ostala pitanja od znacaja za udrugu. Clanak 2. (1) Naziv Udruge je: Gradanski nogometni klub Dinamo. (2) Skra\\u00e9eni naziv Udruge je: GNK Dinamo. (3) Gradanski nogometni klub Dinamo je profesionalni nogometni klub. (4) SjediSte kluba je u Zagrebu, Maksimirska cesta 128. Clanak 3. (1) Gradanski nogometni klub Dinamo (u daljnjem tekstu: Klub) je udruga registrirana u Registru udruga Republike Hrvatske 1 u Evidenciji pravnih osoba u sportu. (2) Klub je neprofitna pravna osoba. Clanak 4. (1) Klub ima pe\\u20acat. (2) Pe\\u00e9at je okruglog oblika, promjera 35 mm, sa ispisanim nazivom 1 mjestom sjedista Kluba po obodu pe\\u00e9ata 1 znakom u sredini. - NACRT PRIJEDLOGA - Clanak 5. (1) Klub je osnovan 26. travnja 1911. Pod nazivom I. Hrvatski gradanski Sportski klub u Zagrebu (u daljnjem tekstu 1: Gradansk1). (2) Obiljezja Kluba su grb (znak) 1 plava boja, a koja slijede izgled obiljezja 1 sportsku tradiciyu Gradanskog. (3) Grb (znak) Kluba je kruznog oblika 1 simbolizira oblik nogometne lopte, a Sto ukazuje na osnovnu djelatnost Kluba. (4) Osnova grba (znaka) sastavljena je od dva polukruga: povijesnog hrvatskog grba s naizmjenicnim crvenim 1 biyelim poljima te tradicionalnog u plavoj boji Grada Zagreba s bijelim slovom \\u201cd\\u201d koje predstavlja pocetno slovo naziva Kluba u diyelu ,,Dinamo\\u201d\\u2019. (5) Sve linije unutar grba (znaka) 1 rub grba (znaka) su zlatne boje. (6) Iznimno od odredaba stavaka 3.-5. Ovog Clanka Statuta, Klub moze koristiti dielove grba (znaka) kao sastavni dio drugih amblema odnosno znakova, pod uvjetom da se time ne vrijeda ugled 1 dostojanstvo Kluba. Clanak 6. (1) Upravljanje Klubom temelji se na nacelu demokratskog ustroja. Klubom, na nacin propisan odredbama ovog Statuta, upravljaju Clanovi Kluba, neposredno ili putem svojih izabranih predstavnika u tijelima Kluba. Nac\\u00a2elo demokratskog ustroja Kluba ne moze se myenyati niti odredbama ovog Statuta niti referendumom. (2) O promyeni naziva Kluba u dijelu ,,Dinamo\\u201c, grba (znaka), boje, trajne lokacije stadiona, preoblikovanja, pripajanja, spajanja ili podjele Kluba te dobrovoljnog prestanka rada Kluba raspisuje se, sukladno Clanku 55. Ovog Statuta, referendum svih \\u00a2lanova Kluba s pravom glasa. (3) Za promjene ovog Clanka Statuta mora se raspisati referendum sukladno \\u00a2lanku 55. Ovog Statuta. Clanak 7. Klub zastupaju Predsjednik Kluba, Predsjednik Nadzornog odbora Kluba 1 Uprava\", \"Kluba, sukladno odredbama ovog Statuta. Clanak 8. (1) Klub: a. postupa sukladno Pravilima nogometne igre koje je donio Medunarodni nogometni savez BORD (IFAB); b. poSstuje nacela privrzenosti, integriteta 1 sportskog ponaSanja kao izraza fairplaya; c. postuje statut, pravilnike 1 odluke FIFA-e 1 UEFA-e 1 Hrvatskog nogometnog saveza (HNS) u svako vrijeme; d. priznaje nadleZnost Arbitraznog suda za sport (CAS) u Lausanni (Svicarska), kao Sto je utvrdeno relevantnim odredbama Statuta FIFA-e, UEFA-e; - NACRT PRIJEDLOGA - e. priznaje nadleznost Arbitraznog suda HNS-a 1 sukladno tome podnosit Ce sve sporove nacionalnih razmjera, koji su nastali 1z ili u vezi s primjenom Statuta ili pravilnika HNS-a, u posljednjoj instanci samo tim arbitrazama, koje rjeSavaju svoje sporove, iskljucujuci svaki redovni sud, osim ukoliko je to izricito zabranjeno vazecim zakonodavstvom u Republici Hrvatsko}. (2) U sluc\\u00e9aju sporova za koje su nadlezna pravosudna tijela FIFA-e, UEFA-e, CAS-a, Arbitraznog suda Saveza ili pravnih tijela Saveza, Klub se obvezuje da spor nece iznositi pred redovne sudove. (3) Klub poStuje sve odluke nadleznih tijela HNS-a, FIFA-e 1 UEFA-e 1 CAS-a. Clanak 9. (1) Klub je neutralan po pitanjima politike 1 vjere. (2) Diskriminacija bilo koje vrste prema osobama temeljena na osnovi rase ili etnicke pripadnosti, nacionalnog ili socijalnog podrijetla, vjere, spola, jeziku, politi\\u00a2kog uvjerenja 1 ostalim razlozima propisanim posebnim propisima o suzbijanju diskriminacije zabranjena je te predstavlja razlog za iskljucenje 1z Kluba u stegovnom postupku. Il. VIZIJA, MISIJA, SVRHA, CILJEVI, NACELA TE PODRUCJE DJELOVANJA I DJELATNOSTI KLUBA Clanak 10. Vizija, misija 1 svrha Kluba: (1) Vizija Kluba je predstavljati Grad Zagreb 1 Republiku Hrvatsku kao medunarodno prepoznat klub koji postize sportske 1 poslovne uspjehe, okuplja svoje Clanove 1 navijace te konstantno stvara svojim primjerom pozitivne druStvene promjene. Klub tezi biti najboljim primjerom kako klub svojih \\u00a2lanova moZe biti uspjeSan, otvoren 1 vjerodostojan u svemu Sto radi \\u2014 na terenu 1 izvan njega. (2) Misija Kluba je Klub svojih Clanova, s dubokom gradanskom 1 hrvatskom tradicijom, koji svakodnevno spaja sport, zajednicu 1 navijacku strast. Klub djeluje odgovorno, transparentno 1 ukljucivo kroz odgoj mladih sportaSa, izgradnju povjerenja medu naviyacima, jacanja zagrebackog 1 hrvatskog identiteta te aktivno djelovanje kao pozitivan cimbenik u drustvu. Cilj Kluba je uvijek poSteno pobiyediti na terenu, ali 1 vjerodostojno predstavljati Klub 1 pripadnost plavoj boji. (3) Svrha Kluba je sluziti svojim Clanovima 1 navijacima kroz vrhunski nogomet 1 prezentaciju sporta, razvoj mladih, promicanje pozitivnih vrednota u druStvu te jacanje zajednistva na lokalnoj 1 nacionalnoj razini. Clanak 11. Ciljevi Kluba su: (1) Identitet 1 vrednote: a. Njegovati identitet Kluba kao otvorenog, gradanskog 1 hrvatskog kluba, temeljenog na nacelima demokraticnosti, transparentnosti 1 zajedniStva. - NACRT PRIJEDLOGA - Promicati kulturu poStenja, odgovornosti, izvrsnosti 1 medusobnog uvazavanja u Svim segmentima djelovanja Kluba. Razvyati Klub kao medunarodno prepoznat 1 vjerodostojan sportski 1 drustveni simbol koji svojim primjerom potice pozitivne promjene u sportu 1 druStvu. Aktivno ukljucivati bivSe igra\\u00e9e kao ambasadore klupskih vrijednosti te poticati njihovo javno djelovanje u promociji sporta, zajednistva 1 druStvene odgovornosti. (2) Sportski razvoj 1 rezultati: a. Postizati vrhunske sportske rezultate kroz stalni razvoj igrackog kadra, posebno putem omladinske\", \"Skole, s ciljem stvaranja igraca za prvu mom\\u00e9ad 1 hrvatsku reprezentaciju. Sudjelovati u domacim 1 medunarodnim natjecanjima te na dostojan nacin predstavljati Klub, Grad Zagreb 1 Republiku Hrvatsku. Osiguravati profesionalni 1 stru\\u00e9ni razvoj sportskih djelatnika kroz obrazovanje, razmjenu znanja 1 cjelozivotno ucenje. Ulagati u sportsku 1 klupsku infrastrukturu 1 tehnoloski razvoj, u skladu s europskim standardima 1 nacelima odrzivosti. Podrzavati muSke, zenske, veteranske 1 futsal ekipe te druge varijante nogometnog sporta s ciljem razvoja 1 popularizacije nogometa. (3) DruStveni utjecaj 1 zajednica: a. Biti srediSnje mjesto okupljanja Clanova, osobito djece 1 mladih, kroz organizaciju Skola nogometa 1 poticanje sportskog na\\u00a2ina Zivota. Aktivno doprinositi lokalnoj zajednici kroz druStveno odgovorne projekte, s posebnim naglaskom na mlade 1 ranjive skupine. Sustavno izgradivati povjerenje medu Clanovima 1 navijacima Kluba kroz otvoren dialog 1 ukljucivanje u odlucivanje, temeljem participativnog modela upravljanja. Clanak 12. Na\\u00e9ela upravljanja Klubom su: a. Zakonitost, eti\\u00a2nost 1 odgovornost: Klub djeluje u skladu sa zakonima, najvisim eti\\u00a2kim standardima 1 odgovorno prema svojim Clanovima, navijacima 1 zajednici. Transparentnost 1 otvorenost: Komunikacia s Clanovima 1 javnoScu temelji se na iskrenosti, dostupnosti informacija 1 jasnom obrazlaganju odluka. Participacija 1 ukljucivost: Klub potic\\u00a2e aktivno sudjelovanje Clanova 1 naviaca u donoSenju odluka te njeguje dialog 1 uvazavanje razlicitih misljenja. Izvrsnost 1 razvoj: Klub tezi izvrsnosti u sportu, poslovanju 1 drustvenom djelovanju, promice ucenje, inovacije 1 stalno unapredenje. Integritet 1 sukob interesa: Svi koji djeluju u ime Kluba duzni su razdvajati privatne 1 klupske interese te postupati u najboljem interesu Kluba. Gradanski identitet 1 druStvena odgovornost: Klub Cuva svoju zagrebacku 1 hrvatsku tradicyu, promice zajedniStvo, poStovanje razlicitosti 1 koristi sport kao alat pozitivnih drustvenih promjena. - NACRT PRIJEDLOGA - Clanak 13. Djelatnosti Kluba su: a. Natjecateljska aktivnost: Sudjelovanje u profesionalnim 1 amaterskim natjecanjima u nogometu na lokalnoj, drzavnoj 1 medunarodnoj razini, za sve uzraste 1 kategorye. Razvoj sportaSa 1 stru\\u00a2nog kadra: Stru\\u00a2\\u00e9no-pedagoSki rad s igra\\u00a2ima svih dobnih skupina kroz Skole nogometa, treninge 1 pripreme, te osposobljavanje 1 usavrSavanje vlastitog trenerskog 1 strucnog kadra. Infrastruktura 1 tehnicka podrska: Upravljanje, odrzavanje 1 daljnji razvoj sportske infrastrukture te osiguravanje svih uvjeta potrebnih za licenciranje prema propisima HNS-a 1 UEFA-e. Suradnja 1 umrezavanje: Razviyanje suradnje s drugim sportskim klubovima, sportskim 1 stru\\u00a2nim organizacijama, kao 1s tijelima javne vlasti te pravnim 1 fizi\\u00a2kim osobama u cilju ostvarivanja sportskih interesa. Razvoj Clanstva 1 klupske kulture: Organizirano okupljanje Clanova svih uzrasta te promicanje vrijednosti Kluba kroz izdavanje publikacija 1 razvoj odnosa s navijacima 1 zajednicom. Promicanje 1 razvoj nogometa: Poticanje nogometa u skladu s nacionalnim 1 lokalnim strateSkim dokumentima, s posebnim naglaskom na djecu, mlade 1 zdravstveno usmjereno tjelesno vjezbanje. Zdravlje 1 sigurnost sportaSa: Sudjelovanje u sustavima zdravstvene skrbi, antidopinga te promicanje sigurnosti, posebno u zastiti djece 1 borbi protiv nasilja u Sportu. Edukacija 1 savjetovanje: Provodenje edukacija, informiranje 1 savjetovanje sportaSa, sportskih djelatnika 1 gradana o temama relevantnima za sport 1 zdravlje. Administrativne 1 zakonske obveze: Vodenje propisanih evidenciyya u nacionalnim sportskim sustavima te obavljanje svih drugih poslova sukladno zakonu 1 Statutu Kluba. Clanak 14. (1) Gospodarske djelatnosti koje Klub obavlja su: a. b.\", \"C. d. izdavacka djelatnost; prodaja proizvoda 1 usluga, sukladno posebnim propisima; promidzbene djelatnosti; davanje u zakup 1 podzakup vlastitih poslovnih prostora 1 mjesta za oglaSavanje. (2) Djelatnosti 1z stavka 1. ovog Clanka Klub obavlja u skladu s posebnim propisima koji ureduju gospodarsko poslovanje udruga kao pravnih osoba. (3) Djelatnosti 1z stavka 1. ovog Clanka ne mogu se obavljati radi stjecanja dobiti za svoje Clanove ili trece osobe. (4) Ako u obavljanju gospodarskih djelatnosti Klub ostvari dobit ona se mora koristiti iskljucivo za obavljanje 1 unapredenje djelatnosti Kluba kojima se ostvaruju ciljevi Kluba, utvrdeni ovim Statutom, sukladno zakonu. - NACRT PRIJEDLOGA - Clanak 15. Klub moze osnivati trgovacka druStva sukladno odredbama Zakona o trgovackim druStvima, kao 1 druge oblike pravnih osoba sukladno posebnim propisima, ako je to u cilju osiguranja materyalnih uvjeta rada 1 razvoja Kluba. Clanak 16. (1) Djelovanje Kluba je javno, a ostvaruje se putem: a. internetskih stranica Kluba, aplikacija 1 druStvenih mreza; b. javnih media; c. povjerenika Kluba; d. ostalih nacina informiranja sukladno odluci Uprave Kluba. (2) Clanove Kluba pravodobno se obavje8tava o radu Kluba, aktima i odlukama njegovih tijela posebnim izvjeScima te skupovima za Clanove koji se organiziraju najmanje jednom godisnje. (3) O nacinu javnosti rada Kluba 1 obavjeStavanja Clanova odluku donosi Uprava Kluba. Clanak 17. (1) Klub se moZe udruziti u saveze udruga, zajednice, mreze 1 u medunarodne udruge. (2) Odluku o udruZivanju donosi Skup\\u00a7Stina Kluba. Ill. CLANOVI KLUBA, PRIJATELJI KLUBA I POVJERENICI KLUBA 1. CLANOVI KLUBA Clanak 18. (1) Clanom Kluba moZe postati svaka fizi\\u00a2ka osoba koja ispunjavanjem pristupnice prihva\\u00e9a nacela djelovanja, Statut 1 druge akte Kluba te koja uplati Clanarinu 1z Clanka 19. ovog Statuta. (2) Osobe mlade od 18 godina te osobe liSene poslovne sposobnosti mogu postati \\u00a2lanom Kluba na nacin da: a. Za osobu mladu od 14 godina ili osobu li8enu poslovne sposobnosti pisanu izjavu o uclanjivanju daje zakonski zastupnik ili skrbnik; b. Za osobu stariyju od 14 godina, a mladu od 18 godina zakonski zastupnik ili skrbnik daje pisanu suglasnost. Clanak 19. (1) Fizi\\u00a2ke osobe 1z Clanka 18. ovog Statuta postaju Clanovi Kluba upisom u Jedinstveni popis Clanova. - NACRT PRIJEDLOGA - (2) Clanstvo u Klubu prestaje istekom kalendarske godine. Po isteku kalendarske godine, fizi\\u00a2ka osoba koja je bila Clanom Kluba u toj kalendarskoj godini moze obnoviti \\u00a2lanstvo za iducu kalendarsku godinu novom uplatom godisnje Clanarine, s time da Clanska prava 1 obveze u toj kalendarskoj godini teku od trenutka obnove Clanstva u Klubu. (3) Visinu Clanarine odreduje Nadzorni odbor. (4) Svaki \\u00a2lan moze dobiti Clansku iskaznicu 1j1 izgled definira Uprava Kluba. Clanak 20. (1) Jedinstveni popis Clanova vodi strucna sluzba po odluci Uprave Kluba u elektroni\\u00a2kom obliku te obavezno sadrzi podatke o osobnom imenu, osobnom identifikacijskom broju (OIB), datumu rodenja, datumu pristupanja Klubu 1 datumu prestanka Clanstva u Klubu. (2) U arhivi Kluba Cuvaju se privole o koriStenju osobnih podataka u skladu s propisima o zaStiti podataka, adrese prebivalista ili boraviSta, brojevi telefona, adrese e-poSte 1 ostali podaci iz pristupnice ili pisane izjave o uclanjivanju. (3) Jedinstveni popis Clanova uvijek\", \"je, u sjediStu Kluba ili na drugom mjestu po odluci Uprave Kluba, dostupan u elektroni\\u00a2kom obliku na uvid svim Clanovima 1 nadleznim tijelima na njihov zahtjev, u skladu sa zakonom 1 drugim propisima o zaStiti podataka. Clanak 21. (1) Punoljetni 1 poslovno sposobni Clanovi Kluba, pod uvjetom da su bili \\u00a2lanovi Kluba i u prethodnoj kalendarskoj godini, sukladno odredbama ovog Statuta, imaju pravo: a. biratii biti birani u tijela Kluba; b. zatraziti raspisivanje referenduma; c. glasovati na referendumu; d. sudjelovati u radu 1 upravljanju Klubom putem izabranih predstavnika u Skup&tini 1u drugim tijelima Kluba te sudjelovati u savjetodavnim odborima 1 povjerenstvima koje osniva Nadzorni odbor Kluba. (2) Svi \\u20aclanovi Kluba, sukladno odredbama ovog Statuta, imaju pravo: a. biti pravodobno obavjeStavani o radu Kluba te aktima 1 odlukama tijela Kluba na nacin propisan Statutom, posebnim aktima 1 odlukama Uprave Kluba; b. biti nagradeni pocasnim odlikovanjima za doprinos Klubu ili za dugotrajno Clanstvo, sukladno odluci Nadzornog odbora Kluba; c. komunicirati pisanim putem s Klubom 1 dobiti pravodobne odgovore, sukladno odluci Uprave Kluba; d. sudjelovati na skupovima za Clanove. (3) Svi \\u20aclanovi Kluba mogu ostvarivati dodatne pogodnosti sukladno odluci Uprave Kluba. Clanak 22. Duznosti 1 odgovornosti \\u00a2lanova Kluba su: a. poStovati nacela djelovanja, Statut te druge akte 1 odluke Kluba; b. podupirati Klub 1 aktivno sudjelovati u ostvarenju ciljeva Kluba; - NACRT PRIJEDLOGA - obavijestiti Klub o promjeni osobnog imena te adresi prebivali8ta ili boraviSta; d. Stititi ugled 1 dostojanstvo Kluba suzdrzavajuci se od ponaSanja 1 radnji koje Stete Klubu te njegovu ugledu, Casti 1 dostojanstvu. Clanak 23. Igraci, Clanovi Uprave Kluba 1 zaposlenici Kluba koji su Clanovi Kluba te povjerenici Kluba, pored prava 1 obveza 1z Clanaka 21.122. ovog Statuta, imaju 1 druga prava, obveze 1 odgovornosti utvrdene ugovorima te odlukama tijela Kluba. Clanak 24. (1) Clanstvo u Klubu prestaje i prije isteka kalendarske godine te se osoba bri8e iz Jedinstvenog popisa Clanova: a. dragovoljnim istupom; b. iskljucenjem u stegovnom postupku; Cc. smrcu. (2) Ukoliko \\u00a2lanu SkupStine Kluba, Nadzornog odbora Kluba, Predsjedniku Kluba ili povjereniku Kluba prestane Clanstvo u Klubu 1z razloga navedenih u stavku |. to\\u00a2kama a.- c. ovog Clanka Statuta, isto automatski dovodi do prestanka mandata u tom tiyelu Kluba 1/111 gubitka statusa povjerenika. (3) Clanovi SkupStine Kluba, \\u00e9lanovi Nadzornog odbora Kluba, Predsjednik Kluba te povjerenici Kluba duzni su do 31. (trideset prvog) prosinca tekuce kalendarske godine obnoviti Clanstvo u Klubu za iducu kalendarsku godinu novom uplatom godiSnje Clanarine. Ukoliko isto propuste uciniti, strucna sluzba iz Clanka 20. stavka 1. ovog Statuta pisanim ce ih putem upozoriti na tu duznost 1 ostaviti im rok od 15 (petnaest) dana da obnove Clanstvo. (4) Ukoliko Glan SkupStine Kluba, Clan Nadzornog odbora Kluba, Predsjednik Kluba ili povjerenik Kluba ne obnovi Clanstvo u Klubu niti u roku 1z stavka 3. ovog Clanka Statuta, isto automatski dovodi do prestanka mandata u tom tiyelu Kluba 1/ili gubitka statusa povjerenika. Clanak 25. (1) Disciplinski prekrSaj predstavlja svako djelovanje Clana Kluba kojim se krSe nacela djelovanja 1 ciljevi Kluba, odredbe Statuta 1 drugih akata Kluba, odluke tijela Kluba\", \"ili odredbe relevantnih zakona 1 podzakonskih propisa. (2) Dyelovanje 1z stavka 1. ovog Clanka Statuta smatra se teSkim disciplinskim prekrSajem ukoliko se Klubu takvim djelovanjem nanosi materiyalna ili nematerijalna Steta, a osobito: a. iznoSenje poslovne ili sluzbene tajne ili ostalih povjerljivih informacija Kluba bez odobrenje nadleznih tijela Kluba; b. grubo vrijedanje Casti 1 ugleda Kluba; c. grubo vrijedanje, klevetanje ili nanoSenje materialne ili nematerijalne Stete drugim \\u00a2lanovima Kluba ili Prijateljima Kluba, povjerenicima Kluba, kao 1 \\u00a2lanovima tijela Kluba tijekom ili zbog obavljanja njihovih funkcya; - NACRT PRIJEDLOGA - d. prisila, prijetnja te svaki drugi oblik nezakonitog utjecaja il1 pokuSaj takvog nezakonitog utjecaja na Clanove tijela Kluba, ostale organe Kluba, zaposlenike Kluba 1 sli\\u00a2no, koji sprjecavaju ili otezavaju obavljanje poslova 1z njihove nadleznosti; e. nasilnicko, diskriminatorno 1 rasisti\\u00a2ko ponaSanje. (3) Stegovne mjere su: a. Opomena; b. Suspenziya \\u00a2lanstva na rok od 3 (tri) mjeseca do 3 (tri) godine; c. Trajno iskljucenje iz Clanstva. (4) Stegovne mjere 1z stavka 3. tocaka b. 1c. ovog Statuta mogu se izreci za teSke disciplinske prekrSaje te u slucajevima ponavljanja disciplinskih prekrSaja 1z stavka 1. ovog Clanka Statuta radi kojih su \\u00a2lanu Kluba prethodno bile izrec\\u00e9ene stegovne mjere opomene. (5) Stegovni postupak pokre\\u00e9e se na zahtjev bilo kojeg Clana tijela Kluba. (6) Odluku o stegovnoj mjeri, kao prvostupanjsko tijelo, donosi Uprava Kluba u roku od 30 (trideset) dana od dana pokretanja stegovnog postupka. (7) Clanu Kluba se odluka 0 stegovnoj mjeri dostavlja na adresu prebivali8ta ili boravi8ta koju je naznacio prilikom uclanjenja u Klub ili 0 kojoj je, sukladno Clanku 22. stavku 1. to\\u00e9ci c. ovog Statuta, obaviyestio Klub. (8) Protiv odluke o stegovnoj mjeri lan Kluba ima pravo na Zalbu. Zalba se podnosi Nadzornom odboru, kao drugostupanjskom tijelu, u roku od 15 (petnaest) dana od dana primitka odluke. (9) Nadzorni odbor duzan je o zalbi odluciti u roku od 30 (trideset) dana, ra\\u00a2unajyuci od dana primitka zalbe. (10) Odluka Nadzornog odbora 0 stegovnoj mjeri je kona\\u00e9na. (11) Ustegovnom postupku u kojem je disciplinski okrivljenik \\u00a2lan tijela Kluba koje odlucuje o stegovnim mjerama, taj Clan ne sudjeluje u raspravi 1 donoSenju odluke o stegovnoj mjeri. 2. PRIJATELJI KLUBA Clanak 26. (1) Prijatel) Kluba moze postati fizi\\u00a2ka osoba iz zemlje ili inozemstva koja moralno 1 materyalno podupire nac\\u00e9ela djelovanja Kluba. Prijatelj Kluba nije lan Kluba, no moze, u skladu s propisima, uzivati pogodnosti odredene posebnim aktom Kluba. (2) Prijateljem Kluba postaje se upisom u Jedinstveni popis Prijatelja Kluba koji vodi struc\\u00e9na sluzba po odluci Uprave Kluba. Jedinstveni popis Prijatelja Kluba ne mora sadrzavati OIB. (3) Prijatelji Kluba ne mogu birati ili biti birani u tijela Kluba, izuzev Uprave Kluba, niti sudjelovati u izbornim postupcima ili referendumu, ali mogu biti izabrani u savjetodavne odbore 1 povjerenstva koje osniva Nadzorni odbor. (4) Prijatelju Kluba izdaje se iskaznica \\u00a21j1 izgled definira Uprava Kluba. (5) Prijatel} Kluba ne moze biti osoba koja svojim ponaSanjem 1 radnjama nanosi materyalnu ili nemateryalnu Stetu Klubu te koja nasilni\\u00a2kim, diskriminatornim 1 rasisti\\u00a2kim ponaSanjem radnjama onemogu\\u00a2ava ostvarenje ciljeva 1 obavljanje djelatnosti te Steti ugledu Kluba. -\", \"NACRT PRIJEDLOGA - (6) Prijatelji Kluba imaju pravo biti pravodobno obavjeStavani o radu Kluba 1 aktima 1 odlukama njegovih tijela na nacin propisan Statutom, posebnim aktima 1 odlukama Uprave te komunicirati pisano 1 putem skupova za Clanove s tyelima Kluba u okviru nyihove nadleznosti 1 dobiti pravodobne odgovore, a duzni su poStivati Statut 1 druge akte Kluba, podupirati Klub te suzdrzavati se od ponaSanja 1 radnji koje Stete Klubu 1 njegovu ugledu. Protiv Prijatelja Kluba se takoder moze provesti disciplinski postupak sukladno \\u00a2lanku 25. ovog Statuta. (7) Osoba prestaje biti Prijateljem Kluba istekom kalendarske godine, temeljem izjave da ne Zeli vise biti Prijatel) Kluba, smrc\\u00e9u ili isklju\\u00e9enjem u stegovnom postupku sukladno odredbi Clanka 25. ovog Statuta. (8) Prijateljima Kluba mogu se izre\\u00a2i stegovne mjere na nacin 1 pod uvjetima propisanim u Clanku 25. ovog Statuta. (9) Posebnim aktom Uprave Kluba detaljnije se ureduju pitanja vezana za proceduru stjecanja statusa Prijatelja Kluba, pogodnostima, obnavljanju 1 prestanku statusa Prijatelja Kluba. (10) Visinu naknade za Prijatelje Kluba odreduje Nadzorni odbor, a jednaka je visini Clanarine za Clanove Kluba. 3. POVJERENICI KLUBA Clanak 27. (1) Povjerenik moze biti svaki \\u00a2lan Kluba koji je podnio zamolbu 1 koji ispunjava sljedece uvjete: da je punoljetna 1 poslovno sposobna osoba; b. da jeu trenutku podnoSenja zamolbe \\u00a2lan Kluba, pod uvjetom da je bio \\u00a2lan Kluba 1 u prethodnoj kalendarskoj godini; c. daje prije podnosenja zamolbe, u kalendarskoj godini u kojoj je podnio zamolbu, na njegovu preporuku u Klub uclanjeno najmanje 50 Clanova Kluba; d. dane postoje zapreke 1z ovog Statuta. (2) Odluku o imenovanju 1 razrjeSenju povjerenika donosi Uprava Kluba. Povjerenik moze Upravi Kluba podnijeti 1 ostavku na mjesto povjerenika. (3) Povjerenik je duzan poticati uclanjivanje novih Clanova Kluba 1 upisivanje novih Priyatelja Kluba te ih izvjeStavati o drugim vaznim temama koje se odnose na ostvarivanje ciljeva Kluba 1 obavljanje njegove djelatnosti te je duzan, u slucajevima propisanim Clankom 52. ovog Statuta, sudjelovati na izborima kao kandidat za Clana SkupStine Kluba. (4) Uprava Kluba moze s imenovanim povjerenikom zakljuciti ugovor o medusobnim pravima 1 obvezama. IV. TIJELA KLUBA Clanak 28. 10 - NACRT PRIJEDLOGA - Tiela Kluba su: a. SkupStina Kluba (u daljnjem tekstu 1: SkupStina) b. Predsjednik Kluba (u daljnjem tekstu 1: Predsjednik) c. Nadzorni odbor Kluba (u daljnjem tekstu 1: Nadzorni odbor) d. Uprava Kluba (u daljnjem tekstu 1: Uprava) Clanak 29. (1) Clanovi tijela Kluba mogu biti samo punoljetni i poslovno sposobni \\u00e9lanovi Kluba pod uvjetom da su isti bili Clanovi Kluba i u kalendarskoj godini koja prethodi godini u kojoj se odrzavaju izbori, osim u slucaju imenovanja Clanova Uprave Kluba. (2) Clanovi klupskih tijela ne mogu biti osobe za koje postoji zapreka Zakona o sportu i iz Zakona o udrugama. (3) Clanovi tijela Kluba, \\u00e9lanovi Izbornog povjerenstva niti Poasni predsjednik Kluba, uz razloge 1z stavka 2. ovog Statuta ne mogu biti osobe: koje su aktivni nogometni sudac, ili osoba koja je to bila u posljednje 3 (tri) godine; koje ne mogu biti Clanovi Uprave odnosno nadzornog odbora dionickog drustva prema odredbama Zakona o\", \"trgovackim druStvima 1 Zakona o sprjecavanju sukoba interesa u obnaSanju javnih duznosti; koji su dioni\\u00e9ari ili Clanovi drugog nogometnog kluba; koje svojim djelovanjem mogu neposredno utjecati na sustav natjecanja u odgovarajucem sportu, a osobito sporta8i koji su profesionalci prema Zakonu o sportu, menadzZeri 1 posrednici u sportu, kao 1 osobe koje su to bile u razdoblju od posljednjih godinu dana; koje su posljednjih godinu dana bile Clanovi ili Clanovi tijela pravne osobe koja obavlja djelatnost organiziranja sportske kladionice; koje s menadzerima 1 posrednicima u istome sportu 1 Clanovima pravnih osoba te Clanovima tiela pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica djeluju zajednick1; koje imaju ili su posljednjih godinu dana imale sklopljen ugovor sa nogometasem ili nogometnim trenerom na temelju kojega ostvaruje pravo na dio prihoda koji proizlaze 1z obavljanja djelatnosti nogometaSa ili nogometnog trenera; koje su ovlaStene za zastupanje u pravnoj osobi koja sukladno Zakonu o sportu ima sklopljene ugovore o ulaganju u fizi\\u00a2ke osobe u nogometu; koje su u posljednje tri godine pravomocno kaznjene za kaznena djela ili prekrSaje u sportu 1 U vezi sa sportom 1 sportskim natjecanjima; koje su pravomo\\u00e9no osudene na kaznu zatvora u trajanju od najmanje 6 (Sest) mjeseci za neko od kaznenih djela pocinjena s namjerom, a nije primijenjena uvjetna osuda godinu dana od odsluzenja kazne; koje ne ispunjavaju druge uvjete propisane Zakonom o sportu 1 drugim zakonima; koje su aktivni igra\\u00a2, trener 111 zaposlenik Kluba, a ako to postanu tijekom mandata u tyelima Kluba, prestaje im mandat 1 Clanstvo u tyelu Kluba, osim Clanovima Uprave Kluba za \\u00a2lanstvo 1 zaposlenicki odnos u Upravi, kao Sto niti Predsjedniku 11 - NACRT PRIJEDLOGA - za njegov zaposlenicki odnos 1 profesionalne duznosti ne prestaje mandat 1 Clanstvo u tielima koji proizlaze 1z funkcije Predsjednika prema ovom Statutu. (4) Svaki \\u00a2lan Kluba koji ulazi u bilo koja tiyela Kluba mora potpisati izjavu kojom izjavljuje da za njega ne vrijede gore navedeni uvjeti te da \\u00a2e u slucaju nastupa gore navedenih uvjete odmah obavyestiti Upravu Kluba. (5) Ukoliko se na izborima za SkupStinu Kluba kandidiraju zaposlenici Kluba, istima 1zborom u SkupStinu Kluba automatski prestaju ugovori o radu 1/ili sli\\u00a2ni ugovori koje imaju zakljucene s Klubom. Iznimno, ako se na izborima kao nositely liste za svoj drugi mandat kandidira Predsjednik, ne prestaje mu ugovor tijekom izbornog postupka. Clanak 30. (1) Mandat Clanovima tijela Kluba prestaje istekom mandata ill: a. smrcu; b. pisanom ili zapisnikom konstatiranom ostavkom; c. razrjeSenjem; d. izborom novog saziva tiyela Kluba; e. gubitkom poslovne sposobnosti; f. prestankom Clanstva u Klubu sukladno Clanka 24. stavaka 2. 1 4. ovog Statuta; g. nastupom okolnosti iz Clanka 29. stavaka 2.13. ovog Statuta. (2) Iznimno od stavka 1. ovog \\u00a2lanka Statuta, \\u00a2lanu Uprave mandat ne prestaje nastupom okolnosti 1z stavka 1. tocke f. ovog Statuta. 1. SKUPSTINA Clanak 31. (1) SkupStina je najviSe tiyelo Kluba. (2) SkupStina se sastoji od 50 (pedeset) predstavnika \\u00a2\\u20aclanova Kluba izabranih na na\\u00a2in propisan odredbama ovog Statuta. (3) Mandat Clanova SkupStine, osim u slucajevima propisanim \\u00a2lankom 30. to\\u00a2\\u00e9kama a., b., d., e., f. 1\", \"g. ovog Statuta, je 5 (pet) godina te isti Clanovi mogu biti izabrani na novo mandatno razdoblje. Clanak 32. (1) SkupStina: a. utvrduje opcu politiku, strateSke ciljeve 1 smyernice rada Kluba na temelju Izbornog programa pobjednicke izborne liste; b. usvaja Statut Kluba te predlaze njegove izmjene 1 dopune u slucajevima propisanim odredbama ovog Statuta; c. usvaja plan rada i financijski plan za sljedecu kalendarsku godinu; 12 - NACRT PRIJEDLOGA - d. usvaja godiSnje financijsko izvjeSce 1 izvjeSca Predsjednika Kluba o radu za prethodnu kalendarsku godinu; e. verificira izvjeSce o radu Nadzornog odbora za prethodnu kalendarsku godinu; f. donosi Poslovnik o radu SkupStine Kluba, Pravilnik 0 izborima u Klubu te druge akte 1 odluke vazne za rad Kluba prema ovom Statutu; g. odlucuje o promjeni ciljeva, djelatnosti 1 obavljanju gospodarskih djelatnosti Kluba; h. odlucuje o udruzivanju u saveze, zajednice, mreze 1 druge oblike povezivanja udruga; 1. birairazrjeSava Predsjednika Kluba; j. bira 1 razrjeSava Predsjednika Nadzornog odbora, Zamyjenika Predsjednika Nadzornog odbora te ostale Clanove Nadzornog odbora; k. moze, uz Nadzorni odbor, razrijesiti Izborno povjerenstvo radi uocenih nepravilnosti na temelju \\u00a2Cega Nadzorni odbor provodi poziv za Clanove novog Izbornog povjerenstva; l. na prijedlog Nadzornog odbora, bira 1 razrjeSava Pocasnog predsjednika Kluba; m. imenuje 1 opoziva likvidatora Kluba; n. donosi odluku o prestanku rada Kluba, raspodjeli preostale imovine Kluba 1 o statusnim promjenama (pripajanju, spajanju 1 podjeli Kluba) 1 druge za nju formalno obvezujuce odluke u skladu s rezultatima provedenog referenduma; o. tumaci Statut 1 opce akte koje donosi, odlucuje 1 o drugim pitanjima za koje joj je ovim Statutom utvrdena nadleznost, ili nije utvrdena za druga tijela Kluba; p. naknadno verificira prestanak u Clanstvu tyela Kluba iz razloga u Clanku 24., 29.1 30. ovog Statuta na prvoj sljedecoj sjednici. Clanak 33. (1) Sjednice SkupStine, osim u slucajevima propisanim odredbama ovog Statuta, odlukom saziva Nadzorni odbor putem Predsjednika Nadzornog odbora, a u slucaju njegove sprijecenosti putem Zamjenika Predsjednika Nadzornog odbora, a u slucaju sprijecenosti Predsjednika Nadzornog odbora 1 Zamjenika Predsjednika Nadzornog odbora putem najstarijeg (po datumu rodenja) \\u00a2lana Nadzornog odbora. (2) Nadzorni odbor najkasnije 15 (petnaest) dana prije dana odrzavanja sjednice SkupStine formira kona\\u00e9an popis svih Clanova SkupStine, a u slucaju sazivanja izvanredne sjednice Skup\\u00a7tine u najkra\\u00a2em mogu\\u00e9em roku koji ne smije biti dulji od 5 (pet) dana. (3) Clana Skup&tine kojem je mandat u Skup8tini prestao iz razloga propisanih \\u00e9lankom 30. tockama a., b., d., e., f. 1 g. ovog Statuta zamjenjuje novi Clan s popisa preostalih kandidata za Clanove SkupStine sa iste izborne liste na nacin da Nadzorni odbor, nakon Sto bude obavijeSten ili sazna za prestanak mandata pojedinog Clana Skup$Stine, uvrStava novog Clana SkupStine na kona\\u00e9an popis Clanova SkupStine. Iznimno, ukoliko \\u00a2lanu SkupStine prestane mandat u SkupStini nakon isteka roka 1z stavka 2. ovog Clanka Statuta, Nadzorni odbor, nakon Sto bude obavijeSten ili sazna za prestanak mandata Clana SkupStine, uvrStava novog Clana SkupStine na kona\\u00e9an popis Clanova SkupStine. (4) Kona\\u00e9an popis svih \\u00a2lanova SkupStine verificira se \\u00a2itanjem imena Clanova SkupStine na pocetku svake sjednice SkupStine. (5) U slu\\u00e9aju da se iscrpi\", \"broj zamjena, SkupStina nastavlja s radom sa preostalim brojem Clanova Skup$\\u00a7tine, pod uvjetom da broj \\u00a2lanova SkupStine nije manji od 26 (dvadeset Sest), 13 - NACRT PRIJEDLOGA - te se prema tom broju odgovarajuce mijenjaju potrebne vecine za donoSenje odluka iz nadleznosti SkupStine. (6) Zamjenskom Clanu SkupStine mandat traje do isteka mandata SkupStine. (7) U odluci o sazivanju SkupStine 1z stavka 1. ovog Clanka Statuta, koja se mora poslati Clanovima SkupStine, Predsjedniku Kluba 1 Pocasnom predsjedniku Kluba najkasniye 15 (petnaest) dana prije odrzavanja SkupStine, a u slucaju sazivanja izvanredne sjednice SkupStine u najkra\\u00a2em mogu\\u00a2\\u00e9em roku koji ne smye biti dulji od 5 (pet) dana, utvrduje se dnevni red te mjesto, koje je u pravilu u sjediStu Kluba, 1 vrijeme odrzavanja sjednice SkupStine. (8) Predsjednik Kluba ili naymanje 15 (petnaest) Clanova Skupstine mogu, nakon primitka odluke o utvrdivanju dnevnog reda redovne sjednice SkupStine, a najkasnije 5 (pet) dana prije sjednice SkupStine, pisanim zahtjevom Nadzornom odboru dopuniti dnevni red bilo kojom tockom koja je u nadleznosti SkupStine, a Uprava je o primitku pisanog zahtjeva duzna bez odgode obavijestiti Nadzorni odbor. (9) Nadzorni odbor putem Predsjednika Nadzornog odbora ili osobe koja ga sukladno stavku 1. ovog Clanka Statuta zamjenjuje, duzan je dopune dnevnog reda Predsjednika Kluba ili najmanje 15 (petnaest) Clanova SkupStine uvrstiti na dnevni red SkupStine. (10) Najkasniye 3 (tri) dana prije dana odrzavanja sjednice SkupStine Clanovima SkupStine, Predsjedniku Kluba 1 Poc\\u00e9asnom predsjedniku Kluba dostavlja se kona\\u00e9ni dnevni red Skup&tine, a Clanovima SkupStine se, uz kona\\u00a2\\u00e9ni dnevni red SkupStine, obvezno dostavljaju 1 svi materijali potrebni za donoSenje odluka prema dnevnom redu. (11) Clanovi SkupStine imaju pravo, radi donogenja informirane odluke na SkupStini, i Sire od dokumenata koji se dostavljaju uz kona\\u00e9ni dnevni red, bilo kada od tijela Kluba pisanim zahtjevom traziti podatke, pod uvjetom da isti ne predstavljaju poslovnu ili sluzbenu tajnu 1 u skladu su s posebnim propisima o zastiti osobnih podataka. Ukoliko do dana odrzavanja sjednice SkupStine Clan SkupStine ne dobye trazene podatke, tijelo Kluba kojem je zahtjev upucen duzno je odgovor na zahtjev ili zatrazene podatke dati na sjednici SkupStine 1 to prie donoSenja odluke o to\\u00e9ci dnevnog reda za koju je zahtjev upucen. Clanak 34. (1) Sjednice SkupStine mogu biti izborne, redovite 1 izvanredne. (2) Izborna sjednica SkupStine odrzava se najkasniye u roku od 15 (petnaest) dana od dana odrzavanja izbora 1 u drugim slucajevima propisanim ovim Statutom te na istoj, a sukladno rezultatima izbora te odredbama ovog Statuta, izabire Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te ostale Clanove Nadzornog odbora. (3) Redovna sjednica SkupStine saziva se najmanje jednom godiSnje. (4) Izvanredna sjednica SkupStine moze se sazvati prema potrebi, za bilo koju odluku iz nadleznosti SkupStine, a mora se sazvati: a. ako, 1z razloga propisanih Clankom 44. ovog Statuta, prestane mandat Predsjedniku Kluba; b. ako, 1z razloga propisanih \\u00a2lankom 30. tockama a.-g. ovog Statuta, prestane mandat svim Clanovima Nadzornog odbora ili broj Clanova Nadzornog odbora padne ispod broja 5 (pet); 14 - NACRT PRIJEDLOGA - c. ako sazivanje izvanredne sjednice SkupStine, obrazlozenim zahtjevom koji sadrzi\", \"1 prijedlog dnevnog reda izvanredne sjednice Skup$&tine, zatrazi Nadzorni odbor; d. ako sazivanje izvanredne sjednice SkupStine, obrazlozenim zahtjevom koji sadrzi 1 prijedlog dnevnog reda izvanredne sjednice SkupStine, zatrazi natpolovicna vec\\u00a2ina Clanova Skup$&tine. (5) U slu\\u00e9aju iz stavka 4. tocke a. ovog Clanka Statuta, izvanredna sjednica SkupStine saziva se na na\\u00a2\\u00e9in 1 u rokovima propisanim Clankom 44. ovog Statuta. (6) U sluc\\u00e9aju iz stavka 4. tocke b. ovog Clanka Statuta, Predsjednik Kluba duzan je sazvati izvanrednu sjednicu SkupStine u roku od 5 (pet) dana od saznanja za prestanak mandata svim Clanovima Nadzornog odbora ili pada broja Clanova Nadzornog odbora ispod broja 5 (pet). (7) U slu\\u00e9aju 1z stavka 4. togaka c. 1d. ovog Clanka Statuta, Nadzorni odbor putem Predsjednika Nadzornog odbora ili osobe koja ga sukladno Clanku 33. stavku 1. ovog Statuta zamjenjuje, duzan je sazvati izvanrednu sjednicu SkupStine u roku od 5 (pet) dana od zaprimanja zahtjeva za sazivanje izvanredne sjednice Skup$Stine te se ista mora odrzati najkasnie u roku od 15 (petnaest) dana od odluke o sazivanju. (8) Ako Predsjednik Nadzornog odbora ili osoba koja ga sukladno Clanku 33. stavku 1. ovog Statuta zamjenjuje, u slucajevima iz stavka 4. tocaka c. 1 d. ovog Statuta, ne sazove izvanrednu sjednicu SkupStine u roku od 5 (pet) dana od dana zaprimanja zahtjeva, izvanrednu sjednicu SkupStine mogu sazvati sami predlagatelji, na nacin da svi predlagatelj1 potpisu poziv kojom se saziva sjednica izvanredne SkupStine. (9) Nakon sazivanja izvanredne sjednice SkupStine na zahtjev Nadzornog odbora ili natpolovi\\u00a2ne vecine Clanova Skupstine mora proteci najmanje 3 (tri) myjeseca prije podnoSenja novog zahtjeva za sazivanjem nove izvanredne sjednice SkupStine s istim prijedlogom dnevnog reda. Clanak 35. (1) SkupStina na izbornoj sjednici odlucuje pravovaljano o izborima 1z Clanka 34. stavka 2. ovog Statuta, ako je na sjednici nazo\\u00e9na natpolovi\\u00a2na vecina Clanova SkupStine, a odluke donosi vecinom glasova svih \\u00a2lanova Skup&tine, osim ako odredbama ovog Statuta nije propisan drugaciji nacin donoSenja odluka. (2) SkupStina odlucuje pravovaljano ako je na sjednici nazo\\u00e9na natpolovicna vecina Clanova Skup&tine, a odluke donosi vecinom glasova nazo\\u00e9nih Clanova Skup$&tine, osim ako Statutom nye propisan drugaciji nacin donoSenja odluke. (3) SkupStina dvotre\\u00a2cinskom vecinom svih Clanova SkupStine donosi odluku o: a. izmjenama 1 dopunama Statuta, osim u slucajevima kada je za promjenu tog diyela Statuta prethodno potrebno provodenje referenduma, kada odlucuje na nacin propisan stavkom 2. ovog \\u00a2lanka Statuta; b. razrjeSenju cijelog Nadzornog odbora, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora 1/ili pojyedinih Clanova Nadzornog odbora; c. razrjeSenju Predsjednika Kluba; d. razrjeSenju Pocasnog predsjednika Kluba; e. sazivanju izvanrednih izbora. 15 - NACRT PRIJEDLOGA - (4) U slucaju izjednacenog broja glasova kod donoSenja odluka SkupStine odlucujuci je glas Predsjednika Nadzornog odbora ili osoba koje ga u slucaju sprijecenosti zamjenjuju sukladno \\u20aclanku 36. stavku 1. ovog Statuta. Clanak 36. (1) Sjednicama SkupStine predsjeda Predsjednik Nadzornog odbora, a u slucaju njegove sprijecenosti Zamyjenik Predsjednika Nadzornog odbora, a u_ slucaju_ sprijecenosti Predsjednika Nadzornog odbora 1 Zamjenika Predsjednika Nadzornog odbora najstariji (po datumu rodenja) nazo\\u00e9ni \\u00a2lan Nadzornog odbora. (dalje u tekstu i: Predsjedavajuci SkupStine). Iznimno, ako prestane mandat svim Clanovima Nadzornog odbora\", \"111 bro} Clanova Nadzornog odbora padne ispod broja 5 (pet), Predsjedavajuci SkupStine na izvanredno] sjednici SkupStine je Predsjednik Kluba. (2) SkupStina zapo\\u00a2cinje verificiranjem kona\\u00a2nog popisa svih Clanova SkupStine, utvrdivanjem prisutnog broja Clanova Skup$Stine od strane Predsjedavajuceg SkupStine te izborom \\u00a2lanova Radnog predsjednistva SkupStine. (3) Radno predsjednistvo SkupStine rukovodi Radom SkupStine, a_ sastoji se od Predsjedavajuceg SkupStine te 2 (dva) Clana SkupStine koja izabire Predsjedavajuci SkupStine. (4) SkupStina sve verifikacije u svojoj nadleznosti obavlja javnim \\u00a2itanjem u zapisnik. (5) Na izbornoj sjednici SkupStine, do izbora Predsjednika Kluba, Predsjednika Nadzornog odbora 1 Zamjenika Predsjednika Nadzornog odbora, sjednicom SkupStine predsjeda nositel} izborne liste koja je na izborima ostvarila veci broj glasova \\u00a2lanova Kluba. Nakon izbora Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te ostalih \\u20aclanova Nadzornog odbora, nositelja izborne liste koja je na izborima ostvarila veci broj glasova Clanova Kluba zamjenjuje Predsjednik Nadzornog odbora. (6) O radu sjednice SkupStine vodi se zapisnik koji se trajno Cuva u arhivi Kluba, a kojeg potpisuju Predsjedavajuci SkupStine 1 zapisnicar. (7) Uprava dostavlja zapisnik sa sjednica SkupStine nadleznom uredu koji vodi registar udruga. 2. NADZORNI ODBOR Clanak 37. (1) Nadzorni odbor Kluba je nadzorno 1 izvjeStajno tijelo SkupStine koje nadzire upravljanje Klubom, provodenje nacela Kluba, ukljucujuci 1 strateSke smjernice SkupStine kao 1 provodenje Izbornog programa pobjednicke izborne liste. (2) Nadzorni odbor sastoji se od 9 (devet) \\u00a2lanova izabranih 1z redova Clanova SkupStine na nacin propisan ovim Statutom, 1 to: a. Predsjednika Nadzornog odbora; b. Zamyenika Predsjednika Nadzornog odbora; c. 7(sedam) \\u00a2lanova Nadzornog odbora. (3) SkupStina, sukladno odredbama ovog Statuta, bira Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora 1 ostale Clanove Nadzornog odbora. 16 - NACRT PRIJEDLOGA - (4) Clanovi Nadzornog odbora ne mogu biti \\u00e9lanovi drugih tijela Kluba, osim Skup\\u00a7tine. Clanak 38. (1) Mandat Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te Clanova Nadzornog odbora, osim u slucajevima propisanim \\u00a2lankom 30. to\\u00a2kama a.-g. ovog Statuta, je 5 (pet) godina te isti Clanovi mogu biti izabrani na nova mandatna razdoblja. (2) U slu\\u00e9aju prestanka mandata pojedinih Clanova Nadzornog odbora iz razloga propisanih Clankom 30. to\\u00a2\\u00e9kama a.-g. ovog Statuta, Nadzorni odbor do izbora novih \\u00a2lanova nastavlja s radom s tim smanjenim brojem Clanova, pod uvjetom da broj Clanova Nadzornog odbora nije manji od 5 (pet). (3) U slu\\u00e9aju 1z stavka 2. ovog Clanka Statuta, SkupStina na prvoj sljedecoj sjednici SkupStine, na prijedlog Predsjednika Nadzornog odbora, bira preostale Clanove Nadzornog odbora 1z redova Clanova SkupStine. (4) Ukoliko, 1z razloga propisanih \\u00a2lankom 30. to\\u00a2kama a.-g. ovog Statuta, prestane mandat Predsjedniku Nadzornog odbora, novim Predsjednikom Nadzornog odbora automatski postaje Zamjenik Predsjednika Nadzornog odbora, a \\u00a2lan Nadzornog odbora na izborno listi naveden pod rednim brojem 4 (Cetiri) automatski postaje novi Zamjenik Predsjednika Nadzornog odbora. Navedeni se nacin izbora novog Predsjednika Nadzornog odbora ili Zamjenika Predsjednika Nadzornog odbora primjenjuje do Clana Nadzornog odbora koji je na izbornoj listi naveden pod rednim brojem 10 (deset), a ukoliko prestane mandat 1 Clanu Nadzornog odbora koji je na izbornoj listi naveden pod rednim brojem 10 (deset), Predsjednikom Nadzornog odbora ili Zamjenikom Predsjednika Nadzornog odbora automatski\", \"postaju novoizabrani Clanovi Nadzornog odbora redoslijedom njihovog izbora za Clanove Nadzornog odbora. (5) U sluc\\u00e9aju da, iz razloga propisanih Clankom 30. to\\u00a2\\u00e9kama a.-g. ovog Statuta, prestane mandat svim Clanovima Nadzornog odbora ili broj Clanova Nadzornog odbora padne ispod broja 5 (pet), Predsjednik Kluba, u roku koji ne moZe biti dulji od 5 (pet) dana, saziva izvanrednu sjednicu Skup$Stine te predlaze nove Clanove Nadzornog odbora 1z redova Clanova Skupstine, a najymanje 15 (petnaest) Clanova SkupStine pisanim prijedlogom moze na sjednici predloziti druge kandidate. (6) U slu\\u00e9ajevima 1z ovog Clanka Statuta, novoizabranim Clanovima Nadzornog odbora mandat traje do isteka mandata Nadzornog odbora. Clanak 39. Nadzorni odbor Kluba: a. skrbi o provedbi op\\u00a2ih nacela djelovanja Kluba te Stiti 1 promice njegov identitet, povijest, vrijednosti 1 Clanska prava; b. skrbi o financijskom, pravnom 1 gospodarskom poslovanju Kluba te 0 raspolaganju njegovom imovinom; c. nadzire provedbu odluka SkupStine, strateSkih smjernica, godiSnjeg plana rada, financijskog plana 1 Izbornog programa Kluba; d. daje prethodnu suglasnost Predsjedniku Kluba za imenovanje 1 razrjeSenje Clanova Uprave; e. u suradnji s Predsjednikom, odreduje operativne 1 strateSke ciljeve 1 zaduzenja \\u00a2lanovima Uprave te nadzire njihovu provedbu; 17 - NACRT PRIJEDLOGA - f. odobrava prijedlog Predsjednika 1 Uprave u vezi godisnjeg plana rada 1 financijskih plana Kluba te godisnjeg financijskog 1zvjeS\\u00a2a 1 izvjeSca o radu Kluba; g. usuradnyji s Predsjednikom, redovno provodi formalnu evaluaciju rada svakog Clana Uprave, uzimajuci u obzir ostvarenje ciljeva 1 poStivanje vrednota Kluba; h. nadzire rad Predsjednika 1 Uprave te u vezi toga moze 1zdavati naputke, 1 zahtijevati izvjeSca 1 dokumentaciju te sazivati dodatne koordinacijske sastanke; 1. daje prethodnu suglasnost za pravne poslove 1 zaduzenja Kluba iznad iznosa od 3.000.000 EUR (tri miliyuna eura) te za provizije 1 podjele kod transfera koje prelaze 10% (deset posto) vrijednosti ugovora; j. obavjeStava nadlezna tijela Kluba o neuskladenostima u radu ili aktima s odredbama Statuta 1 drugih akata te, ukoliko iste ne budu ispravljene, 0 tome izvjeScuje Skupstinu; k. saziva izbore putem Predsjednika Nadzornog odbora te osniva, nadzire 1 razrjeSava Izborno povjerenstvo; 1. rjeSava sukobe interesa 1 sporove unutar Kluba; m. djeluje kao drugostupanjsko tijelo u stegovnim postupcima koji se odnose na Clanska prava 1 obveze te donosi kona\\u00e9ne odluke o stegovnim mjerama; n. predlaze izmjene 1 dopune Statuta, osim u slucajevima propisanim odredbama ovog Statuta; o. donosi odluke o iznosu Clanarine 1 naknade za Prijatelje Kluba; p. moze osnivati savjetodavne odbore 1 povjerenstva za potrebe ucinkovityeg rada Kluba, a u aktu 0 osnivanju odreduje njihov sastav, trajanje mandata, svrhu 1 zadace; q. daje prethodnu suglasnost Predsjedniku 1 Upravi na donoSenje Pravilnika o djelokrugu 1 unutarnjem ustrojstvu Kluba, kojim se ureduju nadleznosti Clanova Uprave 1 organizacija rada Kluba; r. donosi Poslovnik o radu Nadzornog odbora te druge op\\u00e9e akte unutar djelokruga svog rada; s. podnosi SkupStini priedloge za imenovanje Pocasnog Predsjednika, pocasna odlikovanja Clanova Kluba za doprinos Klubu ili za dugotrajno \\u00a2lanstvo; t. obavljaidruge poslove u skladu sa zakonima, ovim Statutom 1 opcim aktima Kluba. Clanak 40. (1) Sjednice Nadzornog odbora saziva Predsjednik Nadzornog odbora, a u slucaju njegove spriyjecenosti Zamyenik Predsjednika\", \"Nadzornog odbora, a u_ slucaju_ sprijecenosti Predsjednika Nadzornog odbora 1 Zamjenika Predsjednika Nadzornog odbora najstariji (po datumu rodenja) Clan Nadzornog odbora. (2) Sjednice Nadzornog odbora sazivaju se prema potrebi, a naymanje 10 (deset) puta godiSnje. (3) Sjednica Nadzornog odbora mora se sazvati: a. kada to pisanim zahtjevom zatrazi vecina Clanova Nadzornog odbora; b. kada to pisanim zahtjevom zatrazi Predsjednik Kluba 1 to za ishodenje prethodne suglasnosti za pravne poslove iznad iznosa od 3.000.000 EUR (tri milijuna eura), ishodenje prethodne suglasnosti za provizije 1 podjele kod transfera koje prelaze 10% (deset posto) vrijednosti ugovora te za izbor ili razrjeSenje Clanova Uprave Kluba; 18 - NACRT PRIJEDLOGA - c. kada privremena sprijecenost Predsjednika Kluba traje dulje od 7 (sedam) dana; d. kada prestane mandat Predsjedniku Kluba 1z razloga propisanih \\u00a2lankom 44. ovog Statuta. (4) Predsjednik Nadzornog odbora ili osoba koja ga sukladno stavku 1. ovog Clanka Statuta zamjenjuje mora sazvati sjednicu Nadzornog odbora odmah po saznanju za nastup okolnosti iz stavka 3. ovog Clanka Statuta ili primitka pisanog zahtjeva vecine Clanova Nadzornog odbora ili Predsjednika Kluba, a sjednica Nadzornog odbora mora se odrzati najkasnije u roku od 3 (tri) dana od dana sazivanja. (5) Ako Predsjednik Nadzornog odbora ili osoba koje ga sukladno stavku |. ovog Clanka Statuta zamjenjuje, u roku iz stavka 4. ovog Clanka Statuta, ne sazove sjednicu na pisani zahtjev vecine \\u20aclanova Nadzornog odbora, sjednicu moze sazvati vecina Clanova Nadzornog odbora na nacin da svi predlagatelji potpiSu poziv kojim se saziva sjednica Nadzornog odbora. (6) Ako Predsjednik Nadzornog odbora ili osoba koje ga sukladno stavku |. ovog \\u20aclanka Statuta zamjenjuje, u roku iz stavka 4. ovog Clanka Statuta, ne sazove sjednicu na pisani zahtjev Predsjednika Kluba, Predsjednik Kluba ovlasten je doniyeti odluku bez prethodne suglasnosti Nadzornog odbora. (7) Nadzorni odbor odlucuje pravovaljano ako je na sjednici nazo\\u00a2na natpolovicna vecina Clanova, a odluke donosi vecinom glasova nazo\\u00e9nih Clanova. (8) U slu\\u00e9aju izjednacenog broja glasova kod donoSenja odluka Nadzornog odbora odlucujuci je glas Predsjednika Nadzornog odbora ili osobe koje ga sukladno stavku 1. ovog \\u00a2lanka Statuta zamjenjuje. (9) Nacin i uvjete svog rada Nadzorni odbor ureduje Poslovnikom o radu Nadzornog odbora. Clanak 41. (1) Nadzorni odbor podnosi SkupStini redovito godiSnje izvjeSce glede svih nadleznosti Nadzornog odbora, posebno nadzora rada Predsjednika Kluba 1 Uprave Kluba. (2) SkupStina moze zatraziti od Nadzornog odbora podnoSenje 1zvanrednog izvjeS\\u00e9a. Clanak 42. Predsjednik Nadzornog odbora: saziva te predlaze dnevni red sjednica SkupStine, sukladno Clanku 33. ovog Statuta; b. saziva te predlaze dnevni red sjednica Nadzornog odbora, osim u slucajevima propisanim odredbama ovog Statuta; Cc. upoznaje javnost s radom 1 odlukama SkupStine Kluba; d. natemelju odluke Nadzornog odbora, podnosi prijedlog Statuta te drugih op\\u00a2ih akata koje usvaja SkupStina, osim u slucajevima odredenim ovim Statutom; e. predsjeda sjednicama SkupStine 1 imenuje druge Clanove SkupStine u Radno predsjednistvo Skup$stine; f. na temelju odluke Nadzornog odbora, saziva izbore u Klubu, sukladno \\u00a2lanku 50. stavku 7. ovog Statuta; g. zastupa Klub prema Predsjedniku Kluba, sklapa 1 raskida ugovor o radu s izabranim Predsjednikom Kluba. 19 - NACRT PRIJEDLOGA - 3. PREDSJEDNIK KLUBA\", \"Clanak 43. (1) Predsjednik Kluba predstavlja Klub, provodi strateSke odluke, bira 1 razrjeSava Upravu te usmjerava 1 nadzire rad Uprave. (2) Mandat Predsjednika Kluba, osim u sluc\\u00e9ajevima propisanim Clankom 44. ovog Statuta, je 5 (pet) godina 1 ogranicen je na dva mandata. (3) Za svoj rad Predsjednik Kluba odgovara Nadzornom odboru 1 SkupStini Kluba. (4) Predsjednik Kluba odgovoran je za zakonitost rada Kluba, provodenje strateSkih odluka SkupStine 1 ostvarenje ciljeva Kluba utvrdenih Izbornim programom. Clanak 44. (1) U sluc\\u00e9aju privremene sprijecenosti Predsjednika Kluba koja traje dulje od 7 (Ssedam) dana 111 u sluc\\u00e9aju prestanka mandata Predsjednika Kluba iz razloga propisanih \\u00a2lankom 30. to\\u00a2kama a.-g. ovog Statuta, Nadzorni odbor duzan je, u rokovima iz Clanka 40. stavka 4. ovog Statuta, odrzati sjednicu te na istoj sjednici izabrati osobu koja Ce privremeno zamyjeniti Predsjednika Kluba u svim pravima, duznostima 1 ovlastima. (2) Osobu 1z stavka 1. ovog Clanka Statuta, Nadzorni odbor moze izabrati izmedu Clanova Nadzornog odbora, \\u00a2lanova Uprave, \\u00a2lanova SkupStine ili Clanova Kluba za koje ne postoje zapreke 1z Clanka 29. ovog Statuta. (3) Osoba iz stavka 1. ovog Clanka Statuta zamjenjuje Predsjednika Kluba do prestanka razloga privremene sprijecenosti Predsjednika Kluba, a u slucajevima propisanim stavkom 4. 1 5. ovog Clanka Statuta do izbora novog Predsjednika Kluba. (4) Privremena sprijecenost Predsjednika Kluba iz stavka 1. ovog Clanka Statuta moze trajati najvise 6 (Sest) mjeseci. Ukoliko privremena sprijecenost Predsjednika Kluba traje dulje od 6 (Sest) mjeseci, smatra se da je mandat Predsjednika Kluba prestao. (5) U slu\\u00e9aju iz stavka 4. ovog Clanka Statuta ili u slucaju prestanka mandata Predsjednika Kluba 1z razloga propisanih Clankom 30. to\\u00a2kama a.-g. ovog Statuta, Nadzorni odbor duzan je odrzati sjednicu u rokovima iz Clanka 40. stavka 4. ovog Statuta te na istoj sjednici raspisati poziv svim Clanovima Kluba, a za koje ne postoje zapreke iz Clanka 29. ovog Statuta, da najkasnije u roku od 30 (trideset) dana od objave poziva Nadzornom odboru dostave vlastitu kandidaturu za Predsjednika Kluba. (6) Nakon isteka roka 1z stavka 5. ovog Clanka Statuta, Nadzorni odbor duzan je odrzati sjednicu u rokovima iz Clanka 40. stavka 4. ovog Statuta, na kojoj ce, izmedu zaprimljenih kandidatura, diskrecijskom ocjenom izabrati najviSe 2 (dva) kandidata te odmah sazvati izvanrednu sjednicu SkupStine. (7) Nadzorni odbor prilikom donoSenja odluke o izboru kandidata, sukladno stavku 6. ovog Clanka Statuta, primjenjuje kriterije prethodnog profesionalnog 1 radnog iskustva kandidata, obrazovanja, poznavanja organizacijske 1 upravljacke strukture Kluba, prethodnog radnog iskustva na izvrSnim, nadzornim ili upravljackim funkcijama u nogometnim ili drugim sportskim klubovima, slijedenja 1 provodenja izbornog programa izborne liste koja je na izborima ostvarila veci broj glasova Clanova Kluba, a moze primjenjivati 1 druge kriterije. 20 - NACRT PRIJEDLOGA - (8) Izvanredna sjednica SkupStine, a koja \\u00a2e izabrati novog Predsjednika Kluba izmedu kandidata 1z stavka 6. ovog lanka Statuta, mora se odrzati najkasnie 5 (pet) dana od dana sazivanja. (9) Izvanredna sjednica SkupStine, sukladno Clanku 34. stavku 2. ovog Statuta, odlucuje pravovaljano ako je na sjednici nazoc\\u00a2na natpolovicna ve\\u00a2ina \\u00a2lanova SkupStine, a odluku o izboru novog Predsjednika Kluba donosi vecinom glasova nazo\\u00e9nih\", \"Clanova SkupStine. (10) Novoizabranom Predsjedniku Kluba mandat traje do isteka mandata tijelima Kluba tijekom kojeg je duzan slijediti 1 provoditi izborni program izborne liste koja je na izborima ostvarila veci broj glasova Clanova Kluba. Clanak 45. Predsjednik Kluba: a. predstavlja 1 zastupa Klub samostalno 1 pojedinacno u pravnom prometu, osim u poslovima za koje mu je potreban supotpis Clana Uprave 1/ili prethodna suglasnost Nadzornog odbora; b. imenuje i razrjeSava Clanove Uprave te sklapa 1 raskida s njima ugovore o radu, uz prethodnu suglasnost Nadzornog odbora; c. usuradnjis Nadzornim odborom, odreduje operativne ciljeve 1 zaduzenja Clanovima Uprave te nadzire njihovu provedbu; d. usmjerava i nadzire rad Uprave; e. usuradnji s Nadzornim odborom, redovno provodi formalnu evaluaciju rada svakog Clana Uprave; f. usuradnji sa Upravom, predlaze SkupStini godiSnji plan rada 1 financijski plan Kluba te je, nakon njihova usvajanja, odgovoran za njihovo provodenje; g. samostalno 1 pojedina\\u00a2no zastupa Klub u pravnim poslovima ukupne vrijednosti do 100.000,00 EUR (sto tisu\\u00e9a eura); h. zastupa Klub u pravnim poslovima ukupne vrijednosti iznad 100.000,00 EUR (sto tisu\\u00a2a eura) do 3.000.000,00 EUR (tri milijuna eura), uz supotpis jednog Clana Uprave; 1. zastupa Klub u pravnim poslovima pojedina\\u00e9ne vrijednosti iznad 3.000.000,00 EUR (tri milijuna eura) te u poslovima kod kojih provizie 1 podjele kod transfera prelaze 10% (deset posto) vrijednosti ugovora, uz prethodnu suglasnost Nadzornog odbora te uz supotpis jednog Clana Uprave; j. skrbi o zakonitosti 1 statutarnosti rada Kluba te 0 provodenju op\\u00a2ih nac\\u00e9ela djelovanja Kluba; k. u suradnji sa Upravom priprema 1 podnosi SkupStini godisnje financijsko izvjes\\u00e9e 1 izvjeSce o radu Kluba; l. usuradnji sa Upravom, podnosi Nadzornom odboru kvartalna 1 godiSnja izvjeS\\u00e9a te dodatna izvjeS\\u00a2\\u00e9a na zahtjev Nadzornog odbora; m. djeluje samostalno u okviru ovlasti definiranih ovim Statutom, pri Cemu je duzan sazvati sjednicu Uprave radi savjetovanja 1 odlucivanja u slucajevima koji ukljucuyu promjene strateSkog smjera Kluba, reorganizaciju poslovanja, donoSenje planova zapoSljavanja 1 svih odluka koje nadilaze njegove pojedina\\u00e9ne ovlasti ili za koje ovim Statutom nye izricito propisana njegova samostalna nadleznost; 21 - NACRT PRIJEDLOGA - n. obavlja1 druge poslove u skladu sa zakonima, ovim Statutom 1 opcim aktima Kluba. 4. UPRAVA KLUBA Clanak 46. (1) Uprava Kluba je izvrSno tyelo koje operativno vodi poslovanje Kluba, u skladu sa smjernicama 1 odlukama Predsjednika Kluba 1 Nadzornog odbora. (2) Uprava Kluba upravlja radom struc\\u00a2nih sluzbi 1 zaposlenika Kluba u skladu s odredbama ovog Statuta, opcih akata Kluba te odlukama Predsjednika Kluba 1 Nadzornog odbora, kada je on odredbama ovog Statuta ovlaSten za takve odluke. (3) Uprava Kluba sastoji se od 2 (dva) do 4 (\\u20acetiri) Clana koje imenuje 1 razryeSava Predsjednik Kluba, uz prethodnu suglasnost Nadzornog odbora. (4) Mandat Clanova Uprave, osim u slucajevima 1z Clanka 30. To\\u00e9aka a., b., c., d., e. I g. Ovog Statuta, traje najdulje 5 (pet) godina te isti Clanovi mogu biti izabrani na nova mandatna razdoblja. (5) Clanovi Uprave ne mogu biti \\u00e9lanovi drugih tijela Kluba. (6) Za svoj radi rad strucnih sluzbi Clanovi Uprave odgovorni su Predsjedniku Kluba, a zajedno s Predsjednikom Kluba odgovorni su Nadzornom odboru 1 SkupStini.\", \"(7) Uprava odluke donosi na nacin propisan Clankom 47. Ovog Statuta te zastupa Klub u pravnim poslovima pojedinac\\u00e9ne vrijednosti do iznosa od 100.000,00 EUR (sto tisuca eura) na nacin da Klub skupno zastupaju najmanje dva Clana Uprave. Clanak 47. (1) Uprava odluke iz svoje nadleZnosti u pravilu donosi na sjednicama Uprave. (2) Sjednice Uprave, prema potrebi, saziva bilo koji \\u00a2lan Uprave, a moZe ih sazvati 1 Predsjednik Kluba ili osoba 1z Clanka 44. Stavka 1. Ovog Statuta. (3) Predsjednik Kluba ili osoba 1z Clanka 44. Stavka 1. Ovog Statuta duzan je sazvati sjednicu Uprave prije donoSenja: a. strateSkih odluka; b. odluka o pravnim poslovima pojedina\\u00a2ne vrijednosti iznad 500.000 EUR (petsto tisuca eura); c. odluka koje imaju za posljedicu promjenu organizacijske strukture ili sklapanje ili raskid ugovora sa zaposlenicima ili osobama koje obavljaju odredene poslove, a koje za Svoj rad odgovaraju izravno Upravi; d. ostalih odluka za koje je odredbama ovog Statuta propisano da se donose na sjednicama Uprave; e. odluka o izvjeScima koja Predsjednik 1 Uprava podnose Nadzornom odboru 1/ili Skup8stin1. (4) Uprava je duzna odrzati minimalno 10 sjednica godisnje. 22 - NACRT PRIJEDLOGA - (5) Uprava na sjednici odlucuje pravovaljano ako je na sjednici nazo\\u00e9na natpolovicna ve\\u00a2ina ukupnog broja Clanova Uprave. (6) Predsjednik Kluba ima pravo biti obaviyeSten o sjednicama Uprave te sudjelovati u radu sjednice Uprave s pravom glasa 1, ukoliko je prisutan na sjednici Uprave, smatra se dijelom kvoruma za odlucivanje. (7) Na sjednicama Uprave odluke se donose vecinom glasova nazo\\u00e9nih \\u00a2lanova Uprave. U slucaju izjednacenog broja glasova Clanova Uprave odlucujuci je glas Predsjednika Kluba ili osobe 1z Clanka 44. Stavka 1. Ovog Statuta. (8) Nacine 1 uvjete svog rada Uprava Kluba ureduje Poslovnikom o radu Uprave, uz suglasnost Predsjednika Kluba. Clanak 48. Uprava Kluba: operativno upravlja radom Kluba 1 za svoj rad odgovorna je Predsjedniku Kluba; b. s Predsjednikom Kluba donosi Pravilnik o djelokrugu 1 unutarnjem ustrojstvu Kluba, kojim se ureduju nadleznosti Clanova Uprave 1 organizacija rada Kluba, uz prethodnu suglasnost Nadzornog odbora; c. zastupa Klub u pravnim poslovima pojedina\\u00e9ne vrijednosti do iznosa od 100.000,00 EUR (sto tisuca eura) na nacin da Klub skupno zastupaju najmanje dva Clana Uprave; d. u suradnji s Predsjednikom, priprema 1 predlaze SkupStini godiSnji plan rada 1 financijski plan Kluba; e. u suradnji s Predsjednikom, priprema 1 podnosi SkupStini godiSnje financijsko izvjeSCe 1 1zvjeSce o radu Kluba; f. usuradnji s Predsjednikom, podnosi Nadzornom odboru kvartalna 1 godiSnja 1zvjeSca te dodatna izvjeS\\u00a2\\u00e9a na zahtjev Nadzornog odbora; g. upravlja imovinom Kluba u okviru ovlasti 1 djelokruga svakog Clana Uprave; h. sklapa 1 raskida ugovore o radu sa zaposlenicima Kluba, osim s Predsjednikom 1 Clanovima Uprave; 1. donosi interne akte Kluba u skladu sa Statutom 1 odlukama nadleznih tijela Kluba; J. organizira 1 nadzire sportsku, poslovnu 1 strucnu politiku Kluba, osim u pitanjima koja su u iskljucivoj nadleznosti Predsjednika Kluba; k. osigurava redovito obavjeStavanje Clanova Kluba o radu 1 rezultatima Kluba te odgovara na upite 1 inicijative Clanova; 1. imenuje Clanove upravnog odbora Dinamove Zaklade 1 nadzire njihov rad, u skladu Ss posebnim odlukama\", \"SkupStine; m. obavlja 1 druge poslove u skladu sa zakonima, ovim Statutom 1 opcim aktima Kluba. V. POCASNI PREDSJEDNIK KLUBA Clanak 49. 23 - NACRT PRIJEDLOGA - (1) Za Po\\u00e9asnog predsjednika Kluba moze biti izabran \\u00a2lan Kluba koji je svojim izuzetnim sportskim, poslovnim ili druStvenim doprinosom pridonio razvoju, ugledu 1 vrijednostima Kluba. (2) Kandidata za Po\\u00e9asnog predsjednika Kluba, pisanim prijedlogom mogu predloziti Nadzorni odbor, najmanje 15 (petnaest) Clanova SkupStine ili Predsjednik Kluba. (3) Pocasnog predsjednika Kluba bira SkupStina, vecinom glasova nazo\\u00e9nih Clanova. (4) Po\\u00e9asni predsjednik Kluba: Promice vrijednosti, identitet 1 tradiciyu Kluba; b. Kao predstavnik Kluba sudjeluje na svecanim dogadanjima, proslavama, Clanskim okupljanjima 1 drugim javnim prigodama; c. Moze biti gost na sastancima s predstavnicima drugih klubova, sponzorima, partnerima 1 predstavnicima nogometnih saveza; d. Ima pravo sudjelovati na sjednicama SkupStine, ali bez prava glasa; e. Na poziv Predsjednika Nadzornog odbora, moze sudjelovati na sjednicama Nadzornog odbora, ali bez prava glasa; f. Moze biti savjetnik Predsjedniku Kluba 1 Nadzornom odboru o strateSki vaznim pitanjima. (5) Po\\u00e9asni predsjednik Kluba ne sudjeluje u donoSenju odluka Kluba i ne obavlja izvrsne niti upravljacke funkcye. (6) Pocasni predsjednik Kluba ne smiye sudjelovati u izbornim kampanjama niti na bilo koji nacin iskazivati podrsSku za pojedine izborne liste ili kandidate. (7) Po\\u00e9asni predsjednik Kluba duzan je Cuvati Cast 1 ugled Kluba, postupati dostojanstveno te se suzdrzavati od javnih istupa koji bi mogli naruSiti stabilnost 1 integritet Kluba. (8) Mandat Po\\u00e9asnog predsjednika Kluba nije vremenski ogranicen. Iznimno, SkupStina ga u slucaju djelovanja protivno interesima, stabilnosti il1 Casti 1 ugleda Kluba ili nastupa okolnosti 1z Clanka 29. ovog Statuta, na pisani prijedlog Nadzornog odbora, najymanje 15 (petnaest) Clanova SkupStine ili Predsjednika Kluba, moZe razriyesiti odlukom donesenom dvotrecinskom vecinom svih \\u00a2lanova SkupStine. (9) Po\\u00e9asni predsjednik ima pravo biti gost Kluba na svim domacim 1 gostujucim utakmicama Kluba. VI. IZBORI | REFERENDUM 1. IZBORI Clanak 50. (1) Na izborima Clanovi Kluba s pravom glasa biraju 50 (pedeset) Clanova SkupStine Kluba. (2) Pravo birati 1 biti birani na izborima imaju iskljucivo punoljetni 1 poslovno sposobni Clanovi Kluba, pod uvjetom da su isti bili Clanovi Kluba i u prethodnoj kalendarskoj godini. (3) Izbori mogu biti redovni 1 1zvanredni. 24 - NACRT PRIJEDLOGA - (4) Redovni izbori odrzavaju se najranije 180 (sto osamdeset) prije kraja redovnog mandata Skup&tine, a najkasnije 90 (devedeset) dana nakon isteka redovnog mandata Skup$tine te se moraju sazvati najkasnije 45 (Cetrdeset pet) dana prije dana odrzavanja izbora. (5) Izvanredni izbori sazivaju se najkasnije u roku od 7 (sedam) dana od dana nastupa slyedecih okolnosti: odluke SkupStine donesene dvotrecinskom vecinom svih \\u00a2lanova Skup$&tine; b. dainakon Sto se iscrpi broj svih zamjenskih Clanova SkupStine, sukladno Clanku 35. stavku 5. ovog Statuta, broj Clanova SkupStine padne ispod 26 (dvadeset Sest); c. od potvrde novog Statuta ili usvajanja izmjena ili dopuna Statuta kojima se mijenjaju tijela Kluba, njihov broj Clanova, nadleznosti 1 ovlasti ili trajanje mandata od strane nadleznog tijela Grada Zagreba. (6) Izvanredni izbori 1z stavka 5. ovog Clanka Statuta moraju se odrzati najkasnije 21 (dvadeset jedan) dana od dana sazivanja. (7) Izbore,\", \"osim u slucajevima propisanim odredbama ovog Statuta, raspisuje Nadzorni odbor putem Predsjednika Nadzornog odbora Kluba ili osobe koja ga sukladno \\u00a2lanku 33. stavku 1. ovog Statuta zamjenjuje. (8) Izbore provodi Izborno povjerenstvo sastavljeno od 5 (pet) \\u00a2lanova Kluba s pravom glasa koje, na temelju pojedinac\\u00e9nih kandidatura Clanova Kluba, zdrijebom bira Nadzorni odbor. U slu\\u00e9aju da se ne prijavi dovoljan broj kandidata, Nadzorni odbor izabire preostale \\u00a2lanove Izbornog povjerenstva izmedu Clanova Kluba s pravom glasa. (9) Nadzorni odbor moZe razrijeSiti Izborno povjerenstvo ili pojedine njegove Clanove 1z razloga propisanih odredbama ovog Statuta 1 Pravilnika o izborima. (10) Mandat Clanova Izbornog povjerenstva traje od dana odrzavanja zdrijeba do izbora Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora 1 ostalih Clanova Nadzornog odbora na izborno] sjednici Skup$stine. Clanak 51. (1) Izbori se provode na temelju izbornth lista koje sadrze najmanje 45 (Cetrdeset pet), a najviSe 55 (pedeset pet) kandidata za Clanove SkupStine Kluba, pri Cemu svaka izborna lista obvezno sadrzi: a. Kandidata za Predsjednika Kluba koji je ujedno 1 nositelj te 1izborne liste, na listi obvezno naveden pod rednim brojem | (jedan); b. Kandidata za Predsjednika Nadzornog odbora, na listi obvezno naveden pod rednim brojem 2 (dva); c. Kandidata za Zamjenika Predsjednika Nadzornog odbora, na listi obvezno naveden pod rednim brojem 3 (tri); d. Kandidate za ostale Clanove Nadzornog odbora, na listi obvezno navedeni pod rednim brojevima od 4 (\\u20acetiri) do 10 (deset); e. Preostale kandidate za Clanove SkupStine, na list! obvezno navedeni pod rednim brojevima od (11) jedanaest do najmanje 45 (Cetrdeset pet), a najviSe do 55 (pedeset pet). (2) Svaka izborna lista, pored obveznog sadrzaja iz stavka 1. ovog Clanka Statuta, obvezno sadrzi 1: 25 - NACRT PRIJEDLOGA - a. plan 1 program upravljanja Klubom koji mora biti dostupan Clanovima Kluba najkasnije 5 (pet) dana prije datuma odrzavanja izbora, a moze sadrzavati 1 biografije kandidata 1z stavka 1. to\\u00e9aka a.-d. ovog Clanka Statuta; b. potpise podrske najmanje 100 (sto) punoljetnih 1 poslovno sposobnih Clanova Kluba s vazecim Clanstvom u trenutku potpisivanja, pod uvjetom da su isti bili \\u00a2lanovi Kluba 1 u prethodnoj kalendarskoj godini. (3) Potpisima podrske, u smislu stavka 2. toc\\u00e9ke b. ovog \\u00a2lanka Statuta, ne smatraju se potpisi samih kandidata na izborno] listi, a potpisi podrSke nuzno sadrzavaju ime 1 prezime, brojeve Clanskih iskaznica te potpis davatelja podrske. (4) Izborne liste moraju se dostaviti Izbornom povjerenstvu najkasniye 7 (sedam) dana prije dana odrzavanja izbora. (5) Izborne liste koje su dostavljene nakon isteka roka 1z stavka 4. ovog \\u20aclanka Statuta ili izborne liste koje ne sadrzavaju sve potrebne podatke iz stavaka 1.-3. ovog Clanka Statuta, Izborno povjerenstvo nece smatrati vazecima te iste ne mogu sudjelovati na izborima. (6) Ukoliko se do isteka roka 1z stavka 4. ovog Clanka Statuta ne kandidira niti jedna izborna lista ili niti jedna kandirana izborna lista ne sadrzava sve potrebne podatke 1z stavaka 1.-3. ovog Clanka Statuta, svi rokovi 1z Clanaka 50. 151. ovog Statuta produljuju se za 30 (trideset) dana. Clanak 52. (1) Neovisno o broju izbornih lista koje su se kandidirale na\", \"izborima, Clanovima SkupStine Kluba postaju kandidati s dviyu izbornih lista koje su ostvarile najveci broj dobivenih glasova \\u00a2lanova Kluba. (2) Broj kandidata sa svake od dviju izbornih lista 1z stavka 1. ovog Clanka Statuta koji postayu Clanovima SkupStine odreduje se proporcionalno broju dobivenih glasova \\u00a2lanova Kluba, pri Cemu se kao ukupan broj glasova Clanova Kluba u obzir uzimaju iskljucivo glasovi koje su ostvarile dvije izborne liste 1z stavka 1. ovog Clanka Statuta. (3) U slu\\u00e9aju da se broj Clanova SkupStine, primjenom metode proporcionalnog izracuna broja Clanova SkupStine ne moze matematicki izraziti kao ciyeli broj, ve\\u00a2 sadrzi decimalni broj, primjenjuju se sljede\\u00e9a pravila: a. Clanom Skup&tine postaje kandidat izborne liste koja je na izborima ostvarila veci broj dobiventh glasova \\u00a2lanova Kluba; b. ukoliko su obje izborne liste na izborima ostvarile identi\\u00a2an broj dobivenih glasova \\u00a2lanova Kluba, saziva se drugi krug izbora na kojima sudjeluju dvije izborne liste 1z stavka 1. ovog Clanka Statuta, a koji se moraju odrZati najkasniye u roku od 7 (sedam) dana. (4) Jedna izborna lista, neovisno o rezultatima izbora, moze imati najviSe 45 (Cetrdeset pet) Clanova SkupStine. (5) U slu\\u00e9aju da se na izborima, do isteka roka od 20 (dvadeset) dana prije datuma odrzavanja izbora, kandidira samo jedna izborna lista, \\u00a2lanovima SkupStine postaju: a. 45 (\\u20acetrdeset pet) kandidata za Clanove SkupStine s jedine kandidirane izborne liste; b. 5 (pet) povjerenika Kluba koje izabiru Clanovi Kluba s liste povjerenika Kluba. 26 - NACRT PRIJEDLOGA - (6) U slucaju da bi, sukladno rezultatima izbora 1 primjeni metode proporcionalnog izracuna broja Clanova SkupStine, \\u00a2lanovima SkupStine trebalo postati viSe od 45 (Cetrdeset pet) kandidata s jedne izborne liste, Clanovima SkupStine postaju: a. 45 (\\u20acetrdeset pet) kandidata za Clanove SkupStine s pobjednicke izborne liste; b. preostalih 5 (pet) Clanova SkupStine popunjava na na\\u00a2in da: - \\u20aclanovima Skup&tine postaju kandidati s druge izborne liste, pri Cemu se, u Slucaju da se broj Clanova SkupStine te izborne liste ne moze matematick1 izraziti cijelim brojem, vec sadrzi decimalni broj, zaokruzivanje vrSi na nacin da se broj \\u00a2lanova SkupStine s druge izborne liste zaokruzuje se na veci ciyeli bro}; - preostalim \\u00a2lanovima SkupStine postaju povjerenici Kluba koje izabiru Clanovi Kluba s liste povjerenika Kluba. (7) U slu\\u00e9aju da su pojedini kandidati na izbornim listama 1z \\u00a2lanka 51. ovog \\u00a2lanka Statuta ujedno 1 povjerenici Kluba, isti ne mogu sudjelovati na izborima na listi povjerenika Kluba niti biti izabrani kao Clanovi SkupStine sukladno stavku 5.16. ovog Clanka Statuta. (8) Detalje izbornih postupaka 1 referenduma, kao 1 rad Izbornog povjerenstva ureduje Pravilnik o izborima u Klubu. Clanak 53. (1) Izborna sjednica SkupStine odrzava se najkasniye u roku od 15 (petnaest) dana od dana odrzavanja izbora 1 u drugim slucajevima propisanim ovim Statutom te na istoj, a sukladno rezultatima izbora te odredbama ovog Statuta, izabire Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te ostale Clanove Nadzornog odbora. (2) Kandidati za Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te ostalih \\u20acClanova Nadzornog odbora su kandidati s izborne liste koja je, sukladno \\u20aclanku 52. stavku 2.13. ovog Statuta,\", \"ostvarila veci broj Clanova u SkupStin1. (3) Odluku o izboru Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamyjenika predsjednika Nadzornog odbora te ostalih Clanova Nadzornog odbora izborna Skup\\u00a7tina donosi vecinom glasova svih \\u00a2lanova Skup$&tine. (4) U slu\\u00e9aju da kandidati iz stavka 2. ovog Clanka ne budu izabrani vecinom glasova svih Clanova Skup\\u00a7Stine provodi se drugi krug glasovanja na kojemu Clanovi SkupStine glasuju izmedu kandidata s obje izborne liste, a u slucaju 1zjednacenog broja glasova za Predsjednika Kluba, Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora te ostalih \\u20aclanova Nadzornog odbora smatraju se izabrani kandidati s izborne liste koja je ostvarila veci broj dobivenih glasova \\u00a2lanova Kluba. (5) Nakon Sto bude izabran, Predsjednik Kluba prestaje biti Clanom Skup$Stine 1 na mjestu Clana SkupStine zamjenjuje ga novi Clan s popisa zamjenskih kandidata za \\u00a2lanove SkupStine sa iste liste. Clanak 54. (1) U slu\\u00e9aju da se na izborima niti u rokovima iz Clanka 51. stavka 6. ovog Statuta ne kandidira niti jedna vazeca izborna lista, svi Clanovi Kluba s pravom glasa postaju Op\\u00a2\\u00e9a SkupStina Kluba koja \\u00a2e izabrati Predsjednika Kluba, te Predsjednika Nadzornog odbora, Zamjenika Predsjednika Nadzornog odbora 1 \\u00a2lanove Nadzornog odbora Kluba koji \\u00a2e dalje prema ovom Statutu izabrati ostala tela 1 djelovati unutar svojih statutarnih nadleznosti. 27 - NACRT PRIJEDLOGA - (2) U slu\\u00e9aju 1z stavka 1. ovog Clanka Statuta, Opcu SkupStinu Kluba, u roku od 15 (petnaest) dana od isteka mandata svim tijelima Kluba, izuzev Clanovima Uprave, duzan je sazvati zadnji Predsjednik Kluba ili zadnji Predsjednik Nadzornog odbora, a ako isto ne ucine, Opcu SkupStinu Kluba duzna je sazvati bilo koja osoba od ostalih osoba ovlaStenih za zastupanje upisana u Registar udruga Republike Hrvatske. Iznimno, ukoliko ni jedna od prethodno navedenih osoba, u roku od 15 (petnaest) dana od isteka mandata svim tielima Kluba, ne sazove Opcu Skup$Stinu Kluba, istu moze sazvati bilo koji od zadnjih Clanova Nadzornog odbora ili bilo koji od Clanova zadnjeg saziva SkupStine ili Pocasni predsjednik Kluba. (3) Sazivatel) odreduje mjesto (u pravilu u sjediStu Kluba ili na stadionu Kluba) 1 vrijeme odrzavanja Skup\\u00a7Stine, predlaze dnevni red, te njome predsjeda 1 imenuje Radno predsjednistvo 1 zapisni\\u00a2ara. Svakih 100 (sto) \\u00a2lanova Kluba s pravom glasa moze do pocetka Opce SkupStine Kluba pisanim prijedlogom predloziti kandidata za Predsjednika Kluba, a ako to ne u\\u00a2ine, kandidata za Predsjednika Kluba predlaze sazivatelj. Nakon Sto bude izabran, Predsjednik Kluba na Op\\u00e9oj SkupStini Kluba predlaze sve Clanove Nadzornog odbora iz redova Clanova Kluba s pravom glasa. (4) Op\\u00e9a SkupStina Kluba nema kvoruma za odlucivanje, a odluke donosi vecinom danih glasova. (5) Mandat tiyela Kluba izabranih na Op\\u00e9oj Skup&tini Kluba je 2 (dviye) godine. (6) Sljedeci redovni izbori moraju se odrzati na nacin propisan Clancima 50.-52. ovog Statuta, a mogu Se sazvati 1 prije kraja mandata tijelima Kluba izabranih na Opcoj SkupStini Kluba. 2. REFERENDUM Clanak 55. (1) Referendum svih \\u00a2lanova Kluba s pravom glasa (dalje u tekstu: Referendum) mora se raspisati prethodno donoSenju odluke SkupStine o: a. promyjeni naziva Kluba u diyelu ,,Dinamo\\u201c; b. promjeni grba (znaka) Kluba; c. promjeni boje Kluba; d. promjeni trajne\", \"lokacije stadiona; e. statusnim promjenama (preoblikovanje, pripajanje, spajanje ili podjela) Kluba; f. dobrovoljnog prestanka rada Kluba; g. izmjenama 1/il1 dopunama Clanka 6. stavka 1. ovog Statuta. (2) Referendum iz stavka 1. ovog \\u00a2lanka Statuta mora se raspisati na pisani zahtjev: a. Dvotrecinske vecine svih Clanova Skup$Stine; b. 20% (dvadeset posto) svih Clanova Kluba s pravom glasa. (3) Na pisani zahtjev 20% (dvadeset posto) svih Clanova Kluba s pravom glasa mora se raspisati 1 referendum radi donoSenja odluke o raspisivanju izvanrednih izbora u Klubu. (4) Na referendumu 1z stavaka 1. 1 3. ovog Clanka Statuta mora sudjelovati najmanje 50 % (pedeset posto) svih Clanova Kluba s pravom glasa, a odlucuje se dvotrecinskom vecinom danih glasova. 28 - NACRT PRIJEDLOGA - (5) Potrebnim se postotkom od 20 % (dvadeset posto) svih Clanova Kluba s pravom glasa, u smislu odredaba stavka 2. tocke b. te stavaka 3. 1 4. ovog Clanka Statuta, smatra se broj Clanova Kluba u kalendarskoj godini u kojoj se referendum raspisuje ili u kalendarskoj godini koja prethodi kalendarskoj godini u kojoj se referendum raspisuje, ovisno 0 tome u kojoj je kalendarskoj godini broj \\u00a2lanova Kluba s pravom glasa vec. (6) Referendum 1z stavaka 1.12. ovog \\u00a2lanka Statuta, raspisuje 1 provodi Nadzorni odbor putem Predsjednika Nadzornog odbora ili osobe koja ga sukladno Clanku 33. stavku 1. ovog Statuta zamjenjuje, u roku od 30 (trideset) dana od zaprimanja pisanog zahtjeva iz stavka 2. ovog \\u00a2lanka Statuta. VII. RJESAVANJE SPOROVA I SUKOBA INTERESA Clanak 56. (1) Postupak pred Nadzornim odborom za rjeSavanje statutarnih 1 ostalih sporova te sukoba interesa moze pisanim 1 obrazlozenim zahtjevom pokrenuti svaki Clan tiela Kluba, ako smatra da postoji spor ili sukob interesa u Klubu. (2) Nadzorni odbor o zahtjevu odlucuje u roku od 60 (Sezdeset) dana od dana zaprimanja zahtjeva. (3) Nadzorni odbor u svom radu na odgovarajuci nacin primjenjuje odredbe Zakona o mirenju. (4) Odluka Nadzornog odbora o sukobu interesa je kona\\u00e9na. (5) Nadzorni odbor odlukom odreduje nacin razrjeSavanja statutarnih 1 ostalih sporova te utvrdenog sukoba interesa. (6) Ako Nadzorni odbor utvrdi da je Predsjednik Kluba u sukobu interesa, predlaze SkupStini Kluba sankciju ili razrjeSenje te raskid ugovora. (7) Ako Nadzorni odbor utvrdi da su Clanovi Uprave u sukobu interesa, predlaze Predsjedniku Kluba sankciju ili razrjeSenje te raskid ugovora. (8) Ako Nadzorni odbor utvrdi da su zaposlenici Kluba u sukobu interesa, predlaze Predsjedniku Kluba sankciju ili razrjeSenje te otkaz ugovora. (9) U slu\\u00e9aju da odlucuje o sukobu interesa Clana Nadzornog odbora, taj Clan Nadzornog odbora ne sudjeluje u donoSenju odluke. VIII. IMOVINA, NACIN STJECANJA I RASPOLAGANJE IMOVINOM Clanak 57. (1) Imovinu Kluba Cine: a. nov\\u00e9ana sredstva koja je Klub stekao uplatom Clanarina, naknada Prijatelja Kluba, dobrovoljnim prilozima 1 darovima; b. novc\\u00e9ana sredstva koja Klub stekne obavljanjem djelatnosti kojima se ostvaruju ciljevi, obavljanjem djelatnosti 1 gospodarskih djelatnosti, financiranjem programa 1 29 - NACRT PRIJEDLOGA - projekata Kluba iz drzavnog proracuna 1 proracuna jedinica lokalne 1 podrucne (regionalne) samouprave te fondova 1/ili 1z inozemnih 1zvora; c. nekretnine 1 pokretne stvari Kluba; d. druga prava ustanovljena u korist Kluba.\", \"(2) Klub moze raspolagati svojom imovinom samo za ostvarivanje ciljeva 1 obavljanjem djelatnosti odredenih ovim Statutom, u skladu sa zakonima 1 posebnim propisima. (3) ViSak prihoda nad rashodima koje Klub ostvari mora se koristiti iskljucivo za obavljanje 1 unapredenje djelatnosti Kluba kojima se ostvaruju ciljevi Kluba, utvrdeni ovim Statutom, sukladno zakonu. Clanak 58. (1) Odluke o stjecanju ili otudivanju pokretnina 1 nekretnina donose Predsjednik 1 Uprava, na nacin propisan ovim Statutom. (2) Poslovne odluke u vezi koriStenja financijskih sredstava tijekom kalendarske godine provodi Uprava Kluba koja 0 tome, na na\\u00a2cin propisan ovim Statutom, izvjeScuje Nadzorni odbor 1 SkupSstinu. (3) Predsjednik 1 Uprava odgovorni su za zakonitost koriStenja 1 raspolaganja imovinom, a posebice financijskih sredstava Kluba. (4) Sva dokumentacija o materiyalno-financijskom poslovanju Kluba \\u00a2uva se u zakonskim rokovima sa posebnom paznjom u arhivi Kluba. IX. PRESTANAK POSTOJANJA KLUBA Clanak 59. (1) Klub prestaje postojati odlukom SkupStine u skladu s rezultatima provedenog referenduma ili u drugim slu\\u00e9ajevima predvidenim zakonom. (2) U slu\\u00e9aju prestanka postojanja Kluba preostala imovina pripada udruzi, ustanovi, zakladi ili drugoj pravnoj osobi koja ima iste ili sli\\u00a2ne statutarne ciljeve, a prema odluci SkupStine. Clanak 60. (1) Likvidatora Kluba imenuje 1 opoziva SkupStina Kluba. (2) Likvidator zastupa Klub u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u Registar udruga Republike Hrvatske kao osoba ovlastena za zastupanje Kluba do okon\\u00e9anja postupka likvidacije 1 brisanja Kluba 1z registra udruga. (3) Osoba koja se bira za likvidatora treba imati potrebnu strucnost 1 iskustvo, s obzirom na nadleznost likvidatora te ne smije imati zapreke 1z Zakona o sportu ili Zakona o udrugama. (4) Pokretanjem postupka likvidaciyje Kluba prestaju ovlaStenja tijela 1 osoba ovlaStenih za zastupanje Kluba. (5) Postupak likvidacije Kluba provodi likvidator sukladno odredbama Zakona o udrugama. 30 - NACRT PRIJEDLOGA - X. PRIJELAZNE I ZAVRSNE ODREDBE Clanak 61. (1) Statut stupa na snagu danom donoSenja. (2) Sva tyela Kluba mogu se, putem Nadzornog odbora, obratiti SkupStini za autentic\\u00a2no tumacenje odredaba Statuta 1 akata koje ona donosi. (3) Postojecim tijelima Kluba nadleZnosti 1 ovlasti traju do izbora tyela Kluba sukladno odredbama ovog Statuta. (4) Op\\u00a2i akti Kluba moraju se usuglasiti s odredbama ovog Statuta u roku od 90 (devedeset) dana od dana donoSenja Statuta. U Zagrebu..... 31\"]"