["Na temelju članka 27. Statuta Hrvatskog olimpijskog odbora, a u skladu s člancima 45. i 46. Zakona o sportu (Narodne novine br.141/2022) i članka 13. Zakona o udrugama (Narodne novine br. 74/2014., 70/2017.,98/2019. i 151/2022.), Skupština Hrvatskog olimpijskog odbora, na svojoj 41. sjednici održanoj 6. studenog 2015. godine, donijela je Statut Hrvatskog olimpijskog odbora (broj: 928/15, od 6. studenog 2015.), a odluke o izmjenama i dopunama Stat", "uta Hrvatskog olimpijskog odbora usvojene su na 43. sjednici Skupstine Hrvatskog olimpijskog odbora održanoj 29. veljače 2016. godine, (broj: 216/16 od 01. ožujka 2016.), na 50. sjednici Skupštine Hrvatskog olimpijskog odbora održanoj 28. veljače 2018. godine (broj: 358/2018 od 19.04.2018.), na 55. sjednici Skupstine Hrvatskog olimpijskog odbora odrzanoj 8 srpnja 2020. (broj: 438/20 od 10. 07.2020.), na 58. elektronickoj sjednici Skupštine Hrvats", "kog olimpijskog odbora dana 5. studenog 2020. godine (broj: 761/20 od 19.11.2020.), na 65. sjednici Skupstine Hrvatskog olimpijskog odbora održanoj 13. rujna 2022. godine (broj: 1029/2022 od 13.09.2022.), na 67. sjednici Skupštine Hrvatskog olimpijskog odbora održanoj 27. veljače 2023. godine (broj: 267/2023 od 03.03.2023), na 69. elektroničkoj sjednici Skupštine Hrvatskog olimpijskog odbora održanoj elektroničkim glasovanjem članova Skupštine HO", "O-a u razdoblju od 09.-14. kolovoza 2023. (broj: 1082/2023 od 30.08.2023.) kao i na 73. sjednici Skupštine Hrvatskog olimpijskog odbora održanoj 09. srpnja 2024. godine (Klasa; 030-08/24-01/3, urbroj: 442-01-05-24-1) slijedom kojih se utvrduje\n\n## STATUT HRVATSKOG OLIMPIJSKOG ODBORA\n\n## - pročišceni tekst -\n\n## I. IZVORIŠNE OSNOVE\n\nOlimpijski pokret u Hrvatskoj je još 1894. počeo promicati Franjo Bučar, no ideja o prijemu u medunarodnu olimpijsku", " obitelj mogla se ostvariti tek uspostavom samostalne Republike Hrvatske.\n\nIzražavajući stoljetnu želju hrvatskih sportaša i sportskih djelatnika da Hrvatska bude priznatim članom Medunarodnog olimpijskog odbora na sjednici Hrvatskog olimpijskog odbora, održanoj 10. rujna 1991. godine u Zagrebu je utemeljen Hrvatski olimpijski odbor i usvojena su Pravila Hrvatskog olimpijskog odbora. Hrvatski olimpijski odbor osnovali su nacionalni sportski savez", "i 29 olimpijskih sportova i tri udruženja.\n\nOdluka o privremenom priznanju Hrvatskog olimpijskog odbora donesena je 17. siječnja 1992. godine u Lausannei od strane predsjednika i četiri potpredsjednika Medunarodnog olimpijskog odbora, a u skladu s ovlastima koje im je povjerio Izvršni odbor Medunarodnog olimpijskog odbora, na sastanku 4., 5. ¡ 6. prosinca 1991. godine u Lausannei. Navedenom odlukom Medunarodni olimpijski odbor pozvao je Hrvatski ", "olimpijski odbor da sudjeluje na 16. Zimskim olimpijskim igrama u Albertvilleu i na Igrama 25. olimpijade u Barceloni. Potpuno priznanje Hrvatskog olimpijskog odbora uslijedilo je na 101. zasjedanju Medunarodnog olimpijskog odbora u Monacu, 24. rujna 1993. godine.\n\n## Il. TEMELJNE ODREDBE\n\n## Clanak 1.\n\nStatutom Hrvatskog olimpijskog odbora (dalje u tekstu: Statut) ureduje se naziv, sjedište, zastupanje, izgled pečata, ciljevi i djelatnosti kojim", "a se ostvaruju ciljevi, ustrojstvo i način rada, članstvo i način ostvarivanja prava i obveza članova, način uporabe i zaštite simbola i obilježja Medunarodnog olimpijskog odbora i Hrvatskog olimpijskog odbora, način osiguranja javnosti rada, način stjecanja i raspolaganja imovinom, prestanak postojanja, postupak s imovinom u slučaju prestanka postojanja, te druga pitanja u vezi s djelokrugom i zadaćama Hrvatskog olimpijskog odbora.\n\n## Clanak 2.", "\n\n- (1) Hrvatski olimpijski odbor (dalje u tekstu: HOO) je krovno sportsko udruženje u Republici Hrvatskoj, u koje se udružuju nacionalni sportski savezi, sportske zajednice u županijama i Gradu Zagrebu te druge pravne osobe čija je djelatnost od značaja za promicanje sporta i olimpijskog pokreta u Republici Hrvatskoj, sukladno ovom Statutu, a prema načelima olimpijskog pokreta i Olimpijske povelje\n- (2) HOO je obvezan poštovati odredbe Olimpijsk", "e povelje i odluke Medunarodnog olimpijskog odbora (dalje u tekstu: MOO) kao vrhovnog tijela olimpijskog pokreta.\n- (3) HOO se obvezuje, sukladno zadaćama i ulozi na nacionalnoj razini, sudjelovati u aktivnostima promicanja mira i žena u sportu. Isto se tako obvezuje podržavati i poticati promidžbu sportske etike, boriti se protiv dopinga i pokazivati odgovornu brigu za pitanja okoliša.\n- (4) Da bi ispunio svoju zadaću, HOO može suradivati s vlad", "inim, odnosno državnim tijelima u Republici Hrvatskoj s kojima uspostavlja skladne odnose, pri čemu ta aktivnost ne smije biti u suprotnosti s Olimpijskom poveljom. HOO suraduje i s nevladinim tijelima u Republici Hrvatskoj, koja djeluju ili su povezana s djelatnošću HOO-a.\n- (5) HOO mora čuvati svoju autonomiju i oduprijeti se pritiscima svake vrste od političkih, pravnih, vjerskih, ekonomskih i drugih pritisaka koji su u suprotnosti s Olimpijsk", "om poveljom.\n- (6) HOO je član Udruženja nacionalnih olimpijskih odbora (ANOC), Europskih olimpijskih odbora (EOC), Medunarodnog odbora Mediteranskih igara (ICMG), Europske nevladine sportske organizacije (ENGSO), Medunarodnog fair play odbora (IFPC) i Europskog fair play pokreta (EFPM).\n- (1) HOO je u svom djelovanju samostalan.\n\n## Članak 3.\n\n- (2) HOO se ustrojava i djeluje sukladno odredbama Olimpijske povelje, Zakona o sportu i Zakona o udru", "gama.\n- (3) HOO je neprofitna pravna osoba.\n\n- (4) HOO se upisuje u Registar udruga Republike Hrvatske pri nadležnom upravnom tijelu Grada Zagreba, Registar neprofitnih organizacija pri Ministarstvu financija Republike Hrvatske, te u Eidenciji pravnih osoba u sportu.\n\n## Clanak 4.\n\n- (1) Puni naziv je: Hrvatski olimpijski odbor.\n- (2) Skraćeni naziv je: HOO.\n- (3) Osim punog i skraćenog naziva na hrvatskom jeziku, može se koristiti i puni naziv n", "a engleskom jeziku.\n- (4) Puni naziv na engleskom jeziku je: Croatian Olympic Committee.\n- (5) Skraćeni naziv na engleskom jeziku je: NOC of Croatia.\n- (6) Naziv na engleskom jeziku može se koristiti samo uz istodobno navodenje naziva na hrvatskom jeziku, koji se navodi na prvom mjestu.\n- (7) U službenoj uporabi HOO-a je hrvatski jezik i latinično pismo, dok se u korespondenciji s inozemstvom koristi engleski ili francuski jezik.\n- (8) Puni naziv", " na francuskom jeziku je Comité Olympique Croate.\n- (9) Skraćeni naziv na francuskom je: CNO Croate.\n\n## Članak 5.\n\n- (1) HOO djeluje na području Republike Hrvatske.\n- (2) Sjedište HOO-a je u Zagrebu, Odranska 1/1.\n\n## Članak 6.\n\nHOO ne dopušta rasnu, etničku, nacionalnu, vjersku, političku i spolnu diskriminaciju te kršenje sloboda i prava čovjeka i gradanina.\n\n## Članak 7.\n\nZa svoje obveze HOO odgovara cijelom svojom imovinom, u skladu sa zakon", "om.\n\n## članak 8.\n\n- (1) HOO ima znak i zastavu odobrenu od Izvršnog odbora Medunarodnog olimpijskog odbora.\n- (2) Znak HOO-a sastoji se od tri elementa: riječi Hrvatska (ili Croatia) iznad koje se nalazi pet olimpijskih krugova, a ispod riječi je šest crvenih kvadrata sastavljenih u obliku obrnutog trapeza.\n\n- (3) Zastava HOO-a je bijele boje, omjera širine i dužine 1 prema 2, sa znakom HOO-a smještenim u sredini zastave. Središnja točka znaka p", "oklapa se s točkom u kojoj se sijeku dijagonale zastave. Zastavu, znak i himnu koje će koristiti HOO u svojim aktivnostima, uključujući i olimpijske igre, mora odobriti Izvršni odbor MOO-a.\n- (1) HOO ima pečat i štambilj.\n\n## Clanak 9.\n\n- (2) Pečat je okruglog oblika, promjera 30 mm, s ispisanim tekstom uz rub: \"Hrvatski olimpijski odbor - Croatian Olympic Committee\", a u sredini se nalazi znak HOO-a.\n- (3) Stambilj je pravokutnog oblika, dug 50 ", "i širok 20 mm, s ispisanim tekstom: \"Hrvatski olimpijski odbor - Croatian Olympic Committee, Trg Krešimira Cosića 11, HR-10000 Zagreb\".\n\n## Članak 10.\n\n- (1) HOO predstavlja predsjednik HOO-a, a u njegovoj odsutnosti ili spriječenosti dopredsjednik ili drugi član Vijeća kojeg odredi predsjednik, odnosno kojeg odredi Vijeće HOO-a (dalje u tekstu: Vijeće) u slučaju nemogućnosti da predsjednik o tome odluči.\n- (2) U svim poslovima HOO zastupaju pred", "sjednik HOO-a (dalje u tekstu: predsjednik) i glavni tajnik HOO-a (dalje u tekstu: glavni tajnik).\n- (3) Odredene poslove zastupanja predsjednik odnosno glavni tajnik mogu prenijeti na treće osobe, na temelju pisane punomoći, kojom se odreduju ovlasti i opseg zastupanja.\n- (1) Rad HOO-a je javan.\n\n## Članak 11.\n\n- (2) Javnost rada osigurava se i ostvaruje na način utvrden ovim Statutom.\n\n## III. CILIEVI, PODRUČJE DJELOVANJA SUKLADNO CILEVIMA I DJ", "ELATNOST\n\n## (1) Ciljevi HOO-a su:\n\n## Članak 12.\n\n- promicanje olimpijskih načela, etičkih i moralnih normi u sportu\n- poticanje i promicanje cjelokupnog hrvatskog sporta te njegovo predstavljanje pred MOO-om i drugim odgovarajućim medunarodnim sportskim organizacijama i udruženjima\n- uskladivanje i poticanje aktivnosti nacionalnih sportskih saveza\n- razvoj i promicanje sporta na državnoj razini te poticanje i suradnja u provedbi aktivnosti u po", "dručju razvoja sporta na razini županija, gradova i opcina\n\n- (2) HOO sukladno ciljevima djeluje na području sporta.\n- (3) Djelatnost HOO-a u ispunjavanju navedenih ciljeva je:\n3. poticanje i promicanje sporta i olimpizma u Republici Hrvatskoj,\n- razvijanje, promicanje i zastita olimpijskog pokreta sukladno Olimpijskoj povelji\n5. promicanje temeljnih načela i vrijednosti olimpizma u Republici Hrvatskoj, osobito u područjima sporta i obrazovanja, ", "promicanjem olimpijskih obrazovnih programa na svim razinama skola, sportskih institucija i institucija tjelesnog odgoja kao i poticanjem stvaranja institucija posvećenih olimpijskom obrazovanju, kao što je to Hrvatska olimpijska akademija, olimpijski muzej i drugi programi, uključujući i kulturne programe, koji se odnose na olimpijski pokret.\n6. poticanje etičkih i moralnih načela, poštivanje ljudskog dostojanstva, fair playa, tolerancije, nenas", "ilja i kulture sporta\n- djelovanje na održavanju skladnih odnosa i suradnje s odgovarajućim državnim i nedržavnim tijelima\n8. sudjelovanje u radu Nacionalnog vijeća za sport\n9. sudjelovanje u predlaganju i provodenju nacionalne strategije sporta i nacionalnog plana razvoja sporta, te u provedbi Nacionalnog programa sporta,\n10. sudjelovanje u predlaganju i ostvarivanju mjera za unapredenje i razvoj sporta\n11. provodenje postupka kategorizacije spo", "rtova za sportove koji su razvrstani u Nomenklaturi sportova i sportskih grana u nadležnosti HOO-a i donošenje odluke o rangiranju sportova i razvrstavanju u kategorije\n12. -sudjelovanje u predlaganju i provodenju dijela programa javnih potreba u sportu drěavne razine\n13. djelovanje na razvijanju prijateljstva, medusobnog razumijevanja i ravnopravnosti te izgradnji boljeg i mirnijeg svijeta\n14. poduzimanje mjera protiv svih oblika diskriminacije ", "i nasilja u sportu\n- zalaganje za ravnopravnost spolova u sportu\n- poticanje sporta djece i mladih\n17. -promocija sporta putem medija\n\n- zalaganje za razvoj sportske rekreacije-sporta za sve\n- uskladivanje i kontrola aktivnosti nacionalnih sportskih saveza i suradnja u provedbi aktivnosti u području razvoja sporta sa sportskim zajednicama u županijama i Gradu Zagrebu u ostvarivanju programa javnih potreba sporta državne razine, odnosno ukupnog pr", "ograma sporta i utvrdene strategije razvoja sporta\n- poticanje razvoja vrhunskih sportskih dostignuća hrvatskih sportaša i njihovog sudjelovanja u nacionalnim ekipama na olimpijskim i mediteranskim igrama, svjetskim i europskim prvenstvima, te drugim velikim medunarodnim sportskim natjecanjima\n- sudjelovanje u provedbi zdravstvene skrbi u sportu\n- sudjelovanje u provedbi aktivnosti, pripadajućih pravila i postupaka za borbu protiv dopinga u sport", "u, kao i korištenja supstanci te postupaka koje zabranjuje MOO ili medunarodni savezi\n- -zaštita i očuvanje čovjekova okoliša, te uključenje u svjetski pokret u borbi protiv klimatskih promjena brigom i aktivnostima za postizanje održivog razvoja u sustavu sporta\n- -zaštita površina i objekata za sport\n- borba protiv svih oblika političke i komercijalne zloupotrebe sporta i sportaša\n- poduzimanje aktivnosti i mjera zaštite djece u sportu te o sva", "kom kršenju prava djece, osobito svim oblicima nasilja nad djecom, spolne zloporabe, zanemarivanja ili nehajnog postupanja, zlostavljanja ili izrabljivanja djece u sportskim natjecanjima ili u vezi sa sportom obavijestiti nadležna tijela\n- -koordiniranje članova HOO-a pri izradi protokola za postupanje u slučaju nasilja medu djecom u sportskim klubovima\n- sudjelovanje u organiziranju i poticanju znanstvenih i razvojnih projekata u sportu\n- utvrdi", "vanje sustava, uvjeta i načela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj\n- sudjelovanje u organiziranju olimpijskih igara i drugih velikih medunarodnih sportskih natjecanja i priredbi\n- poticanje i poduzimanje aktivnosti za unapredenje stručnog rada u sportu i skrbi o osposobljavanju i usavršavanju stručnih djelatnika u sportu te obrazovanje sportskih djelatnika u svrhu promicanja temeljnih načela olimpizma putem pro", "grama HOO-a i Hrvatske olimpijske akademije, kao i drugih odgovarajućih ustanova i organizacija\n\n- provedba stručnog nadzora nad radom trenera koji su financirani kroz program javnih potreba u sportu državne razine\n- kontrola i izvještavanje tijela državne uprave nadležnog za sport o učinku svih programa, a posebno razvojnih programa za sportaše i trenere koji su financiranji kroz program javnih potreba u sportu državne razine\n- nadzor nad stručn", "im radom nacionalnih sportskih saveza, sukladno članku 110. Zakona o sportu\n- utvrdivanje nomenklature sportova\n- dostavljanje podataka u Nacionalni informacijski sustav u sportu\n- poduzimanje aktivnosti za primjenu medunarodnih sportskih pravila te donošenje akata u vezi s njihovom primjenom\n- djelovanje na povezivanju Republike Hrvatske putem sporta s drugim državama radi zbližavanja s drugim narodima, zbližavanja sportaša i drugih sudionika u ", "sportu\n- -čuvanje neovisnosti i autonomije HOO-a i sporta odupiranjem pritiscima svake vrste od političkih, pravnih, vjerskih, ekonomskih i drugih pritisaka koji su u suprotnosti s Olimpijskom poveljom\n- obavljanje i drugih zadaća koje su utvrdene zakonom, ovim statutom i drugim propisima.\n\n(4) Osim djelatnosti iz stavka 3. ovog članka HOO može obavljati i gospodarsku djelatnost odnosno marketinšku djelatnost, kao dio aktivnosti promocije sporta ", "radi osiguranja sredstava za financiranje zadaća i ostvarenja ciljeva HOO-a. HOO svoju gospodarsku djelatnost ne smije obavljati radi stjecanja dobiti. Ukoliko u obavljanju svoje gospodarske djelatnosti HOO ostvari dobit, ona se mora koristiti isključivo za obavljanje i unapredenje djelatnosti HOO-a, kojima se ostvaruju ciljevi HOO-a, utvrdeni ovim Statutom, sukladno zakonu.\n\n## Članak 13.\n\n(1) HOO ima isključive ovlasti predstavljanja hrvatskog ", "sporta na olimpijskim igrama, te svjetskim, europskim i regionalnim višesportskim natjecanjima koja se održavaju pod pokroviteljstvom MOO-a ili Europskih olimpijskih odbora.\n\n(2) HOO je dužan sudjelovati na natjecanjima navedenim u prethodnom stavku ovog članka, u skladu s Olimpijskom poveljom.\n\n(3) HOO stvara, organizira i vodi svoje delegacije na olimpijske igre, te svjetska, europska i regionalna višesportska natjecanja koja se održavaju pod p", "okroviteljstvom MOO-a ili EOC-a, te je odgovoran za ponašanje članova delegacije.\n\n(4) HOO odlučuje o prijavi sportaša koje su predložili njihovi nacionalni sportski savezi. Izbor sportaša temelji se ne samo na sportskom dostignuću već i na njihovim sposobnostima da budu primjer mladosti svoje zemlje. O uskladenosti prijava nacionalnih sportskih saveza s odredbama Olimpijske povelje brine HOO\n\n(5) HOO ustrojava i vodi službenu evidenciju o osvaja", "čima medalja na olimpijskim igrama i zimskim olimpijskim igrama te svjetskim prvenstvima u olimpijskim sportovima i disciplinama.\n\n(6) HOO izdaje uvjerenje iz evidencije iz stavka 5. ovog Članka na zahtjev sportaša osvajača medalje u svrhu ostvarivanja prava na trajnu novčanu mjesečnu naknadu osvajača medalja na olimpijskim igrama i svjetskim prvenstvima u olimpijskim sportovima i disciplinama, sukladno odredbama Zakona o sportu.\n\n(7) HOO vodi sl", "užbenu evidenciju o trenerima i izbornicima koji su obavljali stručne poslove vodenja sportaša ili ekipe na sportskom natjecanju, odnosno olimpijskim igrama /i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama/, i koji su zaslužni za medalju koja je osvojena na olimpijskim igrama te izdaje uvjerenje izbornicima i trenerima, na njihov zahtjev, u svrhu ostvarivanja prava na trajnu mjesečnu novčanu naknadu, sukladno odredbama ", "Zakona o sportu.\n\n(8) HOO je isključivo ovlašten da odabere i imenuje grad koji se može prijaviti za organizaciju Olimpijskih igara u Republici Hrvatskoj.\n\n(9) HOO usvaja i primjenjuje Svjetski kodeks protiv dopinga, na taj način osiguravajući da strategije i pravila HOO-a protiv dopinga, članstvo i zahtjevi financiranja, te rezultati upravljačkih postupaka budu u skladu sa Svjetskim kodeksom protiv dopinga i poštuju sve uloge i odgovornosti naci", "onalnog olimpijskog odbora koji su navedeni unutar Svjetskog kodeksa protiv dopinga.\n\n(10) HOO ima zadaću štititi olimpijsko vlasništvo te je odgovoran Medunarodnom olimpijskom odboru za poštivanje pravila i dopunskih propisa pravilima Olimpijske povelje vezanim uz skrb za zaštitu prava koja se odnose na olimpijske igre i olimpijskom vlasništvo, koje obuhvaća olimpijski simbol, olimpijsku zastavu, olimpijsko geslo, olimpijske znakove, olimpijsku ", "himnu, olimpijski plamen i olimpijske baklje te olimpijske oznake na području Republike Hrvatske, a ovlašten je poduzimati mjere za zabranu korištenja olimpijskog vlasništva, ako je to u suprotnosti s pravilima ili dopunskim propisima Olimpijske povelje.\n\n(11) HOO utvrduje svoju opredijeljenost i spremnost poduzimanja aktivnosti za podržavanje integriteta sporta, uključujući zaštitu čistih sportaša i poštenog natjecanja, kao i za borbu protiv man", "ipulacije natjecanjima pridržavajući se normi Kodeksa olimpijskog pokreta o sprječavanju manipulacije sportskim natjecanjima, sukladno pripadajućem općem aktu HOO-a, pri čemu zahtijeva od svojih članova da učine isto.\n\n## Članak 14.\n\n- (1) HOO-u je Zakonom o sportu, povjerena javna ovlast za utvrdivanje kategorija sportaša i donošenje riešenja o kategorizaciji sportaša.\n- (2) HOO ustrojava i vodi registar kategoriziranih sportaša.\n\n## IV. ČLANSTV", "O\n\n- (1) Članovi HOO-a su:\n2. -nacionalni sportski savezi\n3. -sportske zajednice u županijama te Gradu Zagrebu\n4. druge pravne osobe čija je djelatnost od interesa za razvoj hrvatskog sporta i olimpijskog pokreta sukladno ovom Statutu.\n- (2) Odluku o učlanjenju u HOO donosi Skupština HOO-a (dalje u tekstu: Skupština).\n- (3) Popis članova HOO-a vodi se elektronički, a za svaku članicu Saveza obvezno sadrži:\n- podatak o nazivu člana\n- OIB člana\n- d", "atum pristupanja HOO-u\n- kategoriji članstva\n- datum prestanka članstva (za one članove koji nisu više članovi HOO-a)\n- (4) Popis članova HOO-a je dostupan na uvid svim članovima i nadležnim tijelima, na njihov zahtjev.\n\n## Članak 16.\n\n- (1) Članovi HOO-a samostalne su, autonomne udruge s pravnom osobnošću i odredenim pravima, obvezama i odgovornostima u HOO-u, koje iskazuju:\n2. svojim ustrojem, programskom i poslovnom djelatnošću\n- osiguravanjem", " financijskih sredstava i drugih uvjeta za svoju djelatnost\n- pravom odlučivanja iz svog djelokruga.\n- (2) Članovi HOO-a mogu biti punopravni, pridruženi i privremeni te počasni članovi.\n\n## Članak 15.\n\n## Punopravni članovi\n\n- (1) Punopravni članovi HOO-a mogu biti: nacionalni sportski savez, sportska zajednica u županijama i Gradu Zagrebu ako ispunjava slijedeće kriterije i uvjete:\n\n## 1. Nacionalni sportski savez:\n\n- da je medunarodnu federaci", "ju istog sporta priznao MOO ili da je učlanjena u pripadajuće udruzenje medunarodnih sportskih federacija / SportAccord\n- da je osnovan sukladno Zakonu o sportu i Zakonu o udrugama i registriran kod nadležnog upravnog tijela županije odnosno Grada Zagreba\n- da je svrha osnivanja i djelovanja razvoj i unapredenje, širenje i promicanje sporta u Republici Hrvatskoj prema načelima sporta i olimpizma\n- -da ima tijela saveza izabrana i registrirana suk", "ladno statutu, Zakonu o sportu i Zakonu o udrugama, te da ima opće akte utvrdene navedenim zakonima i usvojene od nadležnih tijela saveza\n- da ima osigurane kadrovske i stručne te osnovne materijalne uvjete za rad i djelovanje\n- da drugi nacionalni savez istog sporta nije učlanjen u HOO\n- da prihvaća Statut HOO-a.\n2. Sportska zajednica županije i Grada Zagreba (dalje u tekstu: sportska zajednica):\n- da je osnovana sukladno Zakonu o sportu i Zakon", "u o udrugama nadležnog upravnog tijela županije odnosno Grada Zagreba i registrirana kod\n- da je svrha osnivanja i djelovanja razvoj i unapredenje, širenje i promicanje cjelokupnog sporta na području njenog djelovanja prema načelima sporta i olimpizma\n- da ima tijela sportske zajednice izabrana i registrirana sukladno statutu, Zakonu o sportu i Zakonu o udrugama\n- da prihvaća Statut HOO-a.\n- (2) Punopravni član HOO-a je i Hrvatski klub olimpijaca", ", ako ispunjava slijedeće uvjete:\n- da je osnovan sukladno Zakonu o sportu i Zakonu o udrugama i registriran kod nadležnog upravnog tijela županije odnosno Grada Zagreba\n- da je svrha osnivanja i djelovanja razvoj i unapredenje sporta i olimpizma\n\n## Članak 17.\n\n- da ima tijela Kluba izabrana i registrirana sukladno statutu, Zakonu o sportu i Zakonu udrugama\n- da prihvaća Statut HOO-a.\n\n## Pridruženi članovi\n\nPridruženi članovi HOO-a mogu biti:\n\n", "1. Nacionalni sportski savez koji ne ispunjava kriterije i uvjete iz članka 17. točke 1. u alinejama 1. i 5. ako Skupština odluči da je njihovo učlanjenje od interesa za hrvatski sport u cijelosti.\n2. Pravna osoba - udruga i ustanova čija je djelatnost od značenja za hrvatski sport (dalje u tekstu: udruga) ako ispunjava slijedeće kriterije i uvjete:\n- da je odgovarajuću medunarodnu udrugu priznao MOO ili da je učlanjen u pripadajuće udruženje med", "unarodnih sportskih federacija / SportAccord\n- da je osnovana sukladno zakonu i registrirana pri nadležnom tijelu\n- da je svrha osnivanja i djelovanja udruge doprinos razvoju i unapredenju, širenju i promicanju cjelokupnog sporta u skladu s načelima sporta i olimpizma\n- da ima osigurane kadrovske, stručne i osnovne materijalne uvjete za rad i djelovanje\n- da prihvaća Statut HOO-a.\n- (1) Zahtjevu za učlanjenje nacionalni sportski savez i sportska ", "zajednica ili udruga prilažu dokaze o ispunjavanju kriterija i uvjeta navedenih u člancima 17. i 18. ovog Statuta, a naročito:\n- Statut\n- rješenje o upisu u registar nadležnog tijela\n- obavijest Državnog zavoda za statistiku o razvrstavanju poslovnog subjekta u djelatnosti\n- popis članova\n- podatke o osobama ovlaštenim za zastupanje i predstavljanje\n- opis osnovnih značajki sporta, dosadašnjeg djelovanja saveza ili udruge, te opći akt o sustavu, ", "uvjetima i organizaciji sportskih natjecanja tog sporta kad zahtjev za učlanjenje podnosi nacionalni sportski savez.\n\nČlanak 18.\n\n## Članak 19.\n\n(2) Ukoliko za odredeni jedan sport djeluje jedna medunarodna federacija tog sporta koju je priznao MOO ili koja je učlanjena u pripadajuće udruženje medunarodnih sportskih federacija - SportAccord, a u Republici Hrvatskoj se iz takvog sporta samovoljnim izdvajanjem (cijepanjem) osnuje drugi ili više sav", "eza, HOO neće udovoljiti zahtjevima novoosnovanih saveza ili udruga za učlanjenje u HOO.\n\n## Privremeni članovi\n\n- (1) Skupština može privremeno priznati novi nacionalni sportski savez na rok od dvije godine ili drugo razdoblje koje utvrdi Skupština, a u kojem će HOO pratiti djelovanje podnositelja zahtjeva za učlanjenje, a nakon kojeg u slučaju da nije donesena odluka o prijemu u članstvo HOO-a, privremeno priznanje automatski gubi valjanost. Za", " vrijeme privremenog članstva pripadajući nacionalni sportski savez ima prava i dužnosti kao i pridruženi članovi HOO-a. Vijeće HOO-a ovlašteno je donijeti opći akt o načinu i postupku na koji se utvrouje ispunjenje uvjeta iz ovog Statuta za prijem u članstvo HOO-a kao i o uvjetima za promjenu statusa člana HOO-a iz privremenog u pridruženo, odnosno punopravno ili obrnuto.\n\n## Clanak 20.\n\n- (2) Odredba prethodnog stavka ovog članka ne primjenjuje", " se ako prijem za učlanjenje podnosi nacionalni sportski savez čija je medunarodna federacija istog sporta uključena u program olimpijskih igara.\n\n## Clanak 21.\n\n- (1) Članovi HOO-a u ostvarivanju zajedničkih interesa, zadaća i poslova, odredenih zakonom, ovim Statutom i Olimpijskom poveljom imaju prava i obveze:\n2. sudjelovati u radu HOO-a i njegovih tijela i davati prijedloge radi što uspješnijeg ostvarivanja ciljeva i zadaća HOO-a\n3. birati pr", "edstavnike u Skupštinu u skladu s odredbama ovog Statuta\n4. provoditi aktivnosti kojima se ostvaruju zadaće i ciljevi utvrdeni ovim Statutom\n5. sudjelovati u utvrdivanju i provodenju dijela programa javnih potreba u sportu državne razine u nadležnosti HOO-a te prema vlastitom sudjelovanju u tom programu ostvarivati pravo na financiranje programskih zadaća iz sredstava HOO-a u skladu s odredbama Zakona o sportu kojima se definiraju javne potrebe u", " sportu na državnoj razini u nadležnosti HOO-a i kriterijima koje utvrduje HOO, a sukladno odredbama općih akata HOO-a, te na zahtjev HOO-a, dostavljati izvješća u dijelu programa javnih potreba sporta državne razine u kojem sudjeluje član HOO-a\n- dostavljati HOO-u statut kao i svaku izmjenu i dopunu statuta, na prethodno mišljenje radi utvrdivanja suglasnosti da je statut člana HOO-a suglasan sa Statutom HOO-a i Zakonom o sportu, a prije registr", "acije pri nadležnom upravnom tijelu županije odnosno Grada Zagreba.\n\n- uskladiti opći akt o sustavu, uvjetima i organizaciji sportskih natjecanja u pojedinom sportu s općim aktom HOO-a o načelima i osnovnim elementima sustava sportskih natjecanja u Republici Hrvatskoj\n- provoditi odluke i zaključke HOO-a i njegovih tijela te odgovarati za njihovo izvršavanje\n- ostvarivati druga prava i izvršavati druge obveze u skladu sa zakonom i ovim Statutom.\n", "\n(2) Pridruženi članovi HOO-a imaju prava, obveze i odgovornosti utvrdene prethodnim stavkom ovog članka, osim:\n\n- -prava odlučivanja u Skupštini\n- (3) Skupština može na prijedlog Vijeća HOO-a donijeti odluku da se prava i obveze člana HOO-a nad kojim je otvoren stečajni postupak stavljaju u mirovanje, osim prava na financiranje odredenih programskih zadaća sportskog programa člana HOO-a u stečaju, o čijem opsegu i namjeni odlučuje Vijeće HOO-a, ", "u okviru usvojenog proračuna HOO-a\n- (4) Kod utvrdivanja prethodnog mišljenja na Statut, odnosno izmjene i dopune Statuta člana HOO-a, slijedom odredbe stavka 1. alineja 5. ovog članka, HOO ce poštovati specifičnosti pojedinog sporta, nacionalnog sportskog saveza ili lokalne sportske zajednice, koje su isti unijeli u Statut.\n\n## Počasni članovi\n\n## članak 22.\n\n- (1) Za počasne članove HOO-a Skupština imenuje fizičke osobe naročito zaslužne za dug", "ogodišnji doprinos uspješnom djelovanju HOO-a, razvoju sporta i olimpizma, na temelju posebnog akta na prijedlog Vijeća.\n- (2) Počasni članovi mogu sudjelovati u radu Skupštine bez prava glasa.\n\n## Prestanak članstva\n\n## Članak 23.\n\n- (1) Članu HOO-a prestaje članstvo:\n2. -na vlastiti pisani obrazloženi zahtjev člana\n- brisanjem iz registra nadležnog upravnog tijela župaanije odnosno Grada Zagreba\n- kada više ne udovoljava osnovnim uvjetima za čl", "anstvo u HOO-u iz članka 17. i 18. ovog Statuta.\n5. -pokretanjem stečajnog postupka\n\n- -ako se rješenjem nadležnog upravnog tijela županije odnosno Grada Zagreba utvrdi da je član prestao djelovati\n- isključenjem iz HOO-a.\n\n(2) U slučaju pokretanja stečajnog postupka nad nacionalnim sportskim savezom, HOO odlukom Vijeća HOO-a preuzima skrb o nacionalnoj sportskoj ekipi te poduzima potrebne aktivnosti za zaštitu interesa sportaša i stečenih prava ", "na medunarodnoj razini.\n\nKada član HOO-a svojim djelovanjem:\n\n## Članak 24.\n\n- ne ostvaruje ciljeve i zadaće zbog kojih je osnovan\n- -ne pridržava se ili krši načela i pravila Olimpijske povelje i ovog Statuta\n- -ne izvršava i ne provodi odluke i zaključke tijela HOO-a,\n- ne djeluje sukladno Zakonu o sportu i Zakonu o udrugama, odnosno nema tijela izabrana i registrirana sukladno navedenim zakonima i/ili nema opée akte propisane zakonom i usvojen", "e od nadležnih tijela,\n\npodliježe mjerama i sankcijama utvrdenim ovim Statutom.\n\n## Članak 25.\n\n- (1) Radi djelovanja iz članka 24. ovog Statuta, članovima HOO-a mogu se izreći:\n- a) mjere:\n- upozorenje\n- opomena\n- b) sankcije:\n6. suspenzija\n7. isključenje iz članstva HOO-a.\n- (2) Izricanje mjera ili sankcija utvrdenih u stavku 1. ovog članka zavisi o vrsti, težini i stupnju učinjene povrede ili prekršaja iz članka 24. ovog Statuta, a primjenjuje", " se:\n- za lakšu povredu: upozorenje ili opomena\n- za težu povredu: suspenzija ili isključenje iz članstva HOO-a.\n- (3) O izricanju mjere upozorenja ili opomene odlučuje Vijeće.\n\nNa prvoj sljedećoj sjednici Skupštine, Vijeće izvještava o izrečenoj mjeri iz prethodnog stavka.\n\n- (4) O suspenziji ili isključenju iz članstva odlučuje Skupština.\n- (5) U slučaju hitne potrebe Vijeće može izreći i sankciju suspenzije, o čemu konačnu odluku donosi Skupšt", "ina na prvoj sljedećoj sjednici koja se treba održati najkasnije u roku od 60 dana.\n- (6) Posebnim aktom HOO-a ureduju se pitanja provodenja postupka za utvrdivanje povreda ili prekršaja iz članka 24. i izricanje odgovarajućih mjera i sankcija utvrdenih u stavku 1. ovog članka.\n\n## V. USTROJSTVO\n\nČlanak 26.\n\n- (1) Tijela HOO-a jesu:\n\n1. Skupština\n\n2. Predsjednik\n\n3. Vijeće\n\n4. Nadzorni odbor\n\n5. Etički odbor\n\n6. Komisija sportaša\n\n- (2) Samostaln", "o i nezavisno tijelo za rješavanje sporova koji se mogu pojaviti izmedu HOO-a i njegovih članova vezano uz nadležnosti HOO-a, kao i u pogledu povrede Olimpijske povelje, ovog Statuta i drugih općih akata HOO-a je:\n\nKomisija za rješavanje disciplinskih pitanja i prijepora izmedu HOO-a i članica\n\n- (3) Samostalno te operativno i institucionalno nezavisno tijelo za antidoping je:\n\nŽalbeno vijeće za antidoping\n\n- (4) Članovi tijela HOO-a temeljem čla", "nstva u njima, osim tijela iz stavka 3. ovog članka, ne ostvaruju pravo na novčanu naknadu.\n\n- (5) U tijelima HOO-a potrebno je osigurati sudjelovanje 40% osoba podzastupljenog spola.\n\n## 1. Skupština\n\n## a) Nadležnosti Skupštine\n\nSkupština je najviše upravljačko tijelo HOO-a koje obavlja sljedeće zadaće:\n\n## Članak 27.\n\n- donosi Statut i opée akte te njihove izmjene i dopune\n- utvrduje strategiju i politiku razvoja hrvatskog sporta u nadležnosti", " HOO-a\n- donosi odluke o učlanjenju u medunarodne sportske i nedržavne asocijacije od interesa za HOO i hrvatski sport\n- verificira uspostavljanje odnosa s drugim nacionalnim olimpijskim odborima\n- odlučuje o isticanju kandidature za organizaciju olimpijskih igara, mediteranskih igara i drugih višesportskih natjecanja za koje je potrebno donijeti odluku\n- odlučuje o verifikaciji svojih članova, izboru predsjednika i četiri dopredsjednika, članova", " Vijeća, članova Nadzornog odbora, članova Komisije za rješavanje disciplinskih pitanja i prijepora izmedu HOO-a i članica, članova Žalbenog vijeće za antidoping, vanjskog revizora i likvidatora, te donosi odluku o njihovom razrješenju\n- odlučuje o statusu svojih članova - učlanjenju, sankcijama i prestanku članstva\n- donosi opći akt kojim se utvrduju načela i osnovni elementi sustava sportskih natjecanja u Republici Hrvatskoj\n- imenuje Etički od", "bor i osniva Hrvatsku olimpijsku akademiju\n- -Losniva posebna povjerenstva za izvršavanje odredenih zadaća\n- usvaja godišnje i višegodišnje planove i programe dijela javnih potreba sporta državne razine u nadležnosti HOO-a, godišnji financijski plan HOO-a, odnosno dio programa javnih potreba sporta državne razine u nadležnosti HOO-a i financijski plan HOO-a za slijedeću godinu, kao i njegove izmjene i dopune, a iznimno u slučaju potrebe privremen", "i financijski plan HOO-a, te izvješća o izvršenju programa i financijski izvještaj za prethodnu godinu.\n- donosi projekt priprema i sudjelovanja na olimpijskim i zimskim olimpijskim igrama\n- donosi kriterije za lokalne sportske zajednice na razini gradova u odnosu na članstvo u Odboru lokalnih sportskih zajednica\n\n- donosi odluku o promjeni ciljeva i djelatnosti, prestanku rada i raspodjeli preostale imovine\n- obavlja i druge poslove i zadaće odr", "edene zakonom, te je nadležna i za sva pitanja za koja nije utvrdena nadležnost drugih tijela HOO-a, kada se radi o pitanjima koja po svom značaju upućuju na nadležnost najvišeg tijela upravljanja HOO-a.\n\n## b) Sastav Skupštine\n\n## (1) Skupštinu čine:\n\n- po jedan predstavnik nacionalnih sportskih saveza, županijskih sportskih zajednica i Grada Zagreba, te udruga i ustanova\n- tri predstavnika Komisije sportaša\n- tri predstavnika Hrvatskog kluba ol", "impijaca, natjecatelja na olimpijskim igrama\n- članovi MOO-a u Hrvatskoj po funkciji\n- počasni članovi MOO-a u Hrvatskoj po funkciji.\n- (2) Pravo glasa u Skupštini imaju svi predstavnici nacionalnih sportskih saveza iz članka 17. ovog Statuta, sportskih zajednica županija i Grada Zagreba, sva tri predstavnika Komisije sportaša i Hrvatskog kluba olimpijaca, te članovi MOO-a u Hrvatskoj.\n- (3) Predstavnici Komisije sportša se moraju povući sa svoji", "h mjesta u Skupštini HOO-a najkasnije krajem treće olimpijade nakon posljednjih olimpijskih igara u kojima su sudjelovali.\n- (4) Država i njezina tijela kao i druga tijela javne vlasti i nedržavnih institucija, sukladno Olimpijskoj povelji, ne mogu imenovati svoje predstavnike u Skupštinu.\n\n## Članak 29.\n\n- (1) Predstavnici nacionalnih sportskih saveza učlanjenih u medunarodne federacije olimpijskih sportova moraju imati većinu glasova u Skupštin", "i.\n- (2) Radi provedbe odredbe stavka 1. ovog članka predstavnici nacionalnih sportskih saveza učlanjenih u medunarodne federacije olimpijskih sportova imaju po dva glasa u Skupštini.\n\n## Članak 28.\n\n## Clanak 30.\n\n- (1) Za clana Skupštine može biti izabrana osoba koja ispunjava slijedeće uvjete i kriterije:\n- da je državljanin Republike Hrvatske\n- da je afirmiran sportaš ili sportski djelatnik\n- da prihvaća i promiče načela i pravila Olimpijske ", "povelje, Etičkog i Medicinskog kodeksa, Svjetskog kodeksa protiv dopinga te ovog Statuta\n- da se nije ogriješio o etičke norme i načela olimpijskog pokreta\n- da nije kažnjen disciplinskom kaznom nacionalnog sportskog saveza, osim kazne koju su dobili sportaši u sustavu natjecanja\n7. -da nema zapreke iz članka 114. odnosno članka 111. stavci 1. i 2. Zakona o sportu\n8. -da nije zaposlen ili angažiran po ugovoru o djelu ili drugom odgovarajućem ugov", "oru, u HOO-u, odnosno u članovima HOO-a, na teret sredstava financijskog plana HOO-a\n- (2) Članovi Skupštine obvezni su potpisati posebnu izjavu o poštivanju Olimpijske povelje i ovog Statuta.\n- (3) Odbijanje potpisa izjave iz prethodnog stavka ovog članka ima značaj ostavke, te je član HOO-a, kojeg predstavlja, dužan predložiti novog predstavnika.\n- (4) Jedan član Skupštine može biti predstavnik, što uključuje i zamjenu predstavnika, samo jednog", " člana HOO-a.\n\n## c) Mandat Skupštine\n\n- (1) Mandat Skupštine traje četiri godine, a počinje teći danom održavanja izborne sjednice Skupštine na kojoj se verificira većina mandata predstavnika članova HOO-a za novi saziv Skupštine.\n\n## članak 31.\n\n- (2) Ista osoba može biti ponovno izabrana u Skupštinu za novo mandatno razdoblje. Naknadno izabranom članu Skupštine mandat traje do isteka mandata saziva Skupštine za koji je izabran.\n- (3) Iznimno, ", "u slučaju spriječenosti člana Skupštine da sudjeluje na sjednici Skupštine, nadležno tijelo nacionalnog sportskog saveza, sportske zajednice i udruge može, na temelju pisane odluke, imenovati zamjenika za tu sjednicu.\n- (4) Mandat zamjenskog člana za tu sjednicu podliježe verifikaciji Skupštine.\n\n## Članak 32.\n\n- (1) Izbori predstavnika u Skupštinu objavljuju se najkasnije 60 dana prije održavanja izborne Skupštine novog saziva.\n- (2) Izbornu sje", "dnicu Skupštine saziva predsjednik na temelju odluke Vijeća.\n\n## članak 33.\n\n- (1) Clanovi Skupštine sudjeluju u radu i odlučivanju zasnivajući svoje stajalište prije svega na:\n2. -zahtjevima provodenja utvrdene strategije razvoja sporta u Republici Hrvatskoj\n3. -zajedničkim obvezama i odgovornostima za ostvarivanje programa javnih potreba u sportu Republike Hrvatske\n4. -težnjama k ostvarivanju sportskih vrijednosti koje pridonose razvitku, afirm", "aciji ugledu hrvatskog sporta i Republike Hrvatske\n5. zajedničkim interesima svih udruženih članica i obvezi izvršenja ciljeva i zadaća HOO-a utvrdenih zakonom, ovim Statutom i Olimpijskom poveljom.\n- (2) Obveza je članova Skupštine u svakoj prigodi zastupati i štititi interese HOO-a, hrvatskog sporta i olimpizma te interese udruge koju predstavljaju.\n- (3) Članovi Skupštine dužni su prije svake sjednice Skupštine ili Odbora provesti konzultacije", " s udrugom koju predstavljaju oko materijala za točke dnevnog reda na sjednicama.\n\n## Članak 34.\n\n## Članu Skupštine mandat može prestati:\n\n- istekom trajanja mandata na koji je izabran\n- gubitkom državljanstva Republike Hrvatske\n- podnošenjem neopozive ostavke\n- opozivom od strane nacionalnog sportskog saveza, sportske zajednice odnosno udruge čiji je predstavnik\n- nastupanjem okolnosti zbog kojih više ne može obavljati dužnost\n- kada se utvrde ", "uvjeti nespojivosti odredenih funkcija i dužnosti u HOO-u, odnosno njegovoj Stručnoj službi i njegovim članovima\n- ako je član Skupštine predstavnik saveza ili druge udruge nad kojom je pokrenut stečajni postupak\n- -razrješenjem.\n\n## Članak 35.\n\n- (1) U slučajevima iz članka 34. alineje 1. do 6. ovog Statuta, članstvo prestaje automatski, bez provodenja posebnog postupka, verifikacijom stanja na sjednici Skupštine.\n- (2) U siučaju razrješenja iz ", "članka 34. alineje 8. ovog Statuta, mandat člana u Skupštini može prestati u slučaju:\n- ako ne prihvaća, ne promiče, ne pridržava se ili krši načela i pravila Olimpijske povelje, Etičkog, ili Medicinskog kodeksa, Svjetskog kodeksa protiv dopinga te ovog Statuta\n- ako svojim nedoličnim ponašanjem šteti interesima ili ugrožava ugled HOO-a i olimpijskog pokreta u hrvatskoj javnosti ili na medunarodnom planu\n- ako tijekom dvije godine neopravdano izo", "staje sa sjednica Skupštine, ili ne izvršava zadaće koje proizlaze iz Statuta i odluka Skupštine i njezinih tijela.\n- (3) Razrješenje člana Skupštine zbog jednog ili više razloga iz stavka 2. ovog članka može zatražiti nacionalni sportski savez, županijska zajednica ili udruga, te članovi Skupštine.\n- (4) Razrješenje člana Skupštine zbog razloga iz članka 34. alineja 7. ovog Statuta Skupštini prediaže Vijeće HOO-a.\n- (5) U slučaju kad razrješenje", " člana Skupštine traži član Skupštine, takav zahtjev se stavlja na razmatranje ako ga je podržalo najmanje petnaest članova Skupštine s pravom glasa.\n\n## Clanak 36.\n\n- (1) Odluku o prestanku članstva u Skupštini zbog jednog ili više utvrdenih razloga iz članka 35. stavka 2. ovog Statuta, donosi Skupština na temelju pisanog zahtjeva ovlaštenog tijela ili osobe iz Članka 35. stavka 3. ovog Statuta, dvotrećinskom većinom glasova nazočnih članova s p", "ravom glasa na sjednici Skupštine.\n- (2) Član Skupštine o čijem se prestanku članstva u Skupštini raspravlja, ima pravo prije glasovanja pred Skupstinom izloziti svoj stav, a u slučaju da osporava podneseni zahtjev za njegovo razrješenje može zatražiti mišljenje Etičkog odbora, koje ce biti razmatrano na Skupštini zajedno s podnesenim zahtjevom za razrješenje.\n- (3) Razriješeni član Skupštine ne može više postati članom Skupštine niti obavljati b", "ilo koju drugu funkciju u HOO-u, ako je razriješen u skladu s člankom 35. stavcima 2. i 3. ovog Statuta.\n- (4) Isključeni član MOO-a ne može više biti član HOO-a.\n\n## d) Sjednice Skupštine\n\n- (1) Skupština HOO-a odlučuje o pitanjima iz svoje nadležnosti na sjednicama.\n\n## Clanak 37.\n\n(2) Sjednice Skupštine saziva i predsjedava im predsjednik, a u slučaju njegove odsutnosti ili spriječenosti jedan od dopredsjednika kojeg on ovlasti.\n\n(3) Izborne s", "jednice Skupštine saziva predsjednik, a predsjedava joj tročlano radno predsjedništvo koje se bira izmedu članova Skupštine s pravom glasa. U radno predsjedništvo ne mogu biti birani kandidati za predsjednika HOO-a.\n\n(4) Sjednice Skupštine saziva predsjednik:\n\n- kad ocijeni potrebnim, a najmanje dva puta godišnje\n- na temelju zaključka Vijeća\n- na obrazloženi zahtjev najmanje jedne trećine članova Skupštine\n- na obrazloženi pisani zahtjev Nadzorn", "og odbora.\n\n(5) Skupština može pravovaljano odlučivati ako je na sjednici nazočan onaj broj članova Skupštine čiji ukupan broj glasova čini za jedan glas više od polovine ukupnog broja glasova članova Skupštine s pravom glasa.\n\n(6) Članu Skupštine na izbornoj sjednici Skupštine HOO-a, oduzet ce se pravo glasa u slučaju da je predstavnik člana HOO-a koji nema urednu registraciju o važećim mandatima tijela upravijanja i zastupanja.\n\n## Članak 38.\n\n", "(1) Sjednice Skupštine mogu biti redovne, izvanredne, tematske, svečane i izborne.\n\n(2) Izvanredne i tematske sjednice Skupštine saziva predsjednik na vlastitu inicijativu, ili na temelju zaključka, odnosno zahtjeva iz članka 37. stavka 4. alineje 2. do 4. ovog Statuta.\n\n(3) Zahtjev za sazivanje izvanredne sjednice Skupštine mora sadržavati prijedlog dnevnog reda i pisano obrazloženje s prijedlogom tema za dnevni red sjednice.\n\n(4) Ako nadležno t", "ijelo Skupštine ovlašteno za sazivanje sjednice Skupštine, prema odredbi članka 37. stavak 2., ne sazove izvanredu sjednicu Skupštine u roku od 30 dana od dana prijema zaključka, odnosno zahtjeva za sazivanje izvanredne sjednice postavljenog u skladu s odredbama ovog Statuta, inicijator može sam sazvati traženu izvanrednu sjednicu Skupštine.\n\n(5) Tematske sjednice Skupštine održavaju se osobito, radi razmatranja posebne problematike olimpijskih s", "portova, neolimpijskih sportova ili sporta na lokalnoj razini.\n\n(6) Svečane sjednice Skupštine mogu se sazvati povodom Velikog dana hrvatskog sporta 17. siječnja, odnosno drugog datuma kojeg odredi Vijeće HOO-a, te Hrvatskog olimpijskog dana 10. rujna.\n\n(7) Izborne sjednice Skupštine održavaju se svake četiri godine, nakon održanih olimpijskih igara.\n\n(8) U slučaju isteka mandata tijelima HOO-a, Skupštinu HOO-a saziva zadnja osoba za zastupanje u", "pisana u Registar udruga ili najmanje 1/3 punopravnih članova HOO-a, koje su upisane u popis članova HOO-a prije isteka mandata tijelima HOO-a.\n\n## Članak 38.A\n\n- (1) Iznimno, u slučaju izvanrednih okolnosti i u hitnim slučajevima, odnosno u situacijama kad je odluka Skupštine hitna, a nema dovoljno vremena ili drugih uvjeta da se održi redovna sjednica Skupštine, Skupština može donijeti odluku glasovanjem članova Skupštine bez neposrednog dolask", "a članova Skupštine na sjednicu, izjašnjavanjem o prijedlogu odluke putem e-maila (elektronička sjednica).\n- (2) Za organizaciju navedene elektroničke sjednice dostavlja se prijedlog ili pitanje članu Skupštine s prijedlogom da se izjasni „Za\", „Protiv\" ili „Suzdržan\" u odnosu na prijedlog odluke koju je potrebno usvojiti na hitan način bez sazivanja sjednice.\n- (3) Takve odluke zahtijevaju prihvaćanje od strane većine svih članova Skupštine HOO-", "a s pravom giasa, ukljucujući provedbu odredbe iz članka 29. stavak 2. Statuta, ali isključujući primjenu odredbe Članka 31. stavak 3. Statuta.\n\n(4) O elektroničkoj sjednici sastaviti će se, a zatim i verificirati, zapisnik na slijedećoj redovnoj sjednici Skupštine HOO-a.\n\n## Članak 39.\n\n- (1) Skupština donosi odluke dvotrećinskom većinom glasova nazočnih članova na Skupštini s pravom glasa, u slijedećim slučajevima:\n- kod donošenja Statuta HOO-a", " kao i njegovih izmjena i dopuna\n- kod odlučivanja o prestanku članstva u Skupštini u skladu s člankom 36. stavak 1. ovog Statuta.\n- (2) Odluku o prestanku rada HOO-a donosi Skupština dvotrećinskom većinom ukupnog broja glasova članova u Skupštini s pravom glasa.\n\n(3) O svim drugim pitanjima, osim stavaka 1. i 2. ovog članka, Skupština donosi odluke većinom glasova nazočnih članova s pravom glasa na sjednici Skupštine.\n\n- (4) U slučaju jednakog b", "roja glasova za i protiv odlučuje glas predsjedavajućeg Skupštine.\n\nGlasovanje u Skupštini je javno osim:\n\n## Članak 40.\n\n- ako Skupština dvotrećinskom većinom glasova nazočnih članova s pravom glasa, odluči da je glasovanje o pojedinim pitanjima tajno i\n- kad se glasuje o izboru tijela HOO-a, a broj predloženih kandidatata je veći od broja osoba koje se bira za pojedino tijelo.\n\n## Članak 41.\n\n## Kada se radi o:\n\n- učlanjenju HOO-a u MOO i asoci", "jacije njegovih članova\n- isticanju kandidature za organizaciju olimpijskih igara\n- uspostavljanju odnosa s drugim nacionalnim olimpijskim odborima\n- -projektu priprema i sudjelovanja na olimpijskim igrama,\n\nkod odlučivanja se uzimaju u obzir samo glasovi članova Skupštine predstavnika nacionalnih sportskih saveza učlanjenih u medunarodne federacije olimpijskih sportova, članova Vijeća, predstavnika Komisije sportaša i Hrvatskog kluba olimpijaca.", "\n\n## Članak 42.\n\nPoslovnikom o radu Skupštine podrobnije se ureduju sazivanje, sadržaj rada i tijek sjednica, prava, obveze i odgovornosti članova Skupštine u vezi sa sjednicom, kao i druga pitanja od značenja za održavanje sjednica.\n\n## e) Stalna radna tijela Skupštine\n\nStalna radna tijela Skupštine jesu:\n\n- odbor ljetnih olimpijskih sportova\n- odbor zimskih olimpijskih sportova\n- odbor neolimpijskih sportova\n- odbor lokalnih sportskih zajednica", "\n\n## Članak 43.\n\n## Članak 44.\n\n(1) Odbor ljetnih olimpijskih sportova čine članovi Skupštine koji su predstavnici nacionalnih sportskih saveza čiji su sportovi uključeni u program igara olimpijade (ljetne). U Odboru ljetnih\n\n- olimpijskih sportova ne sudjeluju predstavnici nacionalnih sportskih saveza čiji sportovi su uključeni u program zimskih olimpijskih igara.\n- (2) Odbor zimskih olimpijskih sportova Čine članovi Skupštine koji su predstavni", "ci nacionalnih sportskih saveza čiji su sportovi uključeni u program zimskih olimpijskih igara.\n- (3) Odbor neolimpijskih sportova čine članovi Skupštine koji su predstavnici svih neolimpijskih nacionalnih sportskih saveza, punopravnih i pridruženih članova HOO-a koji nisu na programu igara olimpijade niti zimskih olimpijskih igara.\n- (4) Odbor lokalnih sportskih zajednica čine članovi Skupštine koji su predstavnici sportskih zajednica u županija", "ma i Gradu Zagrebu te predstavnici sportskih zajednica u pojedinim gradovima prema odluci Skupštine.\n- (5) Svi članovi u stalnim radnim tijelima Skupštine pri odlučivanju raspolažu s jednim glasom.\n- (6) Stalna radna tijela Skupštine sastaju se u pravilu prije sjednica Skupštine ili prema potrebi.\n- (7) Odbori mogu, prema potrebi, djelovati zasebno ili zajednički, sa drugim odborima, na svojim sjednicama.\n\n## Clanak 45.\n\n- (1) Sjednice stalnih ra", "dnih tijela Skupštine saziva i predsjedava im jedan od članova Vijeća HOOa iz redova predstavnika u Skupštini HOO-a koji sukladno odredbi članka 44. Statuta HOO-a čine pripadajući odbor, a kojeg Skupština imenuje za predsjednika tog stalnog radnog tijela.\n- (2) Stalno radno tijelo Skupštine donosi poslovnik o svom radu.\n\n## Clanak 46.\n\n(1) Odbor ljetnih olimpijskih sportova bavi se pitanjima u odnosu na sudjelovanje na igrama olimpijade, europski", "m i mediteranskim igrama, te drugim višesportskim priredbama pod pokroviteljstvom MOO-a za sve sportove koji su uključeni u program igara olimpijade, program europskih i mediteranskih igara, kao i drugim pitanjima aktivnosti tih nacionalnih sportskih saveza vezanih uz program javnih potreba u sportu na državnoj razini, a naročito:\n\n- razmatra prijedlog kriterija za nastup na igrama olimpijade, olimpijskim igrama mladih, europskim i mediteranskim ", "igrama za sve sportove\n- razmatra prijedlog liste sudionika igara olimpijade, olimpijskih igara mladih, europskih i mediteranskih igara\n- razmatra prijedlog programa priprema za igre olimpijade, olimpijske igre mladih, europske i mediteranske igre\n- razmatra prijedlog liste potencijalnih i evidentnih kandidata za sudjelovanje na igrama olimpijade, olimpijskim igrama mladih, europskim i mediteranskim igrama\n\n- -sudjeluje u pripremi kriterija za iz", "radu dijela programa javnih potreba sportu na državnoj razini u nadležnosti HOO-a\n- razmatra prijedlog financijskog plana HOO-a, u dijelu koji se odnosi na programe utvrene ovim člankom Satuta\n- -razmatra prijedlog kriterija za kategorizaciju sportaša\n- -razmatra prijedlog načela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj za nacionalne sportske saveze članove HOO-a.\n- (2) Kad odbor ljetnih olimpijskih sportova razmatr", "a pitanja u odnosu na europske odnosno mediteranske igre, u njegovu radu s pravom glasa sudjeluju i članovi Skupštine koji su predstavnici nacionalnih sportskih saveza koji nisu na programu igara olimpijade, ali su u programu europskih odnosno mediteranskih igara.\n\n## Članak 47.\n\nOdbor zimskih olimpijskih sportova bavi se pitanjima u odnosu na sudjelovanje na zimskim olimpijskim igrama te drugim višesportskim priredbama pod pokroviteljstvom MOO-a", " za sve sportove koji su uključeni u program zimskih olimpijskih igara, kao i drugim pitanjima aktivnosti tih nacionalnih sportskih saveza vezanih uz program javnih potreba u sportu na državnoj razini, a naročito:\n\n- -razmatra prijedlog kriterija za nastup na zimskim olimpijskim igrama i zimskim olimpijskim igrama mladih za sve sportove\n- razmatra prijedlog liste sudionika zimskih olimpijskih igara i zimskih olimpijskih igara mladih\n- -razmatra p", "rijedlog programa priprema za zimske olimpijske igre i zimske olimpijske igre mladih\n- -razmatra prijedlog liste potencijalnih i evidentnih kandidata za sudjelovanje na zimskim olimpijskim igrama i zimskim olimpijskim igrama mladih\n- sudjeluje u pripremi kriterija za izradu dijela programa javnih potreba sportu na državnoj razini u nadležnosti HOO-a\n- razmatra prijedlog financijskog plana HOO-a, u dijelu koji se odnosi na programe utvrdene ovim č", "lankom Satuta\n- razmatra prijedlog kriterija za kategorizaciju sportaša\n- razmatra prijedlog načela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj za nacionalne sportske saveze članove HOO-a.\n\n## Clanak 48.\n\nOdbor neolimpijskih sportova bavi se pitanjima aktivnosti nacionalnih sportskih saveza sportova koji nisu uključeni u program igara olimpijade, niti zimskih olimpijskih igara, a naročito:\n\n- sudjeluje u pripremi krite", "rija za izradu dijela programa javnih potreba u sportu državne razine u nadležnosti HOO-a\n- razmatra prijedlog financijskog plana HOO-a u dijelu koji se odnosi na programe utvrdene ovim člankom Satuta\n- razmatra prijedlog kriterija za kategorizaciju sportaša\n- razmatra prijedlog načela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj za nacionalne sportske saveze članove HOO-a.\n\n## Članak 49.\n\nOdbor lokalnih sportskih zajed", "nica bavi se pitanjima sporta na razini županija, gradova i općina, a naročito:\n\n- -razmatra pitanja organizacije i djelovanja sporta na lokalnoj razini\n- -potiče medusobnu suradnju izmedu lokalnih sportskih zajednica\n- -razmatra prijedlog financijskog plana HOO-a y dijelu koji se odnosi na programe poticanja razvoja sporta\n- potiče suradnju lokalnih sportskih zajednica i tijela lokalne i područne (regionalne) samouprave\n- predlaže Skupštini krit", "erije za lokalne sportske zajednice na razini gradova u odnosu na članstvo u Odboru lokalnih sportskih zajednica.\n\n## Članak 50.\n\n- (1) Stalna radna tijela Skupštine mogu pravovaljano odlučivati ako je prisutna natpolovična većina svih članova.\n- (2) Sve odluke stalna radna tijela donose većinom glasova prisutnih članova.\n- (3) U radu stalnih radnih tijela Skupštine obavezno sudjeluju predstavnici Stručne službe HOO-a.\n\n## članak 51.\n\nMandat stal", "nih radnih tijela Skupštine traje paralelno s mandatom Skupštine.\n\n## 2. Predsjednik\n\n## Članak 52.\n\n(1) Predsjednik obavlja sljedeće zadace i poslove:\n\n- predstavlja i zastupa HOO u zemlji i inozemstvu\n- saziva i predsjedava sjednicama Skupstine i Vijeca\n- poduzima i potiče aktivnosti za promicanje olimpizma i primjenu Olimpijske povelje i ovog Statuta\n- potiče aktivnosti na razvoju i unapredenju funkcioniranja djelatnosti hrvatskog sporta\n- pot", "pisuje protokole, konvencije i deklaracije medunarodnih sportskih i nevladinih asocijacija i institucija od interesa za hrvatski sport\n- potpisuje opće akte HOO-a koje donosi Skupština i Vijeće\n- potpisuje verificirane zapisnike održanih sjednica Skupštine i Vijeća kojima predsjeda\n- predlaže Skupštini kandidate za dopredsjednike i članove Vijeća i predlaže Vijeću kandidate za glavnog tajnika\n- -pokreće rješavanje pitanja razrješenja članova Vije", "ća te dopredsjednika\n- voditelj je delegacije HOO-a na olimpijskim, europskim i mediteranskim igrama i drugim višesportskim priredbama kojima je nazočan\n- izvršava i druge aktivnosti i obveze sukladno odlukama i zaključcima Skupštine i Vijeća, odredbama Olimpijske povelje i drugih medunarodnih propisa u sportu, općim aktima HOO-a i ovim Statutom.\n- (2) Za svoj rad predsjednik je odgovoran Skupštini.\n- (3) U slučaju odsutnosti ili spriječenosti pr", "edsjednika, zamjenjuje ga jedan od dopredsjednika kojeg ovlasti predsjednik, odnosno kojeg odredi Vijeće u slučaju nemogućnosti da predsjednik o tome odluči.\n\n## članak 53.\n\nZa predsjednika može biti izabrana osoba koja udovoljava sljedećim uvjetima i kriterijima:\n\n- -da je državljanin Republike Hrvatske\n- -da je ugledan sportski djelatnik\n\n- da vlada jednim od službenih jezika MOO-a, engleskim ili francuskim\n- da se nije ogriješio o etičke norme", " i moralna načela olimpizma\n- da prihvaća ovaj Statut i Olimpijsku povelju\n- da nema zapreke iz članka 114. odnosno 111. stavci 1. i 2. Zakona o sportu i članka 19. stavci 2. i 3. Zakona o udrugama\n- da je član Skupštine.\n- (1) Predsjednika bira Skupština na način i po postupku utvrdenom posebnom odlukom Skupštine o provodenju izbora.\n\n## Članak 54.\n\n- (2) Mandat predsjednika traje četiri godine i ista osoba može biti ponovno izabrana za novo man", "datno razdoblje.\n- (3) Kandidate za predsjednika mogu istaći nacionalni sportski savezi, punopravni članovi HOO-a učlanjeni u matične medunarodne federacije olimpijskih sportova izmedu svih članova Skupštine s pravom glasa.\n- (4) Za isticanje kandidata za predsjednika potrebno je najmanje 10 potpisa punopravnih članova HOO-a o podržavanju njegove kandidature.\n- (5) Odluku o pokretanju postupka isticanja kandidata za predsjednika donosi Vijeće, ko", "d redovnog izbora, zajedno s odlukom o sazivanju izborne sjednice Skupštine najmanje 60 dana prije termina održavanja sjednice, o čemu u dalinjem roku od osam dana obavještava pisanim putem članove HOO-a.\n\n## Pocasni predsjednik\n\nSkupština može, na prijedlog Vijeća izabrati za počasnog predsjednika Hrvatskog olimpijskog odbora, osobu koja je kao predsjednik Hrvatskog olimpijskog odbora svojim izuzetnim radom doprinijela ugledu i razvoju Hrvatskog", " olimpijskog odbora i olimpijskog pokreta u Hrvatskoj i svijetu.\n\n## 3. Vijeće\n\n- (1) Vijeće je izvršno tijelo HOO-a koje obavlja sljedeće zadaće i poslove:\n\n## članak 55.\n\n## Članak 56.\n\n- predlaže Statut i opće akte HOO-a te njihove izmjene i dopune\n\n- utvrduje akt kojim HOO sudjeluje u predlaganju i provodenju nacionalne strategije razvoja sporta i nacionalnog plana razvoja sporta, te utvrduje elemente za sudjelovanje u predlaganju i ostvariva", "nju mjera za unapredenje razvoja sporta\n- imenuje glavnog tajnika na temelju provedenog natječaja i razrješava ga\n- imenuje osobe s posebnim ovlastima u stručnim službama na prijedlog glavnog tajnika\n- predlaže učlanjenje u medunarodne sportske i nedržavne asocijacije od interesa za HOO\n- inicira uspostavljanje i održavanje odnosa s drugim nacionalnim olimpijskim odborima\n- predlaže isticanje kandidature za organizaciju olimpijskih igara i drugih", " višesportskih natjecanja o kojima odlučuje Skupština\n- predlaže godišnje i višegodišnje programe javnih potreba sporta državne razine u nadležnosti HOO-a, godišnji financijski plan HOO-a, odnosno program javnih potreba sporta državne razine u nadležnosti HOO-a i financijski plan HOO-a za slijedeću godinu, a iznimno u slučaju potrebe privremeni financijski plan HOO-a, te utvrduje prijedlog izvješća o izvršenju programa i financijskog izvještaja z", "a prethodnu godinu\n- odobrava pokroviteljstvo HOO-a pod utvrdenim uvjetima\n- predlaže učlanjenje novih članova u HOO-a i utvrduje pravila postupka za prijem novih članova\n- daje preporuke nacionalnim sportskim savezima za učlanjenje u medunarodne federacije\n- -predlaže počasne članove HOO-a\n- ističe kandidate za članstvo u tijelima MOO-a i drugim asocijacijama čiji je HOO član\n- -imenuje i opoziva predstavnike HOO-a u drugim organizacijama, insti", "tucijama i tijelima\n- utvrduje prijedlog projekta priprema i sudjelovanja hrvatskih sportaša na igrama olimpijade i zimskim olimpijskim igrama, a u slučaju žurne potrebe ovlašteno je utvrditi izmjene i dopune projekta, uključujući i izmjene i dopune Kriterija za razvrstavanje sportaša u kategorije olimpijskih kandidata, koje se na prvoj slijedećoj sjednici Skupštine podnose na verifikaciju, te donosi projekt priprema i sudjelovanja hrvatskih spor", "taša na europskim i mediteranskim igrama, te drugim višesportskim natjecanjima\n- utvrduje sudionike olimpijskih igara, olimpijskih igara mladih, europskih i mediteranskih igara te drugih višesportskih natjecanja u nadležnosti HOO-a\n- imenuje predsjednike i članove stalnih i povremenih radnih tijela Vijeća, te članove uredništva publikacija HOO-a i web redakcije HOO-a\n\n- odreduje predstavnike HOO-a za sudjelovanje na inozemnim ili tuzemnim skupovi", "ma\n- odlučuje o načinu stjecanja i korištenja sredstava u okviru usvojenog programa i financijskog plana HOO-a\n- -razmatra izvješća revizija\n- utvrduje prijedlog odluke o promjeni ciljeva i djelatnosti, prestanku rada i raspodjeli imovine HOO-a\n- upravlja i raspolaže osnovnim sredstvima u vlasništvu HOO-a\n- izriče mjere i sankcije u skladu s člankom 24. i 25. ovog Statuta\n- imenuje članove žirija za dodjelu \"Nagrade HOO-a Matija Ljubek\" i Nagrade", " „Dražen Petrović\" te raspisuje natječaj, odnosno objavu za dodjelu tih nagrada\n- utvrduje nomenklaturu sportova u Republici Hrvatskoj, s podjelom na ekipne i pojedinačne sportove\n- utvrduje način provodenja postupka kategorizacije sportova u HOO-u za sportove koji su razvrstani u Nomenklaturi sportova i donosi odluku o rangiranju sportova i razvrstavanju u kategorije u nadležnosti HOO-a\n- utvrduje način i postupak za provedbu nadzora nad stručni", "m radom nacionalnih sportskih saveza\n- utvrduje kriterije i način provedbe kontrole učinka svih programa koje realizira HOO, a posebno razvojnih programa za sportaše i programe za trenere koji se financiraju kroz program javnih potreba u sportu državne razine\n- utvrduje kriterije, način i postupak provedbe stručnog nadzora nad radom trenera koji su financiranji kroz program javnih potreba u sportu državne rizine\n- utvrdivanje prethodnog mišljenja", " o postojanju interesa za prijam u hrvatsko državljanstvo fizičke osobe u sustavu sporta koja je strani državljanin, na traženje tijela državne uprave nadležnog za sport\n- odlučuje o poslovodnom ustrojstvu stručnih službi HOO-a, te donosi opée akte o njihovom radu\n- donosi opée akte koji reguliraju pitanja iz nadležnosti Vijeća HOO-a, te razmatra i odlučuje o pitanjima iz područja djelovanja HOO-a, a koja nisu u nadležnosti Skupštine ili kojeg dr", "ugog tijela HOO-a u skladu s odredbama ovog Statuta\n- donosi poslovnik o svom radu\n\n- obavlja i druge zadaće i poslove koje mu povjeri Skupština, odnosno koje su mu stavljene u nadležnost ovim Statutom ili drugim aktom HOO-a\n\n(2) Vijeće za svoj rad odgovara Skupštini.\n\n(1) Vijeće čini 23 člana, medu kojima su po funkciji:\n\n- predsjednik\n- četiri dopredsjednika\n- -član MOO-a u Hrvatskoj\n- predstavnik Komisije sportaša.\n\n(2) Četiri dopredsjednika i", " ostale članove Vijeća, na prijedlog predsjednika bira Skupština, iz sastava Skupštine, pri čemu se u predlaganju i biranju dopredsjednika i članova Vijeća treba voditi računa o odgovarajućoj zastupljenosti predstavnika Članova HOO-a s pravom glasa u Skupštini HOO-a (olimpijski sportovi, neolimpijski sportovi, sportske zajednice), uključujući primjenu pravila 28. točka 3. (1.2) Olimpijske povelje prema kojoj predstavnici nacionalnih sportskih sav", "eza učlanjenih u medunarodne federacije olimpijskih sportova imaju vecinu u Vijeću HOO-a.\n\n(3) Ukoliko nema člana MOO-a u Hrvatskoj kao člana Vijeća HOO-a po funkciji, Skupština bira člana Vijeća na to mjesto uvažavajući odredbu stvaka 1. ovog članka.\n\n## Članak 58.\n\nZa člana Vijeća može biti izabrana samo osoba koja udovoljava kriterijima i uvjetima iz članka 30. stavka 1. ovog Statuta.\n\n## Članak 59.\n\nSlijedom odredaba Olimpijske povelje:\n\n- ve", "ćinu od ukupnog broja članova Vijeća čine članovi iz reda nacionalnih sportskih saveza učlanjenih u medunarodne federacije olimpijskih sportova te\n- u Vijeću treba biti najmanje 40% žena od ukupnog boja članova Vijeća.\n\n## članak 60.\n\n(1) Mandat Vijeća traje paralelno mandatu Skupštine četiri godine i ista osoba može biti ponovno izabrana za novo mandatno razdoblje.\n\n(2) Za slučaj razrješenja člana Vijeća primjenjuju se odredbe članaka 34. i 35. ", "ovog Statuta.\n\n## Članak 57.\n\n- (3) Mandat članu Vijeća prestaje i u slučaju kad je osobi koja je član Vijeća prestao mandat Člana Skupštine.\n- (4) Mandat članovima Vijeća prestaje i u slučaju da predsjednik HOO-a podnese ostavku ili bude razriješen s te funkcije.\n- (1) Vijeće djeluje na sjednicama.\n\n## Članak 61.\n\n- (2) Za donošenje pravovaljanih odluka potrebna je nazočnost većine od ukupnog broja članova Vijeća.\n- (3) Vijeće donosi odluke veći", "nom glasova nazočnih članova, javnim glasovanjem.\n- (4) Iznimno, od odredbe stavka 3. ovog članka dvotrećinskom većinom glasova članova Vijeća donose se odluke o suspenziji člana Skupštine kao i o Poslovniku o radu Vijeća.\n- (5) U slučaju jednakog broja glasova za i protiv, odlučuje glas predsjedavajućeg.\n\n## Clanak 62.\n\n- (1) Sjednicama Vijeća predsjedava predsjednik, a u slučaju njegove odsutnosti ili spriječenosti jedan od dopredsjednika kojeg", " on ovlasti.\n- (2) Poslovnikom o radu Vijeća podrobnije se odreduju pitanja u vezi s održavanjem sjednica.\n\n## Članak 63.\n\n- (1) Sjednice Vijeća saziva predsjednik prema potrebi, a najmanje šest puta godišnje.\n- (2) Predsjednik je obvezan sazvati sjednicu Vijeća i na obrazloženi pisani zahtjev najmanje jedne trećine članova Vijeća.\n- (3) Sjednice Vijeća mogu biti radne ili svečane.\n- (4) Sjednice Vijeća mogu biti otvorene ili zatvorene za javnost", ", zavisno o sadržaju i značenju predmeta koji su na raspravi, o čemu odlučuje Vijeće.\n\n## članak 64.\n\n- (1) Za izvršavanje odredenih zadaća, Vijeće svojom odlukom osniva stalna i povremena radna tijela, odnosno povjerenstva.\n- (2) Stalna radna tijela Vijeća su:\n- Zdravstvena komisija\n4. Komisija za ravnopravnost spolova u sportu\n\n- Komisija za sportsko graditeljstvo i okolis\n- Komisija za medunarodne odnose\n- Komisija za razvoj sporta\n- -Komisija", " za digitalizaciju i digitalne medije\n- Komisija za marketing\n- Komisija za informiranje i izdavaštvo\n- Komisija za dual karijeru u sportu\n\n(3) Povremena radna tijela ili povjerenstva osnivaju se za izvršenje odredenih zadaća.\n\n## Članak 65.\n\n(1) Odlukom o osnivanju radnih tijela Vijeće odreduje njihov sastav, djelokrug i ovlasti.\n\n(2) Na radna tijela Vijeća ne može se prenijeti odlučivanje u pitanjima koja su ovim Statutom stavljena u nadležnost", " Vijeća.\n\n(3) Vijeće imenuje predsjednike radnih tijela i na njihov prijedlog imenuje članove.\n\n(4) Vijeće verificira programe rada, usvaja prijedloge i izvješća radnih tijela.\n\n(5) Vijeće postavlja tajnike radnih tijela, u pravilu iz sastava stručnih službi HOO-a, na prijedlog glavnog tajnika.\n\n## Članak 66.\n\nČlanovi Vijeća izvršavaju zadaće koje im naloži Skupština, Vijeće ili predsjednik.\n\n## članak 67.\n\nObveza je članova Vijeća u svakoj prigo", "di zastupati i štititi interese HOO-a, cjelokupnog hrvatskog sporta i olimpijskog pokreta.\n\n## 4. Nadzorni odbor\n\nNadzorni odbor Hrvatskog olimpijskog odbora (dalje u tekstu: Nadzorni odbor) tijelo je HOO-a sa zadacom:\n\n- nadzora nad djelatnošću HOO-a\n- -provjere zakonitosti u radu i materijalno-financijskom poslovanju u НОО-u\n\n## Članak 68.\n\n- -nadzora izvršavanja odluka i zaključaka Skupštine i Vijeća\n- razmatranje revizorskog izvješća vanjskog", " revizora i usvajanje revizorskog izvješća unutarnjeg revizora\n- -kontrola provedbe naloga revizija i davanje uputa i zadaća unutarnjoj reviziji\n- -provjere pridržavanja utvrdenih normi i akata HOO-a i poštivanja ovog Statuta.\n\n## Članak 69.\n\n- (1) Članove Nadzornog odbora bira Skupština tajnim glasovanjem na nacin i po postupku utvrdenom posebnom odlukom Skupštine o provodenju izbora и НОО-u.\n- (2) Za izbor članova Nadzornog odbora mogu biti pre", "dloženi samo kandidati punopravnih članova HOO-a koji nisu članovi Skupštine i drugih tijela HOO-a, kao i osobe koje nisu zaposlene ili angažirane po ugovoru o djelu ili drugom odgovarajućem ugovoru, u HOO-u, odnosno u članovima HOO-a, na teret sredstava proračuna HOO-a.\n- (1) Nadzorni odbor broji pet članova.\n\n## članak 70.\n\n- (2) Članovi Nadzornog odbora na prvoj konstituirajućoj sjednici biraju svog predsjednika.\n- (3) Mandat Nadzornog odbora ", "traje četiri godine i ista osoba može biti ponovno birana u novom mandatnom razdoblju.\n- (4) Nadzorni odbor radi na sjednicama, koje saziva predsjednik Nadzornog odbora slanjem pisanog poziva i materijala za točke dnevnog reda, najmanje pet dana prije dana održavanja sjednice Nadzornog odbora.\n- (5) Za pravovaljano donošenje odluka potrebno je da na sjednici Nadzornog odbora bude nazočno više od polovice članova Nadzornog odbora. Odluke se donose", " većinom glasova nazočnih članova Nadzornog odbora. U slučaju jednakog broja glasova „za\" ili „protiv\" odlučuje glas predsjednika odnosno člana koji rukovodi radom Nadzornog odbora.\n\n## Članak 71.\n\nNadzorni odbor svoje zadaće iz članka 68. ovog Statuta obavlja nad djelatnošću:\n\n- -HOO-a i njegovih tijela\n- članova HOO-a u dijelu koji je u nadležnosti HOO-a, odnosno kod pravnih i fizičkih osoba kojima je HOO namjenski doznačio sredstva, u dijelu t", "ih doznačenih sredstava.\n\n## Članak 72.\n\nRadi izvorne informiranosti i uspješnog djelovanja:\n\n- -predsjedniku Nadzornog odbora dostavlja se poziv s materijalima za sjednice Vijeća\n- predsjednika i članove Nadzornog odbora poziva se na sjednice Skupštine\n- predsjednik i članovi Nadzornog odbora dobivaju zapisnike sjednica Vijeća i Skupštine.\n\n## Članak 73.\n\n- (1) Način rada Nadzornog odbora propisuje se poslovnikom o radu koji donosi Nadzorni odbo", "r.\n- (2) Stručne, administrativne i tehničke poslove za Nadzorni odbor obavljaju stručne službe HOO-a.\n- (3) Stručna služba HOO-a, kao i predsjednik i glavni tajnik dužni su dostaviti na uvid sve tražene dokumente potrebne za rad Nadzornog odbora.\n\n## 5. Etički odbor\n\n## Članak 74.\n\n- (1) HOO osniva Etički odbor kao nezavisno tijelo HOO-a osnovano radi razvijanja i modernizacije osnova etičkih pravila u sportu, temeljenih na vrijednostima i princ", "ipima zajamčenim Olimpijskom poveljom i ovim Statutom, te skrbi o pridržavanju i poštivanju načela i pravila Olimpijske povelje, Statuta HOO-a i drugih općih akata od strane članova Skupštine HOO-a, drugih tijela u njihovom radu kao i ostalih sudionika u sportu.\n- (2) Etički odbor ima pet članova, a imenuje ih Skupština na prijedlog članova HOO-a i/ili članova Skupštine.\n- (3) Članovi Etičkog odbora ne mogu biti osobe koje su članovi Skupštine HO", "O-a ili bilo kojeg drugog upravljačkog tijela HOO-a, kao ni osobe koje imaju zapreke utvrdene člankom 111. stavci 1. i 2. Zakona o sportu.\n- (4) Mandat Etičkog odbora traje četiri godine, a iste osobe mogu biti ponovno imenovane za člana Etičkog odbora.\n- (5) Etički odbor sudi u vijeću. Predsjednik Etičkog odbora saziva sjednice vijeća, a odluke se donose većinom glasova svih članova vijeća Etičkog odbora.\n- (6) Posebnim aktom Skupštne uređuju se", " pitanja ustrojstva, djelokruga i načina rada Etičkog odbora.\n\n## 6. Komisija sportaša HOO-a\n\n## članak 75.\n\nKomisija sportaša HOO-a (dalje u tekstu: Komisija sportaša) je stalno tijelo HOO-a, koje se osniva sukladno odredbama Olimpijske povelie i Smjernica MOO-a za osnivanje komisija sportaša nacionalnih olimpijskih odbora, čija misija je predstavljanje mišljenja sportaša i njihovo\n\naktivno sudjelovanje u tijelima HOO-a, koje treba osigurati da ", "se pri donošenju odluka HOO-a uzmu u obzir mišljenja i stavovi sportaša.\n\n## Djelovanje Komisije sportaša obuhvaća:\n\n## Clanak 76.\n\n- razmatranje pitanja koja se odnose na sportaše i davanje prijedloga i mišljenja tijelima HOO-a\n- zastupanje prava i interesa sportaša i davanje preporuka\n- poduzimanje aktivnosti za obrazovanje sportaša i rješavanje drugih pitanja značajnih za sportaše\n- -održavanje kontakata s Komisijom MOO-a i EOO-a za sportaše t", "e Hrvatski klubom olimpijaca\n- promovira i potiče aktivnosti za primjenu i poštovanje Etičkog kodeksa MOO-a\n- suradnju sa sportskim komisijama nacionalnih sportskih saveza i Hrvatskim klubom olimpijaca\n- -biranje predsjednika Komisije sportaša, tri predstavnika u Skupštinu HOO-a i medu njima jednog člana Vijeća HOO-a\n- sudjelovanje u predlaganju sportaša-kandidata Republike Hrvatske za sportske komisije MOO-a i EOO-a, sukladno kriterijima koje ut", "vrduje MOO i EOO\n- djelovanje na razvijanju prijateljstva, medusobnog razumijevanja i ravnopravnosti te izgradnji fair play odnosa u sportu i životu.\n- -suradnju u aktivnostima za primjenu i poštovanje pravila Olimpijske povelje MOO-a, koja se odnose na sportaše, borbu protiv svakog oblika diskriminacije i nasilja u sportu, kao i protiv uporabe supstanci i te postupaka koje zabranjuje MOO ili međunarodni savezi\n\n## Clanak 77.\n\n- (1) Članove Komis", "ije sportaša biraju sportaši izmedu predloženih kandidata koje su predložile sportske komisije nacionalnih sportskih saveza olimpijskih i neolimpijskih sportova punopravnih članova HOO-a.\n- (2) Jedan nacionalni sportski savez, odnosno jedan sport može imati u Komisiji sportaša samo jednog člana.\n- (3) U Komisiji sportaša trebaju biti zastupljena ravnopravno oba spola, koliko god je to moguće.\n- (4) Komisija sportaša je sastavljena od:\n- šest član", "ova - predstavnika ljetnih olimpijskih sportova, među kojima su tri sportašice i tri sportaša\n- dva člana - predstavnika zimskih olimpijskih sportova, medu kojima je jedna sportašica i jedan sportaš\n- dva člana - predstavnika neolimpijskih sportova, među kojima je jedna sportašica i jedan sportaš\n- (5) Članovi Komisije sportaša po svojoj funkciji su:\n- član Komisije MOO-a za sportaše\n- član Komisije EOO-a za sportaše.\n\n- (6) Za člana Komisije spo", "rtaša može biti birana osoba koja ispunjava slijedeće uvjete:\n2. -da je državljanin Republike Hrvatske\n3. da u vrijeme izbora ima navršenih 18 godina Života\n4. da nije kažnjavana zbog dopinških prekršaja\n5. da nema prepreke iz članka 111. stavci 1. 1 2. Zakona o sportu\n6. da se osoba ukoliko je kandidat olimpijskih sportova, u vrijeme isticanja kandidature za izbor člana Komisije sportaša aktivno natječe u reprezentativnoj vrsti nacionalnog sport", "skog saveza punopravnog člana HOO-a, u sportu na programu igara olimpijade odnosno zimskih olimpijskih igara, te da je nastupila na igrama olimpijade odnosno zimskim olimpijskim igrama koje prethode izboru za člana Komisije sportaša ili na igrama olimpijade odnosno zimskim olimpijskim igrama četiri godine prije provedbe izbora\n7. da se osoba ukoliko je kandidat neolimpijskih sportova, u vrijeme isticanja kandidature za izbor člana Komisije sporta", "ša aktivno natječe u reprezentativnoj vrsti nacionalnog sportskog saveza neolimpijskog sporta čiji nacionalni sportski savez je punopravni Član HOO-a, te da je u razdoblju od prethodne četiri godine prije provedbe izbora, nastupila kao natjecatelj na služenom prvenstvu svijeta organiziranom pod ingerencijom pripadajuće medunarodne sportske federacije.\n\n## Članak 78.\n\n- (1) Članovi Komisije sportaša biraju se na razdoblje od četiri godine i mogu b", "iti još jednom birani.\n- (2) Članovi Komisije sportaša HOO-a medu sobom biraju predsjednika Komisije sportaša svake četiri godine, odnosno kada predsjedniku istekne mandat ili kada mu iz drugih razloga prestane mandat u Komisiji.\n- (3) Mandat članova Komisije sportaša po funkciji traje dok traje njihov status člana Komisije MOO-a i/ili EOO-a za sportaše.\n- (4) Izbori za članove Komisije sportaša održavaju se glasovanjem sportaša za vrijeme igara ", "olimpijade, odnosno zimskih olimpijskih igara. Izbori članova Komisije sportaša neolimpijskih sportova organizira se na dan osnivanja HOO-a, 10. rujna svake četiri godine, odnosno drugog odgovarajućeg termina ako izbore nije moguće provesti tog dana iz opravdanih razloga, organiziranjem posebnog glasovanja za izbor sportaša i sportašice-predstavnika neolimpijskih sportova. Glasovanje se organizira na odvojenim listama za sportaše igara olimpijade", ", zimskih olimpijskih igara i sportaše neolimpijskih sportova. Kandidate na liste za glasovenje predlažu komisije sportaša nacionalnih sportskih saveza, u kojima su te komisije osnovane.\n- (5) Vijeće HOO-a ima pravo, na prijedlog predsjednika HOO-a predložiti do najviše dva kandidata na listu sportaša o kojima se glasuje za izbor članova Komisije sportaša, koji se ističu ukoliko je odredeni sport propustio kandidirati sportaša koji ispunjava uvje", "te za uvrštenje na listu kandidata, a njegove sposobnosti i rezultati, kao i rezultati pripadajućeg sporta opravdavaju takvu kandidaturu, pri čemu kandidat mora ispunjavati sve uvjete za uvrštenje na listu kandidata utvrdene pravilnikom o radu Komsije sportaša.\n- (6) Komisija sportaša djeluje na sjednicama Komisije. Sjednice Komisije sportaša organiziraju se Komisije se usvajaju vecinom glasova nazočnih članova.\n- (7) Odredbe koje utvrduju izbore", " kao i djelovanje Komisije sportaša utvrduju se posebnim pravilnikom o radu Komisije sportaša koji donosi Skupština HOO-a.\n\nČlanak 79. brisan\n\nČlanak 80. brisan\n\nČlanak 81. brisan\n\nČlanak 82. brisan\n\n## Komisija za rješavanje disciplinskih pitanja i prijepora izmedu HOO-a i članica\n\n## Članak 83.\n\n- (1) Komisija za rješavanje disciplinskih pitanja i prijepora izmedu HOO-a i članica je nezavisno tijelo HOO-a koje rjesava sporove koji se mogu pojav", "iti izmedu HOO-a i njegovih članova vezano uz nadležnosti HOO-a te skrbi o pridržavanju i poštivanju načela i pravila Olimpijske povelje, Statuta HOO-a i drugih općih akata, sukladno članku 25. ovog Statuta, od strane:\n- članova HOO-a\n- clanova tijela HOO-a\n- članova radnih tijela HOO-a\n- sportaša i trenera korisnika programa HOO-a i\n- drugih korisnika prava (s osnove radno-pravnog statusa u članovima HOO-a, sudjelovanja u financiranju sredstvima", " HOO-a i slično).\n- (2) Komisiju za rješavanje disciplinskih pitanja i prijepora izmedu HOO-a i članica čini deset članova, od toga pet članova prvostupanjskog tijela i pet članova drugostupanjskog tijela, koje imenuje na vrijeme od četiri godine Skupština HOO-a, na prijedlog Vijeća HOO-a iz redova istaknutih pravnika poznavatelja sporta i sportskog sustava. Svako vijeće radi u sastavu od po tri člana (predsjednik i dva člana).\n- (3) Komisija za ", "rješavanje disciplinskih pitanja i prijepora izmedu HOO-a i članica sudi u vijeću, sukladno odredbi prethodnog stavka, a sjednice svakog vijeća saziva predsjednik pripadajućeg vijeća. Odluke se donose većinom glasova svih članova pripadajućeg vijeća.\n- (4) Posebnim aktom Skupštne ureduju se pitanja ustrojstva, djelokruga i načina rada Komisije za rješavanje disciplinskih pitanja i prijepora izmedu HOO-a i članica.\n\n- (5) Žalba na spor do kojeg do", "de prigodom ili u svezi s olimpijskim igrama isključivo se podnosi Sportskom arbitražnom sudu u Lausanni sukladno Kodeksu sportske arbitraže. Rok za podnošenje žalbe je dvadeset jedan (21) dan nakon primitka odluke koja se odnosi na žalbu.\n\n## Nezavisno tijelo za antidoping žalbeno vijeće za antidoping\n\n## Članak 83.A.\n\nZalbeno vijeće za antidoping samostalno je te operativno i institucionalno nezavisno tijelo koje djeluje pri Hrvatskom olimpijsk", "om odboru nadležno za postupanje i odlučivanje O žalbama u odnosu na sporove i pitanja koja proizlaze iz ili su u vezi s hrvatskim nacionalnim pravilima za antidoping i pripadajućim propisima. Postupak pred Žalbenim Vijećem za antidoping ureduje se\n\n## VI. GLAVNI TAJNIK\n\n## članak 84.\n\nGlavni tajnik obavlja dužnost profesionalno, a imenuje ga na temelju javnog natječaja Vijeće HOO-a.\n\n- (1) Glavni tajnik imenuje se na odredeno vrijeme, u pravilu ", "na četiri godine, a ista osoba može biti ponovno imenovana za glavnog tajnika.\n\n## Članak 85.\n\n- (2) HOO i glavni tajnik zaključuju ugovor o radu na odredeno vrijeme, kojim odreduju medusobna prava obveze i odgovornosti.\n- (3) Glavni tajnik ostvaruje prava iz radnog odnosa u Stručnoj službi HOO-a.\n\n## Članak 86.\n\nZa glavnog tajnika može biti imenovana osoba koja ispunjava sljedeće uvjete i kriterije:\n\n- da je državljanin Republike Hrvatske\n- da p", "osjeduje visoku stručnu spremu\n- da ima najmanje pet godina radnog iskustva na rukovodećim poslovima\n- da vlada jednim od službenih jezika MOO-a, engleskim ili francuskim\n- da se nije ogriješio o etičke norme i moralna načela sporta i olimpizma\n- da nema zapreke iz članka 114. odnosno 111. stavci 1. i 2. Zakona o sportu i članka 19. stavci 2. i 3. Zakona o udrugama\n\n- prednost pri izboru ima osoba koja poznaje sustav i djelovanje sporta, koja je ", "ugledni sportski djelatnik i koja ima iskustva na rukovodećim poslovima u sportu.\n\n## Članak 87.\n\nGlavni tajnik, provodi i osigurava provodenje općih akata i programa HOO-a, te odluka i zaključaka Skupštine, Vijeća i predsjednika HOO-a, te osobito obavlja slijedeće poslove i zadaće:\n\n- zastupa HOO u zemlji i inozemstvu, a u pojednim situacijama, a po ovlasti Vijeća ili predsjednika, i predstavlja HOO\n- sklapa ugovore i poduzima pravne radnje u im", "e i za račun HOO-a\n- odgovoran je za zakonitost rada HOO-a\n- organizira i koordinira pripremu materijala za sjednice Skupštine i Viieća\n- odgovoran je za podnošenje prijedloga godišnjeg programskog i financijskog izviješća Skupštini HOO-a,\n- obvezan je tijekom poslovne godine provesti samoprocjenu učinkovitosti i djelotvornosti funkcioniranja sustava financijskog upravljanja i kontrola HOO-a\n- odgovoran je za pravodobnu provedbu zaključaka i odlu", "ka Skupštine i Vijeća, obavještava nositelje zadaća o odlukama i zaključcima, te obavještava Vijeće i Skupštinu o izvršenju odluka i zaključaka\n- odgovoran je za podnošenje dokumenata nadležnim tijelima sukladno propisima, te za dostavljanje zapisnika s redovne sjednice Skupštine Saveza nadležnom uredu\n- koordinira radom radnih tijela Vijeća i skrbi o provodenju njihovih zaključaka\n- sudjeluje u radu Vijeća bez prava glasa\n- poduzima aktivnosti z", "a izvršavanje zadaća i obveza članova HOO-a\n- organizira i koordinira suradnju s MOO-om, njegovim tijelima i ostalim asocijacijama Čiji je HOO član\n- organizira i koordinira suradnju s drugim nacionalnim olimpijskim odborima\n- predlaže rješenja za unapredenja djelatnosti i poslovanja HOO-a\n- predlaže Vijeću opći akt o ustrojstvu i radu Stručne službe HOO-a kao i imenovanje rukovoditelja Stručnih službi HOO-a\n\n- provodi aktivnosti za javnost rada ", "HOO-a\n- član je vodstva delegacije HOO-a na olimpijskim igrama, europskim i mediteranskim igrama i drugim višesportskim priredbama\n- obavlja i druge poslove iz svog djelokruga i po odlukama Skupštine, predsjednika i Vijeća.\n\n## članak 88.\n\n- (1) O svim ugovorima i isplatama u vrijednostima većim od 6.636 EUR-a kao i o svim isplatama izvršenim mimo usvojenog proračuna, glavni tajnik dužan je izvijestiti Vijeće na prvoj slijedećoj sjednici.\n- (2) Z", "a svoj rad i poslovanje glavni tajnik je odgovoran Vijeću i predsjedniku.\n\n## VII. STRUČNA SLUŽBA\n\n- (1) 2a bavianie poslova HOO-a osniva se Strucna lizba.\n- (2) Stručna služba HOO-a obavlja stručne, administrativne i tehničke poslove, zadaće iz područja sporta i medunarodnih sportskih odnosa i aktivnosti te izvršava obveze utvrdene zakonima, propisima i odlukama HOO-a.\n\n## Članak 90.\n\nUstrojstvo i način rada Stručne službe ureduje se općim aktom", " kojeg donosi Vijeće.\n\n- 1) Struna sluba HO-a može, osim poslova a potrebe HOO-, obalati odredene stručne i ostale poslove za druge subjekte na ugovornim osnovama.\n- (2) Radom Stručne službe rukovodi glavni tajnik, koji podnosi izvješce o radu Stručne službe Vijeću HOO-a po potrebi i /ili zahtjevu Vijeća HOO-a.\n\n## VIll. HRVATSKA OLIMPIJSKA AKADEMIJA\n\n## članak 92.\n\nRadi sustavnog poticanja i promicanja olimpizma, promidžbe olimpijskih načela, fa", "ir playa i tolerancije, sudjelovanja u realizaciji programa Olimpijske solidarnosti te provedbe stručnog osposobljavanja i usavršavanja osoba koje obavljaju stručne poslove u sportu, a sukladno Olimpijskoj povelji, posebnim aktom Skupštine HOO-a osniva se Hrvatska olimpijska akademija.\n\n## IX. HRVATSKI FAIR PLAY ODBOR\n\n- (1) Hrvatski fair play odbor je nezavisno tijelo koje djeluje pri Hrvatskom olimpijskom odboru, čiji članovi su predstavnici os", "nivača HOO-a i Hrvatskog zbora sportskih novinara.\n\n## Clanak 93.\n\n- (2) Hrvatski fair play odbor promovira i razvija fair play u sportu i svakodnevnom životu, potiče afirmaciju općih etičkih vrijednosti te poduzima aktivnosti za postupanje i ponašanje svih sudionika u sportu na principima tolerancije i medusobnog poštovanja, u skladu s pravilima i načelima Olimpijske povelje, odredbama Statuta HOO-a, pravilima Medunarodnog fair play odbora i Eur", "opskog fair play pokreta.\n\n## X. ZAKLADA HRVATSKIH SPORTAŠA\n\n- (1) Zakladu hrvatskih sportaša, sa statusom samostalne pravne osobe, osnovao je HOO, u suradnji s Hrvatskim klubom olimpijaca i Sportskim novostima.\n\n## Clanak 94.\n\n- (2) Zaklada hrvatskih sportaša je osnovana i djeluje radi ostvarivanja općekorisne i dobrotvorne svrhe davanjem novčane i druge potpore sportašima, a iznimno i trenerima kao i članovima obitelji sportaša, koji su tijekom", " ili nakon svoje sportske karijere ostali bez mogućnosti da vlastitim sredstvima ostvare osnovne uvjete za egzistenciju, uvjete stanovanja, liječenja, stvaranja mogućnosti za zapošljavanje, pomoć u stvaranju uvjeta za školovanje ili osposobljavanje i sl.\n\n## XI. SREDSTVA I FINANCIRANJE\n\n- (1) Imovinu HOO-a čine novčana sredstva, nepokretne i pokretne stvari te druga imovinska prava.\n\n## Članak 95.\n\n- (2) Osnovu financiranja djelatnosti i programa", " HOO-a i članova HOO-a Čine prihodi ostvareni vlastitom djelatnošću, iz sredstava državnog proračuna i drugih izvora u skladu sa zakonom (prihod od igara na sreću itd.).\n- (3) Za izvršavanje programskih zadaća i aktivnosti članova HOO-a od zajedničkog interesa, koji su Zakonom o sportu označeni kao javne potrebe sporta državne razine i o čijem je izvršenju dužan skrbiti HOO, sredstva osigurava HOO.\n- (4) HOO se za realizaciju programa HOO-a može ", "kratkoročno zadužiti o čemu odluku donosi Vijeće HOO-a, na razdoblje od najduže 12 mjeseci u slučajevima kada se tekucim priljevima sredstava ne mogu pokriti dospjele obveze, a do visine utvrdene financijskim planom HOO-a, dok odluku o dugoroćnom zaduženju HOO-a donosi Skupština HOO-a sukladno propisima. Ugovor o kratkoročnom odnosno dugoročnom zaduženju temeljem navedenih odluka\n\nzaključuje glavni tajnik HOO-a ili druga osoba ovlaštena za zastup", "anje HOO-a, odnosno osoba koju osoba ovlaštena za zastupanje HOO-a za to ovlasti temeljem posebnog akta, a do visine utvrdene financijskim planom HOO-a.\n\n## Clanak 96.\n\nZa ostvarivanje programskih zadaća iz članka 21. stavka 1. alineje 4. ovog Statuta HOO osigurava članovima HOO-a sredstva na temelju akta o kriterijima i mjerilima programiranja i financiranja javnih potreba sporta državne razine u nadležnosti HOO-a, i to za:\n\n- -službene nastupe ", "i kvalifikacijska natjecanja, završne pripreme reprezentativnih selekcija i pojedinaca za olimpijske igre, svjetska i europska prvenstva i kupove, mediteranske igre, medunarodna natjecanja mladeži, službene medudržavne susrete, državna prvenstva te ostale sportske priredbe i manifestacije od zajedničkog ili općeg interesa\n- -zdravstvenu zaštitu, dopinšku kontrolu, dopunsku prehranu (vitaminizaciju) te osiguranje, testiranje i opremanje sportaša\n-", " permanentnu skrb o posebno talentiranim mladim sportašima i olimpijskim kandidatima, kao i o trenerima korisnicima razvojnih programa HOO-a\n- podmirivanje troškova članarina i kotizacija medunarodnim sportskim asocijacijama, sudjelovanja u radu tijela matičnih međunarodnih federacija i dijela troškova poslovanja.\n\n## Članak 97.\n\n- (1) Proračunska sredstva i ostala sredstva ostvarena u skladu sa zakonom su namjenska i mogu se samo tako koristiti.", "\n- (2) Sredstva ostvarena na olimpijskom programu i od olimpijske solidarnosti koriste se namjenski prema važećim propisima MOO-a і НОО-a.\n- (3) Sredstvima koja HOO ostvari vlastitom djelatnošću, raspolaže HOO i koristi ih za unapredenje djelatnosti HOO-a i njegovih članova, primjenom važećih akata i odluka Skupštine i Vijeća.\n- (4) Vlastita sredstva HOO-a se sukladno usvojenom financijskom planu od strane nadležnog tijela mogu dodijeliti i za dr", "uge pravne osobe koje provode programe koji su od značaja za hrvatski sport i provedbu zadaća HOO-a (pravne osobe osnovane od strane HOO-a i druge prvane osobe).\n\n## članak 98.\n\n- (1) Raspored planiranih sredstava za ostvarivanje programskih aktivnosti HOO-a vrši se godišnjim programom i financijskim planom HOO-a, na temelju akta o kriterijima i mjerilima programiranja i financiranja sporta državne razine.\n- (2) Izmjene i dopune financijskog plan", "a obvezno se provode u slučaju značajnih odstupanja nastalih prihoda i rashoda u odnosu na planirane, a posebice u slučaju nastanka novih obveza\n\nza koje sredstva nisu osigurana, odnosno smanjenja prihoda, a Vijeće HOO-a je nadležno utvrditi što se smatra značajnim odstupanjem nastalih prihoda i rashoda u odnosu na planirane, sukladno posebnom općem aktu, sukladno odredbama članka 70. stavci 9., 10. i 11. Zakona o sportu.\n\n(3) Naredbodavac za izv", "ršenje programa i financijskog plana je glavni tajnik.\n\n(4) Glavni tajnik dužan je na svakoj redovnoj sjednici Skupštine podnijeti izviješće o ostvarivanju financijskog plana.\n\n(5) Glavni tajnik takoder je dužan na svakoj sjednici izvještavati Vijeće HOO-a o financijskom poslovanju HOO-a.\n\n(6) Godišnji financijski izvještaj HOO-a, usvaja Skupština i predaje se Ministarstvu financija, odnosno drugoj instituciji koju Ministarstvo financija ovlasti ", "za zaprimanje i obradu financijskih izvještaja, a javno se objavljuje putem Registra neprofitnih organizacija i na službenoj mrežnoj stranici HOO-a.\n\n(7) Nad godišnjim financijskim izvještajem HOO-a provodi se revizija sukladno propisima, a revizorsko izvješće o obavljenoj reviziji godišnjeg financijskog izvještaja se podnosi Skupštini HOO-a.\n\n## XII. KONTROLA POSLOVANJA\n\nNad godišnjim financijskim izvješćem i poslovanjem HOO-a obavezno se provod", "i (vanjska) revizija.\n\n## članak 99.\n\n## Članak 100.\n\n(1) U Stručnoj služni osniva se i djeluje posebna služba unutarnje revizije, koja djeluje prema uputama Nadzornog odbora.\n\n(2) Unutarnja revizija HOO-a obavljat će unutarnje revizije u skladu s međunarodnim revizijskim standardima za unutarnju reviziju kao i propisima i smernicama koje ureduju unutarnju reviziju za javni sektor u Republici Hrvatskoj. Unutarnja revizija obavlja se u HOO-u, te k", "od pravnih i fizičkih osoba kojima je HOO namjenski doznačio sredstva, u dijelu tih namjenski doznačenih sredstava.\n\n## XIII. NAČIN RJEŠAVANJA SPOROVA, SUKOBA INTERESA I NESPOJIVOST ODREDENIH POSLOVA I FUNKCIJA\n\n## Clanak 101.\n\nKada postoji spor izmedu HOO-a i njegovih članova, kao i spor na nacionalnoj razini koji nastane iz ili u vezi s primjenom ovog Statuta i općih akata HOO-a, koji nije moguće riješiti sporazumno, odnosno koji nije moguće ri", "ješiti na način utvrden odredbama ovog Statuta, rješavanje spora se povjerava Komisiji za rješavanje disciplinskih pitanja i prijepora izmedu HOO-a i članica.\n\n## Članak 102.\n\nSukladno odredbama Zakona o sportu, Zakona o javnoj nabavi te drugim pripadajućim propisima, a u odnosu na nadležnosti tijela HOO-a utvrduje se zastita općeg interesa hrvatskog sporta, sportasa i HOO-a u odnosu na pojedinacne interese pojedinaca, clanova HOO-a i članova tij", "ela HOO-a, te se sukladno odredbama ovog Statuta utvrduje da su članovi tijela HOOa kao i Stručne službe HOO-a dužne i odgovorne voditi brigu o postojanju eventualnog sukoba interesa u radu tijela HOO-a ili obnašanja odredene dužnosti u HOO-u, kao i poduzeti odgovarajuće radnje i postupke za njihovo sprječavanje i otklanjenje. O postojanju sukoba interesa u HOO-u odluku donosi Vijeće HOO-a.\n\n## XIV. JAVNOST RADA\n\n- (1) Rad HOO-a je javan.\n\n## (2)", " Javnost rada ostvaruje se:\n\n- -pravodobnim dostavljanjem materijala za raspravu članovima tijela HOO-a i drugim pozvanim osobama koji se na njih mogu odnositi\n- obavještavanjem sredstava javnog informiranja o održavanju sjednica\n- obavještavanjem javnosti o radu i poslovanju HOO-a putem sredstava informiranja i na tiskovnim konferencijama\n- objavom Statuta, općih akata HOO-a te informacija na mrežnim stranicama HOO-a\n- na druge prigodne načine.\n", "- (3) Iznimno, kada to zahtijeva sadržaj dnevnog reda, sjednice Vijeća mogu biti zatvorene za javnost.\n\n## članak 104. briše se\n\n## XV. NAGRADE I PRIZNANJA\n\n## Članak 103.\n\n## Članak 105.\n\n(1) Nagrada Hrvatskog olimpijskog odbora Matija Ljubek (dalje u tekstu: Nagrada HOO-a Matija Ljubek) najviše je društveno sportsko priznanje koje se dodjeljuje svake godine, u znak priznanja i časti za osobit doprinos razvoju sporta u Republici Hrvatskoj, kao n", "agrada za zivotno djelo, najzaslužnijim pojedincima te udrugama za dugogodišnje djelovanje u sportu.\n\n(2) Poslovnikom o dodjeli Nagrade HOO-a Matija Ljubek ureduje se postupak raspisivanja natječaja za dodjelu Nagrade HOO, uvjeti i način predlaganja kandidata te rad Žirija.\n\n## Clanak 106.\n\n(1) HOO za svaku godinu proglašava najuspješnije sportaše, odnosno izabire i proglašava najuspjesnije pojedince i ekipe, žene i muškarce, a za izuzetan doprin", "os promicanju Hrvatske u svijetu pojedinca-muškarca ili ženu, ili ekipu, sportaša i sportašicu navjeća nada hrvatskog sporta, te najuspjesnijeg trenera.\n\n(2) Pravilnikom o izboru i proglašenju najuspješnijih hrvatskih sportaša i trenera ureduju se način i postupak službenog izbora i proglašenja najuspješnijih hrvatskih sportaša za postignute najveće sportske dosege i izuzetan doprinos promicanju Hrvatske u svijetu u tijeku jedne godine.\n\n## Clana", "k 107.\n\n(1) Nagrada „Dražen Petrović\" je nagrada koja se dodjeljuje najuspješnijem sportašu i sportašici, ekipi mladih dobnih kategorija, sportskom paru, štafeti ili posadi te sportašu i sportašici najvećoj nadi hrvatskog sporta, primjenom kriterija najvrednijih plasmana postignutih tijekom nekoliko prethodnih godina u sportskoj karijeri sportaša, sportašica odnosno ekipa mladih dobnih kategorija na službenim međunarodnim sportskim natjecanjima.\n", "\n(2) Pravilnikom o izboru i proglašenju najuspješnijih sportaša mladih dobnih kategorija Nagrada „Dražen Petrović\" ureduje se postupak, uvjeti i način predlaganja kandidata, te izbor i postupanje Odbora za izbor i proglašenje najuspješnijih sportaša mladih dobnih kategorija...\n\n## Clanak 108.\n\n## Članak 109.\n\nHOO može ustanoviti i druge nagrade i priznanja što se ureduje posebnim aktom koji donosi Vijeće.\n\n## XVI. PRESTANAK\n\n(1) HOO prestaje s ra", "dom kada se ispune zakonom propisane pretpostavke ili ako to odluči Skupština dvotrećinskom većinom glasova svih članova Skupštine s pravom glasa.\n\n(2) U slučaju prestanka s radom o imovini HOO-a odlučuje Skupština sukladno zakonu.\n\n(3) Ako Skupština ne donese odluku iz prethodnog stavka, u slučaju prestanka rada HOO-a, imovina HOO-a prelazi u vlasništvo sportske udruge koja će nastaviti djelatnost nacionalnog olimpijskog odbora na području Repub", "like Hrvatske.\n\n(4) Ukoliko sportska udruga iz prethodnog stavka neće postojati, imovinu HOO-a pruzet ce Republika Hrvatska. Ako je HOO primio financijska sredstva iz proračuna ili iz drugih javnih\n\nizvora, u slučaju prestanka postojanja, ostatak sredstava vratit će se u proračun iz kojeg su financijska sredstva dodijeljena.\n\n## Likvidator\n\n## Članak 110.\n\n(1) Likvidator je fizička osoba koju bira i opoziva Skupština HOO-a u skladu s odredbama ov", "og Statuta.\n\n(2) Skupština HOO-a može odlučiti da likvidator HOO-a bude i pravna osoba.\n\n(3) Osobu koja se bira za likvidatora HOO-a, predlaže predsjednik HOO-a, uvažavajući potrebnu stručnost i iskustvo te osobe, s obzirom na nadležnosti likvidatora, a koja ne smije imati zapreke iz članka 19. stavci 2. i 3. Zakona o udrugama.\n\n(4) Pokretanjem postupka likvidacije HOO-a prestaju ovlaštenja tijela i osoba ovlaštenih za zastupanje HOO-a.\n\n(5) Likv", "idator zastupa HOO u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u Registar udruga kao osoba ovlaštena za zastupanje HOO-a do okončanja postupka likvidacije i brisanja HOO-a iz Registra udruga.\n\n(6) Likvidator likvidaciju HOO-a provodi u skladu s odredbama Zakona o udrugama.\n\n## XVII. ZAVRŠNE ODREDBE\n\n(1) Promjene i dopune ovog Statuta vrše se na način i po postupku predvidenom za njihovo donošenje.\n\n## Članak 111.\n\n(2) ", "Tumačenje ovog Statuta daje Skupština.\n\n(3) Svi opći akti HOO-a i njegovih članova uskladit ce se s odredbama ovog Statuta u roku od šest mjeseci od dana stupanja Statuta na snagu.\n\n## članak 112.\n\n(1) Statut HOO-a mora se podnijeti na odobrenje MOO-u, kao i naknadne promjene ili izmjene Statuta HOO-a, po proceduri koju propisuje Olimpijska povelja.\n\n(2) Ako postoji sumnja o značenju ili tumačenju Statuta, ili ako postoji proturječnost izmedu ovo", "g Statuta i Olimpijske povelje, mjerodavan je tekst Olimpijske povelje.\n\n## Clanak 113.\n\n- (1) Statut stupa na snagu danom donošenja, a primjenjuje se danom upisa u Registar udruga Republike Hrvatske, osim odredbe iz članka 59, alineja druga, koja se slijedom preporuka Medunarodnog olimpijskog odbora stavlja u Statut s primjenom od slijedeći izbora u HOO-U (2024).\n- (2) Danom stupanja na snagu ovog Statuta Hrvatskog olimpijskog odbora - pročišćen", "i tekst, prestaje važiti Statut HOO-a - pročišćeni tekst broj: 268/23 od 3.3.2023.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nGlavni tajnik Hrvatskog olimpijskog odbora mr.sc. Siniša Krajač\n\n24001\n\nPredsiednil Hrvatskog olimpijskog odbora\n\ndr.sc. Zlatko Mateša\n\nNebed\n\nKlasa; 030-08/24-01/3 Ur. Broj; 442-01-05-24-2"]