"[\"Na temelju Clanka 13. Zakona o udrugama (Narodne novine, br. 74/14, 70/17, 98/19 i 151/22) i Clanka 30. Zakona o sportu (Narodne novine, br. 141/22) na sjednici Skup&tine Gradanskog nogometnog kluba ,Dinamo* odrZanoj 21.12.2023. donesen je: STATUT GRADANSKOG NOGOMETNOG KLUBA ,,DINAMO\\u201c OSNOVNE ODREDBE Clanak 1. Ovim Statutom ureduju se: naziv i sjedi$te udruge; podrugje i ciljevi djelovanja; zastupanje; djelatnost; gospodarska djelatnost; na\\u00e9in osiguranja javnosti djelovanja udruge; uvjeti i nacin uclanjivanja; prestanak \\u00e9lanstva; prava, obveze i odgovornosti \\u20aclanova; popis \\u00e9lanova; tijela udruge, njihov sastav i nacin sazivanja sjednica; izbor, opoziv, oviasti, odgovornost, nag\\u00e9in odlu\\u00e9ivanja i trajanje mandata; na\\u00e9in rjeSavanja sporova i sukoba interesa unutar udruge; nacin sazivanja SkupStine u slu\\u00e9aju isteka mandata; izbor i opoziv likvidatora; prestanak postojanja udruge; imovina, na\\u00e9in stjecanja i raspolaganja imovinom; postupak s imovinom u_ slu\\u00e9aju prestanka postojanja udruge te ostala pitanja od zna\\u00e9aja za udrugu. Clanak 2. (1) Naziv Udruge je: Gradanski nogometni klub ,Dinamo*. (2) Skra\\u00e9eni naziv Udruge je: GNK ,Dinamo*. (3) Gradanski nogometni klub ,Dinamo* profesionalni sportski nogometni klub. (4) SjediSte kiuba je u Zagrebu, Maksimirska cesta 128. Clanak 3. (1) Gradanski nogometni klub ,Dinamo* (u daljnjem tekstu: Klub) je udruga registrirana u Registru udruga Republike Hrvatske i Evidenciji pravnih osoba u sportu . (2) Klub je neprofitna pravna osoba. Clanak 4. (1) Klub ima pe\\u00e9at. (2) Pe\\u00e9at je okruglog oblika, promjera 35 mm, sa ispisanim nazivom i mjestom sjedista Kluba po obodu pe\\u00e9ata i znakom u sredini. Clanak 5. (1) Obiljezja Kluba su znak/amblem/grb i plava boja, a koja slijede izgled obiljezja i sportsku tradiciju Prvog hrvatskog gradanskog Sportskog kluba Zagreb, odnosno 1. HSK Gradanskog. (2) Znak/amblem/grb Kluba je kruZnog oblika i simbolizira oblik nogometne lopte, a Sto ukazuje na osnovnu djelatnost Kluba. (3) Osnova znaka/amblema/grba sastavijena je od dva_ polukruga: povijesnog hrvatskog grba s naizmjeni\\u00e9nim crvenim i bijelim poljima i tradicionalnog u plavoj boji Grada Zagreba s bijelim slovom \\u2018d' koje predstavija po\\u00e9etno slovo naziva Kluba Dinamo\\u201c. (4) Sve linije unutar znaka/amblema/grba i rub znaka/amblema/grba su u boji zlata. (5) Klub ba&tini sportsku povijest i rezultate nastale pod imenima 1. HSK Gradanski, NK ,Dinamo\\u201c, NK HASK-Gradanski i NK Croatia. Clanak 6. (1) O promjeni imena, grba, boje, lokacije stadiona, preoblikovanja, pripajanja, spajanja ili podjele Kluba i dobrovoljnog prestanka rada Kluba saziva se obvezujuci referendum svih punoljetnih i poslovno sposobnih \\u00e9lanova Kluba, tako da na njemu mora sudjelovati najmanje 70 % Glanova Kluba s pravom glasa, a odlucuje se obi\\u00e9nom vecinom. (2) Referendum svih Clanova Kluba mora sazvati Predsjednik Kluba u slucajevima iz st. 1. ovog Elanka. Clanak 7. Klub zastupaju Predsjednik, Dopredsjednik i Uprava, sukladno odredbama ovog Statuta. Clanak 8. (1) Klub: a. postupa sukladno Pravilima nogometne igre koje je donio Medunarodni nogometni savez BOARD (IFAB); b. postuje na\\u00e9ela privrzenosti, integriteta i sportskog ponaSanja kao izraza fair- playa; c. postuje statut, pravilnike i odluke FIFA-e i UEFA-e i Hrvatskog nogometnog saveza (HNS) u svako vrijeme; d. priznaje nadleZnost Arbitraznog suda za sport (CAS) u Lausanni (Svicarska), kao Sto je utvrdeno relevantnim odredbama Statuta FIFA-e, UEFA-e; e. priznaje nadlieznost Arbitraznog suda HNS-a i\", \"sportskog ponaSanja kao izraza fair- playa; c. postuje statut, pravilnike i odluke FIFA-e i UEFA-e i Hrvatskog nogometnog saveza (HNS) u svako vrijeme; d. priznaje nadleZnost Arbitraznog suda za sport (CAS) u Lausanni (Svicarska), kao Sto je utvrdeno relevantnim odredbama Statuta FIFA-e, UEFA-e; e. priznaje nadlieznost Arbitraznog suda HNS-a i sukladno tome podnosit \\u00e9e sve sporove nacionalnih razmjera, koji su nastali iz ili u vezi s primjenom Statuta ili pravilnika HNS-a, u posljednjoj instanci samo tim arbitrazama, koje rjeSavaju svoje sporove, isklju\\u00e9ujuci svaki redovni sud, osim ukoliko je to izriCito zabranjeno vazecim zakonodavstvom u Republici Hrvatskoj. (2) U slu\\u00e9aju sporova za koje su nadleZna pravosudna tijela FIFA-e, UEFA-e, CAS-a, Arbitraznog suda Saveza ili pravnih tijela Saveza, Klub se obvezuje da spor ne\\u00e9e iznositi pred redovne sudove. (3) Klub poStuje sve odluke nadleznih tijela HNS-a, FIFA-e i UEFA-e i CAS-a. CILJEVI, PODRUCJE DJELOVANJA SUKLADNO CILJEVIMA, DJELATNOST | GOSPODARSKE DJELATNOSTI Clanak 9. (1) Ciljevi Kluba su: o297D okupljanje gradana, djece i mladezi kroz Skole nogometa; razvoj i unapredenje nogometa te postizanje vrhunskih sportskih rezultata; sudjelovanje u nogometnim natjecanjima u zemlji i inozemstvu; stru\\u00e9no i profesionalno osposobljavanje i usavrSavanje sportskih djelatnika; stvaranje potrebnih uvjeta za bavijenje nogometom, trening, organizaciju stru\\u00e9nog rada i natjecanje svih ekipa Kluba. (2) Klub moze podrZavati muSku, Zensku i veteransku nogometnu ekipu, futsal ekipu te ostale varijacije s ciljem razvoja i popularizacije nogometnog sporta. (3) Klub sukladno ciljevima djeluje na podru\\u00e9ju sporta. Clanak 10. Djelatnosti Kluba su: a. b. Cc. sudjelovanje u profesionalnim ili amaterskim natjecanjima na lokalnoj, drzavnoj i medunarodngj razini unogometnom sportu za sve uzraste; stru\\u00e9no-pedagoski rad sa svim uzrastima sportaSa, osobito kroz nogometne $kole; organizirano vodenje treninga i sportskih priprema; osposobljavanje i usavrSavanje viastitog struc\\u00e9nog i pedagoSkog kadra; stvaranje materijalnih, tehnickih infrastrukturnih i drugih uvjeta za bavljenje nogometnim sportom; upravijanje, odrzavanje i skrb o daljnjoj izgradnji sportskih objekata kojima Klub raspolaze; osiguravanje svih potrebnih uvjeta za sudjelovanje u natjecanju prema uvjetima za licenciranje HNS-a i UEFE (stru\\u00e9no-pedago&ki trenerski kadrovi, administrativni kriteriji, sportski kriteriji, infrastrukturni kriteriji i financijski kriteriji); suradnja sa sudackim, trenerskim ji drugim stru\\u00e9nim sportskim organizacijama na lokalnoj, drzavnoj i medunarodnoj razini; suradnja s drugim nogometnim i sportskim klubovima; h. suradnja s tijelima drzavne te lokalne i regionalne viasti, pravnim i fizi\\u00e9kim osobama u ispunjavanju sportskih interesa i ciljeva; i. organizirano okupljanje Clanstva Kluba svih uzrasta; j. izdavanje biltena, glasila, monografija, priru\\u00e9nika i drugih tiskovina vezano uz nogometni sport i Klub; k. poticanje i promicanje nogometa kao sporta u skladu s aktima strateSkog planiranja razvoja sporta na nacionalnoj razini, odnosno nacionalnom strategijom razvoja sporta inacionalnim planom razvoja sporta te strateSkim dokumentima donesenim na podru\\u00e9noj (regionainoj) razini, a osobito sporta djece i mladezi, te zdravstveno usmjerenog tjelesnog vjezbanja i zdravstveno usmjerene tjelesne aktivnosti sportaSa; I. sudjelovanje u ostvarivanju uvjeta za provodenje zdravstvene skrbi sportaga te sudjeluje u edukaciji sportaSa o antidopingu; m. provodenje edukaciju, informiranje i savjetovanje sportaga, sportskih djelatnika, gradana i ostalih sudionika u sportu o pitanjima bitnim za bavljenje sportskim aktivnostima i djelatnostima; n. poduzimanje aktivnosti za sprjecavanje negativnih pojava u sportu, posebno Za\", \"u ostvarivanju uvjeta za provodenje zdravstvene skrbi sportaga te sudjeluje u edukaciji sportaSa o antidopingu; m. provodenje edukaciju, informiranje i savjetovanje sportaga, sportskih djelatnika, gradana i ostalih sudionika u sportu o pitanjima bitnim za bavljenje sportskim aktivnostima i djelatnostima; n. poduzimanje aktivnosti za sprjecavanje negativnih pojava u sportu, posebno Za sprjecavanje nasilja u sportu i krSenja prava djece; 0. promicanje stru\\u00e9nog rada u sportu, te sudjelovanje u unapredenju stru\\u00e9nog rada i skrbi o osposobijavanju stru\\u00e9nih djelatnika; p. unos i azuriranje podataka za koje je nadleZan Klub u Nacionalni informacijski sustav u sportu; q. obavija i druge poslove, djelatnosti i zada\\u00e9e odredene zakonom i ovim Statutom. Clanak 11. (1) Gospodarske djelatnosti koje Klub obavija su: a. izdavacka djelatnost; b. prodaja vlastitih proizvoda na malo izvan prodavaonica, sukladno Zakonu o trgovini; c. promidzbene djelatnosti; d. davanje u zakup i podzakup viastitih poslovnih prostora i mjesta za oglaSavanje; (2) Djelatnosti iz st. 1. ovog lanka Klub obavlja u skladu s posebnim propisima koji ureduju gospodarsko poslovanje udruga kao pravnih osoba. (3) Djelatnosti iz st. 1. ovog lanka ne mogu se obavijati radi stjecanja dobiti za svoje \\u20aclanove ili trece osobe. (4) Ako u obavijanju gospodarskih djelatnosti Klub ostvari dobit ona se mora koristiti iskljucivo za obavijanje i unapredenje djelatnosti Kluba kojima se ostvaruju ciljevi Kluba, utvrdeni ovim Statutom, sukladno zakonu. Clanak 12. Klub moze osnivati trgova\\u00e9ka drugtva prema odredbama Zakona o trgovackim druStvima, kao i druge oblike pravnih osoba u skladu s posebnim propisima, ako je to u cilju osiguranja materijalnih uvjeta rada i razvoja Kluba. Clanak 13. (1) Djelovanje Kluba je javno, a ostvaruje se putem: a. internetskih stranica Kluba, aplikacija i druStvenih mreza, b. javnih medija, c. povjerenika Kluba, d. ostalih na\\u00e9ina informiranja sukladno odluci Uprave Kluba. (2) Clanove Kluba pravodobno se obavjeStava o radu Kluba, aktima i odlukama njegovih tijela posebnim izvjeScima te skupovima za Glanove koji se organiziraju najmanje jednom godi&nje Sto je definirano Pravilnikom o \\u00e9lanstvu. (3) O na\\u00e9inu javnosti rada Kluba i obavjeStavanja Glanova, Uprava Kluba donosi odluku. Clanak 14. (1) Klub se moze udruZiti u saveze udruga, zajednice, mreze i u medunarodne udruge. (2) Odluku o udruzivanju donosi Skup8tina. CLANSTVO Clanak 15. (1) Clanom Kluba moze postati svaka fizicka osoba koja ispunjavanjem pristupnice prinvaca na\\u00e9ela, Statut i druge akte Kluba. (2) Clanom Kluba se postaje upisom u jedinstveni Popis \\u00e9lanova koji vodi stru\\u00e9na sluzba po odluci Uprave Kluba. (3) Primitak u Clanstvo odobrava Uprava Kluba i osobe koje Uprava zaduzi za \\u00e9lanstvo, ako ne postoje prepreke iz ovog Statuta ili zakona, a na temelju ispunjene pristupnice. Odbijanje mora biti obrazlozeno u roku od 30 dana i osoba koja je podnijela zahtjev moZe podnijeti Zalbu Nadzornom odboru u roku od 15 dana od primitka odbijanja. (4) Osobe miade od 18 godina, kao i osobe liSene poslovne sposobnosti mogu postati Clanom Kluba. Za osobu mladu od 14 godina pisanu izjavu o u\\u00e9lanjivanju u udrugu daje zakonski zastupnik ili skronik, a za maloljetnu osobu s navrSenih 14 godina zakonski zastupnik ili skrbnik daje pisanu suglasnost. (5) Maloljetnici te osobe\", \"miade od 18 godina, kao i osobe liSene poslovne sposobnosti mogu postati Clanom Kluba. Za osobu mladu od 14 godina pisanu izjavu o u\\u00e9lanjivanju u udrugu daje zakonski zastupnik ili skronik, a za maloljetnu osobu s navrSenih 14 godina zakonski zastupnik ili skrbnik daje pisanu suglasnost. (5) Maloljetnici te osobe liSene poslovne sposobnosti ne mogu biti Glanovi klupskih tijela. (6) Svaki Clan moze dobiti Glansku iskaznicu Giji izgled definira Uprava Kluba. (7) Jedinstveni popis \\u00a2lanova vodi se elektroni\\u00e9ki i obavezno sadr#i podatke o osobnom imenu, osobnom identifikacijskom broju (OIB), datumu rodenja, datumu pristupanja Klubu te datumu prestanka Glanstva u Klubu. (8) U arhivi se Cuvaju privole o koriStenju osobnih podataka u skladu s propisima o Za&titi podataka, adrese stanovanja, brojeve telefona i mobilnih telefona, adrese e- poste i ostali podaci iz pristupnice koju ispunjavaju Glanovi pri ulanjenju. (9) Jedinstveni popis \\u00e9lanova uvijek je dostupan na uvid svim Glanovima i nadleznim tijelima na njihov zahtjev u skladu sa zakonima i drugim propisima o za&titi podataka. Clanak 16. (1) Visinu \\u20aclanarine odreduje Izvr8ni odbor. (2) Clan je duzan uplatiti Glanarinu u roku od 15 dana od dana potpisivanja pristupnice u Clanstvo Kluba. (3) Clanstvo po\\u00e9inje datumom upisa u jedinstveni Popis Clanova i zavrSava istekom te kalendarske godine. Po isteku kalendarske godine, \\u00e9lanstvo se obnavija za idu\\u00e9u kalendarsku godinu novom uplatom godi&nje Glanarine, a prava i obveze prema ovom Statutu teku od trenutka obnove. Clanak 17. (1) Klub je neutralan po pitanjima politike i vjere. (2) Diskriminacija bilo koje vrste prema drzavama, osobama ili rodnim skupinama osoba temeljena na njihovoj rasi, nacionalnosti, vjeri, spolu, jeziku, politi\\u00e9kom opredjeljenju ili bilo Gemu drugome zabranjena je i predstavija razlog za isklju\\u00e9enje iz Kluba u stegovnom postupku. (3) Clan ne moze biti osoba koja svojim ponaSanjem i radnjama nanosi materijainu ili nematerijalinu Stetu Klubu te koja nasilni\\u00e9kim, diskriminatornim i rasisti\\u00e9kim ponasanjem \\u2014_radnjama onemogu\\u00e9ava ostvarenje ciljeva i obavijanje djelatnosti, te Steti ugledu Kluba. Clanak 18. Prava Clanova su: a. birati i biti biran u tijela Kluba te pravo glasa na referendumu, Sto vrijedi za punoljetne i poslovno sposobne \\u00e9lanove Kluba koji su bili Glanovi u prethodnoj kalendarskoj godini, osim u slu\\u00e9aju imenovanja \\u00e9lanova Uprave; b. pridonositi afirmaciji i ugledu Kluba u zemlji i inozemstvu; c. sudjelovati u radu i upravijanju Klubom putem izabranih predstavnika u Skup8Stini i drugim tijelima Kluba; d. biti pravodobno obavjeStavani o radu Kluba i aktima i odiukama njegovih tijela na na\\u00e9in propisan Statutom, posebnim aktima i odiukama Uprave; \\u20ac. komunicirati pisano te putem javne tribine jednom godi&nje s tijelima Kluba u okviru njihove nadleZnosti i dobiti pravodobne odgovore; f. predlagati to\\u00a2ke dnevnog reda Skup&tine izabranim predstavnicima u Skup8stinu; g. biti nagraden po\\u00e9asnim odlikovanjima za doprinos ili za dugotrajno \\u00e9lanstvo; h. prednost u kupnji ulaznica na na\\u00e9in koji odredi Uprava. Clanak 19. DuZnosti i odgovornosti lanova su: a. placanje Clanarine te poStivanje Statuta i drugih akata Kluba; b. podupiranje Kluba i aktivno sudjelovanje u ostvarenju ciljeva Kluba; c. suzdrzavanje od ponaSanja i radnji koje Stete Klubu i njegovu ugledu. Clanak 20. Nogometa8i koji su Clanovi\", \"na na\\u00e9in koji odredi Uprava. Clanak 19. DuZnosti i odgovornosti lanova su: a. placanje Clanarine te poStivanje Statuta i drugih akata Kluba; b. podupiranje Kluba i aktivno sudjelovanje u ostvarenju ciljeva Kluba; c. suzdrzavanje od ponaSanja i radnji koje Stete Klubu i njegovu ugledu. Clanak 20. Nogometa8i koji su Clanovi Kluba pored prava i obveza iz \\u00e9l. 18. i 19. ovog Statuta imaju i druga prava, obveze i odgovornosti utvrdene ugovorima te odlukama klupskih tijela. Clanak 21. (1) Clanstvo u Klubu i njegovim tijelima prestaje: a. dragovoljnim istupom, b. neplacanjem Glanarine, c. isklju\\u00e9enjem u stegovnom postupku, d. smrcu, e. postojanjem zapreka propisanih u pravnim propisima. (2) Clanstvo prestaje i dlan se brige iz Jedinstvenog popisa Clanova bez posebne odluke ako ne plati \\u20aclanarinu unutar kalendarske godine. Clanak 22. (1) Stegovne mjere prema \\u00e9lanovima Kluba su opomena, suspenzija i isklju\\u00e9enje, koje moze biti trajno ili na odredeni vremenski rok. (2) Opomena i suspenzija izri\\u00e9e se Elanu koji svojim djelovanjem naruSava ugled Kluba. (3) Clan moze biti isklju\\u00e9en iz Kluba ako djeluje protivno cillevima Kluba te zbog nepoStivanja Statuta, drugih opcih akata i odluka klupskih tijela. (4) Stegovni postupak pokre\\u00e9e se na zahtjev bilo kojeg Glana klupskih tijela. (5) Odluku 0 stegovnim mjerama donosi Uprava. (8) Isklju\\u00e9eni Elan ima pravo u roku od 15 dana, ra\\u00e9unajuci od dana dostave odluke, podnijeti Zalbu Nadzornom odboru. (7) Nadzorni odbor je duzan rijeSiti Zalbu u roku od 30 dana, ra\\u00e9unajuci od dana dostave Zalbe. (8) Odluka Nadzornog odbora 0 isklju\\u00e9enju je kona\\u00e9na. Clanak 23. (1) Povjerenik moZe biti svaki \\u00e9lan Kluba koji je podnio zamolbu i koji ispunjava sljedece uvjete: a. osoba je s potpunom poslovnom sposobnos\\u00e9u; b. da je prije podnogenja zamolbe, na njegovu preporuku u Klub u\\u00e9lanjeno najmanje 20 novih Glanova Kluba; c. da je najmanje 5 (pet) godina neprekidno Glan kluba prije podnogsenja zamobbe ili da je najmanje 2 (dvije) godine neprekidno Clan kluba i na Giji se prijedlog uClani najmanje 50 \\u00e9tanova kluba: d. da ne postoje zapreke iz ovog Statuta. (2) Odluku o imenovanju povjerenika donosi Uprava Kluba. (3) Povjerenik je duzZan animirati i poticati u\\u00e9lanjivanje novih Glanova Kluba te izvjeStavati svoje Glanove drugim vazZnim temama koje se odnose na ostvarivanje ciljeva Kluba i obavijanje njegove djelatnosti. (4) Uprava Kluba moze s imenovanim povjerenikom zaklju\\u00e9iti ugovor 0 medusobnim pravima i obvezama. TIJELA KLUBA Clanak 24. (1) Klupska tijela su: a. Skup&tina, b. Izvr&ni odbor, c. Predsjednik i Dopredsjednik Kluba, d. Nadzorni odbor, e. Uprava Kluba. (2) U klupska tijela mogu biti izabrani samo punoljetni i poslovno sposobni \\u00e9lanovi Kluba. Clanak 25. (1) Clanovi klupskih tijela ne mogu biti osobe za koje postoji zapreka iz \\u00e9l. 111. 1 112. Zakona o sportu iiz \\u00e9l. 19. st. 2. i 3. Zakona o udrugama. (2) Clanovi klupskih tijela uz razloge iz st. 1. ne mogu biti osobe: a. koje su aktivni nogometni sudac, ili osoba koja je to bila u posljednje 3 (tri) godine; b. koje ne mogu biti \\u00e9lanovi Uprave odnosno nadzomnog odbora dioni\\u00e9kog drustva prema odredbama Zakona o trgova\\u00e9kim dru&tvima i\", \"udrugama. (2) Clanovi klupskih tijela uz razloge iz st. 1. ne mogu biti osobe: a. koje su aktivni nogometni sudac, ili osoba koja je to bila u posljednje 3 (tri) godine; b. koje ne mogu biti \\u00e9lanovi Uprave odnosno nadzomnog odbora dioni\\u00e9kog drustva prema odredbama Zakona o trgova\\u00e9kim dru&tvima i Zakona o sprjecavanju sukoba interesa u obnaSanju javnih duznosti: c. koji su dioni\\u00e9ari ili Clanovi drugog nogometnog kluba; d. koje svojim djelovanjem mogu neposredno utjecati na sustav natjecanja u odgovaraju\\u00a2em sportu, a osobito sportadi koji su profesionalni prema Zakona o sportu, menadzZeri i posrednici u sportu, kao i osobe koje su to bile u razdoblju od posljednjih godinu dana; e. koje su posljednjih godinu dana bile Glanovi ili Glanovi tijela pravne osobe koja obavija djelatnost organiziranja sportske kladionice; f. koje s menadZerima i posrednicima u istome sportu i \\u00e9lanovima pravnih osoba te Clanovima tijela pravnih osoba koje obavijaju djelatnost organiziranja sportskih kladionica djeluju zajednicki; g. koje imaju ili su posljednjih godinu dana imale sklopljen ugovor sa nogometasem ili nogometnim trenerom na temelju kojega ostvaruje pravo na dio prihoda koji proiziaze iz obavijanja djelatnosti nogometaga ili nogometnog trenera; h. koje su ovlaStene za zastupanje u pravnoj osobi koja sukladno Zakonu o sportu ima sklopljene ugovore o ulaganju u fizicke osobe u nogometu; i. koje su u posljednje tri godine pravomo\\u00e9no kaznjene za kaznena djela ili prekrSaje u sportu i u vezi sa sportom i sportskim natjecanjima; j. koje su pravomo\\u00e9no osudene na kaznu zatvora u trajanju od najmanje 6 (Sest) mjeseci za neko od kaznenih djela pocinjena s namjerom, a nije primijenjena uvjetna osuda godinu dana od odsluzenja kazne; k. koje ne ispunjavaju druge uvjete propisane Zakonom o sportu i drugim zakonima. |. koje su aktivni igra\\u00e9, trener ili zaposlenik Kluba, a ako to postanu tijekom mandata u tijelima Kluba, prestaje im mandat i \\u00e9lanstvo u tijelu, osim Clanovima Uprave Kluba. (3) Svaki Glan Kluba koji ulazi u bilo koja tijela Kluba mora potpisati izjavu kojom izjavijuje da za njega ne vrijede gore navedeni uvjeti te da \\u00e9e u slu\\u00e9aju nastupa gore navedenih uvjete odmah obavijestiti Upravu Kluba. Clanak 26. (1) Mandat \\u20aclanovima klupskih tijela prestaje i prije isteka roka u slu\\u00e9aju: a. pisane ostavke ili zapisnikom konstatirane ostavke - danom zaprimanja ostavke odnosno ovjerom zapisnika; izbora novog saziva klupskog tijela; potpunog ili djelomi\\u00e9nog gubitka poslovne sposobnosti; nastupa okolnosti iz \\u20aclanka 21. i 25. ovog Statuta; e. nastupa druge okolnosti zbog koje viSe ne moze biti \\u00e9lanom klupskog tijela. (2) Na mjesto Clana SkupStine koji je prestao biti Glan Skup&tine prije isteka mandata na koji je izabran imenuje se novi Glan s popisa zamjenskih Glanova Skup&tine u obje izborne jedinice. U slu\\u00e9aju da se iscrpi broj zamjena, Skup&tina nastavija funkcionirati s brojem preostalih Glanova Skup8tine. (3) Novoimenovanom \\u00e9lanu Skup&tine prema st. 2. ovog \\u00e9lanka, mandat traje do isteka mandata Skup\\u00e9&tine. (4) Novoizabranom Glanu Izvr3nog odbora mandat traje do isteka mandata IzvrSnog odbora. (5) Novoizabranom \\u00e9lanu Nadzornog odbora mandat traje do isteka mandata Nadzornog odbora. 295 SKUPSTINA Clanak 27. (1) Skup8&tina je\", \"brojem preostalih Glanova Skup8tine. (3) Novoimenovanom \\u00e9lanu Skup&tine prema st. 2. ovog \\u00e9lanka, mandat traje do isteka mandata Skup\\u00e9&tine. (4) Novoizabranom Glanu Izvr3nog odbora mandat traje do isteka mandata IzvrSnog odbora. (5) Novoizabranom \\u00e9lanu Nadzornog odbora mandat traje do isteka mandata Nadzornog odbora. 295 SKUPSTINA Clanak 27. (1) Skup8&tina je najvige tijelo upravijanja Klubom. (2) SkupStinu sa\\u00e9injava 60 predstavnika \\u00e9lanova Kluba, na naGin da: 25 Clanova Skup$tine biraju svi Slanovi Kluba na izborima te lista s najvise glasova ulazi u cijelosti u Skuptinu 35 Glanova Skup&tine bira Izvr8ni odbor iz redova prijavijenih kandidata tajnim glasovanjem Clanak 28. (1) Izbori za Skup&tinu Kluba odrZavaju se u dvije izborne jedinice: izbori u prvoj izbornoj jedinici na kojima sudjeluju punoljetni i poslovno sposobni Clanovi koji imaju vaZece \\u00e9lanstvo u trenutku izbora iu prethodnoj kalendarskoj godini, koji glasuju za izborne liste koje uz nositelja liste, sadrze i popis kandidata za svih 25 mjesta u Skup&tini i najmanje pet zamjenskih kandidata za \\u00a2lanove SkupStine. Lista koja dobije najveci broj glasova popunjava sva mjesta za prvu izbornu jedinicu; druga izborna jedinica za koju punoljetni i poslovno sposobni \\u00e9lanovi s vazecim Clanstvom u trenutku izbora i u prethodnoj kalendarskoj godini, mogu posiati kandidature Izbornom povjerenstvu, a iz koje Ge 35 \\u00e9lanova Skup&tine kao cjelovitu listu izabrati Izvr3ni odbor uz pet zamjenskih kandidata. (2) Liste iz obje izborne jedinice imaju nositelje koji su i kandidati za Predsjednika. Nositelj liste koja je pobijedila u prvoj izbornoj jedinici je jedan kandidat za Predsjednika, a izmedu 35 \\u00e9lanova Skup8tine iz druge izbore jedinice Predsjednik Kluba imenuje nositelja liste koji je kandidat za Predsjednika druge izborne jedinice. IZmedu dva kandidata za Predsjednika SkupStina glasa za Predsjednika Kluba. Nositelji lista kao kandidati za Predsjednika moraju imati plan upravijanja Klubom u svom mandatu dostupan Clanovima Kluba prije izbora, koji dostavijaju Izbornom povjerenstvu. Liste u prvoj izbornoj jedinici moraju imati potpise podrske najmanje 100 punoljetnih i poslovno sposobnih \\u00e9lanova Kluba s vaze\\u00e9im \\u00e9lanstvom u trenutku potpisivanja i u kalendarskoj godini koja prethodi izbornim procesima. (3) Izborna Skup&tina se mora odrZati najkasnije 30 dana od dana izbora. (4) Detalje izbornih postupaka i referenduma ureduje Pravilnik o izborima u Klubu. Clanak 29. (1) Skup&tina zapoCinje utvrdivanjem Glanova Skup&tine i prisutnog broja Glanova od strane Predsjednika Kluba na temelju dostavijenih verificiranih listi kod Izborne Skup&tine te popisa promjena Glanova Skup&tine od strane Izvr$nog odbora. (2) IzvrSni odbor \\u00e9e najkasnije 2 mjeseca prije izbora izabrati Izborno povjerenstvo u sastavu od 5 prijavijenih \\u00a2lanova Kluba. U slu\\u00e9aju da nema dovoljno prijavijenih \\u00e9lanova Kluba za Izborno povjerenstvo Izvr8ni odbor \\u00e9e obavijati funkciju Izbornog povjerenstva. (3) Na Izbornoj Skup&tini, nakon izbora Predsjednika Kluba, Predsjednik Kluba automatski postaje Predsjednik IzvrSnog odbora i imenuje joS 10 \\u00e9lanova IzvrSnog odbora po svom odabiru iz redova \\u00e9lanova Skup&tine, a 2 lana imenuje nositelj druge liste koja sacinjava Skup\\u00e9tinu, Sto se verificira na Skup&tini Citanjem imena \\u20aclanova Izvr$nog odbora. (4) SkupStina donosi Pravilnik 0 izborima u Klubu u kojem su detaljnije odredeni izborni postupci i rad Izbornog povjerenstva. (5) SkupStina sve verifikacije u njezinoj nadleZnosti obavija javnim\", \"\\u00e9lanova Skup&tine, a 2 lana imenuje nositelj druge liste koja sacinjava Skup\\u00e9tinu, Sto se verificira na Skup&tini Citanjem imena \\u20aclanova Izvr$nog odbora. (4) SkupStina donosi Pravilnik 0 izborima u Klubu u kojem su detaljnije odredeni izborni postupci i rad Izbornog povjerenstva. (5) SkupStina sve verifikacije u njezinoj nadleZnosti obavija javnim Gitanjem u zapisnik, dok ostala tijela, posebno Izborno povjerenstvo, verifikacije obavijaju glasovanjem. Clanak 30. Clanovi Skup&tine biraju se na mandat od 4 (\\u20acetiri) godine te isti \\u20aclanovi mogu biti birani na novo mandatno razdoblje. Clanak 31. (1) SkupStina moZe biti redovita i izvanredna. (2) SkupStina redovito zasjeda najmanje jednom godiSnje, dok se izvanredne odrzavaju prema potrebi. (3) Sjednice SkupStine saziva Predsjednik Kluba. (4) Predsjednik Kluba mora sazvati izvanrednu sjednicu ako to zatrazZi IzvrSni odbor ili 31 Clan Skup&tine koji su duzZni predloZiti dnevni red izvanredne sjednice Skup$&tine. (5) U slu\\u00e9aju iz st. 4. ovog \\u00e9lanka Predsjednik Kluba je duzan sazvati izvanrednu sjednicu Skup&tine u roku od 15 dana od dana zaprimanja zahtjeva predlagatelja za sazivanje Skup&tine koja se mora odrZati najkasnije u roku od 30 dana od dana zaprimanja zahtjeva za njezinim sazivanjem. (6) Ako Predsjednik Kluba ne sazove izvanrednu sjednicu SkupStine Kluba u roku 30 dana od dana zaprimanja zahtjeva prediagatelja, izvanrednu sjednicu Skup&tine mogu sazvati sami predlagatelji. (7) Nakon sazivanja izvanredne sjednice SkupStine mora prote\\u00a2ci najmanje 3 (tri) mjeseca prije podnoSenja novog zahtjeva za sazivanjem nove izvanredne sjednice Skup\\u00a7&tine. Clanak 32. (1) 15 dana prije donoSenja odluke o sazivanju SkupStine izvrSni odbor formira popis svih Clanova Skup&tine te u slu\\u00a2aju nastupa uvjeta navedenih u \\u00e9l. 25. i \\u00e9l. 26., dodaje nove \\u00e9lanove s liste zamjenskih Glanova. (2) U odluci o sazivanju Skup&tine koja se mora poslati Glanovima SkupStine najkasnije 8 dana prije odrzavanja SkupStine, Predsjednik Kiuba utvrduje dnevni red te dan i mjesto odr\\u00e9avanja sjednice. lzvrSni odbor moze dopuniti dnevni red pisanim prijedlogom. (3) Nakon primitka odluke o utvrdivanju dnevnog reda najmanje 25 Glanova Skup&tine moze dopuniti dnevni red pisanim prijedlogom IzvrSnom odboru bilo koje to\\u00e9ke koja je u nadleznosti Skupstine, najkasnije 7 dana prije Skup8tine. (4) Najkasnije 3 dana prije SkupStine Predsjednik Salje kona\\u00e9ni dnevni red i sve materijale potrebne za donoSenje odluka prema dnevnom redu. Clanak 33. (1) U slu\\u00e9aju isteka mandata svim tijelima Kluba, svi punoljetni i poslovno sposobni Clanovi Kluba postaju op\\u00e9a Skup&tina koja \\u00e9e izabrati tijela Kluba. (2) U slu\\u00e9aju iz st 1. ovog Glanka op\\u00e9u Skup&tinu saziva jedna od zadnjih osoba oviastenih za zastupanje u registar udruga Republike Hrvatske. Clanak 34, (1) Predsjednik Kluba imenuje radno predsjedni&tvo od 3 \\u00e9lana, koje rukovodi radom Skup$Stine. (2) Dopredsjednik kojeg imenuje Predsjednik Kluba je predsjedavajuci Skup8tine. (3)Na_ Izbornoj Skup&tini, nakon odabira Izvr8nog odbora i Dopredsjednika, dosadaSnjeg Dopredsjednika na mijestu predsjedavaju\\u00e9eg, zamjenjuje novoizabrani. (4) O radu sjednice vodi se zapisnik koji se trajno \\u00e9uva u arhivi Kluba, a kojeg potpisuju predsjedavajuci tom sjednicom i zapisni\\u00e9ar. (5) Jedan od Clanova Uprave, ovlaSten za zastupanje Kluba dostavlja zapisnik sa sjednica Skup&tine nadleZnom uredu koji vodi registar udruga. Clanak 35. (1) Skup&tina odlu\\u00e9uje pravovaljano ako je nazo\\u00e9an najmanje 31\", \"sjednice vodi se zapisnik koji se trajno \\u00e9uva u arhivi Kluba, a kojeg potpisuju predsjedavajuci tom sjednicom i zapisni\\u00e9ar. (5) Jedan od Clanova Uprave, ovlaSten za zastupanje Kluba dostavlja zapisnik sa sjednica Skup&tine nadleZnom uredu koji vodi registar udruga. Clanak 35. (1) Skup&tina odlu\\u00e9uje pravovaljano ako je nazo\\u00e9an najmanje 31 \\u00e9lan Skup&tine, a odluke donosi vecinom glasova, osim ako Statutom nije propisano druk\\u00e9ije. (2) Za dono&enje, dopune i izmjene Statuta i za razrjeSenje Predsjednika ili Glanova IzvrSnog odbora potrebna je odluka najmanje 40 Glanova Skup&tine. (3) Za izbor novog Predsjednika potrebna je odluka najmanje 31 \\u00e9lana Skup&tine. Ako se na sjednici Skup&tine ne odabere Predsjednik ili vecina Izvr8nog odbora, Skup&tina saziva izbore u roku od 60 dana. Clanak 36. Skup&tina Kiuba: a. utvrduje politiku i smjernice rada Kluba predlozene od strane IzvrSnog odbora; b. usvaja Statut Kluba te predlaze i utvrduje njegove izmjene i dopune na na\\u00e9in propisan u \\u00a2l. 31 st.4. i \\u00e9l. 32 st.3. ovog Statuta; c. usvaja plan rada i financijski plan za sljede\\u00a2u kalendarsku godinu; d. usvaja godignje financijsko izvjeSce i izvjeS\\u00a2e o radu za prethodnu kalendarsku godinu; e. donosi Poslovnik o radu Skup&tine Kluba, Pravilnik o dodjeli nagrade \\u2018Ponos Dinama\\u2019, Pravilnik o izborima u Klubu, te druge akte i odluke vazne za rad Kluba prema ovom Statutu; f. odlu\\u00a2uje o promjeni ciljeva i djelatnosti te obavijanju gospodarskih djelatnosti; g. odlucuje o udruzivanju u saveze, zajednice, mreze i druge oblike povezivanja udruga; h. bira i razrjeSava Predsjednika Kluba, verificira i razrjeSava IzvrSni odbor i Nadzorni odbor, razrjeSava Izborno povjerenstvo, kao i pojedine Glanove tih tijela; i. imenuje i opoziva likvidatora Kluba; j. donosi odluku o prestanku rada Kluba, raspodjeli preostale imovine Kluba i 0 statusnim promjenama (pripajanju, spajanju i podjeli Kluba) u skladu s rezultatima provedenog referenduma; k. tumac\\u00e9i Statut i op\\u00e9e akte koje donosi, odlucuje i o drugim pitanjima za koje ovim Statutom nije utvrdena nadleznost drugih klupskih tijela. IZVRSNI ODBOR Clanak 37. (1) IzvrSni odbor Kluba je izvrSno tijelo Skup&tine kojoj odgovara za svoj rad. (2) lzvrSni odbor zalaZe se za na\\u00e9ela: zakonitosti, transparentnosti i javnosti poslovanja, sprjecavanje sukoba interesa, u\\u20acinkovit unutarnji nadzor, ja\\u00e9anje osobne odgovornosti, dru&tveno odgovorno poslovanje. (3) IzvrSni odbor se sastoji od 13 \\u00e9lanova iz redova \\u00e9lanova Skup8tine. (4) Iz redova Clanova Skup&tine, Predsjednik Kluba imenuje 10 \\u00e9lanova IzvrSnog odbora po svom odabiru, a 2 \\u00e9lana imenuje nositelj druge liste koja sacinjava Skup\\u00a7&tinu. (5) Mandat Clanova Izvr&nog odbora i Predsjednika je 4 (\\u00e9etiri) godine. (6) U slu\\u00e9aju prestanka Clanstva u Izvr8nom odboru iz bilo kojeg razloga prema ovom Statutu, Predsjednik ili nositelj druge liste, ovisno s \\u00e9ije liste su Glanovi IzvrSnog odbora kojima je prestalo Glanstvo, imenuje druge \\u00e9lanove IzvrSnog odbora iz Skup$&tine. Clanak 38. IzvrSni odbor Kluba: a. provodi odluke, zakljucke i preporuke Skup&tine; b. predlaze izmjene i dopune Statuta, osim u slu\\u00e9ajevima iz \\u00e9l. 36. ovog Statuta c. predlaze i usvaja opce akte Kluba, ako ovim Statutom nije druga\\u00e9ije odredeno; d. predlaZe Skup&tini program razvoja, politiku i smjernice rada Kluba: e. imenuje, sklapa ugovor, kao i razrjeSava predsjednika Uprave\", \"zakljucke i preporuke Skup&tine; b. predlaze izmjene i dopune Statuta, osim u slu\\u00e9ajevima iz \\u00e9l. 36. ovog Statuta c. predlaze i usvaja opce akte Kluba, ako ovim Statutom nije druga\\u00e9ije odredeno; d. predlaZe Skup&tini program razvoja, politiku i smjernice rada Kluba: e. imenuje, sklapa ugovor, kao i razrjeSava predsjednika Uprave i \\u00e9lanove Uprave Kluba; f. nadzire rad Uprave i daje joj suglasnost za pravne poslove iznad ukupnog iznosa 3 milijuna eura; g. oSniva po potrebi savjetodavne pododbore i povjerenstva sastavljene od Clanova Kluba, zaposlenika Kluba i stru\\u00e9njaka koji nisu \\u00e9lanovi Kluba, za potrebe kvalitetnije kontrole rada Kluba (Odbor za internu reviziju i kontrolu, Odbor za korporativna i strateSka pitanja, Odbor za imenovanja zasluznih igra\\u00e9a i trenera i sl.) te se obvezuje u odiuci o osnivanju pododbora i/ili povjerenstva navesti njihov sastav, zada\\u00e9u, vrijeme za koje se osnivaju i odgovornost za obavijanje poslova; h. odlu\\u00e9uje i o drugim pitanjima koje mu odredi Skup\\u00a7&tina. Clanak 39. (1) izvrSni odbor svoje poslove obavija na sjednicama koje saziva Predsjednik ili \\u00e9lan Izvrsnog odbora kojeg odredi Predsjednik prema potrebi, a najmanje jednom mjese\\u00e9no. (2) IzvrSni odbor odlu\\u00e9uje vecinom glasova nazo\\u00e9nih \\u00e9lanova pod uvjetom da je na sjednici prisutna natpolovi\\u00e9na ve\\u00e9ina svih Glanova. Clanak 40. Nacin i uvjete svog rada IzvrSni odbor ureduje Poslovnikom. PREDSJEDNIK KLUBA Clanak 41. (1) Predsjednik Kluba: a. saziva sjednice SkupStine Kluba i Izvr8nog odbora te predlaze dnevni red, osim u slu\\u00e9ajevima odredenih ovim Statutom: b. brine se o upoznavanju javnosti s radom Skup&tine Kluba; c. usuradnjis IzvrSnim odborom, utvrduje prijedlog Statuta i drugih op\\u00e9ih akata koje usvaja Skup&tina Kluba, osim u slu\\u00e9ajevima iz \\u00e9l. 36. d. imenuje Clanove Izvr$nog odbora sukladno \\u00e9l. 37. st. 4. ovog Statuta i predilaze Skup\\u00e9tini Kluba njihovo razrjeSavanije; e. saziva izbore u Klubu; f. obavija i druge poslove u skladu sa zakonima, ovim Statutom i aktima Kluba. (2) U bilo kojim siu\\u00e9ajevima istovremene sprijecenosti Predsjednika i Dopredsjednika duljim od 6 mjeseci, Izvr&ni odbor mora sazvati Skup&tinu koja \\u00e9e izabrati novog Predsjednika u roku od 3 mjeseca nakon proteka tog roka. Clanak 42. (1) Predsjednik Kluba po svojoj funkciji je \\u00e9lan i predsjednik IzvrSnog odbora. (2) Mandat Predsjednika Kluba je 4 (\\u20acetiri) godine i za svoj rad je odgovoran Skup8tini Kluba. (3) Predsjednik Kluba predstavija i zastupa Klub u zemiji i inozemstvu. (4) Predsjednik Kluba iz redova Izvrsnog odbora imenuje Dopredsjednika, koji rukovodi sjednicama Skup$tine i koji ga zamjenjuje u svim oviastima u slu\\u00e9aju njegove sprijecenosti. Clanak 43. (1) Skup&tina Kluba na redovnoj sjednici vecinom prisutnih Glanova Skupstine moze imenovati po\\u00e9asnog predsjednika Dinama na temelju poslovnih i sportskih zasluga i rezultata. (2) Mandat po\\u00e9asnog predsjednika je neograni\\u00e9en. U izuzetnim slucajevima moze ga razrijeSiti SkupStina. (3) Po\\u00e9asni predsjednik Kluba ima pravo sudjelovati na sjednicama Skup&tine, ali nema pravo glasa. NADZORNI ODBOR Clanak 44, (1) Nadzorni odbor: a. b. c. oh skrbi o financijskom poslovanju Kiuba te raspolaganju njegovom imovinom; skrbi o provodenju odredbi Statuta, op\\u00a2\\u00e9ih akata Kluba i pravnom poslovanju Kluba o Cemu moze traZiti izvjeS\\u00e9a tijela Kluba: stegovno je tijelo u drugom stupnju vezano uz \\u00e9lanska prava\", \"glasa. NADZORNI ODBOR Clanak 44, (1) Nadzorni odbor: a. b. c. oh skrbi o financijskom poslovanju Kiuba te raspolaganju njegovom imovinom; skrbi o provodenju odredbi Statuta, op\\u00a2\\u00e9ih akata Kluba i pravnom poslovanju Kluba o Cemu moze traZiti izvjeS\\u00e9a tijela Kluba: stegovno je tijelo u drugom stupnju vezano uz \\u00e9lanska prava i obveze te donosi kona\\u00e9nu odluku 0 stegovnoj meri: obavija i druge poslove u skladu sa zakonima, ovim Statutom i Pravilnikom 0 izborima; rjeSava sukobe interesa i sporove unutar Kluba; obavjestava klupska tijela o neusuglaSenosti rada ili akata sa Statutom i drugim aktima Kluba, o Gemu, ako se ne isprave, obavjeStava Skup&tinu koja donosi obvezujuc\\u00e9u odluku o uskladivanju rada i akata. (2) Clanovi klupskih tijela koja odlucuju u stegovnom postupku ne sudjeluju u njemu kada su predmet stegovnih postupaka. Clanak 45. (1) Nadzorni odbor se sastoji se od 3 \\u00e9lana, koji izmedu sebe biraju predsjednika. (2) Predsjednik Nadzornog odbora saziva sjednice i predia%e dnevni red. (3) Nadzorni odbor donosi odluke vecinom glasova svih Glanova. (4) Mandat Clanova Nadzornog odbora je 4 (&etiri) godine. Clanak 46. (1) Clanovi Nadzornog odbora ne mogu biti Clanovi drugih klupskih tijela. (2) Nadzorni odbor podnosi Skup&tini Kluba redovito godiSnje izvjeS\\u00e9e. (3) Skup&tina Kluba moze zahtijevati od Nadzornog odbora podnoSenje izvanrednog izvjeS\\u00e9a. Clanak 47, Nadine i uvjete svog rada Nadzorni odbor ureduje Poslovnikom. Clanak 48. (1) Clanove Nadzornog odbora na temelju samostainih kandidatura poslanih Izbornom povjerenstvu bira IzvrSni odbor na na@in propisan u Pravilniku o izborima. \\u00a7 liste prijavijenih kandidata prvo jednog \\u00e9lana Nadzornog odbora bira 10 \\u00e9lanova IzvrSnog odbora koje je izabrao Predsjednik, a zatim ostala dva \\u00e9lana Nadzornog odbora bira dva \\u00e9lana IzvrSnog odbora s druge liste koja sacinjava Skup&tinu. U slu\\u00e9aju da se ne prijavi dovoljno kandidata, Predsjednik Kluba predilaze kandidate Skup8&tini. (2) SkupStina razrjeSava Glanove Nadzornog odbora ako ne prihvati izvjes\\u00e9e Nadzornog odbora. (3) Odluku o neprihvacanju izvjeS\\u00e9a Nadzornog odbora, Skup&tina donosi ve\\u00e9inom glasova prisutnih Glanova Skup8tine. UPRAVA KLUBA Clanak 49. (1) Uprava Kluba vodi poslovanje Kluba i upravija radom stru\\u00e9nih sluzbi Kluba u skladu s ovim Statutom, opcim aktima Kluba te odlukama Skup\\u00a7tine i Izvr8nog odbora. (2) Upravu Kluba \\u00e9ine predsjednik Uprave Kluba i 2 do 4 \\u00e9lana koje bira IzvrSni odbor Kluba. Clanak 50. (1) Clanovi Uprave Kluba zastupaju Kiub u pravnom prometu bez ograni\\u00e9enja. (2) Clanovi Uprave Kluba zastupaju Klub u pravnom prometu na na\\u00e9in da najmanje 2 lana uprave potpisuju i zastupaju prema trecim osobama o svakom pitanju iz djelokruga Uprave, a prema Poslovniku o radu Uprave. (3) Mandat Clanova Uprave Kluba je 4 (\\u00e9etiri) godine. Clanak 51. Uprava Kluba: a. b. zamopa prediaze Izvr8nom odboru Pravilnik o djelokrugu i unutarnjem ustrojstvu Kluba; organizira obavijanje stru\\u00e9nih, tehni\\u00e9kih i pomo\\u00e9nih poslova Kluba i vodi poslovnu, sportsku i stru\\u00e9nu_politiku Kluba, za koje odgovara Izvr8nom odboru; samostalno sklapa pravne poslove do ukupnog iznosa 3 milijuna eura, a za vece ukupne iznose mora ishoditi prethodnu suglasnost Izvr8nog odbora, te poduzima druge pravne radnje u ime i za ra\\u00e9un Kluba; rukovodi i nadzire rad zaposlenika Kluba; brine se o provodenju odluka Skup\\u00a7tine i\", \"za koje odgovara Izvr8nom odboru; samostalno sklapa pravne poslove do ukupnog iznosa 3 milijuna eura, a za vece ukupne iznose mora ishoditi prethodnu suglasnost Izvr8nog odbora, te poduzima druge pravne radnje u ime i za ra\\u00e9un Kluba; rukovodi i nadzire rad zaposlenika Kluba; brine se o provodenju odluka Skup\\u00a7tine i Izvr$nog odbora; podnosi financijska godiSnja i druga izvjeS\\u00e9a Skup8&tini Kluba; donosi akte sukladno Statutu i odlukama klupskih tijela; osigurava redovito obavjeStavanje \\u00e9lanova Kluba o radu i rezultatima Kluba; upravija imovinom Kluba; sklapa ugovore i poduzima pravne radnje u ime i za ra\\u00e9un Kluba; utvrduje uvjete za sklapanje i raskid ugovora s igracima; donosi odiuke o organiziranju turnira, odigravanju prijateljskih utakmica te o mjestu i vremenu odrzavanja priprema igra\\u00e9a; donosi odluke o izvanrednom nagradivanju igraca i ostalih zaposlenika Kluba za postignute rezultate; prediaze Izvr8nom odboru godi&nji financijski ji poslovni plan te podnosi kvartaina izvjeS\\u00a2a o provedbi tog plana; obavija i druge poslove sukladno ovom Statutu i odlukama klupskih tijela; Clanak 52. (1) Za svoj rad i rad stru\\u00e9nih sluzbi Glanovi Uprave Kluba odgovorni su Izvr$nom odboru. (2) Clanovi Uprave Kluba ne mogu biti Clanovi drugih klupskih tijela. Clanak 53. Na\\u00e9ine i uvjete svog rada Uprava Kluba ureduje Poslovnikom uz suglasnost IzvrSnog odbora. RJESAVANJE SPOROVA I SUKOBA INTERESA Clanak 54. (1) Postupak pred Nadzornim odborom za rjeSavanje statutarnih i ostalih sporova te sukoba interesa moze zahtjevom pokrenuti svako klupsko tijelo, odnosno svaki lan Kluba ako smatra da postoji spor ili sukob interesa u Klubu. (2) Nadzorni odbor o zahtjevu odlu\\u00e9uje u roku od 60 dana od dana podnoSenja zahtjeva. (3) Nadzorni odbor u svom radu na odgovarajuci na\\u00e9in primjenjuje odredbe Zakona o mirenju. (4) Odluka Nadzornog odbora o sukobu interesa je kona\\u00e9na. (5) Ako pronade da postoji sukob interesa, Nadzorni odbor odreduje i na\\u00e9in razrjeSavanja utvrdenog sukoba interesa. (6) Sva klupska tijela mogu se obratiti Skup8tini za tuma\\u00e9enje odredbi Statuta i akata koje ona donosi. IMOVINA, NACIN STJECANJA I RASPOLAGANJE IMOVINOM Clanak 55. (1) Imovinu Kluba Gine: a. nov\\u00e9ana sredstva koja je Klub stekao uplatom Clanarina, dobrovoljnim prilozima i darovima; b. nov\\u00e9ana sredstva koja Klub stekne obavijanjem djelatnosti kojima se ostvaruju ciljevi, obavijanjem djelatnosti_ i gospodarske djelatnosti, financiranjem programa i projekata Kluba iz drZavnog prora\\u00e9una i prora\\u00e9una jedinica lokalne i podru\\u00e9ne (regionalne) samouprave te fondova i/ili iz inozemnih izvora; c. nekretnine i pokretne stvari Kluba; d. druga prava ustanovijena u korist Kluba. (2) Klub moze raspolagati svojom imovinom samo za ostvarivanje ciljeva i obavijanjem djelatnosti odredenih Statutom Kluba, u skladu sa zakonom. (3) ViSak prihoda nad rashodima koje Klub ostvari koristi se za osivarivanje ciljeva utvrdenih ovim Statutom. Clanak 56. (1) Odluke o stjecanju ili otudivanju pokretnina i nekretnina donosi Uprava Kluba. (2) Posiovne odluke u vezi kori8tenja financijskih sredstava tijlekom kalendarske godine provodi Uprava Kluba koja 0 tome izvje&\\u00e9uje Izvr8ni odbor. (3) Uprava Kluba odgovorna je za zakonitost kori$tenja i raspolaganja imovinom, a posebice financijskih sredstava Kluba. (4) Sva dokumentacija o materijaino-financijskom poslovanju Kluba Guva se u zakonskim rokovima sa posebnom paznjom u arhivi Kluba. PRESTANAK POSTOJANJA KLUBA Clanak 57. (1)\", \"godine provodi Uprava Kluba koja 0 tome izvje&\\u00e9uje Izvr8ni odbor. (3) Uprava Kluba odgovorna je za zakonitost kori$tenja i raspolaganja imovinom, a posebice financijskih sredstava Kluba. (4) Sva dokumentacija o materijaino-financijskom poslovanju Kluba Guva se u zakonskim rokovima sa posebnom paznjom u arhivi Kluba. PRESTANAK POSTOJANJA KLUBA Clanak 57. (1) Klub prestaje postojati odlukom Skup&tine u skladu s rezultatima provedenog referenduma, ili u drugim sluc\\u00e9ajevima predvidenim zakonom. (2) U slu\\u00e9aju prestanka postojanja Kluba preostala imovina pripada udruzi, ustanovi, zakladi ili drugoj pravnoj osobi koja ima iste ili sligne statutarne ciljeve, a prema odluci Skup&tine u skladu s rezultatima referenduma. Clanak 58. (1) Likvidatora Kluba imenuje i opoziva Skup$stina Kluba. (2) Likvidator zastupa Klub u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u registar udruga kao osoba ovlagtena za zastupanje Kluba do okon\\u00e9anja postupka likvidacije i brisanja Kluba iz registra udruga. (3) Osoba koja se bira za likvidatora treba imati potrebnu stru\\u00e9nost i iskustvo, s obzirom na nadleZnost likvidatora te ne smije imati zapreke iz \\u00e9l. 112. Zakona o sportu i Cl. 19. st. 2. 13. Zakona o udrugama. (4) Pokretanjem postupka likvidacije Kluba prestaju ovlaStenja tijela i osoba ovlagtenih Za zastupanje Kluba. (5) Postupak likvidacije Kluba provodi likvidator sukladno odredbama Zakona \\u00b0 udrugama. PRIJELAZNE | ZAVRSNE ODREDBE Clanak 59. (1) Statut stupa na snagu danom donogenja. (2) Op\\u00a2i akti i ostali potrebni akti Kluba vezani za izbore u Klubu moraju se usuglasiti s odredbama ovog Statuta, kao i ustrojiti Izborno povjerenstvo od strane Izvr&nog odbora sa\\u00e9injene prema prethodnom Statutu, prije datuma prvih izbora koji \\u00e9e ustrojiti tijela Kluba prema ovom Statutu. Tijela Kluba ustrojena po prethodnom Statutu djeluju do ustroja novih tijela Kluba prema ovom Statutu nakon prvih izbora u Klubu. U Zagrebu, 21.12.2023. Se sy\"]"