["REPUBLIKA HRVATSKA MINISTARSTVO PROSVJETE I ŠPORTA ___________________________________________________________ KONAČNI PRIJEDLOG ZAKONA O SPORTU ___________________________________________________ SRPANJ 2003. «A što mi mislimo o mladima i kako s njima postupamo čim počnu razlikovati bolje od gorega, i tijelom jačati, i odolijevati naporima, to ću ti sada izložiti, da shvatiš radi čega ih primoravamo da vježbaju svoje tijelo. Ne biva to samo radi nadmetanja, da bi mogli dobiti nagrade, jer za njima vrlo rijetki idu od sviju njih, nego time namjeravamo da u isti mah postignemo neko veće dobro i za cijelu državu i za njih same. Jer, sve dobre građane očekuje drugo neko zajedničko nadmetanje i vijenac, i to ne od omorike, ni od divlje masline, ni od selena, nego onaj koji obuhvaća u sebi svu ljudsku sreću, a pod time razumijevam slobodu svakog pojedinca i cijele domovine uopće, i bogatstvo, i slavu, i uživanje svetih svetkovina naslijeđenih od otaca, i spasenje obitelji, jednom riječju: sve najljepše što čovjek od bogova postići želi.» Solon prema Lukijanu _______________________________ Solon - atenski političar, zakonodavac, pjesnik, jedan od sedam grčkih mudraca, organizator odgoja mladeži, rođen oko 640. godine prije Krista. Godine 594. prije Krista izabran je za arhonta (najvišeg dužnosnika) Atene s ovlastima da provede reforme. Lukijan - grčki pisac rođen 125. godine prije Krista. B K O N A Č N I P R I J E D L O G Z A K O N A O S P O R T U K A Z A L O I. OPĆE ODREDBE ...................................................................................................... 1 II. SUSTAV SPORTA ..................................................................................................... 2 1 Amaterski sportski klub ............................................................................................... 2 2. Sportski savezi ............................................................................................................. 4 3. Sportske zajednice ........................................................................................................ 5 4. Studentski sport ............................................................................................................ 6 5. Sportska rekreacija ...................................................................................................... 6 6. Sport osoba s invaliditetom .......................................................................................... 7 7. Hrvatski olimpijski odbor ............................................................................................ 7 III. SPORT U ŠKOLI ...................................................................................................... 9 1. Školski sportski klubovi ................................................................................................ 9 2. Školski sportski savezi ................................................................................................. 10 3. Hrvatski školski sportski savez .................................................................................... 10 4. Sportska poduka djece i mladeži .................................................................................. 10 IV. SPORTAŠI I DRUGE OSOBE U SPORTU ........................................................... 11 V. STRUČNI POSLOVI U SPORTU .......................................................................... 13 VI. OBAVLJANJE SPORTSKIH DJELATNOSTI .................................................... 14 1. Uvjeti za obavljanje sportskih djelatnosti ..................................................................... 14 2. Obavljanje sportskih djelatnosti samostalnim radom ................................................... 15 3. Ustanove za obavljanje sportskih djelatnosti ................................................................ 16 4. Trgovačka društva za javne sportske objekte ............................................................... 17 5. Sportski obrti ................................................................................................................. 17 6. Trgovačka društva ........................................................................................................ 18 VII. PROFESIONALNI SPORTSKI KLUB ................................................................ 18 1. Pojam profesionalnog sportskog kluba i djelatnost ...................................................... 18 1.1. Temelj za osnivanje .............................................................................................. 18 1.2. Osnivači ............................................................................................................... 19 1.3. Temeljni kapital ................................................................................................... 19 1.4. Dionice ................................................................................................................. 19 1.5. Zabrana stjecanja dionica ................................................................................... 19 1.6. Povezane osobe .................................................................................................... 20 1.7. Ograničenja za stjecanje dionica ........................................................................ 20 1.8. Posljedice stjecanja dionica suprotno zabrani i ograničenjima .......................... 20 1.9. Upis u sudski registar .......................................................................................... 21 1.10. Dobit .................................................................................................................. 21 1.11.Ograničenja za članstvo u upravnom ili nadzornom odboru ............................. 21 C 2. Amaterski sportski klub – osnivač profesionalnog kluba .............................................. 22 3. Preoblikovanje amaterskog sportskog kluba u profesionalni klub ............................... 22 4. Javni poziv za upis", "ograničenjima .......................... 20 1.9. Upis u sudski registar .......................................................................................... 21 1.10. Dobit .................................................................................................................. 21 1.11.Ograničenja za članstvo u upravnom ili nadzornom odboru ............................. 21 C 2. Amaterski sportski klub – osnivač profesionalnog kluba .............................................. 22 3. Preoblikovanje amaterskog sportskog kluba u profesionalni klub ............................... 22 4. Javni poziv za upis dionica i rokovi .............................................................................. 22 5. Vjerovnici amaterskog kluba ......................................................................................... 23 6. Utvrđivanje stanja imovine i obveza amaterskog i profesionalnog kluba .................... 23 7. Posebna ograničenja u podmirivanju obveza profesionalnog kluba ........................... 24 8. Povjerenstvo za profesionalne sportske klubove ........................................................... 24 VIII. SPORTSKA NATJECANJA ................................................................................. 25 1. Sustav sportskih natjecanja ........................................................................................... 25 2. Posebna zdravstvena zaštita sportaša ........................................................................... 28 3. Povjerenstvo za borbu protiv droge u sportu ................................................................ 29 IX. SPORTSKI OBJEKTI .............................................................................................. 29 X. FINANCIRANJE SPORTA ..................................................................................... 33 XI. SPORTSKE ZAKLADE I SPORTSKE FUNDACIJE .......................................... 35 XII. NACIONALNI PROGRAM SPORTA .................................................................. 36 XIII. EVIDENCIJE I INFORMACIJSKI SUSTAV U SPORTU ............................... 37 XVI. UPRAVNI, INSPEKCIJSKI I STRUČNI NADZOR ......................................... 37 1. Upravni nadzor ............................................................................................................. 37 2. Inspekcijski nadzor u sportu ......................................................................................... 37 3. Nadzor nad stručnim radom u sportu ............................................................................ 38 XV. DRŽAVNA NAGRADA SPORTA «FRANJO BUČAR» .................................... 38 XVI. KAZNENE ODREDBE ........................................................................................ 39 XVII. PRIJELAZNE I ZAVRŠNE ODREDBE ............................................................ 44 OBRAZLOŽENJE KONAČNOG PRIJEDLOGA ZAKONA O SPORTU ……….. I I. RAZLOZI ZBOG KOJIH SE ZAKON DONOSI ......................................................... I II. PITANJA KOJA SE UREĐUJU ZAKONOM ............................................................. VII III. OBRAZLOŽENJE POJEDINIH ODREDBI ZAKONA.. .......................................... VIII IV. SREDSTVA POTREBNA ZA PROVEDBU ZAKONA ........................................... XVIII V. RAZLIKE IZMEĐU RJEŠENJA KOJA SE PREDLAŽU KONAČNIM PRIJEDLOGOM ZAKONA U ODNOSU NA RJEŠENJA IZ PRIJEDLOGA ZAKONA ......................................................................................... XVIII VI. PRIJEDLOZI I MIŠLJENJA NA PRIJEDLOG ZAKONA KOJE PREDLAGATELJ NIJE PRIHVATIO ................................................. XX D KONAČNI PRIJEDLOG ZAKONA O SPORTU I. OPĆE ODREDBE Članak 1. Zakonom o sportu uređuje se sport kao djelatnost kojom se djeci, mladeži i odraslima omogućuje zadovoljavanje potreba za kretanjem i igrom, razvoj sposobnosti, osobina i sportskih znanja, sportsko izražavanje i stvaralaštvo, očuvanje i unapređivanje psihofizičkih sposobnosti i postizanje sportskih rezultata na svim razinama natjecanja. Članak 2. (1) Sportska djelatnost, u smislu ovoga Zakona, je: - sportska poduka; - trening i natjecanja sportaša; - sportska rekreacija. (2) Sportskom djelatnošću smatraju se i: - organizirane izvannastavne i izvanškolske učeničke i studentske sportske aktivnosti; - organiziranje i vođenje natjecanja; - organizirane sportske aktivnosti osoba s invaliditetom. Članak 3. (1) Sport kao djelatnost zasniva se na načelima dobrovoljnosti, partnerstva, sposobnosti i etičnosti te stručnim i znanstvenim spoznajama. (2) Sport mora biti dostupan svima bez obzira na rasu, boju kože, spol, vjeru, nacionalnost, društveni položaj, političko ili drugo uvjerenje. Članak 4. zbog: Sport kao društvena djelatnost od osobitog je interesa za Republiku Hrvatsku, posebno - značenja za odgoj i skladan razvoj djece i mladeži; - višestruke vrijednosti amaterskog bavljenja sportom i dragovoljnog rada u sportu; - sustavnog usmjeravanja sportaša i stvaranja uvjeta za postizanje vrhunskih sportskih rezultata; - potreba i interesa odraslih za sportskom rekreacijom i pozitivnog djelovanja na zaštitu i poboljšanje zdravlja; - pozitivnog djelovanja na kvalitetu života osoba s invaliditetom. Članak 5. (1) Republika Hrvatska razvoj sporta osobito osigurava:", "dragovoljnog rada u sportu; - sustavnog usmjeravanja sportaša i stvaranja uvjeta za postizanje vrhunskih sportskih rezultata; - potreba i interesa odraslih za sportskom rekreacijom i pozitivnog djelovanja na zaštitu i poboljšanje zdravlja; - pozitivnog djelovanja na kvalitetu života osoba s invaliditetom. Članak 5. (1) Republika Hrvatska razvoj sporta osobito osigurava: - utvrđivanjem strategije razvoja sporta; - donošenjem Nacionalnog programa sporta; - podupiranjem dragovoljnog rada u sportu; - školovanjem, osposobljavanjem i usavršavanjem stručnih kadrova; - odgojno-obrazovnim i znanstveno-istraživačkim radom; 1 - propisivanjem stimulativnih gospodarskih mjera te poreznih i drugih olakšica; - poticanjem i stimuliranjem partnerstva vladinih i nevladinih organizacija u sportu; - izgradnjom i održavanjem sportskih objekata; - financijskim sredstvima iz proračuna na državnoj, lokalnoj i područnoj (regionalnoj) - drugim izvorima financiranja, posebice od igara na sreću i nagradnih igara. (2) Lokalna i područna (regionalna) samouprava potiče i pomaže sport, a osobito u razini; stvaranju uvjeta za svakodnevno bavljenje sportom djece i mladeži. (3) Pravne i fizičke osobe u obavljanju sportskih djelatnosti dužne su promicati i ostvarivati odgojne, humane, sociološko-kulturne i zdravstvene vrijednosti sporta. Članak 6. Na odnose u sportu, koji nisu uređeni ovim Zakonom, drugim zakonima i drugim propisima donesenim na temelju ovoga Zakona, primjenjuju se opći akti nacionalnih sportskih saveza, Hrvatskoga olimpijskog odbora i pravila međunarodnih sportskih udruženja za pojedini sport te načela i pravila olimpijskog pokreta i Međunarodnoga olimpijskog odbora, kao i norme sportske etike i morala. II. SUSTAV SPORTA Članak 7. (1) Sustav sporta u Republici Hrvatskoj čine amaterski i profesionalni sportski klubovi, sportske udruge, sportska udruženja, sportski savezi, sportske zajednice i Hrvatski olimpijski odbor. (2) Dio sustava sporta su i školski sportski klubovi, školski sportski savezi, studentske sportske udruge, ustanove za obavljanje sportskih djelatnosti, trgovačka društva za javne sportske objekte te visoka učilišta za školovanje kadrova u sportu. (3) Amaterski sportski klubovi, sportski savezi, sportske zajednice, studentske sportske udruge, društva sportske rekreacije, sportske udruge i sportski klubovi osoba s invaliditetom, školski sportski savezi i Hrvatski olimpijski odbor neprofitne su pravne osobe i imaju pravni status udruge. (4) Na osnivanje, registraciju, pravni položaj i prestanak udruga iz stavka 3. ovoga članka primjenjuju se odredbe Zakona o udrugama, ako ovim Zakonom za pojedinu udrugu nije drukčije određeno. (5) Pravne i fizičke osobe obavljaju sportske djelatnosti u skladu s ovim Zakonom i zakonima po kojima se osnivaju i registriraju. (6) Pravne osobe iz sustava sporta vode evidenciju svojih članova. (7) Članovi pravnih osoba iz stavka 3. ovoga članka imaju, u skladu s općim aktom tih pravnih osoba, pravo na: olakšice pri korištenju sportskih objekata, usluge sportskih stručnjaka, namirenje putnih troškova, dnevnica, troškova smještaja i prehrane, naknadu izgubljene zarade te stručno usavršavanje. 1. Amaterski sportski klub Članak 8. (1) Radi obavljanja djelatnosti treninga, priprema i natjecanja sportaša u određenom sportu osnivaju se amaterski sportski klubovi (u daljnjem tekstu: sportski klub). 2 (2) U obavljanju sportskih djelatnosti sportski klubovi imaju odgojne, sociološko- kulturne i humane zadaće. (3) Sportski klub može osnovati i jedna pravna osoba. (4) Sportski klub u svom nazivu može umjesto riječi «klub» rabiti riječ «društvo». Članak 9. U", "osnivaju se amaterski sportski klubovi (u daljnjem tekstu: sportski klub). 2 (2) U obavljanju sportskih djelatnosti sportski klubovi imaju odgojne, sociološko- kulturne i humane zadaće. (3) Sportski klub može osnovati i jedna pravna osoba. (4) Sportski klub u svom nazivu može umjesto riječi «klub» rabiti riječ «društvo». Članak 9. U tijelima sportskog kluba ne mogu biti i imati ovlasti u zastupanju vlasnici sportskih kladionica i menadžeri sportaša, kao i osobe koje su to bile u posljednjih pet godina. Članak 10. (1) Imovinu sportskog kluba čine novčana sredstva, nepokretne i pokretne stvari i imovinska i neimovinska prava. (2) Sredstva koja su osnivači i članovi sportskog kluba unijeli u klub po bilo kojoj osnovi imovina su sportskog kluba. (3) Sportski klub je neprofitna udruga. (4) Sportski klub ne smije obavljati djelatnosti radi stjecanja dobiti za svoje osnivače, članove ili treće osobe. (5) Sportski klub odgovara za obveze svojom cjelokupnom imovinom. (1) Sportski klub određuje visinu članarine svojim aktom koji mora biti dostupan u Članak 11. sjedištu kluba. (2) Sportski klub u strukovnim i sportskim pitanjima djeluje prema općim aktima nacionalnoga sportskog saveza čiji je član. Članak 12. (1) Nastupi sportaša amatera i sportaša profesionalaca u sportskim klubovima uređuju se općim aktima nacionalnih sportskih saveza. (2) U ekipi amaterskog sportskog kluba momčadskog sporta istovremeno može nastupati (igrati) najviše 50% igrača sa statusom sportaša profesionalca. Članak 13. Sportski klub može promijeniti status u profesionalni sportski klub u skladu s uvjetima i prema postupku propisanom ovim Zakonom. (1) Radi ostvarivanja zajedničkih interesa i ciljeva mogu se osnivati udruge u sportu Članak 14. kojima osnovni cilj djelovanja nije sudjelovanje u sportskim natjecanjima. (2) Svoje udruge mogu osnivati sportski suci i delegati, sportaši, sportski treneri te učitelji i instruktori i druge stručne osobe u sportu te navijači.. (3) Svoje udruge mogu osnivati i profesionalni sportski klubovi istog sporta i članovi su pripadajućeg nacionalnog sportskog saveza. (4) Radi ostvarivanja zajedničkih sportskih interesa sportski klubovi različitih sportova mogu se udruživati u sportska društva (korištenje sportskog objekta i dr.). 3 Članak 15. (1) Osnivači udruga sportskih sudaca, trenera, učitelja, instruktora i drugih stručnih osoba u sportu mogu biti i sportski savezi. (2) Udruge iz stavka 1. ovoga članka članovi su pripadajućeg sportskog saveza. 2. Sportski savezi Članak 16. (1) Radi ostvarivanja zajedničkih interesa u pojedinom sportu osnivaju se sportski savezi. (2) Članovi sportskih saveza su sportski klubovi iz istog sporta. (3) Sportski savezi u gradovima mogu se osnivati ako na njihovu području djeluju najmanje tri sportska kluba istog sporta. (4) Sportski savezi u županijama i Gradu Zagrebu osnivaju se ako na njihovu području djeluju najmanje tri sportska kluba odnosno sportska saveza istog sporta. (5) Klubovi iz dvije i više županija u kojima ne postoje uvjeti za osnivanje sportskih saveza mogu osnivati međužupanijske saveze. (6) Nacionalni sportski savez osniva se ako na teritoriju Republike Hrvatske djeluju najmanje tri kluba odnosno dva sportska saveza istog sporta. (7) Članovi županijskih sportskih saveza su gradski sportski savezi i sportski klubovi istog sporta s područja županije. (8) Članovi nacionalnih sportskih saveza su sportski savezi županija,", "osnivati međužupanijske saveze. (6) Nacionalni sportski savez osniva se ako na teritoriju Republike Hrvatske djeluju najmanje tri kluba odnosno dva sportska saveza istog sporta. (7) Članovi županijskih sportskih saveza su gradski sportski savezi i sportski klubovi istog sporta s područja županije. (8) Članovi nacionalnih sportskih saveza su sportski savezi županija, Grada Zagreba i gradova i sportski klubovi istog sporta u Republici Hrvatskoj. (9) U Republici Hrvatskoj, županiji, Gradu Zagrebu i gradu za jedan sport može se osnovati samo jedan sportski savez. (10) U slučaju dvojbe što se smatra istim sportom, odnosno da li je neka aktivnost sport mišljenje daje Hrvatski olimpijski odbor. Članak 17. (1) Sportski savezi, u svom djelokrugu na odgovarajućoj razini, osobito: potiču i promiču odgovarajući sport, odnosno sportsku aktivnost, usklađuju aktivnosti svojih članica, organiziraju i provode sustav natjecanja, uređuju pitanja koja se odnose na registraciju sportaša, status sportaša i drugih sportskih djelatnika te stegovnu odgovornost sportaša i sportskih djelatnika, skrbe se o unapređenju stručnog rada i osposobljavanju stručnih djelatnika te unapređenju sportskih dostignuća, skrbe se o darovitim i vrhunskim sportašima, surađuju s nadležnim tijelima za sport pri Oružanim snagama Republike Hrvatske, obavljaju i druge poslove i zadaće određene ovim Zakonom i općim aktima nacionalnoga sportskog saveza. (2) Nacionalni sportski savezi, osim zadaća iz stavka 1. ovoga članka, izrađuju strategiju razvoja svoga sporta, organiziraju nacionalna sportska prvenstva, skrbe se o nacionalnoj sportskoj ekipi, te predstavljaju svoj sport pred odgovarajućim međunarodnim sportskim udruženjima. registraciju sportaša, status sportaša, (3) Nacionalni sportski savezi svojim općim aktima uređuju pitanja koja se odnose na: - - - prava i obveze sportaša amatera, - prava i obveze darovitih i vrhunskih sportaša, - prava i obveze sportaša profesionalaca, - promjene statusa sportaša, 4 - način i uvjete te prava i obveze amaterskih sportskih klubova kod prelaska sportaša iz kluba u klub (transfer sportaša) i visine naknada, - prava nastupa stranaca za hrvatske klubove, - prava i obveze osoba u funkciji sporta (sportskih sudaca, sportskih delegata, sportskih povjerenika i sl.), stegovne odgovornosti sportaša i osoba u funkciji sporta, - - prava dragovoljaca u sportu, - uvjete, kriterije, prava i obveze fizičkih i pravnih osoba u zastupanju sportsko- natjecateljskih interesa sportaša (menadžeri sportaša), uvjete i način stjecanja statusa menadžera sportaša i Evidencije menadžerskih ugovora i te vođenje Evidencije menadžera sportaša - druga pitanja koja proizlaze iz ovoga Zakona. (4) Nacionalni sportski savezi vode evidenciju amaterskih i profesionalnih sportskih klubova. Članak 18. (1) U skupštini i izvršnom tijelu sportskog saveza može biti najviše 10 % delegata iz reda osoba koje poslovima i aktivnostima mogu neposredno utjecati na uvjete, sustav i regularnost sportskih natjecanja (sportski suci, sportski delegati, sportski povjerenici i sl.), kao i osoba koje su to bile u posljednjih pet godina. (2) U skupštini i izvršnom tijelu sportskog saveza ne mogu biti i imati ovlasti u zastupanju vlasnici sportskih kladionica i menadžeri sportaša, kao i osobe koje su to bile u posljednjih pet godina. 3. Sportske zajednice Članak 19. (1) Radi ostvarivanja zajedničkih interesa u sportu, na području jedinica lokalne i područne (regionalne) samouprave osnivaju se sportske", "sportskog saveza ne mogu biti i imati ovlasti u zastupanju vlasnici sportskih kladionica i menadžeri sportaša, kao i osobe koje su to bile u posljednjih pet godina. 3. Sportske zajednice Članak 19. (1) Radi ostvarivanja zajedničkih interesa u sportu, na području jedinica lokalne i područne (regionalne) samouprave osnivaju se sportske zajednice. (2) Članovi sportskih zajednica u županijama, Gradu Zagrebu, gradovima i općinama su svi sportski savezi, javne ustanove za upravljanje sportskim objektima i trgovačka društva za javne sportske objekte s njihova područja. (3) Sportski klubovi iz gradova i općina u kojima nema uvjeta za osnivanje sportskih saveza ili nisu osnovani sportski savezi, članovi su sportskih zajednica iz stavka 2. ovoga članka. (4) Članovi sportskih zajednica mogu biti i druge pravne osobe čija je djelatnost značajna za sport i u vezi sa sportom. Članak 20. Sportske zajednice u svom djelokrugu: - sudjeluju u izradi strategije razvoja sporta, utvrđivanju politike sporta i ostvaruju politiku promicanja sporta na svom području; - potiču i promiču sport, osobito sport djece i mladeži; - usklađuju aktivnosti svojih članova; - objedinjuju i usklađuju programe sporta te predlažu program javnih potreba u sportu i skrbe se o njegovu ostvarivanju; 5 - skrbe se o darovitim i vrhunskim sportašima i svojim aktima uređuju njihova prava te sudjeluju u stvaranju uvjeta za njihovu pripremu za olimpijske igre, svjetska i europska prvenstva te druga velika međunarodna natjecanja; - surađuju u ostvarivanju programa Hrvatskoga olimpijskog odbora; - sudjeluju u unapređivanju stručnog rada u sportu i brinu se o školovanju, stručnom osposobljavanju i usavršavanju te zapošljavanju stručnih radnika u svojim članicama; - sudjeluju u programima sportske poduke djece i mladeži; - skrbe se o posebnoj zdravstvenoj zaštiti sportaša na svom području; - sudjeluju u skrbi o javnim sportskim objektima; - obavljaju i druge poslove i zadaće određene ovim Zakonom, pravilima Hrvatskoga olimpijskog odbora i njihovim općim aktima. 4. Studentski sport Članak 21. (1) Na visokim učilištima osnivaju se studentske sportske udruge. (2) Studentske sportske udruge udružuju se u studentske sportske saveze koji uspostavljaju sustav sportskih natjecanja u skolpu jednog sveučilišta ili drugih visokoškolskih ustanova. (3) Studentski sportski savezi osnivaju Hrvatski studentski sportski savez koji utvrđuje i i predstavlja hrvatski studentski sport u organizira nacionalna studentska natjecanja međunarodnim studentskim sportskim udruženjima. (4) Aktivnost studentskih sportskih udruga financira se iz članarina, proračuna visokih učilišta, iz sredstava sveučilišta, sveučilišnih studentskih sportskih saveza i Hrvatskoga studentskoga sportskog saveza te iz državnog proračuna i proračuna jedinica područne (regionalne) samouprave te drugih izvora u skladu sa zakonom. (5) Na djelokrug i zadaće Hrvatskoga studentskoga sportskog saveza na odgovarajući način se primjenjuju odredbe članka 17. ovoga Zakona. (6) Upravno vijeće visokih učilišta utvrđuje pod kojim uvjetima studentske sportske udruge mogu za obavljanje svojih aktivnosti koristiti prostor visokih učilišta. 5. Sportska rekreacija Članak 22. (1) Radi zadovoljavanja potreba za očuvanjem, održavanjem, poboljšanjem i unapređenjem psihofizičkih sposobnosti i zdravlja te osmišljavanja slobodnog vremena, vježbanjem i bavljenjem sportskim aktivnostima, građani mogu osnivati sportske udruge kao društva sportske rekreacije. (2) Osnivač udruga iz stavka 1. ovoga članka može biti i jedna pravna osoba. (3)", "rekreacija Članak 22. (1) Radi zadovoljavanja potreba za očuvanjem, održavanjem, poboljšanjem i unapređenjem psihofizičkih sposobnosti i zdravlja te osmišljavanja slobodnog vremena, vježbanjem i bavljenjem sportskim aktivnostima, građani mogu osnivati sportske udruge kao društva sportske rekreacije. (2) Osnivač udruga iz stavka 1. ovoga članka može biti i jedna pravna osoba. (3) U županijama se osnivaju savezi sportske rekreacije kao «sport za sve» ako se udruže najmanje tri društva ili udruge sportske rekreacije iz općina ili gradova. (4) Hrvatski savez sportske rekreacije – «Sport za sve» osniva se kao nacionalni sportski savez u koji se udružuju savezi sportske rekreacije županija, Grada Zagreba, te gradski i općinski savezi iz županija u kojima nisu osnovani županijski savezi. (5) Na djelokrug i zadaće Hrvatskog saveza sportske rekreacije – «Sport za sve» na odgovarajući način se primjenjuju odredbe članka 17. ovoga Zakona. (6) Članovi društava i saveza sportske rekreacije mogu biti i druge pravne i fizičke osobe koje se bave sportskom rekreacijom ili je njihova djelatnost vezana uz sportsku rekreaciju. 6 6. Sport osoba s invaliditetom Članak 23. (1) Radi pozitivnog djelovanja sporta na kvalitetu života osoba s invaliditetom, te poticanja i provođenja sportsko-rekreativnih aktivnosti i sportskih natjecanja osoba s invaliditetom mogu se osnivati sportske udruge ili sportski klubovi osoba s invaliditetom. (2) Sportske udruge i sportski klubovi iz stavka 1. ovoga članka mogu se udruživati po sportovima i po vrstama invaliditeta koje priznaje Hrvatski paraolimpijski odbor i Hrvatski športski savez gluhih, Međunarodni paraolimpijski odbor, Međunarodni olimpijski odbor gluhih i druga međunarodna sportska udruženja osoba s invaliditetom. (3) Sportske udruge i sportski klubovi iz stavka 1. ovoga članka udružuju se u sportske saveze osoba s invaliditetom na razini županije, Grada Zagreba i u nacionalne sportske saveze osoba s invaliditetom. (4) Sportski savezi iz stavka 3. ovog članka udružuju se u Hrvatski paraolimpijski odbor, osim Hrvatskog športskog saveza gluhih i Specijalne olimpijade. (5) Ustanove i druge pravne osobe za provođenje specifičnih sportsko-rekreativnih aktivnosti osoba s invaliditetom udružuju se u Specijalnu olimpijadu Hrvatske sa statusom nacionalnog sportskog saveza. (6) Hrvatski paraolimpijski odbor i nacionalni sportski savezi osoba s invaliditetom iz stavka 4. ovog članka općim aktom uspostavljaju sustav, uvjete i organizaciju sportskih natjecanja osoba s invaliditetom i svoje vrste invaliditeta u skladu s odredbama ovoga Zakona, pravilima sporta i normama međunarodnih sportskih udruženja osoba s invaliditetom, sudjeluju u međunarodnim sportskim pokretima osoba s invaliditetom i udružuju se u odgovarajuća međunarodna sportska udruženja osoba s invaliditetom, skrbe o pripremama i sudjelovanju na paraolimpijskim igrama, svjetskim, europskim i sličnim prvenstvima i igrama osoba s invaliditetom te sudjeluju u njihovu organiziranju. (7) Na udruživanje sportskih udruga, sportskih klubova i sportskih saveza iz ovoga članka, na odgovarajući način primjenjuju se odredbe članaka 16. i 19. ovoga Zakona. (8) Na djelokrug i zadaće nacionalnih sportskih saveza osoba s invaliditetom iz ovog članka, na odgovarajući način se primjenjuju odredbe članka 17. ovoga Zakona. 7. Hrvatski olimpijski odbor Članak 24. (1) Hrvatski olimpijski odbor je najviša nevladina nacionalna sportska udruga. (2) U Hrvatski olimpijski odbor udružuju se nacionalni sportski savezi i sportske zajednice županija i", "nacionalnih sportskih saveza osoba s invaliditetom iz ovog članka, na odgovarajući način se primjenjuju odredbe članka 17. ovoga Zakona. 7. Hrvatski olimpijski odbor Članak 24. (1) Hrvatski olimpijski odbor je najviša nevladina nacionalna sportska udruga. (2) U Hrvatski olimpijski odbor udružuju se nacionalni sportski savezi i sportske zajednice županija i Grada Zagreba. (3) U Hrvatski olimpijski odbor mogu se udružiti i druge udruge i pravne osobe važne za razvoj i promicanje sporta u Republici Hrvatskoj. (4) Hrvatski olimpijski odbor u svom djelokrugu stvara uvjete za nesmetan razvoj sporta i olimpijskog pokreta u Republici Hrvatskoj. Hrvatski olimpijski odbor svoje djelovanje temelji na načelima olimpijskog pokreta, Olimpijske povelje Međunarodnoga olimpijskog odbora te na potrebama hrvatskoga sporta. Članak 25. 7 Članak 26. Hrvatski olimpijski odbor u svom djelokrugu osobito: - potiče, promiče i prati sport u Republici Hrvatskoj; - sudjeluje u utvrđivanju i ostvarivanju politike promicanja sporta u Republici Hrvatskoj; - predlaže i provodi program javnih potreba u sportu u Republici Hrvatskoj; - predlaže dugoročne programe razvoja hrvatskog sporta; - skrbi se o načelima zaštite okoliša; - sudjeluje u organiziranju olimpijskih igara i drugih važnih međunarodnih sportskih natjecanja i priredbi; - usklađuje aktivnosti nacionalnih sportskih saveza i sportskih zajednica županija i Grada Zagreba na ostvarivanju ukupnog programa sporta; - provodi međunarodna sportska pravila i donosi akte u vezi s njihovom primjenom; - skrbi se o promicanju vrhunskih sportskih dostignuća hrvatskih sportaša i njihovu sudjelovanju u nacionalnim sportskim ekipama na olimpijskim i sredozemnim igrama, svjetskim i europskim prvenstvima te drugim velikim natjecanjima i priredbama; - djeluje na promicanju stručnog rada u sportu i sudjelujesudjeluju u školovanju, osposobljavanju i usavršavanju stručnih djelatnika u sportu; - osigurava kadrovske i materijalne uvjete i organizira istraživačko-razvojni rad u sportu; - skrbi o zdravstvenoj zaštiti sportaša; - surađuje s nadležnim tijelima za sport pri Oružanim snagama Republike Hrvatske; - sportom promiče povezivanje Republike Hrvatske s drugim državama i narodima; - skrbi se o širenju olimpijskih načela, etičkih i moralnih normi u sportu; - skrbi se o načinu uporabe i zaštiti simbola i obilježja Međunarodnoga olimpijskog odbora i Hrvatskoga olimpijskog odbora; - predstavlja hrvatski sport pred Međunarodnim olimpijskim odborom i odgovarajućim međunarodnim sportskim organizacijama i udruženjima; - obavlja i druge zadaće koje su utvrđene ovim Zakonom i drugim propisima. Članak 27. (1) Pri Hrvatskom olimpijskom odboru djeluje stalno izborno sudište (Sportska arbitraža) kao samostalno i nezavisno tijelo za rješavanje sporova u vezi sa sportom. (2) Sportska arbitraža odlučuje o zahtjevu za izvanredno preispitivanje odluka sportskih saveza, sportskih zajednica, sportskih klubova i drugih sportskih udruga protiv kojih su iscrpljena ili ne postoje druga sredstva pravne zaštite, a radi se o sporu ili pitanju važnom za izvršavanje njihovih poslova i zadaća i poslova i zadaća Hrvatskog olimpijskog odbora iz ovoga Zakona. (3) Sportsko arbitražno sudište odlučuje o zahtjevu pravnih i fizičkih osoba koje obavljaju sportsku djelatnost, a koje su ugovorile nadležnost tog sudišta u sporovima nastalim u vezi s obavljanjem sportske djelatnosti, te o pravima kojima mogu slobodno raspolagati ako zakonom nije određeno da za odlučivanje o određenoj vrsti tih sporova postoji", "Sportsko arbitražno sudište odlučuje o zahtjevu pravnih i fizičkih osoba koje obavljaju sportsku djelatnost, a koje su ugovorile nadležnost tog sudišta u sporovima nastalim u vezi s obavljanjem sportske djelatnosti, te o pravima kojima mogu slobodno raspolagati ako zakonom nije određeno da za odlučivanje o određenoj vrsti tih sporova postoji isključiva nadležnost redovnog suda. (4) Općim aktima Hrvatskoga olimpijskog odbora pobliže se uređuje nadležnost, sastav i ustroj Sportske arbitraže te pravila o postupku. 8 III. SPORT U ŠKOLI Članak 28. Sport u školi, u smislu ovoga Zakona, su organizirane sportske aktivnosti u ustanovama predškolskog odgoja te sportske aktivnosti školskih sportskih klubova i sportska poduka u školama. Članak 29. (1) U ustanovama predškolskog odgoja posebno se potiču organizirane tjelesne aktivnosti djece po posebnim sportskim programima u funkciji razvoja motoričkih znanja i sposobnosti, povoljnog utjecaja na rast i razvoj ličnosti i pozitivnog usmjeravanja interesa za sportskim aktivnostima. (2) U školama se posebno potiču organizirane izvannastavne i izvanškolske sportske aktivnosti učenica i učenika. Članak 30. Državna tijela, tijela jedinica lokalne i područne (regionalne) samouprave dužna su zajedno i u suradnji sa sportskim savezima, zajednicama i klubovima stvarati organizacijske, prostorne, financijske, stručne i druge uvjete za bavljenje sportom djece i mladeži. 1. Školski sportski klubovi Članak 31. (1) Radi izvannastavnog bavljenja sportom učenica i učenika (dalje: učenika), u školama se osnivaju školski sportski klubovi ili školska sportska društva koja nemaju status pravne osobe. (2) Organizirano izvannastavno bavljenje sportom učenika provodi se u sportskim sekcijama školskih sportskih klubova odnosno školskih sportskih društava (dalje: školski klub). Članak 32. (1) Školske klubove osnivaju škole s temeljnim ciljem uključivanja što više učenika u sportske aktivnosti. Svoje aktivnosti provode sukladno ovom zakonu i propisima kojima se uređuje osnovno odnosno srednje školstvo. (2) Škole osiguravaju sudjelovanje učenika u radu školskih klubova i donošenju odluka o organizaciji njihovih sportskih aktivnosti. (3) Ministar nadležan za poslove prosvjete i sporta propisuje način rada i djelovanja školskih klubova. Članak 33. (1) Aktivnosti, odnosno rad školskih klubova financira se: - iz proračuna jedinica lokalne i područne (regionalne) samouprave sredstvima namijenjenim školstvu i sportu iz sredstava državnog proračuna; - neposrednim potporama, prilozima, darovima i sponzorstvom u novcu, sredstvima i uslugama te iz drugih izvora dopuštenih zakonima i propisima. (2) Novčana i druga sredstva za aktivnosti i rad školskog kluba izdvajaju se na račun škole, a mogu se upotrebljavati isključivo za rad i djelovanje školskog kluba. 9 2. Školski sportski savezi Članak 34. (1) Radi izvanškolskih sportskih aktivnosti školskih klubova i provođenja školskih sportskih natjecanja u županijama i Gradu Zagrebu osnivaju se školski sportski savezi sa statusom udruge. (2) Školski sportski savezi mogu se osnivati i u gradovima s pet ili više škola. (3) Osnivači školskih sportskih saveza mogu biti samostalno ili u suradnji: škole, sportske zajednice i gradovi. (4) U županiji, Gradu Zagrebu i gradu može se osnovati samo jedan školski sportski savez. (5) Temeljne zadaće školskih sportskih saveza su da u suradnji sa školama i tijelima jedinica lokalne i područne (regionalne) samouprave nadležnim za prosvjetu i sport, sportskim savezima i sportskim zajednicama iz ovoga Zakona", "i gradovi. (4) U županiji, Gradu Zagrebu i gradu može se osnovati samo jedan školski sportski savez. (5) Temeljne zadaće školskih sportskih saveza su da u suradnji sa školama i tijelima jedinica lokalne i područne (regionalne) samouprave nadležnim za prosvjetu i sport, sportskim savezima i sportskim zajednicama iz ovoga Zakona potiču, prate i pomažu aktivnosti školskih klubova te organiziraju i provode njihova natjecanja. Školski sportski savezi planiraju i provode školska sportska natjecanja poštujući interes školskih klubova i programe sportske poduke. (6) Školski sportski savezi imaju i druge zadaće sukladne s temeljnim ciljevima, a posebice da surađuju sa sportskim zajednicama i sportskim savezima u pripremi i provedbi programa sportske poduke. (7) Školski sportski savezi udružuju se u sportske zajednice iz članka 19. ovoga Zakona na svom području radi izvršenja zadaća iz stavka 5. i 6. ovoga članka. (8) Djelatnost školskih sportskih saveza financira se iz proračuna županija, Grada Zagreba i gradova, sredstvima namijenjenim školstvu i sportu. 3. Hrvatski školski sportski savez Članak 35. (1) Radi unapređivanja sporta djece i mladeži, razvojne funkcije školskog sporta te radi usklađivanja djelovanja i ostvarivanja zajedničkih interesa školskih sportskih klubova i saveza pri ministarstvu nadležnom za poslove sporta ustrojava se Hrvatski školski sportski savez. (2) Način rada, ustroj, djelokrug, položaj, status i druga pitanja Hrvatskog školskog sportskog saveza pravilnikom uređuje ministar nadležan za poslove prosvjete i sporta. (3) Temeljne zadaće Hrvatskoga školskoga sportskog saveza su: utvrđivanje jedinstvenog sustava natjecanja školskih klubova u Republici Hrvatskoj, skrb o izjednačavanju i poboljšanju uvjeta rada školskih klubova, organizacija i provedba državnih školskih sportskih natjecanja, usklađivanje rada županijskih i gradskih školskih sportskih saveza te skrb o statusu školskog sporta u sustavu obrazovanja i sustavu sporta i suradnja s nacionalnim sportskim savezima u izvršavanju zadaća. (4) Hrvatski školski sportski savez član je Hrvatskoga olimpijskog odbora. (5) Aktivnosti, poslovi i djelatnosti koje se odnose na zadaće Hrvatskoga školskoga sportskog saveza financiraju se sredstvima iz državnog proračuna preko ministarstva nadležnog za poslove sporta. 4. Sportska poduka djece i mladeži Članak 36. (1) Sportska poduka djece i mladeži je priprema, trening i natjecanje učenica i učenika za sustavno bavljenje sportom. 10 (2) Programe sportske poduke djece i mladeži provode sportski klubovi, savezi i zajednice u suradnji sa školskim klubovima i školskim sportskim savezima te druge pravne i fizičke osobe registrirane za sportsku djelatnost sportske poduke ili treninga sportaša. (3) Program sportske poduke djece i mladeži dio je programa javnih potreba u sportu županije, grada odnosno općine koji sportska zajednica županije, grada i općine usklađuje i ujedinjuje, predlaže i skrbi se o njegovoj provedbi. Članak 37. (1) Program sportske poduke, u dijelu u kojem se djecu uvodi u sportsko vježbanje prije odabira sporta i neovisno o darovitosti djece, ponajprije provode školski klubovi. (2) Program sportske poduke koji je dio programa javnih potreba u sportu prioritetan je u pravu korištenja školskih sportskih prostora i odabiru korisnika tih sportskih prostora, jednako kao i programi školskih klubova. IV. SPORTAŠI I DRUGE OSOBE U SPORTU Članak 38. Sportašica i sportaš (u daljnjem tekstu: sportaš), u smislu ovoga Zakona, je osoba", "koji je dio programa javnih potreba u sportu prioritetan je u pravu korištenja školskih sportskih prostora i odabiru korisnika tih sportskih prostora, jednako kao i programi školskih klubova. IV. SPORTAŠI I DRUGE OSOBE U SPORTU Članak 38. Sportašica i sportaš (u daljnjem tekstu: sportaš), u smislu ovoga Zakona, je osoba koja se priprema za sportska natjecanja i sudjeluje u njima. Članak 39. (1) Sportaš amater je osoba kojoj zarada nije svrha sudjelovanja u sportskim natjecanjima, a bavljenje sportom nije joj zanimanje. (2) Sportaš amater, kao član sportskog kluba, ima pravo na: besplatno korištenje sportskih objekata i drugih prostora, opreme i rekvizita za treninge i pripreme, usluge stručnog rada stručnjaka, naknadu za pojačanu prehranu, podmirenje putnih troškova, troškova smještaja i prehrane za vrijeme natjecanja, naknadu izgubljene zarade te pravo na nagradu za postignute rezultate. (3) Sportaš amater ima pravo na sportsku stipendiju u skladu s općim aktom o kategorizaciji sportaša Hrvatskoga olimpijskog odbora. (4) Sportski klubovi svojim općim aktima uređuju prava iz stavka 2. i 3. ovoga članka, a u skladu s općim aktom nacionalnoga sportskog saveza. Članak 40. (1) Sportaš profesionalac je osoba kojoj je bavljenje sportom zanimanje. (2) Sportaš stječe status sportaša profesionalca i ima pravo na ponovno stjecanje statusa sportaša amatera sukladno općem aktu nacionalnoga sportskog saveza i odredbama ovog Zakona. Članak 41. (1) Daroviti sportaš, u smislu ovoga Zakona, je sportaš mlađe dobne skupine koji takav status stječe na temelju ostvarenih sportskih rezultata, a prema aktu o kategorizaciji sportaša Hrvatskoga olimpijskog odbora. 11 (2) Sportski savezi i sportske zajednice utvrđuju posebne programe skrbi o darovitim sportašima. Članak 42. (1) Vrhunski sportaš, u smislu ovoga Zakona, je sportaš kojemu je na temelju ostvarenih sportskih rezultata po zahtjevu sportaša te na prijedlog sportskog kluba ili nacionalnog sportskog saveza i sukladno aktu o kategorizaciji sportaša Hrvatski olimpijski odbor izdao rješenje o statusu vrhunskog sportaša. (2) Hrvatski olimpijski odbor utvrđuje kategoriju sportaša i donosi rješenje o statusu vrhunskog sportaša i upisuje ga u Registar vrhunskih sportaša. Status vrhunskog sportaša stječe se danom upisa u Registar vrhunskih sportaša, koji ustrojava i vodi Hrvatski olimpijski odbor. (3) Rješenje iz stavka 1. ovog članka ima značenje javne isprave, na čiji se postupak i rokove donošenja primjenjuje Zakon o općem upravnom postupku. (4) O žalbi protiv rješenja iz stavka 1. ovog članka rješava ministarstvo nadležno za poslove sporta. Članak 43. (1) Na temelju rješenja o statusu vrhunskog sportaša, vrhunski sportaš ostvaruje prava propisana ovim Zakonom. (2) Vrhunski sportaš amater ako nije osiguran po drugoj osnovi, ima pravo na mirovinsko i zdravstveno osiguranje po posebnim propisima. (3) Hrvatski olimpijski odbor, nacionalni sportski savezi i sportski klub plaćanje doprinosa za mirovinsko i zdravstveno osiguranje za vrhunske sportaše amatere uređuju svojim općim aktima i međusobnim sporazumom. Članak 44. Daroviti i vrhunski sportaši imaju pravo upisati se, pohađati i završiti osnovno i srednjoškolsko obrazovanje prema posebnim uvjetima koje pravilnikom uređuje ministar nadležan za poslove prosvjete i sporta. Članak 45. Daroviti i vrhunski sportaši imaju pravo na posebne uvjete pri upisu na studij na visokim učilištima te na posebne uvjete", "Daroviti i vrhunski sportaši imaju pravo upisati se, pohađati i završiti osnovno i srednjoškolsko obrazovanje prema posebnim uvjetima koje pravilnikom uređuje ministar nadležan za poslove prosvjete i sporta. Članak 45. Daroviti i vrhunski sportaši imaju pravo na posebne uvjete pri upisu na studij na visokim učilištima te na posebne uvjete studiranja koje općim aktom propisuje visoko učilište. Članak 46. Vrhunski sportaši i osobe koje imaju odgovarajuću stručnu spremu ili su stručno osposobljene za stručne poslove u sportu imaju pravo služiti vojni rok ili civilnu službu u udrugama iz sustava sporta iz ovoga zakona na način kako to pravilnicima uređuju ministar obrane, ministar rada i socijalne skrbi i ministar nadležan za poslove sporta. Članak 47. (1) Sportaši su dužni sudjelovati u pripremama i natjecanjima nacionalnih selekcija. (2) Amaterski i profesionalni sportski klubovi su obvezni svoje sportaše staviti na raspolaganje nacionalnim selekcijama za pripreme i natjecanja. 12 (3) Nacionalni sportski savezi će svojim općim aktima propisati prava nastupa sportaša u inozemnim klubovima. (4) Status sportaša i pitanja u vezi s njihovim treninzima, natjecanjima i dr. uređuju se aktima sportskog kluba koji moraju biti u skladu sa zakonom i s aktima nacionalnog sportskog saveza. Članak 48. (1) Status sportskog suca, sportskog delegata i sportskog povjerenika, kao osoba u funkciji sporta, stječe se na temelju akta nacionalnog sportskog saveza. (2) Nacionalni sportski savez općim aktom utvrđuje kriterije, uvjete i način stjecanja statusa osobe iz stavka 1. ovog članka. Članak 49. (1) Dragovoljci u sportu su osobe koje sudjeluju u ostvarivanju sportskih programa i aktivnosti u sustavu sporta i za svoje sudjelovanje i rad ne primaju novčanu naknadu. (2) Sportskim dragovoljcima mogu se snositi putni troškovi, troškovi smještaja i prehrane za vrijeme dragovoljnog rada. Članak 50. (1) Menadžer sportaša (u daljem tekstu: menadžer), u smislu ovoga Zakona, je fizička ili pravna osoba koja temeljem ugovora sa sportašem (u daljem tekstu: menadžerski ugovor) zastupa njegova prava prilikom prelaska iz kluba u klub, natjecateljska prava i obveze u sustavu sporta iz ovoga Zakona. (2) Nacionalni sportski savez vodi Evidenciju menadžera sportaša i Evidenciju menadžerskih ugovora. (3) Pri upisu menadžerskog ugovora u Evidenciju menadžerskih ugovora, obveza je jednu kopiju ovjerenog i sportaša predati nacionalnom sportskom savezu menadžera menadžerskog ugovora i svaku njegovu izmjenu i dopunu. (4) Ugovori o zastupanju natjecateljskih prava i obveza između sportaša i menadžera koji nisu upisani u Evidenciju menadžerskih ugovora nemaju pravnog učinka. (5) Najviši iznos naknade menadžerima za usluge pri prelasku sportaša iz kluba u klub (transfer sportaša), temeljem menadžerskog ugovora, propisat će nacionalni sportski savez svojim općim aktom. V. STRUČNI POSLOVI U SPORTU Članak 51. (1) Stručni poslovi u sportu, u smislu ovoga Zakona, su: - programiranje i provođenje sportskih aktivnosti djece i mladeži; - programiranje i provođenje sportske poduke; - programiranje i provođenje treninga sportaša; - podučavanje građana u sportskim znanjima i vještinama; - programiranje i provođenje sportske rekreacije građana; - dijagnosticiranje i kontrola psihofizičkih i funkcionalnih sposobnosti sudionika u sportskim aktivnostima; - programiranje i provođenje kineziterapijskog vježbanja. 13 (2) Stručne poslove iz stavka 1. ovoga članka mogu obavljati osobe koje", "i provođenje treninga sportaša; - podučavanje građana u sportskim znanjima i vještinama; - programiranje i provođenje sportske rekreacije građana; - dijagnosticiranje i kontrola psihofizičkih i funkcionalnih sposobnosti sudionika u sportskim aktivnostima; - programiranje i provođenje kineziterapijskog vježbanja. 13 (2) Stručne poslove iz stavka 1. ovoga članka mogu obavljati osobe koje imaju odgovarajuću stručnu spremu. Iznimno, stručne poslove u sportu mogu obavljati i osobe koje su za to stručno osposobljene. (3) Stručnu spremu, odnosno stručnu osposobljenost iz stavka 2. ovoga članka, prema vrsti i složenosti određenih poslova, pravilnikom propisuje ministar nadležan za poslove sporta. Članak 52. (1) Program osposobljavanja za obavljanje stručnih poslova u sportu izvode obrazovne ustanove i druge pravne osobe na temelju odobrenja ministra nadležnog za poslove sporta. (2) Programe osposobljavanja za obavljanje stručnih poslova u sportu, uvjete, način izvođenja programa, utvrđivanje osposobljenosti polaznika te sadržaj i oblik isprave o stručnoj osposobljenosti pravilnikom propisuje ministar nadležan za poslove sporta. VI. OBAVLJANJE SPORTSKIH DJELATNOSTI Članak 53. (1) Sportske djelatnosti mogu obavljati: sportski klubovi, sportske udruge, ustanove za obavljanje sportskih djelatnosti, trgovačka društva za javne sportske objekte, sportski savezi, sportske zajednice, Hrvatski olimpijski odbor te fizičke osobe samostalnim radom i profesionalni sportski klubovi kao poseban oblik sportskog dioničkog društva pod uvjetima propisanim ovim Zakonom. (2) Sportske djelatnosti, kao pružanje usluga na tržištu, mogu se obavljati preko obrta i trgovačkih društava. (3) Sportske djelatnosti mogu obavljati domaće i strane pravne i fizičke osobe ako u pojedinim slučajevima ovim Zakonom nije drukčije uređeno. 1. Uvjeti za obavljanje sportskih djelatnosti (1) Pravne i fizičke osobe registrirane za obavljanje sportskih djelatnosti moraju imati odgovarajuće sportske objekte, sportsku opremu i odgovarajuće školovane odnosno stručno osposobljene osobe, u skladu s ovim Zakonom. Članak 54. (2) Sportski klubovi i druge pravne osobe registrirane za obavljanje sportske djelatnosti sudjelovanja u sportskim natjecanjima moraju ispunjavati i druge uvjete koje općim aktom odredi nacionalni sportski savez. (3) Smatra se da pravna ili fizička osoba registrirana za obavljanje sportske djelatnosti ima sportske objekte ako ima dokaz o vlasništvu, dokaz o upravljanju na temelju odobrenja vlasnika ili ugovor o zakupu. (4) Pravne i fizičke osobe za upis obavljanja sportske djelatnosti u odgovarajuće registre, zahtjev podnose registarskom tijelu uz dokaz o prostoru i s popisom opreme kojom će obavljati sportsku djelatnost. Članak 55. (1) Pravne i fizičke osobe mogu započeti obavljati sportske djelatnosti nakon što ured državne uprave u županiji, odnosno ured Grada Zagreba nadležan za poslove sporta prema sjedištu pravne ili fizičke osobe, rješenjem utvrdi da su ispunjeni uvjeti iz članka 54. ovoga Zakona. 14 (2) Rješenje iz stavka 1. ovoga članka za profesionalne sportske klubove donosi ministarstvo nadležno za poslove sporta. Zakon o općem upravnom postupku. (3) Na postupak i rokove donošenja rješenja iz stavka 1. i 2. ovoga članka primjenjuje se Članak 56. Ne može sudjelovati u sportskim natjecanjima, raditi stručne poslove u sportu niti obavljati sportsku djelatnost samostalnim radom, tri godine nakon izdržane, oproštene ili zastare kazne osoba pravomoćno osuđena za kazneno djelo protiv Republike Hrvatske, za kazneno djelo protiv vrijednosti zaštićenih međunarodnim pravom, za kazneno djelo protiv spolne slobode", "Članak 56. Ne može sudjelovati u sportskim natjecanjima, raditi stručne poslove u sportu niti obavljati sportsku djelatnost samostalnim radom, tri godine nakon izdržane, oproštene ili zastare kazne osoba pravomoćno osuđena za kazneno djelo protiv Republike Hrvatske, za kazneno djelo protiv vrijednosti zaštićenih međunarodnim pravom, za kazneno djelo protiv spolne slobode i spolnog ćudoređa, za kazneno djelo protiv života i tijela, za kazneno djelo protiv braka, obitelji i mladeži, za kaznena djela teške krađe, razbojništva i razbojničke krađe i za teška kaznena djela protiv zdravlja ljudi. 2. Obavljanje sportskih djelatnosti samostalnim radom Članak 57. Fizičke osobe mogu samostalnim radom, odnosno osobnim radom obavljati sportske djelatnosti sportske poduke, treninga sportaša, provođenja sportske rekreacije i sudjelovanja u sportskim natjecanjima. Članak 58. (1) Obavljanje sportskih djelatnosti samostalnim radom upisuje se u Registar sportskih djelatnosti koje se obavljaju samostalnim radom (u daljnjem tekstu: Registar) koji vodi ministarstvo nadležno za poslove sporta. Ministar nadležan za poslove sporta pravilnikom propisuje sadržaj i način vođenja Registra. (2) Upis u Registar iz stavka 1. ovoga članka vrši se na osnovi rješenja koje u upravnom postupku po Zakonu o općem upravnom postupku donosi ministarstvo nadležno za poslove sporta. (3) Fizičke osobe registrirane za obavljanje sportskih djelatnosti samostalnim radom iz članka 57. ovoga Zakona imaju status slobodne profesije i prava i obveze koje iz toga statusa proizlaze, te imaju pravo na mirovinsko i zdravstveno osiguranje po posebnim propisima. Članak 59. (1) Za obavljanje sportskih djelatnosti iz članka 57. ovoga Zakona, osim za sudjelovanje u sportskim natjecanjima, fizičke osobe moraju imati odgovarajuću stručnu spremu odnosno stručnu osposobljenost. (2) Za obavljanje sportske djelatnosti sudjelovanja u sportskim natjecanjima fizičke osobe moraju imati suglasnost nacionalnoga sportskog saveza izdanu na temelju općeg akta kojim se regulira koji sportaši zadovoljavaju uvjete za obavljanje te djelatnosti. (3) Smatra se da zadovoljava uvjetima za obavljanje djelatnosti sudjelovanja u natjecanjima osoba koja je razvrstana u kategoriju vrhunskih sportaša temeljem akta o kategorizaciji Hrvatskog olimpijskog odbora. (4) Ministar nadležan za poslove sporta u suglasnosti s ministrom zdravstva pravilnikom će propisati je li potrebna posebna zdravstvena sposobnost za obavljanje sportskih djelatnosti iz članka 57. ovoga Zakona te koja je to sposobnost. 15 Članak 60. (1) Za obavljanje djelatnosti sportske ponude, treninga sportaša i provođenja sportske rekreacije u Registar iz stavka 1. članka 58. ovog Zakona može se upisati fizička osoba koja ispunjava ove uvjete: 1. da je potpuno poslovno sposobna; 2. da je zdravstveno sposobna; 3. da ima stručnu spremu odnosno da je stručno osposobljena za obavljanje sportskih djelatnosti sportske poduke, treninga sportaša ili provođenja sportske rekreacije; 4. da nije u radnom odnosu ili da ne obavlja neku drugu djelatnost samostalnim osobnim radom. (2) Za obavljanje djelatnosti sudjelovanja u sportskim natjecanjima u Registar iz stavka 1. članka 58. ovog Zakona može se upisati fizička osoba s navršenih šesnaest godina i koja ima odgovarajući status vrhunskog sportaša u smislu ovog Zakona. (3) Strani državljani mogu biti upisani u Registar iz stavka 1. članka 58. ovog Zakona ako je obavljanje djelatnosti samostalnim radom odnosno osobnim radom za strane državljane uređeno posebnim propisima ili propisano", "upisati fizička osoba s navršenih šesnaest godina i koja ima odgovarajući status vrhunskog sportaša u smislu ovog Zakona. (3) Strani državljani mogu biti upisani u Registar iz stavka 1. članka 58. ovog Zakona ako je obavljanje djelatnosti samostalnim radom odnosno osobnim radom za strane državljane uređeno posebnim propisima ili propisano međunarodnim ratificiranim aktima i ugovorima. Članak 61. (1) Osobi upisanoj u Registar iz stavka 1. članka 58. ovog Zakona prestaje pravo obavljanja djelatnosti: 1. ako izgubi hrvatsko državljanstvo, od dana pravomoćnosti odluke kojom je utvrđen gubitak državljanstva, a nema strano državljanstvo suglasno članku 60. stavku 3. ovoga Zakona; 2. ako izgubi potpunu poslovnu sposobnost, od dana pravomoćnosti odluke o lišenju poslovne sposobnosti; 3. ako postane trajno zdravstveno nesposobna za obavljanje sportske djelatnosti; 4. ako stupi u radni odnos ili započne s obavljanjem druge djelatnosti samostalnim osobnim radom, od dana stupanja na rad, odnosno dana upisa u registar druge djelatnosti koja se obavlja samostalnim radom ili 5. ako je osuđena na bezuvjetnu kaznu zatvora od šest ili više mjeseci, od dana pravomoćnosti presude. (2) U slučajevima iz stavka 1. ovoga članka ministarstvo nadležno za poslove sporta brisat će iz Registra obavljanje sportskih djelatnosti, a osobi koja je bila upisana u Registar izdat će rješenje o brisanju. (3) Iz Registra će se brisati obavljanje djelatnosti na osobni zahtjev i u slučaju smrti osobe upisane u Registar. 3. Ustanove za obavljanje sportskih djelatnosti Članak 62. (1) Radi trajnog obavljanja sportskih djelatnosti, obrazovanja i osposobljavanja stručnih kadrova za potrebe sporta, stručno-istraživačkog rada u području sporta i upravljanja sportskim objektima, pravne i fizičke osobe i jedinice lokalne i područne (regionalne) samouprave mogu osnivati ustanove. (2) Na osnivanje, registraciju, ustroj, pravni položaj, početak obavljanja djelatnosti i prestanak postojanja ustanova iz stavka 1. ovoga članka primjenjuju se odredbe Zakona o ustanovama i ovoga Zakona. (3) Osnivački akt ustanova iz stavka 1. ovoga članka mora biti u suglasnosti s ovim Zakonom. 16 (4) U upravnim vijećima ustanova za upravljanje sportskim objektima iz stavka 1. ovoga članka, s predstavnicima osnivača sudjeluju i predstavnici sportskih zajednica s najmanje jednom trećinom članova. Članak 63. Ustanove u sportskoj djelatnosti dužne su donijeti akt odnosno program kojim se uređuju uvjeti i način obavljanja sportske djelatnosti, odnosno ostvarivanje programa sportske djelatnosti i dostaviti ga uredu državne uprave u županiji, odnosno uredu Grada Zagreba nadležnom za poslove sporta prema svom sjedištu, a javne ustanove ministarstvu nadležnom za poslove sporta. 4. Trgovačka društva za javne sportske objekte Članak 64. (1) Jedinice lokalne i područne (regionalne) samouprave mogu osnivati trgovačka društva za upravljanje i održavanje sportskih objekata u njihovu vlasništvu (dalje: trgovačko društvo za javne sportske objekte). (2) Na ustroj, djelovanje, upravljanje, raspolaganje prihodom i porezni status trgovačkih društava za javne sportske objekte primjenjuju se odredbe Zakona o trgovačkim društvima, ako ovim Zakonom nije drukčije određeno. Članak 65. U nadzornim odborima trgovačkih društava za javne sportske objekte, sudjeluju i predstavnici sportskih zajednica s najmanje jednom trećinom članova. Trgovačko društvo za javne sportske objekte dobit ostvarenu obavljanjem svoje djelatnosti mora upotrijebiti isključivo za održavanje, izgradnju i opremanje sportskih", "o trgovačkim društvima, ako ovim Zakonom nije drukčije određeno. Članak 65. U nadzornim odborima trgovačkih društava za javne sportske objekte, sudjeluju i predstavnici sportskih zajednica s najmanje jednom trećinom članova. Trgovačko društvo za javne sportske objekte dobit ostvarenu obavljanjem svoje djelatnosti mora upotrijebiti isključivo za održavanje, izgradnju i opremanje sportskih objekata. Članak 66. 5. Sportski obrti Članak 67. (1) Usluge na tržištu u sportskim djelatnostima mogu se obavljati kao obrt (u daljnjem tekstu: sportski obrt). (2) Sportski obrt osniva se, registrira, posluje i prestaje postojati prema odredbama Zakona o obrtu i ovoga Zakona. Članak 68. (1) Sportski obrt može se obavljati samostalno i uz druge djelatnosti bliske sportu ako se obavljaju u manjem opsegu i služe obavljanju djelatnosti koja je obuhvaćena obrtnicom. Na obavljanje stručnih poslova u sportu obrtom primjenjuju se odredbe članka 51. stavka 2. i 3. ovoga Zakona. Članak 69. 17 Članak 70. Ispunjava li sportski obrt uvjete u pogledu prostora, opreme i propisane stručne spreme, utvrđuje rješenjem ured državne uprave u županiji, odnosno ured Grada Zagreba nadležan za poslove sporta. 6. Trgovačka društva Članak 71. Trgovačko društvo za obavljanje sportskih djelatnosti, osim djelatnosti natjecanja, osniva se, registrira, posluje i prestaje prema odredbama Zakona o trgovačkim društvima, ako neka od tih pitanja nisu ovim Zakonom drukčije uređena. (1) Sportski obrt i trgovačko društvo koje obavlja stručne poslove u sportu mora imati Članak 72. osobu koja ispunjava uvjete za obavljanje tih poslova u skladu s ovim Zakonom. (2) Obrti i trgovačka društva ne smiju zaposliti ili na drugi način angažirati osobu za obavljanje sportskih djelatnosti koja je pravomoćnom sudskom presudom osuđena na kazneno djelo protiv dostojanstva ličnosti i morala ili joj je izrečena sigurnosna mjera ili zaštitna mjera zabrane pružanja usluga u sportskoj djelatnosti. (3) Sportski obrt i trgovačko društvo ne mogu u nazivu imati riječ \"klub\". VII. PROFESIONALNI SPORTSKI KLUB 1. Pojam profesionalnog sportskog kluba i djelatnost Članak 73. (1) Profesionalni sportski klub osniva se kao sportsko dioničko društvo (u daljnjem tekstu: profesionalni klub) za obavljanje sportske djelatnosti treninga i natjecanja na državnoj i međunarodnoj razini. (2) Profesionalni klub uz natjecanja i postizanje sportskih rezultata ima cilj promicanje i razvoj sporta. (3) Profesionalni klub može, osim sportske djelatnosti upisane u sudski registar, obavljati i druge sportske i gospodarske djelatnosti koje su uobičajene, povezane ili proizlaze iz djelatnosti kluba upisane u sudski registar. (4) Tvrtka profesionalnog kluba mora sadržavati riječi \"sportsko dioničko društvo\", ili oznaku \"s.d.d.\". 1.1. Temelj za osnivanje Članak 74. (1) Profesionalni klub osniva se i djeluje pod uvjetima i na način kako je to propisano ovim Zakonom te drugim propisima koji se primjenjuju na dionička društva. Na profesionalne klubove ne primjenjuje se Zakon o preuzimanju dioničkih društava. (2) Amaterski sportski klubovi mogu osnivati profesionalne sportske klubove ili mijenjati status u profesionalne sportske klubove samo na temelju ovoga Zakona. 18 (3) Profesionalni klub u sportskim i strukovnim pitanjima iz svoje djelatnosti djeluje sukladno propisima nacionalnoga sportskog saveza čiji je član te međunarodnoga sportskog udruženja u koje je učlanjen taj nacionalni sportski savez. Članak 75. (1) Nacionalni sportski", "ili mijenjati status u profesionalne sportske klubove samo na temelju ovoga Zakona. 18 (3) Profesionalni klub u sportskim i strukovnim pitanjima iz svoje djelatnosti djeluje sukladno propisima nacionalnoga sportskog saveza čiji je član te međunarodnoga sportskog udruženja u koje je učlanjen taj nacionalni sportski savez. Članak 75. (1) Nacionalni sportski savez donosi odluku o sustavu natjecanja u kojem sudjeluju profesionalni klubovi istog sporta i o potrebi osnivanja profesionalnih klubova. (2) Odluka iz stavka 1. ovog članka donosi se na temelju elaborata o opravdanosti osnivanja sustava natjecanja profesionalnih klubova. Elaborat, koji je sastavni dio odluke, mora sadržavati: broj očekivanih profesionalnih klubova s rezultatima njihove sportske uspješnosti, oblik i status natjecanja u kojem će sudjelovati, građevinsko stanje sportskih objekata za natjecanja, vlasničko-pravni status sportskih objekata, potrebne standarde i uvjete koje propisuje odgovarajuće međunarodno sportsko udruženje i procjenu očekivanih izvora financiranja profesionalnih klubova. 1.2. Osnivači Članak 76. (1) Profesionalni klub mogu osnovati domaće i strane fizičke i pravne osobe. (2) Ista osoba može biti osnivač ili suosnivač samo jednog profesionalnog kluba istog sporta. 1.3. Temeljni kapital Članak 77. (1) Temeljni kapital profesionalnog kluba ne može biti manji od 1.000.000,00 kuna. (2) Ulog u profesionalni klub mora biti u novcu. (3) Iznimno, amaterski sportski klub kao osnivač profesionalnog kluba može osim novca kao temeljni kapital uložiti stvari i prava. 1.4. Dionice Članak 78. (1) Dionice profesionalnog kluba se izdaju na ime. (2) Profesionalni klub mora ministarstvu nadležnom za poslove sporta i pripadajućem nacionalnom sportskom savezu slati obavijesti o dioničarima, što će se urediti pravilnikom koji donosi ministar nadležan za poslove sporta. 1.5. Zabrana stjecanja dionica Članak 79. (1) Ista fizička i pravna osoba može izravno, neizravno ili preko povezanih osoba imati dionice koje daju pravo na više od 5% glasova u glavnoj skupštini profesionalnog kluba samo u jednom profesionalnom klubu istog sporta. (2) Dionice u profesionalnim klubovima istog sporta, izravno, neizravno ili preko povezanih osoba ne mogu imati osobe čiji poslovi i aktivnosti mogu neposredno utjecati na 19 sustav natjecanja u odgovarajućem sportu (sportski suci, menadžeri sportaša, i sl.). (3) Dionice u profesionalnim klubovima, izravno, neizravno ili preko povezanih osoba ne mogu imati vlasnici sportskih kladionica. 1.6. Povezane osobe Članak 80. (1) Smatra se da su osobe koje stječu dionice u profesionalnom klubu povezane: - ako su se sporazumjele da usklađeno djeluju u vezi sa stjecanjem dionica izdavatelja ili u vezi s ostvarivanjem prava glasa prema izdavatelju - ako jedna od njih drži dionice za račun druge ili - ako jedna od njih izravno ili neizravno kontrolira drugu ili druge pravne osobe. (2) Smatra se da fizička ili pravna osoba kontrolira pravnu osobu ako ima: - izravan ili neizravan većinski udio u temeljnom kapitalu te osobe - izravnu ili neizravnu većinu glasačkih prava u toj osobi - pravo imenovati ili opozvati većinu članova uprave ili nadzornog odbora odnosno drugog tijela koje upravlja ili vodi poslovanje te osobe ili - na neki drugi način prevladavajući utjecaj na tu osobu. (3) Smatra se da fizičke osobe djeluju zajednički ako su u krvnom srodstvu u pravoj liniji,", "toj osobi - pravo imenovati ili opozvati većinu članova uprave ili nadzornog odbora odnosno drugog tijela koje upravlja ili vodi poslovanje te osobe ili - na neki drugi način prevladavajući utjecaj na tu osobu. (3) Smatra se da fizičke osobe djeluju zajednički ako su u krvnom srodstvu u pravoj liniji, u svojstvu usvojitelja i usvojenika, a u pobočnoj liniji do prvog stupnja zaključno te ako su bračni ili izvanbračni drugovi. 1.7. Ograničenja za stjecanje dionica Članak 81. (1) U prve dvije godine od osnivanja profesionalnog kluba jedna pravna ili fizička osoba može u profesionalnom klubu imati dionice koje daju najviše 25% glasova u glavnoj skupštini profesionalnog kluba. (2) Iznimno, u prve dvije godine od osnivanja, za stjecanje dionica u profesionalnom klubu koje daju više od 25% glasova u glavnoj skupštini profesionalnog kluba, potrebna je prethodna suglasnost ministarstva nadležnog za poslove sporta. (3) Suglasnost iz stavka 2. ovoga članka daje se na temelju kriterija koje na prijedlog Povjerenstva za profesionalne sportske klubove pravilnikom utvrđuje ministar nadležan za poslove sporta. (4) O svakom stjecanju dionica koje, zajedno s dionicama koje ta osoba već ima, predstavljaju 5% ili više ukupnog temeljnog kapitala profesionalnog kluba, ili koje zajedno s glasovima koje ta osoba već ima daju 5% ili više glasova u glavnoj skupštini profesionalnog kluba, stjecatelj mora bez odgađanja, a najkasnije u roku od osam dana od dana sklapanja pravnog posla koji je osnova stjecanja, obavijestiti ministarstvo nadležno za poslove sporta. 1.8. Posljedice stjecanja dionica suprotno zabrani i ograničenjima Članak 82. (1) Stjecatelj koji je stekao dionice suprotno odredbama članaka 79. i 81. ovoga zakona, dužan je bez odgađanja otuđiti te dionice koje je stekao premda na to nije imao pravo. Dok to ne učini, ne može ostvarivati nikakva prava ni iz jedne dionice niti u jednom profesionalnom klubu. Prava iz tih dionica ostvaruje povjerenik kojega imenuje ministarstvo nadležno za poslove 20 sporta. Povjerenik ne može biti osoba na koju se odnose ograničenje i zabrana stjecanja dionica iz članaka 79. i 81. ovoga zakona. (2) Obavijest o tome da je neka osoba stekla dionice suprotno odredbama članaka 79. i 81. ovoga zakona Središnja depozitarna agencija će bez odgađanja u pisanom obliku dostaviti ministarstvu nadležnom za poslove sporta koje će obavijest dostaviti profesionalnom klubu. (3) Profesionalni klub dužan je bez odgađanja obavijestiti ministarstvo nadležno za poslove sporta o sazivanju svake glavne skupštine u vrijeme dok prava iz dionica u klubu ostvaruje povjerenik. Predstavnik ministarstva nadležnog za poslove sporta ima pravo sudjelovati u radu glavne skupštine te se na njegov zahtjev u zapisnik s glavne skupštine mora unijeti napomena da glasuje osoba koja na to nema pravo jer je stekla dionice suprotno odredbama članaka 79. i 81. ovoga zakona. 1.9. Upis u sudski registar Članak 83. Profesionalni klub upisuje se u sudski registar prema svom mjestu sjedišta. 1.10. Dobit Članak 84. (1) Ostvarenu dobit profesionalni klub može upotrijebiti isključivo za unapređenje svoje djelatnosti, za vlastitu sportsku poduku i trening mladih sportaša, školske sportske klubove i sekcije, amaterske sportske udruge i sl. (2) Izviješće o dobiti iz", "Profesionalni klub upisuje se u sudski registar prema svom mjestu sjedišta. 1.10. Dobit Članak 84. (1) Ostvarenu dobit profesionalni klub može upotrijebiti isključivo za unapređenje svoje djelatnosti, za vlastitu sportsku poduku i trening mladih sportaša, školske sportske klubove i sekcije, amaterske sportske udruge i sl. (2) Izviješće o dobiti iz stavka 1. ovoga članka profesionalni klub objavljuje javno jednom godišnje. 1.11. Ograničenja za članstvo u upravnom ili nadzornom odboru Članak 85. (1) Ista fizička osoba može biti član uprave ili nadzornog odbora samo u jednom profesionalnom klubu istog sporta. (2) Uz osobe koje ne mogu biti članovi uprave ili nadzornog odbora dioničkog društva prema odredbama Zakona o trgovačkim društvima, članovi uprave i nadzornog odbora profesionalnog kluba ne mogu biti niti osobe: - koje su u posljednje tri godine kažnjene za kaznena djela ili prekršaje u sportu i u vezi sa sportom; - koje su dužnosnici u državnoj upravi i tijelima jedinica lokalne i područne (regionalne) samouprave ili su u posljednje dvije godine to bili i ako su ta tijela i funkcije imale vezu s profesionalnim klubovima; - koje poslovima i aktivnostima mogu neposredno utjecati na sustav natjecanja u odgovarajućem sportu (sportski suci, sportski delegati, sportski povjerenici i sl.), kao i osobe koje su to bile u posljednjih pet godina; - vlasnici sportskih kladionica i menadžeri sportaša, kao i osobe koje su to bile u posljednjih pet godina. 21 2. Amaterski sportski klub – osnivač profesionalnog kluba Članak 86. (1) Amaterski sportski klub može osnovati ili biti suosnivač profesionalnog kluba suglasno ovom Zakonu. (2) Amaterski sportski klub koji osniva profesionalni klub nastavlja s radom kao sportska udruga. Članak 87. Amaterski sportski klub može osnovati profesionalni klub tako da kao osnivač, suglasno svome statutu, donese odluku o sukcesivnom osnivanju profesionalnog kluba, tj. donese odluku: - o nominalnom iznosu i broju dionica, čiji nominalni iznos ne može biti manji od 100,00 kuna niti veći od 500,00 kuna - o javnom pozivu za upis dionica - o roku za upis dionica i - o roku za preuzimanje dionica. 3. Preoblikovanje amaterskog sportskog kluba u profesionalni klub Članak 88. (1) Amaterski sportski klubovi mijenjaju status u profesionalne sportske klubove suglasno ovom Zakonu. (2) Amaterski sportski klub mijenja status amaterskoga sportskog kluba u profesionalni klub tako da kao osnivač suglasno svome statutu donese odluku o promjeni statusa odnosno preoblikovanju amaterskog sportskog kluba u profesionalni klub te odluku: - o nominalnom iznosu i broju dionica čiji nominalni iznos ne može biti manji od 100,00 kuna niti veći od 500,00 kuna i - o javnom pozivu za upis dionica i preuzimanje dionica. (3) Prava i obveze amaterskoga sportskog kluba preuzima osnovani profesionalni klub kao i obvezu da će i dalje obavljati sportsku djelatnost, što se unosi u osnivački akt. (4) Profesionalni klub je pravni slijednik amaterskog sportskog kluba. (5) Upisom profesionalnog kluba u sudski registar amaterski sportski klub prestaje postojati kao udruga i podnosi zahtjev nadležnom uredu državne uprave za brisanje iz registra udruga. (6) Zahtjev iz stavka 5. ovog članka podnosi se u roku od 8 dana", "akt. (4) Profesionalni klub je pravni slijednik amaterskog sportskog kluba. (5) Upisom profesionalnog kluba u sudski registar amaterski sportski klub prestaje postojati kao udruga i podnosi zahtjev nadležnom uredu državne uprave za brisanje iz registra udruga. (6) Zahtjev iz stavka 5. ovog članka podnosi se u roku od 8 dana od dan kada je profesionalni klub upisan u sudski registar, a nadležni ured državne uprave briše ga iz registra udruga s danom upisa u trgovački registar. 4. Javni poziv za upis dionica i rokovi Članak 89. (1) Javni poziv za upis dionica pri osnivanju profesionalnog kluba ili prema odluci iz članka 87. stavka 1. alineje 2. ili prema članku 88. stavku 2. alineji 2. ovoga Zakona mora se objaviti najmanje 30 dana, a najviše 60 dana od dana usvajanja osnivačkog akta profesionalnog kluba. (2) Rok za upis dionica profesionalnog kluba ne može biti dulji od 30 dana. 22 (3) Rok za preuzimanje dionica ne može biti dulji od 30 dana od dana upisa dionica. 5. Vjerovnici amaterskog kluba Članak 90. (1) Za potraživanja od amaterskog sportskog kluba koji osniva profesionalni klub vjerovnici mogu upisati i preuzeti dionice profesionalnog kluba u visini svojih vjerovničkih potraživanja. (2) Vjerovnicima iz stavka 1. ovoga članka profesionalni klub je dužan na njihov zahtjev otkupiti dionice u roku od dvije godine od dana upisa u sudski registar. 6. Utvrđivanje stanja imovine i obveza amaterskog i profesionalnog kluba Članak 91. Pri osnivanju profesionalnog kluba na temelju članaka 86. i 88. ovog zakona utvrđuje se stanje imovine i obveza amaterskog sportskog kluba na temelju elaborata koji mora sadržavati: - procjenu ovlaštenog revizora o stanju imovine i obveza - popis i procjenu imovine koju amaterski sportski klub unosi u profesionalni klub, i popis i procjenu imovine koja ostaje amaterskom sportskom klubu - potencijalne dioničare profesionalnog kluba - potrebna dodatna sredstva za obavljanje djelatnosti profesionalnog kluba i - druga pitanja bitna za osnivanje profesionalnog kluba i obavljanje njegove djelatnosti. Članak 92. (1) U imovinu profesionalnog kluba amaterski sportski klub, koji osniva profesionalni klub, unosi dio svoje vrijednosti. (2) Vrijednost amaterskog kluba čine sredstva na računu, nepokretne i pokretne stvari, ugovorna vrijednost sportaša natjecatelja s kojima amaterski klub ima ugovor i druga prava te potraživanja i obveze amaterskog kluba. (3) Amaterskom klubu se upisuju dionice i on ih preuzima u visini vrijednosti suglasno stavku 1. i 2. ovog članka i stavku 1. članka 81. ovog Zakona. Članak 93. U određivanju vrijednosti profesionalnog kluba za javni poziv za upis dionica i određivanje vrijednosti i broja dionica ulazi: 1. vrijednost amaterskog kluba iz članka 88. odnosno članka 92. stavak 1. i 2. 2. iznos temeljnog kapitala 3. vrijednost vjerovničkih potraživanja (članak 90.) i 4. dodatno vrednovanje (članak 94.). Članak 94. (1) Za svaki profesionalni klub kojega osniva amaterski sportski klub ili koji nastaje promjenom statusa amaterskog sportskog kluba u profesionalni klub radi se posebno dodatno vrednovanje. 23 (2) Dodatno vrednovanje profesionalnih klubova iz stavka 1. ovog članka radi se na temelju kriterija koje pravilnikom utvrđuje ministar nadležan za poslove sporta na prijedlog Povjerenstva", "profesionalni klub kojega osniva amaterski sportski klub ili koji nastaje promjenom statusa amaterskog sportskog kluba u profesionalni klub radi se posebno dodatno vrednovanje. 23 (2) Dodatno vrednovanje profesionalnih klubova iz stavka 1. ovog članka radi se na temelju kriterija koje pravilnikom utvrđuje ministar nadležan za poslove sporta na prijedlog Povjerenstva iz članka 96. ovoga Zakona i nacionalnog sportskog saveza. U kriterije za procjenu vrijednosti ulazi: ime kluba, tradicija, sportski uspjesi u posljednje tri natjecateljske sezone, broj reprezentativaca, ugovorne vrijednosti sportaša natjecatelja s kojima klub ima ugovor, broj mladih igrača (amaterski sportski pogon, sportska škola, sportska poduka) i drugo. 7. Posebna ograničenja u podmirivanju obveza profesionalnog kluba Članak 95. Novčane obveze profesionalnog kluba koje proizlaze iz kredita, zajmova ili drugih pravnih poslova, u kojima su vjerovnici društva njegovi dioničari, članovi njegova nadzornog odbora ili uprave ili članovi organa upravljanja amaterskog sportskog kluba koji je dioničar toga profesionalnog kluba, mogu se podmirivati nakon podmirenja dospjelih obveza prema ostalim vjerovnicima. 8. Povjerenstvo za profesionalne sportske klubove Članak 96. (1) Radi osnivanja i praćenja djelatnosti profesionalnih klubova i njihovih sustava natjecanja u Republici Hrvatskoj, kao stručno savjetodavno tijelo, pri ministarstvu nadležnom za poslove sporta osniva se Povjerenstvo za profesionalne sportske klubove (u daljnjem tekstu: Povjerenstvo). (2) Povjerenstvo ima pet članova. Voditelja i članove Povjerenstva imenuje ministar nadležan za poslove sporta iz reda istaknutih stručnjaka i sportskih djelatnika. Jedan član Povjerenstva imenuje se na prijedlog Hrvatskog olimpijskog odbora i jedan promjenjivi član na prijedlog pripadajućeg nacionalnog sportskog saveza. (3) Mandat članova Povjerenstva traje četiri godine. (4) Rad Povjerenstva uređuje se pravilnikom koji donosi ministar nadležan za poslove sporta. (5) Rad Povjerenstva financira se iz dijela prihoda igara na sreću i nagradnih igara namijenjenih financiranju sporta i iz državnog proračuna. Članak 97. (1) Povjerenstvo daje mišljenje na odluku nacionalnog sportskog saveza iz članka 75. i elaborat iz članka 91. ovoga Zakona. (2) Povjerenstvo neće dati pozitivno mišljenje na elaborat iz članka 91. ovoga Zakona: - ako podaci osnivača o preuzimanju dionica, o ulaganju u temeljni kapital, ulaganju i preuzimanju stvari odnosno prava nisu potpuni i točni ili, - ako utvrdi da je vrijednost ulaganja i preuzimanja stvari odnosno prava bitno manja od nominalnih iznosa dionica koje za to treba dati ili vrijednosti činidbi koje za to treba ispuniti. (3) Davanjem pozitivnog mišljenja na elaborat iz članka 91. ovoga Zakona, Povjerenstvo iskazuje stajalište da su svi podaci navedeni u elaboratu prema dostupnim podacima istiniti. 24 Članak 98. (1) Ministarstvo nadležno za poslove sporta, na temelju mišljenja Povjerenstva, daje suglasnost na odluku iz članka 75. i suglasnost na elaborat iz članka 91. ovoga Zakona i dostavlja ih nacionalnom sportskom savezu u roku od 60 dana od dana primitka mišljenja. (2) Ako ministarstvo nadležno za poslove sporta ne donese akt o suglasnosti u roku iz stavka 1. ovog članka, smatra se da je suglasnost dana. VIII. SPORTSKA NATJECANJA 1. Sustav sportskih natjecanja Članak 99. (1) Načela i osnovne elemente sustava sportskih natjecanja u Republici Hrvatskoj, te uvjete sudjelovanja hrvatskih sportaša i sportskih klubova na međunarodnim sportskim natjecanjima utvrđuje općim", "akt o suglasnosti u roku iz stavka 1. ovog članka, smatra se da je suglasnost dana. VIII. SPORTSKA NATJECANJA 1. Sustav sportskih natjecanja Članak 99. (1) Načela i osnovne elemente sustava sportskih natjecanja u Republici Hrvatskoj, te uvjete sudjelovanja hrvatskih sportaša i sportskih klubova na međunarodnim sportskim natjecanjima utvrđuje općim aktom Hrvatski olimpijski odbor. (2) Sustav, uvjete i organizaciju sportskih natjecanja te financijske obveze sportskih klubova i sportaša (kotizacije za sudjelovanje u sustavu natjecanja, naknade za rad sudaca na natjecanjima i sl.) u pojedinom sportu izrađuje u vidu elaborata i utvrđuje općim aktom nacionalni sportski savez u skladu s odredbama ovoga Zakona i s načelima i elementima iz stavka 1. ovoga članka, te pravilima sporta i normama međunarodnih sportskih udruženja. (3) Sudjelovanje amaterskih sportskih klubova i profesionalnih sportskih klubova u istom sustavu natjecanja te uvjete i organizaciju tih natjecanja u pojedinom sportu utvrđuje općim aktom nacionalni sportski savez. (4) Na prijedlog udruženja profesionalnih sportskih klubova nacionalni sportski savez može uspostaviti sustav natjecanja u kojem sudjeluju samo profesionalni klubovi. (5) Odluku o organiziranju sustava sportskih natjecanja za područje više država ili više inozemnih regija donosi nacionalni sportski savez. (6) Odluku o sudjelovanju sportskih klubova iz Republike Hrvatske u višedržavnim ili u inozemnim regionalnim sustavima natjecanja donosi nacionalni sportski savez. (7) Sustav sportskih natjecanja donosi se na neodređeno vrijeme, a iznimno na određeno vrijeme i to ne kraće od četiri godine. (8) Odluku o organizaciji sportskih natjecanja za područje jedne ili više općina ili gradova ili županija, odnosno Grada Zagreba, u skladu s aktom iz stavka 2. ovoga članka, donose i natjecanja organiziraju sportski savezi osnovani na tim područjima, a za područje države nacionalni sportski savezi. Članak 100. (1) Pravilima kojima se uređuje sustav sportskih natjecanja mora se propisati da se novi sustav sportskih natjecanja kao i promjena bitnih elemenata postojećeg sustava sportskog natjecanja ne može početi primjenjivati prije nego što prođe najmanje godina dana od dana donošenja odluke o novom sustavu odnosno promjeni sustava sportskog natjecanja. (2) Bitni elementi sustava sportskog natjecanja, koji se ne mogu mijenjati bez promjene pravila sustava sportskih natjecanja na način i u roku iz stavka 1. ovoga članka, su: broj klubova, način popune i ispadanja iz lige ili nekog drugog sustava natjecanja te povećanje financijskih obveza sudionika u sustavu natjecanja za više od 5% u jednoj natjecateljskoj godini. (3) Prije donošenja odluke o uspostavi novog ili promjeni postojećeg sustava natjecanja, nacionalni sportski savez dužan je donijeti elaborat iz stavka 2. članka 99. i dostaviti ga 25 Hrvatskom olimpijskom odboru radi pribavljanja prethodne suglasnosti za uspostavu ili promjenu sustava natjecanja. (4) Bez suglasnosti Hrvatskog olimpijskog odbora iz stavka 3. ovoga članka nacionalni savez ne može propisivati novi ili mijenjati stari sustav natjecanja. Članak 101. (1) Natjecanje u pojedinom sportu organizira i provodi nacionalni sportski savez. (2) Nacionalni sportski savez vođenje natjecanja može povjeriti svojoj članici ili drugoj pravnoj osobi. Članak 102. (1) Sportaš profesionalac u momčadskim sportovima mora imati ugovor o profesionalnom natjecanju sa sportskim klubom za koji se natječe. (2) Sportaši profesionalci u momčadskim sportovima mogu", "pojedinom sportu organizira i provodi nacionalni sportski savez. (2) Nacionalni sportski savez vođenje natjecanja može povjeriti svojoj članici ili drugoj pravnoj osobi. Članak 102. (1) Sportaš profesionalac u momčadskim sportovima mora imati ugovor o profesionalnom natjecanju sa sportskim klubom za koji se natječe. (2) Sportaši profesionalci u momčadskim sportovima mogu sudjelovati samo na natjecanjima državne i međunarodne razine. (3) Ako sportski klub izgubi pravo natjecanja na državnoj razini, njegovi sportaši profesionalci mogu sudjelovati u nižem krugu natjecanja u sljedećoj natjecateljskoj sezoni. Članak 103. (1) Amaterski i profesionalni klubovi mogu se u kup sustavu međusobno natjecati na svim razinama. (2) Nacionalni sportski savezi svojim općim aktima određuju sudjelovanje sportaša amatera i sportaša profesionalaca u istim natjecanjima. Članak 104. Strani državljani mogu nastupati za sportske klubove na sportskim natjecanjima na razini države, kako je to određeno općim aktom nacionalnoga sportskog saveza, a u međunarodnim natjecanjima sukladno propisima međunarodnih sportskih udruženja. Članak 105. (1) Sportski klubovi i sportaši mogu sudjelovati u međunarodnim sportskim natjecanjima i na međunarodnim sportskim priredbama samo uz prethodnu suglasnost nacionalnoga sportskog saveza. (2) Prijedlog za održavanje olimpijskih igara, mediteranskih igara, svjetskih studentskih igara, svjetskih vojnih igara te drugih međunarodnih sportskih natjecanja u Republici Hrvatskoj daje Hrvatski olimpijski odbor, a za održavanje svjetskih i europskih prvenstava i kupova u pojedinim sportovima prijedlog daje nacionalni sportski savez uz suglasnost Hrvatskoga olimpijskog odbora. (3) Kriterije i mjerila za isticanje kandidature i održavanje međunarodnih sportskih natjecanja u Republici Hrvatskoj iz stavka 2. ovoga članka općim aktom utvrđuje Hrvatski olimpijski odbor. (4) Pri isticanju kandidature za održavanje olimpijskih igara, svjetskih i europskih seniorskih prvenstava te međunarodnih regionalnih sportskih natjecanja na teritoriju Republike Hrvatske, potrebna je prethodna suglasnost Vlade Republike Hrvatske. 26 (5) Međunarodna sportska natjecanja i međunarodne sportske priredbe u Republici Hrvatskoj organiziraju se u skladu s ovim Zakonom, posebnim općim aktom Hrvatskog olimpijskog odbora iz stavka 3. ovoga članka i u skladu s uvjetima koje propisuju međunarodna sportska udruženja. Članak 106. Organizatori sportskih natjecanja i sportskih priredbi dužni su organizirati njihovo održavanje sukladno Zakonu o javnom okupljanju građana, te drugim propisima koji uređuju sprečavanje nereda na sportskim natjecanjima. Članak 107. (1) Na sportskim natjecanjima i u sportskim i drugim objektima u kojima se održava sportsko natjecanje nije dopušteno: - unošenje, prodaja, davanje i uzimanje alkoholnih pića i opojnih droga za vrijeme natjecanja; - ulazak osoba pod utjecajem alkohola ili droge; - unošenje i uporaba oružja, pirotehničkih i drugih sredstava pogodnih za nanošenje ozljeda ili za stvaranje nereda i nasilja, koja mogu ugroziti sigurnost natjecatelja, drugih sudionika u natjecanju i gledatelja; - paljenje i bacanje pirotehničkih sredstava, navijačkih rekvizita i drugih predmeta u natjecateljski ili gledateljski prostor; - pozivanje, poticanje i sudjelovanje u tučnjavi ili napadu na druge gledatelje, redare, službene osobe organizatora natjecanja, sportaše i druge sudionike u sportskom natjecanju; - unošenje i isticanje transparenta, zastave ili druge stvari s obilježjem rasističke ili druge poruke koja može izazvati nesnošljivost, kao i pjevanje rasističkih, nedoličnih ili uvredljivih pjesama, ili pogrdno dobacivanje natjecateljima i drugim sudionicima sportskog natjecanja, te drugim gledateljima; - neovlašteno ulaženje u", "sportaše i druge sudionike u sportskom natjecanju; - unošenje i isticanje transparenta, zastave ili druge stvari s obilježjem rasističke ili druge poruke koja može izazvati nesnošljivost, kao i pjevanje rasističkih, nedoličnih ili uvredljivih pjesama, ili pogrdno dobacivanje natjecateljima i drugim sudionicima sportskog natjecanja, te drugim gledateljima; - neovlašteno ulaženje u prostor na kome se događa sportsko natjecanje; - oštećivanje ili uništavanje dijelova sportskog objekta, te prijevoznih sredstava natjecatelja i navijača i druge imovine prilikom dolaska, za vrijeme održavanja i nakon završetka sportskog natjecanja. (2) Za vrijeme održavanja sportskih natjecanja visokog rizika, kada se očekuje više od pet stotina gledatelja, u objektu na kojem se natjecanje održava zabranjena je prodaja, davanje i uzimanje alkoholnih pića dva sata prije i dva sata poslije natjecanja. Članak 108. Neposredni organizator sportskih natjecanja, u sportskom objektu odnosno objektu u kojem se održava sportsko natjecanje, obvezan je natjecateljima, drugim sudionicima u natjecanju (suci, delegati i druge službene osobe u funkciji natjecanja) i gledateljima osigurati sigurnost i pružanje osnovne i hitne medicinske pomoći. Članak 109. (1) Sportske priredbe su festivali, smotre, susreti, igre i sl. koje se izvode u cilju popularizacije sporta ili u vezi s obilježavanjem nekog događaja. (2) Na organiziranje sportske priredbe i njezine sudionike odgovarajuće se primjenjuju odredbe ovoga Zakona o sportskim natjecanjima. 27 2. Posebna zdravstvena zaštita sportaša Članak 110. (1) U sportskom natjecanju ili sportskoj priredbi ne može sudjelovati osoba za koju nije u razdoblju od šest mjeseci prije sportskog natjecanja ili priredbe utvrđena opća zdravstvena sposobnost, a kada je to propisano i posebna zdravstvena sposobnost, ako propisima nacionalnoga sportskog saveza nije određeno kraće razdoblje. (2) Opću i posebnu zdravstvenu sposobnost utvrdit će liječnik s odgovarajućom edukacijom iz sportske medicine kojeg odredi sportska zajednica županije ili grada. U slučaju da takvog profila liječnika nema, utvrđivanje zdravstvene sposobnosti povjerit će se specijalistu medicine rada. Članak 111. (1) Sportaša se ne može obvezivati na trening, sportsko natjecanje ili sportsku priredbu ako nadležni liječnik utvrdi zdravstvenu nesposobnost ili opasnost od pogoršanja zdravstvenog stanja. (2) Zdravstveno nesposobnom sportašu ne smije se dopustiti sudjelovanje u sportskom natjecanju. Članak 112. (1) Sportašima se ne smiju davati nedopuštena sredstva (doping), niti ih oni smiju uzimati ili primjenjivati postupke koji su u suprotnosti s pravilima Hrvatskoga olimpijskog odbora i Međunarodnoga olimpijskog odbora. (2) Sportaši, klubovi, sportski savezi i drugi organizatori sportskih natjecanja obvezni su dopustiti obavljanje doping kontrole. Članak 113. (1) Kad se utvrdi da je sportaš uzimao nedopuštena sredstva, komisija ili liječnik koji je to utvrdio dužni su u roku od tri dana od dana utvrđivanja nalaza podnijeti pismeno izvješće s nalazima nacionalnom sportskom savezu. (2) Nacionalni sportski savez obvezan je u roku od 8 dana od dana primitka izvješća iz stavka 1. ovoga članka podnijeti prekršajnu prijavu nadležnom sudu protiv osobe koja je davala i osobe koja je uzimala nedopuštena sredstva. (3) Nacionalni sportski savezi svojim općim aktima propisuju postupke u slučaju pozitivnog nalaza o uzimanju nedopuštenih sredstava ili primjeni zabranjenih postupaka sukladno propisima međunarodnih sportskih udruženja i općim aktima Hrvatskoga olimpijskog odbora. (4) Sportašu za kojeg je", "sudu protiv osobe koja je davala i osobe koja je uzimala nedopuštena sredstva. (3) Nacionalni sportski savezi svojim općim aktima propisuju postupke u slučaju pozitivnog nalaza o uzimanju nedopuštenih sredstava ili primjeni zabranjenih postupaka sukladno propisima međunarodnih sportskih udruženja i općim aktima Hrvatskoga olimpijskog odbora. (4) Sportašu za kojeg je nedvojbeno utvrđeno da je uzimao nedopuštena sredstva nacionalni sportski savez izreći će disciplinsku mjeru zabrane nastupanja na svim sportskim natjecanjima u trajanju najmanje od jedne godine. Članak 114. (1) U sportskim natjecanjima u kojima sudjeluju životinje, utvrđuje se zdravstvena sposobnost životinja koje sudjeluju u natjecanjima. Zdravstvenu sposobnost životinja za natjecanja utvrđuje veterinar s odgovarajućom stručnom spremom. 28 (2) Životinja ne može sudjelovati u sportskom natjecanju ako veterinar utvrdi njezinu zdravstvenu nesposobnost za natjecanje. (3) Životinjama koje sudjeluju u sportskim natjecanjima ne smiju se davati nedopuštena doping sredstva, niti se nad njima smiju primjenjivati nedopušteni postupci. (4) Klubovi, organizatori sportskih natjecanja i sportaši koji se natječu sa životinjama obvezni su dopustiti obavljanje doping kontrole nad životinjama koje sudjeluju u natjecanjima. (5) Uvjete utvrđivanja zdravstvene sposobnosti životinja za sudjelovanje u natjecanjima, način provođenja doping kontrole, postupke u slučaju pozitivnog nalaza o davanju nedopuštenih sredstava ili primjeni nedopuštenih postupaka na životinjama propisuje svojim općim aktom odgovarajući nacionalni sportski savez. 3. Povjerenstvo za borbu protiv dopinga u sportu Članak 115. (1) Radi praćenja i provođenja propisa Republike Hrvatske i prihvaćenih međunarodnih konvencija protiv dopinga u sportu u Republici Hrvatskoj, Vlada Republike Hrvatske osnovat će se povjerenstvo za borbu protiv dopinga u sportu (u daljnjem tekstu: Povjerenstvo za antidoping), kao stručno savjetodavno tijelo. (2) Povjerenstvo za antidoping ima devet članova. Voditelja i članove Povjerenstva imenuje Vlada Republike Hrvatske iz reda istaknutih stručnjaka i sportskih djelatnika. Po jedan član Povjerenstva imenuje se na prijedlog ministarstva nadležnog za poslove sporta, ministarstva zdravstva i Hrvatskog olimpijskog odbora. (3) Mandat članova Povjerenstva traje četiri godine. (4) Povjerenstvo za antidoping sustavno prati i koordinira akcije vladinih i nevladinih organizacija u borbi protiv dopinga u sportu te predlaže Vladi Republike Hrvatske mjere u borbi protiv dopinga u sportu. (5) Nadležnosti, organizacija i način rada Povjerenstva za antidoping uređuju se aktom Vlade Republike Hrvatske o osnivanju Povjerenstva za antidoping. IX. SPORTSKI OBJEKTI Članak 116. (1) Sportskim objektima smatraju se uređene i opremljene površine i objekti koji zadovoljavaju uvjete za obavljanje sportske djelatnosti (u daljem tekstu: sportski objekti), u skladu s odredbama ovoga Zakona. (2) Javni sportski objekti su sportski objekti u vlasništvu jedinica lokalne i područne (regionalne) samouprave i Republike Hrvatske. Javnim sportskim objektima smatraju se i drugi sportski objekti koji se trajno koriste za izvođenje programa javnih potreba u sportu. (3) U slučaju sumnje, ministar nadležan za poslove sporta rješenjem određuje smatra li se neki objekt sportskim objektom. Članak 117. (1) Radi planske izgradnje i obnove sportskih objekata, za prostorne planove jedinica lokalne i područne (regionalne) samouprave, mreža sportskih objekata je obvezna stručna podloga za izradu dokumenata prostornog uređenja čiji je sadržaj određen propisima o prostornom uređenju. 29 (2) Sportski objekti Oružanih snaga Republike Hrvatske za koje postoje uvjeti i odobrenje", "Radi planske izgradnje i obnove sportskih objekata, za prostorne planove jedinica lokalne i područne (regionalne) samouprave, mreža sportskih objekata je obvezna stručna podloga za izradu dokumenata prostornog uređenja čiji je sadržaj određen propisima o prostornom uređenju. 29 (2) Sportski objekti Oružanih snaga Republike Hrvatske za koje postoje uvjeti i odobrenje Ministarstva obrane da se koriste i u sportske svrhe za potrebe građanstva, također su sastavni dio mreže sportskih objekata. (3) Mrežu sportskih objekata donosi nadležno tijelo jedinice lokalne i područne (regionalne) samouprave u skladu s prostornim uvjetima, standardima i normativima iz stavka 5. ovoga članka, svako u svom djelokrugu uz obvezno mišljenje pripadajuće sportske zajednice. (4) Pri planiranju izgradnje stambenih naselja, obvezno se planira izgradnja sportskih objekata koji služe djeci, mladeži, studentima, građanima te osobama s invaliditetom. (5) Prostorne uvjete, standarde i normative prostornog uređenja za izradu mreže sportskih objekata te posebne uvjete glede njihove namjene propisuje pravilnikom ministar nadležan za poslove sporta uz prethodnu suglasnost ministra zaštite okoliša i prostornog uređenja. Članak 118. (1) Hrvatski sabor, pri donošenju Nacionalnog programa sporta iz članka 134. ovoga Zakona, utvrđuje program izgradnje kapitalnih sportskih objekata od nacionalnog značaja za daljnji razvoj sporta u Republici Hrvatskoj. (2) Programom izgradnje sportskih objekata iz stavka 1. ovoga članka planiraju se u pravilu višenamjenski sportski objekti u svakoj županiji i u Gradu Zagrebu koje je potrebno izgraditi tijekom razdoblja provedbe Nacionalnog programa sporta. (3) Građenje sportskih objekata iz stavka 1. ovoga članka potiče se financiranjem iz državnog proračuna, proračuna jedinica lokalne i područne (regionalne) samouprave, iz dijela prihoda od igara na sreću i nagradnih igara i iz drugih izvora. (1) Ministar nadležan za poslove sporta pravilnikom će propisati obvezne postupke i Članak 119. sudionike pri izradi programa za projektiranje i izgradnju sportskih objekata. (2) Ministar nadležan za poslove sporta pravilnikom će propisati, uz prethodnu suglasnost ministra zaštite okoliša i prostornog uređenja, posebne uvjete za projektiranje, gradnju, opremanje i održavanje sportskih objekata glede njihove namjene. (3) Zahtjevu za izdavanje građevinske dozvole investitor javnog sportskog objekta za koje je procjena troškova gradnje veća od 1.000.000,00 kuna, dužan je priložiti potvrdu ministarstva nadležnog za poslove sporta o usklađenosti postupka i glavnog projekta s uvjetima iz stavka 1. i 2. ovoga članka. (4) Ministarstvo nadležno za poslove sporta dužno je potvrdu iz stavka 3. ovoga članka izdati u roku 30 dana od dana podnošenja zahtjeva, ili u istom roku odbiti zahtjev rješenjem ako glavni projekt nije izrađen u skladu s uvjetima iz stavka 1. i 2. ovoga članka. Članak 120. Posebne uvjete koji se odnose na sigurnost korisnika uređenih skijališta i kupališta pravilnikom propisuje ministar nadležan za poslove sporta, ako drugim propisima to nije uređeno. Članak 121. (1) Ukloniti, odnosno prenamijeniti javni sportski objekt za namjene koje nisu sportske djelatnosti može se samo uz prethodnu suglasnost ministarstva nadležnog za poslove sporta. 30 (2) Građevna dozvola za uklanjanje javnog sportskog objekta i za njegovu građevnu prenamjenu izdaje se prema posebnom propisu uz prethodnu suglasnost tijela državne uprave županije odnosno Grada Zagreba nadležnog za poslove sporta na čijem području se isti objekt", "može se samo uz prethodnu suglasnost ministarstva nadležnog za poslove sporta. 30 (2) Građevna dozvola za uklanjanje javnog sportskog objekta i za njegovu građevnu prenamjenu izdaje se prema posebnom propisu uz prethodnu suglasnost tijela državne uprave županije odnosno Grada Zagreba nadležnog za poslove sporta na čijem području se isti objekt nalazi. (3) Prethodne suglasnosti iz stavka 1. i 2. ovoga članka ne mogu se izdati ako investitor prenamjene javnog sportskog objekta, odnosno vlasnik javnog sportskog objekta kojeg se uklanja ne preuzme obvezu i osigura uvjete izgradnje odgovarajućeg zamjenskog javnog sportskog objekta. (4) Za uklanjanje ili prenamjenu javnoga sportskog objekta obvezno je prethodno mišljenje sportske zajednice na čijem se području djelovanja nalazi sportski objekt. Članak 122. (1) Sportski objekt od osobitog interesa za Republiku Hrvatsku temeljem ovog Zakona je Hrvatski olimpijski centar \"Bjelolasica\". (2) Interes iz stavka 1. ovoga članka ostvaruje se iznadpolovičnim udjelom Republike Hrvatske u vlasništvu, a sportski interes se ostvaruje obveznim sudjelovanjem po jednog predstavnika ministarstva nadležnog za poslove sporta i Hrvatskoga olimpijskog odbora u Nadzornom odboru Hrvatskoga olimpijskog centara \"Bjelolasica\". (3) Sportski objekti od osobitog interesa za Republiku Hrvatsku mogu se utvrditi i Nacionalnim programom sporta. Članak 123. (1) U upravljanju sportskim objektima u vlasništvu jedinica lokalne i područne trećina (regionalne) samouprave, s predstavnicima vlasnika sudjeluje najmanje predstavnika sportskih zajednica. jedna (2) Program održavanja, korištenja i izgradnje sportskih objekata obvezni je dio programa javnih potreba u sportu i donosi se u jednakom postupku na temelju prijedloga sportske zajednice. (3) Prioritet u korištenju javnih sportskih objekata imaju programi javnih potreba u sportu, a prije svega programi sporta djece i mladeži. Članak 124. (1) Na javnim sportskim objektima cijena komunalnih usluga formira se kao i za odgojno-obrazovne ustanove. (2) Na javnim sportskim objektima kapaciteta manjeg od 2.500 gledatelja cijena energenata utrošenih za vrijeme njihova korištenja formira se kao i za odgojno-obrazovne ustanove. Članak 125. Promjena namjene javnih sportskih objekata i drugih nekretnina stečenih na temelju Zakona o športu (Narodne novine, br. 60/92, 25/93, 11/94 i 77/95), te drugih javnih sportskih objekata u druge namjene koje nisu sportska djelatnost može se izvršiti samo sukladno planskim dokumentima prostornog uređenja, i u skladu s člankom 121. ovoga Zakona. 31 Članak 126. (1) U odlučivanju o prijenosu vlasništva ili suvlasništva na javnim sportskim objektima moraju se uzeti u obzir sljedeća mjerila: 1. značaj sportskog objekta za zadovoljavanje programa javnih potreba sporta jedinice lokalne i područne (regionalne) samouprave i Republike Hrvatske; 2. potrebe školstva, jedinice lokalne i područne (regionalne) samouprave i države, visina ulaganja pojedine jedinice lokalne samouprave i uprave ili njezina prednika novčanih i drugih sredstava i vrijednosti u izgradnju, opremanje i investicijsko održavanje sportskog objekta; 3. mogućnost preuzimanja postojećih obveza sportskog objekta; 4. spremnost i mogućnost budućeg vlasnika sportskog objekta na preuzimanje obveza usmjeravanja i korištenja sredstava od obavljanja sportskih djelatnosti i sredstava od drugih pratećih aktivnosti te djelatnosti na sportskom objektu, na poboljšanje i razvoj sportskog objekta za funkcije sporta; 5. spremnost i mogućnost budućeg vlasnika sportskog objekta na ulaganje sredstava iz drugih izvora za poboljšavanje i unapređivanje sportskog objekta za", "obveza usmjeravanja i korištenja sredstava od obavljanja sportskih djelatnosti i sredstava od drugih pratećih aktivnosti te djelatnosti na sportskom objektu, na poboljšanje i razvoj sportskog objekta za funkcije sporta; 5. spremnost i mogućnost budućeg vlasnika sportskog objekta na ulaganje sredstava iz drugih izvora za poboljšavanje i unapređivanje sportskog objekta za funkcije sporta; 6. bonitet budućeg vlasnika u poslovnom i sportskom smislu. (2) Nadležno tijelo jedinice lokalne i područne (regionalne) samouprave prilikom odlučivanja o prijenosu vlasništva na javnom sportskom objektu iz stavka 1. ovoga članka obvezno je pribaviti mišljenje sportske zajednice. Članak 127. (1) Za promjenu vlasničko-pravnog statusa javnoga sportskog objekta ili njegovu funkcionalnu reorganizaciju obvezan je elaborat o gospodarskoj i sportskoj opravdanosti promjene. (2) Na elaborat iz stavka 1. ovoga članka suglasnost daje ministarstvo nadležno za poslove sporta. (3) Pri prodaji sportskih objekata u privatnom vlasništvu pravo prvokupa ima jedinica lokalne i područne (regionalne) samouprave na čijem području se sportski objekti nalaze. Članak 128. (1) Vlasnici javnih sportskih objekata dužni su pri izboru zakupoprimca voditi računa o mjerilima iz članka 126. ovoga Zakona te pribaviti mišljenje sportske zajednice i ugovoriti s budućim zakupoprimcima preuzimanje obveza da se sportskom objektu ne može mijenjati sportska namjena. (2) Trajanje zakupa na sportskim objektima iz stavka 1. ovog članka i drugim sportskim objektima u javnom vlasništvu ne može biti kraće od pet godina. (3) Davalac u zakup sportskih objekata iz stavka 1. ovoga članka stalno će kontrolirati namjensko korištenje sportskih objekata danih u zakup. (4) Ministarstvo nadležno za poslove sporta ima pravo provjere ugovora o zakupu u vezi s odredbama ovoga Zakona. (5) Pri dodjeli koncesija na pomorskom dobru, javnom vodnom dobru i drugim zemljištima i dobrima na kojima se nalaze sportski objekti iz stavka 1. ovoga članka, prednost pri dodjeli koncesije imaju sportski klubovi koji su se tim sportskim objektima koristili, ako ispunjavaju uvjete određene posebnim zakonima. (6) Jedinice lokalne i područne (regionalne) samouprave dužne su način davanja u zakup ili prenamjenu javnog sportskog objekta urediti općim aktom. 32 X. FINANCIRANJE SPORTA Članak 129. (1) Sport se financira iz prihoda koje pravne i fizičke osobe iz sustava sporta ostvare: obavljanjem sportske djelatnosti, članarinama, iz dijela prihoda od igara na sreću i nagradnih igara te sredstava kojima jedinice lokalne i područne (regionalne) samouprave i država pomažu sport financiranjem iz svojih proračuna za javne potrebe u sportu, iz fondova, donacija i drugih izvora u skladu sa zakonom. (2) Financiranje razvoja sporta i sportskih djelatnosti stimulirati će se gospodarskim mjerama. Članak 130. (1) Republika Hrvatska, županije, Grad Zagreb, gradovi i općine utvrđuju javne potrebe u sportu i za njihovo ostvarivanje osiguravaju financijska sredstva iz svojih proračuna u skladu s ovim Zakonom. (2) Pri utvrđivanju javnih potreba iz stavka 1. ovoga članka polazi se od potreba i mogućnosti društva i dostignuća u sportu suvremenoga svijeta. Članak 131. (1) Javne potrebe u sportu na državnoj razini su programi, odnosno aktivnosti, poslovi i djelatnosti: 1. poticanje i promicanje sporta, osobito sporta djece i mladeži; 2. djelovanje nacionalnih sportskih saveza i Hrvatskoga olimpijskog odbora; i provođenje nacionalnih prvenstava 3. organiziranje", "mogućnosti društva i dostignuća u sportu suvremenoga svijeta. Članak 131. (1) Javne potrebe u sportu na državnoj razini su programi, odnosno aktivnosti, poslovi i djelatnosti: 1. poticanje i promicanje sporta, osobito sporta djece i mladeži; 2. djelovanje nacionalnih sportskih saveza i Hrvatskoga olimpijskog odbora; i provođenje nacionalnih prvenstava 3. organiziranje i međunarodnih sportskih natjecanja reprezentativne razine; 4. posebna skrb o vrhunskim i darovitim sportašima te zapošljavanje visokoobrazovanih stručnjaka iz područja sporta u nacionalnim sportskim savezima; 5. poticanje sportsko-rekreativnih aktivnosti osoba s invaliditetom; 6. organiziranje posebne zdravstvene zaštite sportaša, posebno u svezi sa sprečavanjem uzimanja nedopuštenih sredstava (antidoping) u skladu s prihvaćenim međunarodnim konvencijama; 7. poticanje planiranja i izgradnje kapitalnih sportskih objekata nacionalnog značaja; 8. obavljanje stručnog nadzora u sportu; 9. dodjeljivanje državne nagrade sporta \"Franjo Bučar\"; 10. poticanje aktivnosti školskih sportskih klubova i saveza; 11. međunarodne obveze Republike Hrvatske u sportu; 12. istraživačko-razvojni i stručni rad te obrazovne i informacijske djelatnosti u sportu, što predstavlja osnovu ili je u funkciji realizacije javnih potreba iz stavka 1. točke 1. do 10. ovoga članka. (2) Programe javnih potreba iz stavka 1. ovoga članka donosi Hrvatski sabor na prijedlog Vlade Republike Hrvatske, zajedno s državnim proračunom. (3) Za izvršenje programa javnih potreba iz stavka 1. ovog članka osiguravaju se sredstva u državnom proračunu i iz dijela prihoda od priređivanja igara na sreću i nagradnih igara u smislu Zakona o priređivanju igara na sreću i nagradnih igara. (4) Programe zadovoljavanja javnih potreba iz stavka 1. ovoga članka koji se odnose na djelovanje nacionalnih sportskih saveza, osobito sporta djece i mladeži, organiziranje i provođenje nacionalnih prvenstava i međunarodnih sportskih natjecanja reprezentativne razine, 33 zapošljavanje visokoobrazovanih stručnjaka iz područja sporta, stručni rad u sportu, predlažu nacionalni sportski savezi i odgovorni su za izvršenje programa za koje su sredstva osigurana na temelju stavka 3. ovoga članka, a izvješće o izvršenju programa i utrošku financijskih sredstava podnose Hrvatskom olimpijskom odboru. (5) Programe zadovoljavanja javnih potreba iz stavka 1. ovoga članka koji se odnose na poticanje i promicanje sporta, osobito sporta djece i mladeži, djelovanje Hrvatskoga olimpijskog odbora, provođenje olimpijskih igara, mediteranskih igara i drugih značajnijih međunarodnih natjecanja, posebnu skrb o vrhunskim i darovitim sportašima te zapošljavanje visokoobrazovanih stručnjaka iz područja sporta, skrb o sprečavanju uzimanja nedopuštenih sredstava (antidoping), istraživačko-razvojni i stručni rad te obrazovne i informacijske djelatnosti u sportu i u vezi s potrebama u sportu, predlaže Hrvatski olimpijski odbor i odgovoran je za izvršenje programa i utrošak financijskih sredstava osiguranih na temelju stavka 3. ovoga članka. (6) Hrvatski olimpijski odbor sudjeluje u izradi programa za zadovoljavanje javnih potreba iz stavka 4. i 5. ovoga članka objedinjuje programe i predlaže ih Vladi Republike Hrvatske za financiranje iz državnog proračuna. (7) O izvršenju programa zadovoljavanja javnih potreba u sportu iz stavka 4. i 5. ovoga članka i utrošku financijskih sredstava koja se osiguravaju suglasno stavku 3. ovoga članka, Hrvatski olimpijski odbor podnosi izvješće Vladi Republike Hrvatske u rokovima propisanim za izvješća o izvršenju državnog proračuna. (8) Programe za zadovoljavanje javnih potreba iz stavka 1. ovoga članka koji se odnose", "iz stavka 4. i 5. ovoga članka i utrošku financijskih sredstava koja se osiguravaju suglasno stavku 3. ovoga članka, Hrvatski olimpijski odbor podnosi izvješće Vladi Republike Hrvatske u rokovima propisanim za izvješća o izvršenju državnog proračuna. (8) Programe za zadovoljavanje javnih potreba iz stavka 1. ovoga članka koji se odnose na financiranje poticanja sportsko-rekreativnih aktivnosti osoba s invaliditetom, predlažu Vladi Republike Hrvatske nacionalni sportski savezi iz članka 23. ovoga Zakona, svaki u svom djelokrugu i odgovorni su za izvršenje programa za koje su sredstva osigurana suglasno stavku 3. ovoga članka. Izvješća o izvršenju programa i utrošku financijskih sredstava nacionalni sportski savezi iz članka 23. ovoga Zakona podnose Vladi Republike Hrvatske u rokovima propisanim za izvješća o izvršenju državnog proračuna. (9) Programe za zadovoljavanje javnih potreba iz stavka 1. ovoga članka koji se odnose na financiranje studentskih sportskih udruga i Hrvatskog sveučilišnog sportskog saveza predlaže Hrvatski sveučilišni sportski savez i odgovoran je za izvršenje programa za koje su sredstva osigurana u državnom proračunu, a izvješća o izvršenju programa i utrošku financijskih sredstava podnosi Ministarstvu znanosti i tehnologije. (10) Programe za zadovoljavanje javnih potreba iz stavka 1. ovoga članka koji se odnose na financiranje sporta djece i mladeži, posebice sportske djelatnosti školskih sportskih klubova, županijskih školskih sportskih saveza i Hrvatskoga školskoga sportskog saveza, kao i udruga za promicanje sporta djece i mladeži, poticanje planiranja i izgradnje kapitalnih sportskih objekata nacionalnog značaja, obavljanje stručnog nadzora u sportu, dodjeljivanje državne nagrade sporta \"Franjo Bučar\", za međunarodne obveze Republike Hrvatske u sportu te razvojne, istraživačke, stručne i informacijske djelatnosti u funkciji školskih sportskih klubova djece i mladeži, predlaže ministarstvo nadležno za poslove sporta. (11) Za izvršenje programa javnih potreba iz stavka 10. ovoga članka ministarstvo nadležno za poslove sporta određuje nositelje provedbe, prati i nadzire izvršenje programa te prati korištenje i utrošak sredstava. (12) Ministarstvo nadležno za poslove sporta prati i nadzire izvršenje programa javnih potreba iz stavka 1. ovog članka te prati korištenje i utrošak sredstava za te programe. (13) Izdvajanje sredstava i uplate za izvršenje programa javnih potreba iz ovoga članka provodit će se sukladno Zakonu o proračunu i sustavu državne riznice. (1) Javne potrebe u sportu za koje se sredstva osiguravaju iz proračuna jedinica lokalne i Članak 132. 34 područne (regionalne) samouprave su programi, odnosno aktivnosti, poslovi i djelatnosti: 1. poticanje i promicanje sporta; 2. provođenje izvannastavnih i izvanškolskih sportskih aktivnosti djece i mladeži; 3. djelovanje sportskih zajednica i saveza; 4. trening, domaća i međunarodna natjecanja te opća i posebna zdravstvena zaštita sportaša; 5. zapošljavanje visokoobrazovanih stručnjaka iz područja sporta u klubovima, savezima i sportskim zajednicama; 6. sportsko-rekreacijske aktivnosti građana, kao i druge sportske aktivnosti koje su u funkciji unapređenja psihofizičkih sposobnosti građana; 7. sportske aktivnosti osoba s invaliditetom i drugih osoba oštećena zdravlja; 8. planiranje, izgradnja, održavanje i korištenje sportskih objekata značajnih za jedinicu lokalne i područne (regionalne) samouprave; 9. stručni rad u sportu, obrazovna i informacijska djelatnost u sportu, što predstavlja osnovu ili je u funkciji realizacije javnih potreba iz stavka 1. točke 1. do 8. ovoga članka. (2) Program", "oštećena zdravlja; 8. planiranje, izgradnja, održavanje i korištenje sportskih objekata značajnih za jedinicu lokalne i područne (regionalne) samouprave; 9. stručni rad u sportu, obrazovna i informacijska djelatnost u sportu, što predstavlja osnovu ili je u funkciji realizacije javnih potreba iz stavka 1. točke 1. do 8. ovoga članka. (2) Program javnih potreba iz stavka 1. ovoga članka objedinjuje, priprema i predlaže sportska zajednica, a na prijedlog poglavarstva donosi predstavničko tijelo jedinice lokalne i područne (regionalne) samouprave, zajedno s godišnjim proračunom. (3) Programe javnih potreba iz stavka 1. ovog članka koji se odnose na provođenje izvannastavnih i izvanškolskih sportskih aktivnosti djece i mladeži pripremaju i predlažu školski sportski savezi, sportske zajednice, uredi državne uprave u jedinicama područne (regionalne) samouprave nadležni za poslove sporta i tijela jedinica lokalne samouprave nadležna za poslove sporta. (4) Za izvršenje programa zadovoljavanja javnih potreba iz stavka 1. ovoga članka tijela jedinica lokalne i područne (regionalne) samouprave osiguravaju sredstva u godišnjim proračunima. (5) Za programe zadovoljavanja javnih potreba iz stavka 1. točke 1. do 7. i točke 9. ovoga članka odgovorne su sportske zajednice u jedinici lokalne i područne (regionalne) samouprave. O izvršenju programa za koje su im sredstva osigurana u proračunima jedinica lokalne i područne (regionalne) samouprave podnose izvješće poglavarstvu jedinice lokalne i područne (regionalne) samouprave u rokovima propisanim za izvješća o izvršenju proračuna. (6) Sredstvima za zadovoljavanje javnih potreba iz stavka 1. točke 1. do 7. i točke 9. ovoga članka raspolaže sportska zajednica u jedinicama lokalne i područne (regionalne) samouprave. (7) Sredstvima za zadovoljavanje javnih potreba iz stavka 1. točke 8. ovoga članka raspolaže nadležno tijelo za poslove sporta u jedinici lokalne i područne (regionalne) samouprave. (8) Tijela jedinica lokalne i područne (regionalne) samouprave nadležna za poslove sporta prate i nadziru izvršenje programa javnih potreba iz stavka 1. ovoga članka, te prate korištenje i utrošak sredstava za te programe. XI. SPORTSKE ZAKLADE I SPORTSKE FUNDACIJE Članak 133. (1) Radi unapređenja sporta kao općekorisne djelatnosti ili ostvarenja neke općekorisne svrhe u sportu, mogu se osnivati sportske zaklade i sportske fundacije. 35 (2) Sportska zaklada je imovina koja je trajno namijenjena da sama odnosno prihodima što ih stječe ostvaruje općekorisnu sportsku djelatnost ili svrhu. (3) Sportska fundacija je imovina namijenjena da u određenom razdoblju služi unapređenju ili ostvarenju neke konkretne općekorisne sportske djelatnosti ili svrhe. (4) Sportske zaklade i sportske fundacije osnivaju se, registriraju, posluju i prestaju postojati prema odredbama Zakona o zakladama i fundacijama. XII. NACIONALNI PROGRAM SPORTA Članak 134. (1) Radi ostvarivanja dugoročnih interesa Republike Hrvatske u području sporta donosi se Nacionalni program sporta kojim se utvrđuju sportski razvojni ciljevi u desetogodišnjem razdoblju te obveze i zadaće države i nositelja javnih sportskih programa u tom razdoblju. (2) Nacionalni program sporta donosi Hrvatski sabor na prijedlog Vlade Republike Hrvatske. (3) Nacionalni program sporta obuhvaća: 1. utvrđivanje kapitalnih sportskih objekata nacionalnoga značenja i njihovu izgradnju; 2. izobrazbu stručnih kadrova; 3. zapošljavanje stručnih kadrova; 4. stvaranje uvjeta za svakodnevno bavljenje sportom u odgojno-obrazovnom sustavu; 5. istraživačko-razvojne i druge projekte u funkciji razvoja i unapređenja sportskih djelatnosti; 6.", "prijedlog Vlade Republike Hrvatske. (3) Nacionalni program sporta obuhvaća: 1. utvrđivanje kapitalnih sportskih objekata nacionalnoga značenja i njihovu izgradnju; 2. izobrazbu stručnih kadrova; 3. zapošljavanje stručnih kadrova; 4. stvaranje uvjeta za svakodnevno bavljenje sportom u odgojno-obrazovnom sustavu; 5. istraživačko-razvojne i druge projekte u funkciji razvoja i unapređenja sportskih djelatnosti; 6. nove izvore financiranja sportskih djelatnosti; 7. ulaganja u uvjete za stvaranje vrhunskih sportskih dometa; 8. programe velikih sportskih natjecanja i priredbi u funkciji promicanja i razvoja sporta na državnoj i područnoj (regionalnoj) razini; 9. suradnju sportskih, gospodarskih i drugih partnera. (4) Za svaku zadaću u Nacionalnom programu sporta utvrđuju se nositelji pripreme i provedbe, rokovi, izvori financiranja i procjena učinaka. (5) Nacionalnim programom sporta posebno se utvrđuju obveze državnih tijela i tijela lokalne i područne (regionalne) samouprave, Hrvatskoga olimpijskog odbora, nacionalnih sportskih saveza i područnih (regionalnih) sportskih zajednica u provedbi programskih zadaća. (6) Izvršenje Nacionalnog programa sporta financira se sredstvima iz državnog proračuna, i iz dijela prihoda od priređivanja igara na sreću i nagradnih igara sukladno odredbama članka 10. Zakona o priređivanju igara na sreću i nagradnih igara (Narodne novine, br. 83/02). (7) Izvršenje dijela Nacionalnog programa sporta koji se realizira u županijama i gradovima sufinancira se iz proračuna županija i gradova u kojima se taj program realizira. (8) Sredstva iz stavka 6. ovog članka raspoređuju se u državnom proračunu u razdjelu ministarstva nadležnog za poslove sporta na aktivnost Nacionalni program sporta. (9) Državna tijela i pravni subjekti iz stavka 5. ovoga članka dostavljaju ministarstvu nadležnom za poslove sporta izvješća o izvršenju utvrđenih obveza i provedbi programskih zadaća. (10) Godišnji programi javnih potreba u sportu na državnoj i na lokalnim odnosno područnim (regionalnim) razinama u funkciji su izvršenja Nacionalnog programa sporta. 36 XIII. EVIDENCIJE I INFORMACIJSKI SUSTAV U SPORTU Članak 135. (1) Tijela državne vlasti, Hrvatski olimpijski odbor i udruge u području sporta vode evidencije u sportu. (2) Ustroj, vrste, sadržaj, oblik i izvore evidencija u sportu pravilnikom propisuje ministar nadležan za poslove sporta. Članak 136. (1) Informacijski sustav u sportu omogućava ostvarivanje zadaća u sportu, a posebno: - prikupljanje, praćenje, čuvanje, obrađivanje i dostavljanje podataka značajnih za sport; - pravodobno utvrđivanje stanja i praćenje događaja u sportu; - uočavanje nastalih promjena i mogućnosti utjecanja na njih; - osiguravanje potrebnih elemenata za ostvarivanje politike sporta i promicanje sporta; - protok podataka i informacija za djelotvornu javnu uporabu. (2) Informacijski sustav u sportu uspostavlja ministarstvo nadležno za poslove sporta i Hrvatski olimpijski odbor u sklopu svojih djelokruga odnosno zadaća. XIV. UPRAVNI, INSPEKCIJSKI I STRUČNI NADZOR 1. Upravni nadzor Članak 137. (1) Upravni nadzor nad provedbom ovoga Zakona i propisa donesenih na temelju ovoga Zakona provodi ministarstvo nadležno za poslove sporta. (2) Nadzor te zakonitost rada i postupanje ureda državne uprave nadležnih za poslove sporta u županijama odnosno Gradu Zagrebu provodi ministarstvo nadležno za poslove sporta. 2. Inspekcijski nadzor u sportu Članak 138. (1) Inspekcijski nadzor se provodi nad radom pravnih i fizičkih osoba koje obavljaju sportske djelatnosti. (2) Inspekcijski nadzor nad radom pravnih i fizičkih osoba u obavljanju sportskih djelatnosti provodi", "za poslove sporta u županijama odnosno Gradu Zagrebu provodi ministarstvo nadležno za poslove sporta. 2. Inspekcijski nadzor u sportu Članak 138. (1) Inspekcijski nadzor se provodi nad radom pravnih i fizičkih osoba koje obavljaju sportske djelatnosti. (2) Inspekcijski nadzor nad radom pravnih i fizičkih osoba u obavljanju sportskih djelatnosti provodi ured državne uprave nadležan za poslove sporta u županijama odnosno Gradu Zagrebu, ako ovim Zakonom nije drukčije uređeno. (3) Inspekcijski nadzor nad radom javnih ustanova za obavljanje sportskih djelatnosti u smislu ovoga Zakona, nacionalnih sportskih saveza i nad Hrvatskim olimpijskim odborom provodi ministarstvo nadležno za poslove sporta. Članak 139. U provedbi inspekcijskoga nadzora osobito se utvrđuje: 1. obavlja li se sportska djelatnost u skladu s ovim Zakonom, aktom o osnivanju i statutom, s upisom u odgovarajući registar (registar udruga, registar ustanova, registar sportskih 37 djelatnosti koje se obavljaju samostalnim radom, obrtni registar, registar trgovačkih društava), te u skladu sa suglasnošću odnosno odobrenjem za obavljanje sportske djelatnosti; 2. je li statut odnosno drugi opći akt donesen na Zakonom utvrđeni način te je li njihov sadržaj u skladu sa zakonom; 3. obavlja li stručne poslove u sportu osoba koja ima odgovarajuću stručnu spremu odnosno stručnu osposobljenost prema odredbama ovoga Zakona; 4. imaju li pravne i fizičke osobe koje obavljaju sportsku djelatnost odgovarajuće sportske objekte i sportsku opremu, u skladu s ovim Zakonom; 5. organiziraju li se sportska natjecanja u skladu s ovim Zakonom i drugim propisima; 6. imaju li osobe koje sudjeluju u sportskim natjecanjima utvrđenu odgovarajuću zdravstvenu sposobnost; 7. provode li se javne potrebe u sportu koje se financiraju iz proračuna sukladno usvojenim programima. 3. Nadzor nad stručnim radom u sportu Članak 140. (1) Nadzor nad stručnim radom u sportu obuhvaća sustavno i organizirano praćenje stručnog rada i obavljanja stručnih poslova u sportu, a osobito obavljanja poduke i treninga sportaša, programiranja i vođenja organiziranih izvannastavnih i izvanškolskih tjelesnih aktivnosti djece i mladeži i programiranja i vođenja sportske rekreacije. (2) Nadzor iz stavka 1. ovoga članka obavlja se kod pravnih i fizičkih osoba koje obavljaju sportske djelatnosti: poduke i treninga sportaša, programiranja i vođenja organiziranih izvannastavnih i izvanškolskih tjelesnih aktivnosti i igara djece i mladeži i programiranja i vođenja sportske rekreacije. (3) Ministar nadležan za poslove sporta pravilnikom uređuje pitanja u vezi s obavljanjem nadzora nad stručnim radom u sportu. Članak 141. Tijela državne uprave koja vode registar pravnih i fizičkih osoba dužna su o svakom upisu pravne ili fizičke osobe osnovane radi obavljanja sportske djelatnosti, o promjeni upisa ili brisanju iz registra obavijestiti ministarstvo nadležno za poslove sporta. XV. DRŽAVNA NAGRADA SPORTA \"FRANJO BUČAR\" Članak 142. (1) Državna nagrada sporta \"Franjo Bučar\" (u daljnjem tekstu: državna nagrada) najviše je priznanje koje Republika Hrvatska dodjeljuje za iznimna postignuća i doprinos od osobitog značenja za razvoj sporta u Republici Hrvatskoj. (2) Državna nagrada dodjeljuje se stručnim i javnim djelatnicima u području sporta, sportašima, pravnim i fizičkim osobama koje obavljaju sportsku djelatnost te drugim pravnim i fizičkim osobama zaslužnim za razvoj sporta. (3) Državna nagrada se dodjeljuje u vidu medalje s likom Franje Bučara,", "značenja za razvoj sporta u Republici Hrvatskoj. (2) Državna nagrada dodjeljuje se stručnim i javnim djelatnicima u području sporta, sportašima, pravnim i fizičkim osobama koje obavljaju sportsku djelatnost te drugim pravnim i fizičkim osobama zaslužnim za razvoj sporta. (3) Državna nagrada se dodjeljuje u vidu medalje s likom Franje Bučara, posebne diplome i novčane nagrade. 38 Članak 143. (1) Državna nagrada dodjeljuje se za višegodišnje uspješno djelovanje u sportu, a može se dodijeliti za pojedino iznimno znanstveno, stručno i pedagoško ostvarenje ili sportsko dostignuće. (2) Državna nagrada za životno djelo dodjeljuje se pojedincima za njihov izniman dugogodišnji i trajni doprinos razvoju sporta. (3) Godišnje se mogu dodijeliti najviše petnaest državnih nagrada, od toga tri za životno djelo. (4) Državna nagrada dodjeljuje se svake godine u studenome u povodu obljetnice rođenja Franje Bučara. (5) Državna nagrada ne može se dodijeliti posmrtno. Članak 144. (1) Odluku o dodjeli državne nagrade donosi Odbor državne nagrade sporta \"Franjo Bučar\" (u daljnjem tekstu: Odbor državne nagrade). (2) Predsjednika i osam članova Odbora državne nagrade imenuje Hrvatski sabor iz reda uglednih sportskih i javnih djelatnika, istaknutih sportaša i drugih istaknutih stručnjaka iz područja sporta na vrijeme od četiri godine, na prijedlog ministra nadležnog za poslove sporta. Članak 145. Ministar nadležan za poslove sporta donosi Pravilnik o državnoj nagradi sporta \"Franjo Bučar\" kojim pobliže uređuje uvjete za dodjelu državne nagrade, način rada Odbora državne nagrade i druga pitanja značajna za dodjelu državne nagrade. Članak 146. Dodjela državne nagrade sporta \"Franjo Bučar\" od nacionalnog je interesa i sredstva potrebna za dodjelu državne nagrade se osiguravaju u državnom proračunu Republike Hrvatske. XVI. KAZNENE ODREDBE Članak 147. (1) Novčanom kaznom od 10.000,00 do 30.000,00 kuna kaznit će se za prekršaj pravna osoba: 1. ako započne obavljati sportsku djelatnost prije nego što tijelo državne uprave županije odnosno Grada Zagreba nadležno za poslove sporta utvrdi da ispunjava propisane uvjete (članak 55.); 2. ako obavlja sportsku djelatnost sudjelovanja u natjecanjima, a ne ispunjava uvjete koje odredi nacionalni sportski savez (članak 59. stavak 2.); 3. ako nema osobu odgovarajuće stručne spreme odnosno stručne osposobljenosti za obavljanje stručnih poslova u sportu (članak 72. stavak 1.); 4. ako sportsko natjecanje ne organizira u skladu s pravilima koja određuje nacionalni sportski savez (članak 99. stavak 2.); 5. ako sudjeluje u međunarodnim sportskim natjecanjima i na međunarodnim sportskim priredbama bez prethodne suglasnosti nacionalnoga sportskog saveza (članak 105. stavak 1.); 39 6. ako sportsko natjecanje i sportsku priredbu ne organizira sukladno propisima o javnom okupljanju građana i drugim propisima koji uređuju sprečavanje nereda na sportskim natjecanjima (članak 106.). (2) Za prekršaj iz stavka 1. ovog članka fizička osoba kaznit će se novčanom kaznom od 3.000,00 do 5.000,00 kuna. (3) Novčanom kaznom od 20.000,00 do 40.000,00 kuna kaznit će se za prekršaj pravna osoba: 1. ako zaposli ili na drugi način angažira osobu za obavljanje sportskih djelatnosti koja je pravomoćnom sudskom presudom osuđena na kazneno djelo protiv dostojanstva ličnosti i morala ili joj je izrečena sigurnosna mjera ili zaštitna mjera zabrane pružanja usluga u sportskoj djelatnost dok ta mjera traje", "za prekršaj pravna osoba: 1. ako zaposli ili na drugi način angažira osobu za obavljanje sportskih djelatnosti koja je pravomoćnom sudskom presudom osuđena na kazneno djelo protiv dostojanstva ličnosti i morala ili joj je izrečena sigurnosna mjera ili zaštitna mjera zabrane pružanja usluga u sportskoj djelatnost dok ta mjera traje (članak 72. stavak 2.); 2. ako dopusti ili ne spriječi unošenje, prodaju, davanje i uzimanje alkoholnih pića za vrijeme natjecanja, ulazak osoba pod utjecajem alkohola ili droge, unošenje i uporabu oružja, pirotehničkih i drugih sredstava koja mogu ugroziti sigurnost natjecatelja, drugih sudionika u natjecanju i gledatelja u objekt na kojem se održava sportsko natjecanje (članak 107. stavak 1.); 3. ako u objektu na kojem se natjecanje održava dopusti prodaju, davanje i uzimanje alkoholnih pića dva sata prije i dva sata poslije natjecanja (članak 107. stavak 2.); 4. ako ne osigura pružanje osnovne i hitne medicinske pomoći za vrijeme trajanja sportskog natjecanja odnosno sportske priredbe (članak 108.); 5. ako dozvoli životinji sudjelovanje u sportskom natjecanju za koju je veterinar utvrdio zdravstvenu nesposobnost za natjecanje (članak 114. stavak 2.); 6. ako se životinji koja sudjeluje u sportskim natjecanjima daju nedopuštena (doping) sredstva ili primjenjuju nedopušteni postupci (članak 114. stavak 3.); 7. ako ne dopusti obavljanje doping kontrole nad životinjama koje sudjeluju u sportskim natjecanjima (članak 114. stavak 4.); 8. ako sportaša za kojeg je nadležni liječnik utvrdio zdravstvenu nesposobnost ili opasnost od pogoršanja zdravstvenog stanja obveže na trening, sportsko natjecanje ili sportsku priredbu ili ako mu dopusti sudjelovanje u sportskom natjecanju (članak 111.); 9. ako daje sportašima nedopuštena doping sredstva ili primjenjuje postupke koji su u suprotnosti s pravilima Hrvatskoga olimpijskog odbora i Međunarodnoga olimpijskog odbora (članak 112. stavak 1.); 10. ako ne dopusti obavljanje doping kontrole (članak 112. stavak 2.). (4) Novčanom kaznom od 500,00 do 10.000,00 kuna kaznit će se za prekršaj fizička osoba koja pali i baca pirotehnička sredstava, navijačke rekvizite i druge predmete u natjecateljski ili gledateljski prostor, poziva, potiče i sudjeluje u tučnjavi ili napadu na druge gledatelje, redare, službene osobe organizatora natjecanja, sportaše i druge sudionike u sportskom natjecanju, unosi i ističe transparente, zastave ili druge stvari s obilježjem rasističke ili druge poruke koja može izazvati nesnošljivost, kao i pjeva rasističke, nedolične ili uvredljive pjesme, ili pogrdno dobacuje natjecateljima i drugim sudionicima sportskog natjecanja, te drugim gledateljima, neovlašteno ulazi u prostor na kome se događa sportsko natjecanje, oštećuje ili uništava dijelove sportskog objekta, te prijevozna sredstava natjecatelja i navijača i drugu imovinu prilikom dolaska, za vrijeme održavanja i nakon završetka sportskog natjecanja (članak 107. stavak 1.); (5) Za prekršaj iz točke stavka 3. ovog članka fizička osoba kaznit će se novčanom kaznom od 5.000,00 do 10.000,00 kuna. (6) Za prekršaj iz stavka 1. ovoga članka kaznit će se i odgovorna osoba u pravnoj osobi novčanom kaznom od 3.000,00 do 5.000,00 kuna. novčanom kaznom od 5.000,00 do 10.000,00 kuna. (7) Za prekršaj iz stavka 3. ovoga članka kaznit će se i odgovorna osoba u pravnoj osobi 40 (1) Novčanom kaznom od 50.000,00 do 100.000,00 kuna kaznit će", "će se i odgovorna osoba u pravnoj osobi novčanom kaznom od 3.000,00 do 5.000,00 kuna. novčanom kaznom od 5.000,00 do 10.000,00 kuna. (7) Za prekršaj iz stavka 3. ovoga članka kaznit će se i odgovorna osoba u pravnoj osobi 40 (1) Novčanom kaznom od 50.000,00 do 100.000,00 kuna kaznit će se za prekršaj Članak 148. profesionalni klub: 1. ako ministarstvu nadležnom za poslove sporta i pripadajućem nacionalnom savezu ne šalje obavijesti o dioničarima (članak 78. stavak 2.); 2. ako dionice u profesionalnom klubu istog sporta izravno, neizravno ili preko povezanih osoba imaju osobe čiji poslovi i aktivnosti mogu neposredno utjecati na sustav natjecanja u odgovarajućem sportu (sportski suci, menadžeri u sportu, i sl.) članak 79. stavak 2.; 3. ako dionice u profesionalnom klubu imaju vlasnici sportskih kladionica (članak 79. stavak 3.); 4. ako za stjecanje dionica u profesionalnom klubu koje daju više od 25 % glasova u glavnoj skupštini profesionalnog kluba, u prve dvije godine od osnivanja ne pribavi prethodnu suglasnost ministarstva nadležnog za poslove sporta (članak 81. stavak 2.); 5. ako za člana uprave ili nadzornog odbora ima jednu ili više osoba iz članka 85. stavak 2.; 6. ako novčane obveze koje proizlaze iz kredita, zajmova ili drugih pravnih poslova u kojima su vjerovnici društva njegovi dioničari, članovi njegova nadzornog odbora ili uprave ili članovi upravljačkog tijela amaterskog kluba koji je dioničar toga profesionalnog kluba podmiruje prije podmirenja dospjelih obveza prema ostalim vjerovnicima (članak 95.). (2) Za prekršaje iz stavka 1. ovog članka novčanom kaznom od 5.000,00 do 10.000,00 kuna kaznit će se i odgovorna osoba u profesionalnom klubu. (3) Novčanom kaznom od 5.000,00 do 10.000,00 kuna kaznit će se za prekršaj: 1. stjecatelj dionica profesionalnog kluba iz članka 81. stavak 4. koji ne obavijesti ministarstvo nadležno za poslove sporta o stjecanju dionica koje, zajedno s dionicama koje već ima, čine više od 5% ukupnog temeljnog kapitala profesionalnog kluba ili koje, zajedno s glasovima koje već ima, daju više od 5% glasova u glavnoj skupštini profesionalnog kluba; 2. Središnja depozitarna agencija ako ne obavijesti Povjerenstvo o tome da je neka osoba stekla dionice suprotno odredbama članka 79. i 81. ovoga Zakona (članak 82. stavak 2.); 3. profesionalni klub ako ne obavijesti ministarstvo nadležno za poslove sporta o sazivanju svake glavne skupštine za sve vrijeme dok prava iz dionica u klubu ostvaruje povjerenik, kao i ako onemogući pravo predstavniku ministarstva nadležnog za poslove sporta da sudjeluje u radu glavne skupštine (članak 82. stavak 3.); (4) Novčanom kaznom od 5.000,00 do 10.000,00 kuna kaznit će se fizička osoba koja je član uprave ili nadzornog odbora dva ili više profesionalnih klubova istog sporta (članak 85. stavak 1.) Članak 149. Novčanom kaznom od 3.000,00 do 5.000,00 kuna kaznit će se za prekršaj liječnik i svaki član komisije koji su utvrdili da je sportaš uzimao nedopuštena sredstva, ako u roku od tri dana od dana utvrđivanja nalaza ne podnese pisano izvješće s nalazom nacionalnom sportskom savezu (članak 113. stavak 1.). Članak 150. (1) Novčanom kaznom od 2.000,00 do 10.000,00 kuna kaznit će se pravna", "i svaki član komisije koji su utvrdili da je sportaš uzimao nedopuštena sredstva, ako u roku od tri dana od dana utvrđivanja nalaza ne podnese pisano izvješće s nalazom nacionalnom sportskom savezu (članak 113. stavak 1.). Članak 150. (1) Novčanom kaznom od 2.000,00 do 10.000,00 kuna kaznit će se pravna osoba iz sustava sporta koja ne vodi evidenciju svojih članova (članak 7. stavak 6.); (2) Novčanom kaznom od 2.000,00 do 3.000,00 kuna kaznit će se za prekršaj sportski klub: 41 1. ako aktom ne odredi visinu članarine i ne objavi je na dostupan način (članak 11. stavak 1.); 2. ako općim aktom ne uredi prava svojim članovima sportašima amaterima (članak 39. stavak 4.); 3. ako omogući da u sportskom natjecanju sudjeluje osoba za koju nije u razdoblju od šest mjeseci prije sportskog natjecanja utvrđena opća zdravstvena sposobnost, a kada je to propisano i posebna zdravstvena sposobnost (članak 110. stavak 1.). (3) Za prekršaj iz stavka 1. ovog članka kaznit će se i odgovorna osoba u pravnoj osobi iz sustava sporta novčanom kaznom od 2.000,00 do 6.000,00 kuna. (4) Za prekršaj iz stavka 2. ovoga članka kaznit će se i odgovorna osoba u sportskom klubu novčanom kaznom od 2.000,00 do 4.000,00 kuna. Članak 151. Novčanom kaznom od 3.000,00 do 5.000,00 kuna kaznit će se za prekršaj fizička osoba: 1. ako obavlja stručne poslove u sportu bez odgovarajuće stručne spreme odnosno stručne osposobljenosti (članak 51. stavak 2.); 2. ako sudjeluje u sportskim natjecanjima, radi stručne poslove u sportu ili obavlja sportsku djelatnost samostalnim radom a nije proteklo tri godine nakon izdržavanja, oproštaja ili zastare kazne za kaznena djela iz članka 56.; 3. ako započne obavljati sportsku djelatnost prije upisa u registar sportskih djelatnosti samostalnim radom ili nastavi obavljati sportsku djelatnost nakon brisanja iz registra sportskih djelatnosti (članak 58.); 4. ako obavlja sportsku djelatnost za obrt ili trgovačko društvo bez obzira na to što je pravomoćnom sudskom presudom osuđena na kazneno djelo protiv dostojanstva ličnosti i morala ili joj je izrečena sigurnosna mjera ili zaštitna mjera zabrane pružanja usluga u sportskoj djelatnost dok ta mjera traje (članak 72. stavak 2.). Članak 152. (1) Fizička osoba koja sudjeluje u sportskom natjecanju ili sportskoj priredbi, a nema u razdoblju od šest mjeseci prije sportskog natjecanja ili priredbe utvrđenu opću i zdravstvenu sposobnost, a kad je to propisano i posebnu zdravstvenu sposobnost (članak 110. stavak 1.), kaznit će se za prekršaj novčanom kaznom od 500,00 do 1.000,00 kuna. (2) Ako sportaš uzima nedopuštena sredstva ili ne dopušta obavljanje doping kontrole (članak 112.), kaznit će se za prekršaj: a) prvi put kaznom od 3.000,00 do 7.000,00 kuna; b) drugi i svaki sljedeći put kaznom od 7.000,00 do 10.000,00 kuna. Članak 153. (1) Novčanom kaznom od 3.000,00 do 6.000,00 kuna kaznit će se za prekršaj škola ako novčana i druga sredstva dana za aktivnost i rad školskog kluba upotrijebi za druge namjene, a ne isključivo za rad i djelovanje školskog kluba (članak 33. stavak 2.). (2) Za prekršaj iz stavka 1. ovoga članka kaznit će se i odgovorna", "6.000,00 kuna kaznit će se za prekršaj škola ako novčana i druga sredstva dana za aktivnost i rad školskog kluba upotrijebi za druge namjene, a ne isključivo za rad i djelovanje školskog kluba (članak 33. stavak 2.). (2) Za prekršaj iz stavka 1. ovoga članka kaznit će se i odgovorna osoba u školi novčanom kaznom od 1.000,00 do 3.000,00 kuna. 42 Članak 154. (1) Novčanom kaznom od 10.000,00 do 20.000,00 kuna kaznit će se za prekršaj obrazovna i druga ustanova ako izvodi program osposobljavanja za obavljanje stručnih poslova u sportu bez odobrenja ministra nadležnog za poslove sporta (članak 52. stavak 1.). (2) Za prekršaj iz stavka 1. ovoga članka kaznit će se i odgovorna osoba u ustanovi novčanom kaznom od 3.000,00 do 5.000,00 kuna. (1) Novčanom kaznom od 20.000,00 do 50.000,00 kuna kaznit će se za prekršaj Članak 155. nacionalni sportski savez: 1. ako se počne primjenjivati novi sustav natjecanja prije nego što prođe najmanje godinu dana od dana donošenja odluke o novom sustavu (članak 100. stavak 1.); 2. ako prije donošenja odluke o promjeni postojećeg sustava natjecanja ne načini elaborat o opravdanosti promjene postojećeg sustava i ne pribavi prethodnu suglasnost Hrvatskog olimpijskog odbora za promjenu sustava natjecanja (članak 100. stavak 3.); 3. ako ne donese akt kojim propisuje postupke u slučaju pozitivnog nalaza o uzimanju nedopuštenih sredstava ili primjeni zabranjenih postupaka (članak 113. stavak 3.). (2) Za prekršaj iz stavka 1. ovoga članka kaznit će se i odgovorna osoba u pravnoj osobi novčanom kaznom od 5.000,00 do 10.000,00 kuna. Članak 156. (1) Novčanom kaznom od 15.000,00 do 30.000,00 kuna kaznit će se za prekršaj nacionalni sportski savez ako ne podnese prekršajnu prijavu nadležnom sudu u roku od 8 dana od dana primitka izvješća s nalazom o uzimanju nedopuštenih sredstava (dopinga) protiv osobe koja je uzimala i protiv osobe koja je davala nedopuštena sredstva (članak 113. stavak 2.). (2) Za prekršaj iz stavka 1. ovoga članka kaznit će se i odgovorna osoba u pravnoj osobi novčanom kaznom od 5.000,00 do 10.000,00 kuna. Članak 157. (1) Novčanom kaznom od 10.000,00 do 20.000,00 kuna kaznit će se za prekršaj amaterski sportski klub, a novčanom kaznom od 20.000,00 do 50.000,00 kuna kaznit će se za prekršaj profesionalni sportski klub koji svoje sportaše ne stavi na raspolaganje nacionalnim selekcijama za pripreme i natjecanja (članak 47. stavak 2.). (2) Novčanom kaznom od 3.000,00 do 5.000,00 kuna kaznit će se sportaš amater, a novčanom kaznom od 5.000,00 do 10.000,00 kuna kaznit će se sportaš profesionalac ako odbije sudjelovati u pripremama i natjecanjima nacionalnih selekcija (članak 47. stavak 1.). (3) Novčanom kaznom od 3.000,00 do 5.000,00 kuna kaznit će se sportaš amater, a sportaš profesionalac kaznom od 5.000,00 do 10.000,00 kuna ako se međusobno natječu u borilačkim sportovima suprotno općem aktu iz članka 103. stavak 2. Članak 158. (1) Za prekršaje propisane člancima 147. do 157. ovoga Zakona mogu se izreći sljedeće zaštitne mjere: 1. zabrana obavljanja sportskog zvanja, djelatnosti ili dužnosti fizičkoj osobi u trajanju od jednog mjeseca do jedne godine, 43 2. zabrana obavljanja sportske", "sportovima suprotno općem aktu iz članka 103. stavak 2. Članak 158. (1) Za prekršaje propisane člancima 147. do 157. ovoga Zakona mogu se izreći sljedeće zaštitne mjere: 1. zabrana obavljanja sportskog zvanja, djelatnosti ili dužnosti fizičkoj osobi u trajanju od jednog mjeseca do jedne godine, 43 2. zabrana obavljanja sportske djelatnosti pravnoj osobi u trajanju od tri mjeseca do jedne godine. (2) Za prekršaje propisane člancima 147. do 157. ovoga Zakona može se izreći i mjera oduzimanja imovinske koristi. XVII. PRIJELAZNE I ZAVRŠNE ODREDBE Članak 159. (1) Vlada Republike Hrvatske izradit će prijedlog Nacionalnog programa sporta iz članka 134. ovoga Zakona u roku od šest mjeseci od stupanja na snagu ovoga Zakona i u istom roku će ga predložiti Hrvatskom saboru na donošenje. (2) Hrvatski sabor donijet će Nacionalni program sporta iz članka 134. ovoga Zakona u roku od godinu dana od dana stupanja na snagu ovoga Zakona. (3) Vlada Republike Hrvatske osnovat će povjerenstvo iz članka 115. ovog zakona u roku od 90 dana od dana stupanja na snagu ovog zakona. Članak 160. (1) Ministar nadležan za poslove sporta će pravilnike iz članka 44., članka 58. stavka 1. i članka 145. ovoga Zakona donijeti u roku od 30 dana od dana stupanja na snagu ovoga Zakona. (2) Ministar nadležan za poslove sporta će pravilnike iz članka 35. stavka 2., članka 51. stavka 3., članka 94. stavka 2., članka 96. stavka 4., članka 120., članka 135. stavka 2. i članka 140. stavka 3. ovoga Zakona donijeti u roku od 90 dana od dana stupanja na snagu ovoga Zakona, (3) Ministar nadležan za poslove sporta će pravilnike iz članka 52. stavka 2., članka 78. stavka 2., članka 81. stavka 3. i članka 119. stavka 1. ovoga Zakona donijeti u roku od 120 dana od dana stupanja na snagu ovoga Zakona. (4) Ministar nadležan za poslove prosvjete i sporta će odluke iz članka 32. stavka 3. i članka 35. stavka 1. ovoga Zakona donijeti u roku od 30 dana od dana stupanja na snagu ovoga Zakona. (5) Ministar nadležan za poslove sporta, uz suglasnost ministra zdravstva, će pravilnik iz članka 59. stavka 4. ovoga Zakona donijeti će u roku od 90 dana od dana stupanja na snagu ovoga Zakona. (6) Ministar nadležan za poslove sporta, uz prethodnu suglasnost ministra zaštite okoliša i prostornog uređenja, će pravilnike iz članka 117. stavak 5. i članka 119. stavak 2. ovoga Zakona donijeti u roku od 120 dana od dana stupanja na snagu ovoga Zakona. (7) Ministar obrane, ministar rada i socijalne skrbi i ministar nadležan za poslove sporta će pravilnike iz članka 46. ovoga Zakona donijeti u roku od 90 dana od dana stupanja na snagu ovoga Zakona. Članak 161. (1) Hrvatski olimpijski odbor će opće akte iz članka 27. stavka 4., članka 39. stavka 3., članka 43. stavka 3., članka 99. stavka 1., članka 105. stavka 3., članka 113. stavka 3. ovoga Zakona donijeti odnosno uskladiti u roku od 90 dana od dana stupanja na snagu ovoga Zakona. (2) Nacionalni sportski savezi akte iz", "opće akte iz članka 27. stavka 4., članka 39. stavka 3., članka 43. stavka 3., članka 99. stavka 1., članka 105. stavka 3., članka 113. stavka 3. ovoga Zakona donijeti odnosno uskladiti u roku od 90 dana od dana stupanja na snagu ovoga Zakona. (2) Nacionalni sportski savezi akte iz stavka 1. članka 17. stavka 3., članka 39. stavka 4., članka 43. stavka 3., članka 47. stavka 3., članka 50. stavka 5., članka 54. stavka 2., članka 59. stavka 2., članka 84. stavka 2., članka 103. stavka 2., članka 104., članka 113. stavka 3. i članka 44 114. stavka 5. te prijedlog kriterija iz članka 94. stavka 2. ovoga Zakona donijet će odnosno uskladiti u roku od 90 dana od dana stupanja na snagu ovoga Zakona. (3) Hrvatski športski savez invalida, zajednički s nacionalnim sportskim savezima osoba s invaliditetom, uskladiti će ustroj sporta osoba s invaliditetom s odredbama ovoga Zakona u roku od 90 dana od dana stupanja na snagu ovoga Zakona. (4) Sportski savezi i sportske zajednice akte i programe iz članka 17. i članka 20. ovoga Zakona donijet će u roku od 90 dana od dana stupanja na snagu ovoga Zakona. Članak 162. (1) Osnivači školskih sportskih saveza osnovat će školske sportske saveze iz članka 34. ovoga Zakona u roku od 60 dana od dana stupanja na snagu ovoga Zakona. (2) Školski sportski savezi udružit će se u sportske zajednice iz članka 19. ovoga Zakona u roku od 90 dana od dana stupanja na snagu ovoga Zakona. Članak 163. Amaterski sportski klubovi i druge udruge iz sustava sporta dužne su svoje statute i opće akte iz članka 11. stavka 1. i članka 39. stavka 4. uskladiti s odredbama ovoga Zakona u roku od 120 dana od dana stupanja na snagu ovoga Zakona. Članak 164. Amaterski sportski klub koji ima uvjete za osnivanje profesionalnog sportskog kluba ili za promjenu statusa u profesionalni sportski klub u smislu ovog Zakona dovršit će postupak preoblikovanja najkasnije u roku godinu dana od dana stupanja na snagu ovog Zakona. Članak 165. Fizičke osobe koje na temelju statusa vrhunskog sportaša samostalnim radom obavljaju djelatnosti sportske rekreacije ili sportske poduke ili stručne poslove u sportu dužne su steći odgovarajuću stručnu spremu ili stručnu osposobljenost za obavljanje tih poslova u roku tri godine od dana stupanja na snagu ovoga Zakona. Članak 166. (1) Do donošenja podzakonskih propisa iz članka 160. i općih akata iz članka 161. ovoga Zakona, primjenjuju se postojeći propisi i postojeći opći akti kojima su uređena ta pitanja. (2) Do donošenja podzakonskog akta iz članka 160. stavka 3. ovoga Zakona, pri projektiranju, građenju, opremanju i održavanju sportskih objekata glede njihove namjene primjenjivat će se hrvatske norme za građenje sportskih objekata. Članak 167. Riječi «sport» i «šport» u smislu ovog Zakona su istoznačnice te se stupanjem na snagu ovoga Zakona zbog toga ne moraju mijenjati nazivi, opći akti, dokumenti i dr. 45 Članak 168. Danom stupanja na snagu ovoga Zakona prestaje važiti Zakon o športu (\"Narodne novine\", br. 111/97, 13/98 i 24/01.). Članak 169. Ovaj", "i «šport» u smislu ovog Zakona su istoznačnice te se stupanjem na snagu ovoga Zakona zbog toga ne moraju mijenjati nazivi, opći akti, dokumenti i dr. 45 Članak 168. Danom stupanja na snagu ovoga Zakona prestaje važiti Zakon o športu (\"Narodne novine\", br. 111/97, 13/98 i 24/01.). Članak 169. Ovaj Zakon stupa na snagu osmoga dana od dana objave u Narodnim novinama. KLASA: URBROJ: Zagreb, 46 OBRAZLOŽENJE KONAČNOG PRIJEDLOGA ZAKONA O SPORTU I. RAZLOZI ZBOG KOJIH SE ZAKON DONOSI Djelatnost sporta u Republici Hrvatskoj uređena je Zakonom o športu (\"«Narodne novine\"», br. 111/97., 13/98. i 24/01.). Na djelatnost sporta odgovarajuće se primjenjuju i drugi zakoni, osobito oni koji uređuju pitanja udruživanja građana, djelatnosti školstva i gospodarstva, te propisi iz sustava državne uprave, graditeljstva, financija i zdravstva. Na sport i u sportu se također primjenjuje autonomno pravo međunarodnih sportskih udruženja. Važećim propisima nije prikladno uređen niz značajnih pitanja sporta. Na primjer: stručni poslovi u sportu, sportski objekti, sportska rekreacija, pravni status profesionalnih klubova, sport djece i mladeži, statusna pitanja sportaša, sport osoba s invaliditetom te pravo na sport za svakoga i dr., tako da ti propisi najvećim dijelom ne odgovaraju potrebama suvremenog sporta. Donošenje niza novih zakona, osobito onih koji uređuju organizaciju lokalne samouprave i njezino financiranje, promjene u sustavu državne uprave i proračuna, nameću imperativnu potrebu za traženjem novih i boljih rješenja za sport i sportske djelatnosti. Financijsko sudjelovanje države u području sporta proračunima na svim razinama, izvan proračuna, posebno propisivanjem stalnih određivanje pravnih osoba u sportskim djelatnostima s posebnim statusom, porezne olakšice i drugo, značajna su i važna pitanja u svim zemljama bez obzira na ustroj i odnose vladinih i nevladinih tijela i asocijacija sporta. Suradnja i jasno određivanje nadležnosti između vladinih i nevladinih tijela sporta, ali i partnerstvo, u Europi je opće prihvaćena pojava i nužnost. To su pitanja koja treba primjerenije riješiti ovim Zakonom. izvora financiranja sporta sredstvima Članstvo Hrvatske u Odboru sporta Vijeća Europe, prihvaćanje Europske povelje o sportu i međunarodnih konvencija u svezi sa sportoma nameću potrebu usklađivanja našega zakonodavstva, čime bi se stvorili preduvjeti za značajan napredak hrvatskoga sporta i njegovo postavljanje na ono mjesto u sklopue pozicije u okviru Europe koje neupitno zaslužuje. Treba uzeti u obzir i činjenicu da su se u posljednjih nekoliko godina dogodzbile i druge društvene promjene koje su utjecale na sport, ,a potreba donošenja novog Zakona o sportu nameće se posebno i zbog: 1. Neriješena su i krajnje nedefinirana ostala također mnoga pitanjae nužnog razgraničenja amaterskog i profesionalnog sporta, odnosno amaterskih i profesionalnih klubova, što u krajnjoj mjeri dovodi do mnogih nesporazuma, koji pak pogoduju širenju raznih negativnosti u sportu. Zbog svega toga još uvijek nije do kraja iskorišten golemogroman potencijal u više od 7.000 registriranih sportskih klubova s više od 280 000 sportaša, niti u sportskom smislu, a niti kao mogućnost prihvaćanja većeg broja aktivnih sportaša nego što je to sada. 3.2. Uloga sportskih saveza i sportskih zajednica, te Hrvatskog olimpijskog odbora u cjelokupnom procesu planiranja, programiranja i izvođenja programa javnih potreba, također nije u dovoljnoj mjeri", "s više od 280 000 sportaša, niti u sportskom smislu, a niti kao mogućnost prihvaćanja većeg broja aktivnih sportaša nego što je to sada. 3.2. Uloga sportskih saveza i sportskih zajednica, te Hrvatskog olimpijskog odbora u cjelokupnom procesu planiranja, programiranja i izvođenja programa javnih potreba, također nije u dovoljnoj mjeri precizirana, tako da često puta dolazi do nepotrebnih problema u koordinaciji toga važnog posla s upravnim (državnim) i samoupravnim (lokalnim) tijelima za sport. 6.3. Ne pridaje se dovoljno važnostiznačaja stručnim poslovima, odnosno ne propisuje se precizno tko može i pod kojim uvjetima obavljati stručne poslove u sportu, a nije ni definirano koje su to institucije koje mogu provoditi programe osposobljavanja stručnih kadrova. U stručne poslove su navedeni i poslovi koji po sadržaju i prirodi stvari tu ne spadaju. 47 Formatted: Bullets and Numbering 7.4. Obavljanje sportskih djelatnosti kao mogućčnost pružanja određenih sportskih usluga na tržištu, te uvjeti pod kojima se te djelatnosti mogu obavljati, također su vrlo značajna pitanja koja daju mogućnosti samozapošljavanja i poduzetništva. U postojećem zakonu ta pitanja nisu na adekvatan način uređena. 5. Sport u školi odnosno sport djece i mladeži nema također odgovarajuće mjesto i kvalitetna rješenja u sadašnjim zakonskim propisima. Ostalo je neriješeno niz pitanja koja su u praksi stvarala pravne i upravne probleme (statusi, registracija, pitanja školskih sportskih saveza). Isto tako, naročito kad su u pitanju mogućnosti donacija, sponzorstva i drugi oblici financiranja školskih klubova, postojeći propisi ne daju dovoljno mogućnosti i ne stvaraju pretpostavke razvoja školskog sporta i uključivanja što više učenica i učenika u sport. Dakle, niti taj bitan segment cjelokupnog sporta još uvijek nema mogućnosti daljnjeg razvoja. Stanje je sljedeće: u Hrvatskoj ima 829 matičnih osnovnih škola s više od 400.000 učenika i 377 srednjih škola s oko 200.000 učenika. U tim školama postoje školski sportski klubovi sa sekcijama u kojima je u treninge i natjecanja organizirano uključeno 120.000 školske djece (oko 25% u osnovnim i oko 17% u srednjim školama). Analiza stanja obuke neplivača u Republici Hrvatskoj pokazuje da čak 55% osnovnih škola tu obuku uopće ne provodi i pored činjenice da u osnovnim školama čak 29% učenika (oko 118.000) ne zna plivati. Za rad više od 1.200 školskih sportskih klubova, država iz proračuna izdvaja: GODINA UKUPAN PRORAČUN 1999. 2000. 2001. 2002. 2003. 49.047.850.000 44.017.721.723 49.679.912.000 70.217.912.000 75.283.959.800 ŠKOLSKI SPORT 4.500.000 6.825.000 7.000.000 7.000.000 8.000.000 % 0.009 0,016 0,014 0,010 0,010 Sredstva za školski sport iz državnog proračuna su samo minimalni poticaj za aktivnosti školskih sportskih klubova, jer primjerice za 2003. godinu iznose oko 66,00 kuna godišnje po učeniku uključenom u školski klub. U županijama i Gradu Zagrebu se iz ukupnog proračuna za školski sport već godinama izdvaja od 0,06% do 1,70%, odnosno ukupno sve županije i Grad Zagreb izdvajaju za školski sport oko 8.000.000,00 kuna godišnje. U 12 većih gradova izdvajanja iz ukupnog proračuna za školski sport u proteklim se godinama kreću od 0,03% do 0,22% godišnjeg proračuna, odnosno ukupno oko 1,500.000,00 kuna. Iako je u razdoblju od 1996. do danas izgrađeno ili je još u izgradnji više od", "za školski sport oko 8.000.000,00 kuna godišnje. U 12 većih gradova izdvajanja iz ukupnog proračuna za školski sport u proteklim se godinama kreću od 0,03% do 0,22% godišnjeg proračuna, odnosno ukupno oko 1,500.000,00 kuna. Iako je u razdoblju od 1996. do danas izgrađeno ili je još u izgradnji više od 60 školskih sportskih dvorana, još uvijek smo daleko od rješenja pitanja izgrađenosti školskih dvorana i njihove opremljenosti. U osnovnim školama je sljedeće stanje: 35% osnovnih škola nema dvorane, 12% ima dvorane ispod 200 m2 25% ima dvorane od 200-360 m2 28 % ima dvorane od 360 i više m2, a u srednjim školama: 44% srednjih škola nema dvorane 18% ima dvorane ispod 200 m2 48 Formatted: Bullets and Numbering 24% ima dvorane od 200-360 m2 24 % ima dvorane od 360 i više m2. 6. Postojeća rješenja u odnosu na, statusna pitanja, prava i obaveze koje bi vrhunski sportaši trebali imati, trenutno su ograničavajući čimbenik s obzirom na zahtjeve koje pred njih stavlja sve žešća međunarodna sportska konkurencija, kao i suvremena tehnologija koja pomaže u stvaranju vrhunskih sportskih rezultata. I to je jedan od razloga konstantnog, ali sigurnog pada vrhunskih rezultata u mnogim sportovima (košarka, rukomet, odbojka, itd.). 8.7. S obzirom na potrebe stanovništva za redovitim bavljenjem nekom od sportskih aktivnosti, te u odnosu na uobičajene standarde u zemljama sSrednje i zZapadne Europe, izgrađenost sportskih objekata u Republici Hrvatskoj je tek na razininivou od oko 30% realnih potreba. U određenomizvjesnom smislu, ne uzimvažavajući u obzirznačaj važnost problematike planiranja, izgradnje, upravljanja i održavanja sportskih objekata, postojeća polovična zakonska rješenja su također izazvala mnoge probleme kao na primjer: - Od 1987. godine, znači od održane Univerzijade u Zagrebu, u Hrvatskoj je praktički prestala planska izgradnja sportskih objekata. Međutim, i kod ono malo objekata što se gradi najčešće se gradi skupo i neracionalno, jer se pri projektiranju i građenju sportskih objekata najčešće nisu poštovaliuvažavali nužni postupci, a ni posebni normativi i standardi; - U županijama i gradovima nisu izrađeni adekvatni planovi mreža sportskih objekata,, pa je i zbog toga nažalost, u Hrvatskoj jednostavno “nestalo” nekoliko stotina sportskih objekata, a da istovremeno drugi zamjenski nisu sagrađeni. Zbog toga je više tisuća djece i mladih ostalo bez mogućnosti aktivnog bavljenja sportom; - U većini slučajeva ni pretvorba odnosno preuzimanje po zakonu sportskih objekata koji su bili u društvenom vlasništvu nije do kraja pravedično izvršena, posebno ne u onom dijelu gdje se govori o upravljanju javnim sportskim sportskim objektima, jer su u tom procesu predstavnici sporta (osnovni nosioci realizacije programa) praktički potpuno isključeni itd.. je nedefinirana 8. Uloga države u mnogim segmentima sporta i ona se ponajprijervenstveno izražava kroz samo deklarativnomu potporomdršku razvoju sporta, a u bitsuštini se svodi na izdvajanje tek minimalnih proračunskih sredstava (0o,0o57% od državnog proračuna za 2002. godinu) za financiranje javnih potreba sporta na državnoj razini. Istovremeno, već godinama nese ne izdvaja se planski niti jedna jedina kuna za nužno potrebnu izgradnju sportskih objekata, što je svakako presedan i u svjetskim razmjerima. Ukupna sredstva koja se za javne potrebe u sportu izdvajaju", "od državnog proračuna za 2002. godinu) za financiranje javnih potreba sporta na državnoj razini. Istovremeno, već godinama nese ne izdvaja se planski niti jedna jedina kuna za nužno potrebnu izgradnju sportskih objekata, što je svakako presedan i u svjetskim razmjerima. Ukupna sredstva koja se za javne potrebe u sportu izdvajaju na državnoj razini već godinama se smanjuju i u nominalnom i u postotnom iznosu te u dDržavnom proračunu participiraju u promilima (tablica 1. i 1.a.). Izdvajanja za javne potrebe u sportu na državnoj razini od 1999. – 2002. godine Tablica 1. 1999. godina % 2000. godina % Ukupan državni proračun 49.047.850.000 44.017.721.723 Hrvatski olimpijski odbor 36.600.000 Hrvatski sportski savez invalida Školski sport Međunarodna sportska suradnja Državna nagrada «F.Bučar» UKUPNO ZA SPORT 2.000.000 4.500.000 550.000 330.000 43.980.000 0,075 0,004 0,009 0,001 0,001 0,090 35.574.000 1.950.000 6.825.000 677.625 300.000 40.327.180 0,081 0,004 0,016 0,002 0,001 0,103 2001. godina % 2002. godina % 49 Ukupan državni proračun 49.679.912.000 Hrvatski olimpijski odbor 36.000.000 Hrvatski sportski savez invalida Školski sport Međunarodna sportska suradnja Državna nagrada «F.Bučar» 2.000.000 7.000.000 700.000 300.000 0,072 0,004 0,014 0,001 0,001 70.217.921.000 30.000.000 2.000.000 7.000.000 1.027.181 300.000 0,043 0,003 0,010 0,001 0,000 UKUPNO ZA SPORT, 46.000.000 0,093 40.327.180 0,057 Izdvajanja za javne potrebe u sportu na državnoj razini 2003. godine Tablica 1. a. Ukupan državni proračun Hrvatski olimpijski odbor Hrvatski sportski savez invalida Školski sport Međunarodna sportska suradnja Državna nagrada «F.Bučar» UKUPNO ZA SPORT 2003. godina % 75.076.967.800 30.000.000 2.140.000 8.000.000 840.945 340.000 41.320.945 0,0399 0,0028 0,0106 0,0011 0,0004 0,0550 U tablicama 1. i 1.a. nisu prikazana sredstva za Hrvatski olimpijski centar «Bjelolasica», d.o.o. koji je u većinskom vlasništvu Vlade Republike Hrvatske. Dakle, iz pregleda izdvajanja iz državnog proračuna za javne potrebe u sportu u zadnjih pet godina očito je smanjenje postotaka sudjelovanja javnih potreba za sport u državnom proračunu Republike Hrvatske: 1999. godina 2000. godina 2001. godina 2002. godina 2003. godina 43.980.000 40.327.180 46.000.000 40.327.180 41.320.945 0,090 % od proračuna 0,103 % od proračuna 0,093 % od proračuna 0,057 % od proračuna 0,055 % od proračuna Slijedi grafički prikaz navedenih pokazatelja: % 0,110 0,105 0,100 0,095 0,090 0,085 0,080 0,075 0,070 0,065 0,060 1999 2000 2001 2002 2003 0,103 0,090 0,093 0,057 50 0,055 0,050 0,055 Bez obzira na promjene u metodologiji izrade državnog proračuna za 2002. i 2003. godinu, prikazani podaci jasno pokazuju daljnje smanjenja sredstava za javne potrebe u sportu iz proračuna. Kad se pogledaju postoci izdvajanja za sport u odnosu na bruto društveni proizvod (BDP) u zemljama zapadne i srednje Europe i Mediterana (tablica 2.) vidi se da je Hrvatska na dnu ljestvice. Ne uspoređujući se s najvećim i najrazvijenijim državama, dovoljno je navesti da u Sloveniji i Mađarskoj financiranje sporta sudjeluje s 0,6% u BDP-u, a u Hrvatska tek s 0,3% u BDP-u. Izdvajanja za sport u odnosu na bruto društveni proizvod u nekim europskim državama Tablica 2. Zemlja % za sport u BDP-u 1. 2. Švicarska Portugal 3. Velika Britanija 4. Grčka 5. 6. 7. Finska Francuska Italija Švedska 8. 9. Mađarska 10. Slovenija 11.", "u Hrvatska tek s 0,3% u BDP-u. Izdvajanja za sport u odnosu na bruto društveni proizvod u nekim europskim državama Tablica 2. Zemlja % za sport u BDP-u 1. 2. Švicarska Portugal 3. Velika Britanija 4. Grčka 5. 6. 7. Finska Francuska Italija Švedska 8. 9. Mađarska 10. Slovenija 11. Danska 12. Hrvatska 3,47 1,77 1,49 1,28 1,13 1,10 1,04 0,80 0,60 0,60 0,56 0,30 Izdvajanja za sport iz proračuna u zemljama zapadne i srednje Europe su znatno veća nego u Hrvatskoj i u nominalnom iznosu i po stanovniku što se vidi iz tablice 3. Prikaz financiranja sporta proračunskim sredstvima na državnoj razini po stanovniku u nekim europskim državama Tablica 3. u EUR-ima Zemlja br. stanovnika ( 2001.) državni proračun po stanovniku 1. 2. 3. 4. 5. Francuska Poljska Republika Češka Švicarska Finska Austrija 6. 7. Mađarska 8. 9. Cipar Hrvatska 59.551.227 38.633.912 10.264.212 7.283.274 5.175.783 8.150.835 10.106.017 266 000.000 150 000.000 66.000.000 55.100.000 54.000.000 52.200.000 25.600.000 4.47 3.88 6.43 7.57 10.43 6.40 2.53 762.887 9.900.000 12.98 4.334.142 7.900.000 1.82 51 Iz proračuna županija i gradova, za javne potrebe u sportu, također se izdvajaju minimalna sredstava. Uvidom u podatke Ministarstva financija izdaci za sport i rekreacijske djelatnosti u proračunima na lokalnim razinama bili su: - u 2000. godini 453.731.074 kn što je 5,31% sredstava proračuna lokalne i područne (regionalne) samouprave, a koja su iznosila ukupno 8.550.875.810 kn, - u 2001. godini 439.657.089 kn. što je 4,34% sredstava proračuna lokalne i područne (regionalne) samouprave, a koja su iznosila ukupno 10.128.887.513 kn. Navedeno samo za sebe govori i nedvojbeno pokazuje pad sredstava za sport u Hrvatskoj i na lokalnim razinama (i u nominalnim iznosima i u postocima). Isto tako, umjesto da su sredstva od igara na sreću za sport u Hrvatskoj sve veća, ona su se iz godine u godinu smanjivala. Tako je za sport iz tih izvora bilo izdvojeno: u 1999. godini 14,2 milijuna kuna, a u 200oo2. godine tek oko 10 milijuna kuna. Sredstva od igara na sreću i nagradnih igara u svijetu već tradicionalno predstavljaju značajan izvor financiranja ove djelatnosti, što je vidljivo i iz tablice 4. koja slijedi: Izdvajanja za sport iz sredstava od igara na sreću u nekim europskim državama 2000. godine Tablica 4. Zemlja Velika Britanija Francuska Poljska Danska Švicarska Austrija Republika Češka Cipar 1. 2. 3. 4. 5. 6. 7. 8. 9. Hrvatska u EUR-ima Od igara na sreću 374.400.000 151.000.000 100.000.000 70.000.000 35.000.000 28.600.000 26.000.000 10.000.000 1.400.000 Donošenjem novog Zakona o priređivanju igara na sreću i nagradnih igara stanje se u 2003. godini nešto poboljšalo i sport se iz tih iznosa sufinancira s više sredstava nego što je to bilo do sada. No, i dalje će se iz tog izvora za sport izdvajati daleko manji postotak sredstava nego u europskim zemljama. Naprijed navedeni pokazatelji i uspoređenja s nekim europskim zemljama nedvojbeno pokazuju da Hrvatska u financiranju sporta zaostaje po svim relevantnim pokazateljima. Posljedice niske razine izdvajanja za sport su dugoročno i višestruko negativne.sagle Posebno u onom dijelu gdje bi sport trebao i morao postati", "manji postotak sredstava nego u europskim zemljama. Naprijed navedeni pokazatelji i uspoređenja s nekim europskim zemljama nedvojbeno pokazuju da Hrvatska u financiranju sporta zaostaje po svim relevantnim pokazateljima. Posljedice niske razine izdvajanja za sport su dugoročno i višestruko negativne.sagle Posebno u onom dijelu gdje bi sport trebao i morao postati pristupačan daleko većem broju mladih ljudi nego što je to sada. Sport može i treba postati i jedan od osnovnih čimbenika u osmišljavanju korištenja slobodnog vremena velikog broja građana. 9. Zaštita sportaša i pitanja dopinga su nedovoljno i neadekvatno regulirani. Nedefinirane ili neodgovarajuće su riješene obveze klubova i nacionalnih sportskih saveza te osoba koje obavljaju doping kontrolu, kao obveze, mjere i posljedice kad se utvrdi uzimanje nedozvoljenih sredstava. 10. Pitanja reda na natjecanjima i propisivanje odgovarajućih preventivnih mjera za sprečavanje nereda na natjecanjima postojećim Zakonom regulirano je načelno. 52 11. Sportska rekreacija odnosno «sport za sve» u postojećem zakonu se i ne spominje. Kod sagledavanja stanja u ovom segmentu sporta treba imati u vidu da je stalnim ili povremenim sportskim aktivnostima u Hrvatskoj obuhvaćeno svega oko 10% građana, dok u Zapadnoj Europi taj obuhvat se kreće između 40% i 70%, te je i to razlog za traženje boljih rješenja koja će stvarati uvjete za poboljšanje stanja. 9. 12. Zbog nedovoljno preciznih odredbi u važećem ZZakonu (i izostanku donošenja propisa) u odnosu na potrebu ,inspekcijskog nadzora, te nepostojanja odredbi o nadzoru nad stručnim radom u sportu, a djelomično i zbog neorganiziranosti nadležnih državnih tijela (koja se često puta bave više “stručnim”, a ne upravnim poslovima), ti se značajni poslovi praktički i nisu obavljali. Formatted: Bullets and Numbering II. PITANJA KOJA SE UREĐUJU ZAKONOMZ Posljedice koje će proisteći iz predloženih zakonskih rješenja Ovim zakonskim prijedlogom uređuje se cjelokupan sustav sporta - od amaterskoga sportskog kluba, pa do Hrvatskoga olimpijskog odbora, a osobito sljedeća pitanja: - Sustav sporta u Republici Hrvatskoj, njegovi organizacijski oblici (amaterski i profesionalni sportski klubovi, sportski savezi, sportske zajednice, Hrvatski olimpijski odbor i drugi) te njihova uloga u procesu organiziranja, programiranja i u realizaciji cjelokupnog programa sporta, kao i njihov pravni status. Osim toga uređuju se i osnovne pretpostavke bitne za organizaciju sporta na sveučilištu, sportske rekreacije, te sporta za osobe s invaliditetom; Formatted: Bullets and Numbering - Sport djece i mladeži, odnosno školski sport i njegovi oblici organiziranja i djelovanja kao dio ustroja sporta i obrazovnog sustava, posebno u dijelu koji se odnosi na osnivanje školskih sportskih klubova i njihovo udruživanje u školske sportske saveze, te kroz sportskau podukau kao novi organizacijski oblik sudjelovanja sporta u provođenju sportskih aktivnosti u školi; - - Status, prava i obveze sportaša sa posebnim naglaskom na rješavanje pitanja statusa sportaša u odgojno- obrazovnom procesu kao i za vrijeme služenja vojnog roka ili civilne službe. Zatim pravo vrhunskih sportaša amatera na određene novčane naknade, te na mirovinsko i zdravstveno osiguranje prema posebnim propisima; - Stručni poslovi u sportu, uvjeti za njihovo obavljanje, tko može obavljati stručne poslove, nadležnosti za propisivanje uvjeta i programa osposobljavanja;, - Uvjeti za obavljanje sportskih djelatnosti, koje su to", "civilne službe. Zatim pravo vrhunskih sportaša amatera na određene novčane naknade, te na mirovinsko i zdravstveno osiguranje prema posebnim propisima; - Stručni poslovi u sportu, uvjeti za njihovo obavljanje, tko može obavljati stručne poslove, nadležnosti za propisivanje uvjeta i programa osposobljavanja;, - Uvjeti za obavljanje sportskih djelatnosti, koje su to fizičke i pravne osobe koje ih mogu obavljati i na koji se način kroz trgovačkima društvima i putem obrtatoma mogu u sportu pružati usluge na tzržištu; - Načela i elementi sustava sportskih natjecanja u Republici Hrvatskoj, osnovna pravila za sudjelovanje u sportskim natjecanjima, te nositelji programiranja sustava, uvjeta i organiziranja sportskih natjecanja, njihove obveze, prava i nadležnosti; - Samostalni rad fizičkih osoba kao sportaša natjecatelja, te stručnjaka koji na taj način mogu obavljati poslove sportske poduke, treninga sportaša, te organiziranja i vođenja sportske rekreacije građana;; 53 - Osnivanje profesionalnih klubova kao specifičnih sportskih dioničkih društava sukladno je europskoj praksi i praksi nekih tranzicijskih zemalja. Propisuje se i daje mogućnost da postojeći amaterski sportski klubovi osnivaju profesionalne klubove ili pak da se preoblikuju, te tako promijene status u profesionalne klubove. Osnivanje profesionalnih klubova (sportska dionička društva) u dijelu vrhunskog sporta (nogomet, rukomet, košarka i sl.) postaje obveza. Definiranjem vlasničke strukture kroz dioničare, u tom će se segmentu sporta primjenom zakona uvesti red, isključiti razni privatni “menadžđeri” koji sada djeluju u tim klubovima, a također više neće na poslovanje kluba imati utjecaja često puta sadašnje često puta neodgovorne uprave “amaterskih “ djelatnika, koje danas rade sa znatnim financijskim sredstvima i velikim ovlaštenjima a da pritom ne snose gotovo nikakvu odgovornost. - Zdravstvena zaštita sportaša, zabrana davanja i uzimanja nedopuštzvoljenih sredstava, pravo i obveza na doping kontrolu, obveze organizatora natjecanja i nacionalnih sportskih saveza u slučaju da se utvrdi pozitivan nalaz na doping kontroli; - Postupci pri planiranju, projektiranju i izgradnji sportskih objekata koji bi trebali pridonijeti većoj racionalizaciji u tom važnom segmentu sporta. Onemogućava se daljnja devastacija sportskih objekata i uređuju se odnosi sportskih zajednica i vlasnika javnih sportskih objekata u poslovima upravljanja;; - Zbog specifičnosti obavljanja pojedinih sportskih djelatnosti stvorene su pretpostavke za osnivanje ustanova, kao i trgovačkih društava za javne sportske objekte s nekim posebnostima u odnosu na druga trgovačka društva;; - Izvori financiranja sporta, definiranje i način programiranja javnih potreba u sportu, te određivanje postupaka i nositelja programiranja kao i same realizacije programa javnih potreba u sportu; - Hrvatski olimpijski odbor sudjeluje u izradi programa javnih potreba u sportu propisnih Zakonom iz svog djelokruga, odgovoran je za izvršenje programa javnih potreba i utrošak sredstava, te Vladi Republike Hrvatske podnosi izvješća o izvršenju programa i utrošku sredstava ( uspostavlja se jedan novi partnerski odnos). Takav se partnerski odnos prenosi i na niže razine i tijela lokalne uprave i samouprave u odnosu na sportske zajednice u tim sredinama.; - Kao dugoročni interes Republike Hrvatske donosi se Nacionalni program sporta u kojem će se utvrditi sportski razvojni ciljevi u desetogodišnjem razdoblju, s posebnim naglaskom na nužnost početka izgradnje višenamijenskih kapitalnih sportskih objekata u svim županijama;; - Za financiranje kapitalne izgradnje, a a", "odnosu na sportske zajednice u tim sredinama.; - Kao dugoročni interes Republike Hrvatske donosi se Nacionalni program sporta u kojem će se utvrditi sportski razvojni ciljevi u desetogodišnjem razdoblju, s posebnim naglaskom na nužnost početka izgradnje višenamijenskih kapitalnih sportskih objekata u svim županijama;; - Za financiranje kapitalne izgradnje, a a u sklopokviru Nacionalnog programa sporta, sredstva se osiguravaju iz proračuna i dijela prihoda od igara na sreću i drugih nagradnih igara, dakle na način na koji se to osigurava i u drugim europskimh zemaljama.; - Utvrđivanje propisanih uvjeta za obavljanje pojedinih sportskih djelatnosti daje se tijelima nadležnim za pitanja sporta u županijama i Gradu Zagrebu kao pervostupanjskim upravnim tijelima za razliku od dosadašnjeg ZZakona po kojem je to bilo u nadležnosti Ministarstva prosvjete i športa; Također se uređuju: informacijski sustav i evidencije u sportu, upravni, inspekcijski i stručni nadzor, Državna nagrada za sport \"«Franjo Bučar\"», kazne za prekršaje u sportu i donošenje provedbenih propisa i usklađivanje ustroja sporta s ovim zZakonom. III. OBRAZLOŽENJE POJEDINIH ODREDBI ZAKONA 54 Općim odredbama, glava I. (članci 1. do 6.) navode se bitne višestruke vrijednosti, funkcije i karakteristike sporta kao organizirane aktivnosti, sukladno suvremenim shvaćanjima u nas, Europi i razvijenom svijetu (članak 1.). Određuju se sportske djelatnosti po ovom Zakonu (članak 2.), utvrđuju načela na kojima se temelji sport i sportske djelatnosti (članak 3.), daju se bitni razlozi zbog kojih je sport društvena djelatnost od osobitog interesa za Republiku Hrvatsku (članak 4.), navodi se kojim mjerama, programima, načinima i iz kojih sredstava država osigurava razvoj sporta (članak 5.), te koji se propisi, uz zakonske propise, primjenjuju na odnose u sportu (članak 6.). Naglašava se uloga i obveza lokalne i područne (regionalne) samouprave da potiče i pomaže sport, a osobito u stvaranju uvjeta za svakodnevno bavljenje sportom djece i mladeži (članak 5. stavak 2.). Propisuje se dužnost pravnih i fizičkih osoba da u obavljanju sportskih djelatnosti promiču i ostvaruju odgojne, humane, sociološko-kulturne i zdravstvene vrijednosti sporta (članak 5. stavak 3.). Sustav sporta uređuje se odredbama glave II. (članci 7. do 27.). Člankom 7. određuje se da sustav sporta u Republici Hrvatskoj čine amaterski i profesionalni sportski klubovi, sportske udruge, sportski savezi, sportske zajednice i Hrvatski olimpijski odbor te visoka učilišta za školovanje kadrova u sportu.. Također je određeno da su dio sustava sporta i školski sportski klubovi i školski sportski savezi te ustanove za obavljanje sportskih djelatnosti i trgovačka društva za javne sportske objekte. Amaterski sportski klubovi, sportska udruge, studentske sportske udruge, društva sportske rekreacije, sportski klubovi i sportske udruge osoba s invaliditetom, školski sportski savezi, sportski savezi, sportske zajednice i Hrvatski olimpijski odbor imaju status udruga i neprofitnih pravnih osoba. Na njihovo osnivanje, registraciju, pravni položaj i prestanak primjenjuje se Zakon o udrugama ako ovim Zakonom nije drukčije određeno (članak 7. stavak 3.). U članku 7. stavku 5. su navedena prava za članove sportskih udruga iz sustava sporta te da se korištenje tih prava uređuje općim aktima udruga. Amaterski sportski klubovi uređeni su člancima 8. do 13. Propisana su sva bitna pitanja tih sportskih klubova", "Zakonom nije drukčije određeno (članak 7. stavak 3.). U članku 7. stavku 5. su navedena prava za članove sportskih udruga iz sustava sporta te da se korištenje tih prava uređuje općim aktima udruga. Amaterski sportski klubovi uređeni su člancima 8. do 13. Propisana su sva bitna pitanja tih sportskih klubova odnosno sportskih društava i njihove specifičnosti. Osnivaju se po Zakonu o udrugama i ovom Zakonu. Specifičnost u odnosu na ostale udruge iz Zakona o udrugama je to da amaterski sportski klub kao udrugu može osnovati samo jedna pravna osoba (članak 8.). Člankom 9. propisana su, zbog mogućeg sukoba interesa, ograničenja sudjelovanja u upravljanju. Člankom 10. propisano je: što čini imovinu amaterskoga sportskog kluba, da su sredstva osnivača i članova amaterskog kluba unijeta u klub kao udrugu po bilo kojoj osnovi imovina kluba, da se ne smiju obavljati djelatnosti radi stjecanja dobiti za osnivače, članove i treće osobe te da klub odgovara za obveze cjelokupnom imovinom. Amaterski klub u strukovnim i sportskim pitanjima djeluje sukladno propisima nacionalnoga sportskog saveza i ima obvezu utvrđivanja i objavljivanja općeg akta o određivanju visine članarine (članak 11). Člankom 12. uređeno je koliko za amaterski sportski klub u momčadskim sportovima može istovremeno nastupati (igrati) sportaša profesionalaca. Člankom 13. propisano je da amaterski sportski klub može promijeniti status u profesionalni klub prema uvjetima i postupku iz ovoga Zakona. U člancima 14. i 15. navedene su posebne udruge u sportu i njihove specifičnosti. Takve udruge uobičajeno rabe naziv udruženje ili društvo i osnivaju se radi ostvarivanja zajedničkih sportskih interesa i ciljeva, no njihovo osnivanje i osnovni cilj djelovanja nije sudjelovanje u natjecanjima. 55 Ove sportske udruge se osnivaju, registriraju, imaju pravni položaj i prestaju postojati po Zakonu o udrugama uz neke specifičnosti s obzirom na osnivača. Dana je mogućnost osnivanja posebnih udruga stručnim osobama u sportu i osoba u funkciji sporta kao strukovnim udruženjima. Osnivači udruga osoba u funkciji sporta i stručnih osoba u sportu mogu biti i nacionalni sportski savezi. Profesionalni sportski klubovi istog sporta mogu se udruživati u posebne udruge. Sve ove udruge na nacionalnoj razini su članice pripadajućih nacionalnih sportskih saveza. Sportski savezi uređuju se člancima 16. do 18., a osnivaju se po sportovima. Člankom 16. uređeno je da su članovi sportskih saveza sportski klubovi iz istog sporta. Sportski savezi se u gradovima osnivaju ako na njihovu području djeluju najmanje tri kluba. U županijama i Gradu Zagrebu se osnivaju ako na njihovu području djeluju najmanje tri kluba odnosno saveza, a nacionalni sportski savezi ako djeluju najmanje tri kluba odnosno dva saveza. U državi, županiji odnosno Gradu Zagrebu i gradu za jedan sport može se osnovati samo jedan sportski savez. Ako ne postoje uvjeti za osnivanje županijskih saveza, mogu se osnivati međužupanijski savezi. Mišljenje što se smatra istim sportom i koja se djelatnost smatra sportom, u slučaju dvojbe, daje Hrvatski olimpijski odbor. U članku 17. dan je djelokrug sportskih saveza i posebice nacionalnih sportskih saveza. Člankom 18. propisana su, zbog mogućeg sukoba interesa, određena ograničenja sudjelovanja u upravljanju. Sportske zajednice uređuju se člancima 19. i 20.", "smatra istim sportom i koja se djelatnost smatra sportom, u slučaju dvojbe, daje Hrvatski olimpijski odbor. U članku 17. dan je djelokrug sportskih saveza i posebice nacionalnih sportskih saveza. Člankom 18. propisana su, zbog mogućeg sukoba interesa, određena ograničenja sudjelovanja u upravljanju. Sportske zajednice uređuju se člancima 19. i 20. Osnivaju se za različite sportove u županijama, Gradu Zagrebu i gradovima, a članovi su im svi sportski savezi, javne ustanove za upravljanje sportskim objektima i trgovačka društva za javne sportske objekte na njihovu području. Članovi sportskih saveza mogu biti i druge pravne osobe čija je djelatnost važna za sport. Klubovi iz gradova i općina u kojima nisu osnovani sportski savezi ili ne postoje uvjeti za njihovo osnivanje, članovi su sportskih saveza županija. Člankom 20. uređen je djelokrug sportskih zajednica. Studentski sport uređen je člankom 21. na način da se na visokim učilištima studenti mogu udruživati u studentske sportske udruge, koje se udružuju u studentske sportske saveze i uspostavljaju posebni sustav sportskih natjecanja u sklopu jednog sveučilišta. Studentske sportske saveze osnivaju Hrvatski studentski sportski savez koji utvrđuje i organizira nacionalna studentska natjecanja i predstavlja hrvatski studentski sport u međunarodnim studentskim sportskim udruženjima. Na njegov djelokrug i zadaće primjenjuju se odredbe ovoga Zakona koje se odnose na nacionalne sportske saveze. Upravnim vijećima visokih učilišta dana je u nadležnost utvrđivanje uvjeta pod kojima studentske sportske udruge mogu koristiti prostore visokih učilišta. Sportska rekreacija uređena je člankom 22. kao aktivnost bitna za očuvanje, održavanje, poboljšanje i unapređivanje psihofizičkih sposobnosti građana i osmišljavanje njihova slobodnog vremena u sportskim udrugama – društvima za sportsku rekreaciju. Propisan je način udruživanja u županijama. Hrvatski savez sportske rekreacije – «Sport za sve» ima status nacionalnog saveza u koji se udružuju savezi iz županija, Grada Zagreba i većih gradova. Dana je mogućnost udruživanja i drugih pravnih osoba koje se bave sportskom rekreacijom ili je njihova djelatnost u vezi s njom. Propisana je posebnost da jedna pravna osoba može biti osnivač ovih udruga. Sport osoba s invaliditetom uređen je člankom 23. 56 Osobe s invaliditetom mogu osnivati sportske udruge radi rekreacije i sportske klubove radi sportskih natjecanja osoba s invaliditetom. Udružuju se u sportske zajednice ili sportske saveze osoba s invaliditetom na svom području. Mogu se udruživati po sportovima i po vrstama invaliditeta. Sportski savezi iz županija i Grada Zagreba i nacionalni sportski savezi osoba s invaliditetom udružuju se u Hrvatski paraolimpijski odbor koji ima status nacionalnoga sportskog saveza i na njegov djelokrug i zadaće na odgovarajući način se primjenjuju odredbe o nacionalnim sportskim savezima. Sportske udruge gluhih i specijalne olimpijade udružuju se u posebne nacionalne saveze i po ovom Zakonu nisu obvezni udružiti se u Hrvatski paraolimpijski odbor. Na sportske klubove, udruge i saveze osoba s invaliditetom primjenjuju se odredbe o sportskim savezima i zajednicama iz ovoga Zakona. Hrvatski olimpijski odbor uređuje se člancima 24. do 27. Prema članku 24. Hrvatski olimpijski odbor je posebna pravna osoba – nevladina nacionalna sportska udruga u koju su udruženi nacionalni sportski savezi (sada ih ima 52 registrirana po sportovima) i udruženje sportskih zajednica", "o sportskim savezima i zajednicama iz ovoga Zakona. Hrvatski olimpijski odbor uređuje se člancima 24. do 27. Prema članku 24. Hrvatski olimpijski odbor je posebna pravna osoba – nevladina nacionalna sportska udruga u koju su udruženi nacionalni sportski savezi (sada ih ima 52 registrirana po sportovima) i udruženje sportskih zajednica županija i Grada Zagreba (21 sportska zajednica). Sukladno njegovu statutu, dana je mogućnost da se udruže i druge pravne osobe važne za razvoj i promicanje sporta u Hrvatskoj. Temeljem ovoga Zakona i statuta u Hrvatski olimpijski odbor udruženo je i devet drugih udruženja na državnoj razini. On stvara uvjete za nesmetan razvoj sporta i olimpijskog pokreta u Hrvatskoj. Svoje djelovanje temelji na načelima olimpijskog pokreta, Olimpijske povelje Međunarodnoga olimpijskog odbora i potrebama hrvatskoga sporta (članak 25.). Člankom 26. određene su zadaće Hrvatskoga olimpijskog odbora. Uz poticanje, promicanje i praćenje sporta u Hrvatskoj, Odbor ima niz zadaća i ovlasti bitnih za funkcioniranje sporta u svim njegovim dijelovima kao što su: predlaganje i provođenje programa javnih potreba u sportu na državnoj razini, predlaganje dugoročnih programa razvoja sporta, usklađivanje aktivnosti nacionalnih sportskih saveza i sportskih zajednica. Člankom 27. propisuje se pri Hrvatskom olimpijskom odboru djelovanje stalnog sportskog arbitražnog sudišta kojemu se uz nadležnosti ugovorne arbitraže u sporovima nastalim u vezi s obavljanjem sportske djelatnosti propisuje i ovlast da odlučuje o zahtjevu za izvanredno preispitivanje odluka sportskih saveza i sportskih zajednica, sportskih klubova i drugih sportskih udruga protiv kojih su iscrpljena sredstva pravne zaštite ili ne postoje druga, a radi se o sporu ili pitanju važnom za izvršenje njihovih poslova i zadaća i zadaća Hrvatskoga olimpijskog odbora utvrđenih ovim Zakonom. Propisano je da nadležnost, sastav, ustroj te pravila postupka sportske arbitraže uređuje Hrvatski olimpijski odbor svojim općim aktima. Sport u školi uređuje se odredbama glave III. ( članci 28. do 37.). Člankom 28. definirano je da sport u školi podrazumijeva organizirane sportske aktivnosti u ustanovama predškolskog odgoja i sportske aktivnosti školskih sportskih klubova te sportsku poduku u školama. U članku 29. stavku 1. naglašeno je poticanje organiziranih tjelesnih aktivnosti djece u ustanovama predškolskog odgoja koje se provode po posebnim programima, a u funkciji su razvoja motoričkih znanja i sposobnosti, povoljnog utjecaja na rast i razvoj i usmjerenja interesa djece za sportskim aktivnostima. U školama se posebno potiču organizirane izvannastavne i izvanškolske sportske aktivnosti učenica i učenika (članak 29. stavak 2.). Člankom 30. propisana je obveza suradnje državnih i lokalnih tijela, sportskih udruženja i klubova u stvaranju uvjeta za bavljenje sportom djece i mladeži. 57 Radi izvannastavnog bavljenja sportom učenica i učenika (članak 31.) u školama se osnivaju školski sportski klubovi ili društva. Njihov temeljni cilj je da se što više učenica i učenika bave sportom, a aktivnosti provode sukladno Zakonu o sportu i propisima o osnovnom i srednjem obrazovanju. Ministar nadležan za poslove prosvjete i sporta propisuje način djelovanja tih klubova (članak 32.). Kako školski sportski klubovi nemaju status pravne osobe, sva novčana sredstva za njih idu preko škole u kojoj je klub te se ta sredstva mogu upotrebljavati isključivo za rad i djelovanje", "o osnovnom i srednjem obrazovanju. Ministar nadležan za poslove prosvjete i sporta propisuje način djelovanja tih klubova (članak 32.). Kako školski sportski klubovi nemaju status pravne osobe, sva novčana sredstva za njih idu preko škole u kojoj je klub te se ta sredstva mogu upotrebljavati isključivo za rad i djelovanje kluba (članak 33.). Člankom 34. propisano je da se u županijama i Gradu Zagrebu osnivaju školski sportski savezi, tko je njihov osnivač, te uvjeti kada se mogu osnivati u gradovima. Imaju status posebne udruge koja se osniva po Zakonu o udrugama uz posebnosti iz ovoga Zakona. Propisane su zadaće tih saveza te da se udružuju u sportske zajednice radi izvršavanja zadaća, kao i izvori njihova financiranja. Člankom 35. uređeno je da se odlukom ministara nadležnog za poslove prosvjete i sporta ustrojava Hrvatski školski sportski savez pri ministarstvu nadležnom za poslove sporta te da je član Hrvatskoga olimpijskog odbora. Navedene su njegove temeljne zadaće, aktivnosti, poslovi i djelokrug u vezi sa školskim sportskim klubovima, tj. utvrđivanje jedinstvenog sustava natjecanja školskih klubova u Hrvatskoj, skrb o izjednačavanju i poboljšanju uvjeta rada svih školskih klubova, organizacija i provedba državnih prvenstava školskih klubova i izvori i način financiranja u izvršavanju tih zadaća. Člankom 36. uređena je sportska poduka djece i mladeži kao priprema, trening i natjecanja učenica i učenika za sustavno bavljenje sportom. Uvođenje školskih sportskih klubova kao jednog od značajnijih dijelova ukupnog sporta u ustroj sporta i njihovo djelovanja u sastavu obrazovnih ustanova (škola) važan je dio ne samo razvoja sporta, već i preduvjet za značajniju odgojnu funkciju i djelatnost škole. Sportaši i druge osobe u sportu uređuju se odredbama glave IV. (članci 38. do 50.). Dane su definicije: sportaša (članak 38.), sportaša amatera (članak 39.), sportaša profesionalaca (članak 40.), darovitih sportaša (članak 41.) i vrhunskih sportaša (članak 42.), njihova prava i obveze, stjecanje statusa te tko osigurava ostvarenje prava i tko i na koji način propisuje uvjete za ostvarenje prava. Hrvatskom olimpijskom odboru dano je člancima 42. i 43. ovlaštenje izdavanja javnih isprava – rješenja o kategorizaciji vrhunskih sportaša. Propisano je da se temeljem općeg akta o kategorizaciji vrhunskih sportaša donose rješenja, status i postupak donošenja rješenja te prava koja iz njih proizlaze kao i obveze za ostvarenje prava. Za sportaše, kao i za amaterske i profesionalne klubove, propisana je obveza sudjelovanja u pripremama i treninzima nacionalnih selekcija (članak 47.). Status sportskih sudaca, delegata, povjerenika i drugih osoba u funkciji sporta stječe se temeljem općih akata nacionalnih sportskih saveza (članak 48). Definiran je status dragovoljaca u sportu te da im se mogu snositi putni troškovi, smještaj i prehrana za vrijeme dragovoljnog rada (članak 49.). Pitanja menadžera i njihovih ugovora sa sportašima u sustavu sporta Republike Hrvatske, prava i ovlasti nacionalnih sportskih saveza, obveze, prava i ograničenja menadžera sportaša i sportaša uređena su člankom 50. Stručni poslovi u sportu uređuju se odredbama glave V. (članci 51. i 52.). Propisani su stručni poslovi u sportu (članak 51. stavak 1.) te da ih mogu obavljati odgovarajuće školovane odnosno osposobljene osobe (članak 51. stavak 2.). Ministar", "obveze, prava i ograničenja menadžera sportaša i sportaša uređena su člankom 50. Stručni poslovi u sportu uređuju se odredbama glave V. (članci 51. i 52.). Propisani su stručni poslovi u sportu (članak 51. stavak 1.) te da ih mogu obavljati odgovarajuće školovane odnosno osposobljene osobe (članak 51. stavak 2.). Ministar nadležan za poslove i sporta propisuje stručnu spremu odnosno stručnu osposobljenost za njihovo obavljanje (članak 51. stavak 3.), zatim tko izvodi programe osposobljavanja i na temelju čijeg odobrenja i dr. (članak 52.). 58 Obavljanje sportskih djelatnosti uređuje se odredbama glave VI. (članci 53. do 72.). Člankom 53. uređeno je tko sve može obavljati sportske djelatnosti (sportski klubovi, sportske udruge, ustanove za obavljanje sportskih djelatnosti, trgovačka društva za javne sportske objekte, sportski savezi, sportske zajednice i Hrvatski olimpijski odbor te fizičke osobe samostalnim radom), te da se mogu obavljati obrtom i trgovačkim društvima kao pružanje usluga na tržištu. Mogu ih obavljati domaće i strane pravne i fizičke osobe. Člankom 54. propisani su uvjeti za obavljanje sportskih djelatnosti, tko propisuje uvjete, što se podnosi registarskom tijelu za upis u registar i tko u upravnim postupcima utvrđuje ispunjavanje uvjeta da bi se moglo započeti obavljati sportske djelatnosti (članak 55.). Samostalnim radom fizičke osobe mogu obavljati sportske djelatnosti: sportsku poduku, trening sportaša, provođenje sportske rekreacije i sudjelovanje u natjecanjima (članak 57.). Navedene djelatnosti mogu se obavljati samo osobno. Kako se na fizičke osobe koje samostalnim radom obavljaju djelatnosti ne mogu primijeniti odredbe Zakona o obrtu to su odredbama članaka 57. do 61. uređena sva potrebna pitanja o obavljanju sportskih djelatnosti samostalnim radom (registracija, uvjeti za upis u registar, stručna sprema odnosno osposobljenost, prestanak prava obavljanja djelatnosti, brisanje iz registra i druga pitanja). Obavljanje sportskih djelatnosti navedenih u članka 57. samostalnim radom, kao posebnim pravnim oblikom koji to postaje upisom u registar iz članka 58., stječu se prava iz mirovinskog i zdravstvenog osiguranja temeljem uvjeta iz propisa koji uređuju ta područja i ovoga Zakona. Fizičke osobe upisane u registar imaju pravo na mirovinsko i zdravstveno osiguranje po posebnim propisima i imaju status slobodne profesije i prava i obveze koje iz toga statusa proizlaze (članak 58. stavak 3.). Možemo reći da je ovo jedan od važnih pravnih oblika iz ovoga Zakona koji potiče samozapošljavanje i pogoduje mu. Za strance u Hrvatskoj, pod uvjetima iz ovoga Zakona i drugih zakona, nema zapreka za obavljanje sportskih djelatnosti iz ovoga Zakona. Mogu ih obavljati kroz razne pravne osobe i statuse (trgovačka društva, obrt, temeljem ugovora i dr.). Stranci mogu biti upisni u registar, a time i kroz ovaj pravni oblik obavljati djelatnost, ako je to uređeno posebnim propisima ili ratificiranim međunarodnim sporazumima i drugim ratificiranim međunarodnim aktima što se uređuje članak 60. stavkom 3. Ustanove za obavljanje sportskih djelatnosti uređene su odredbama članka 62. i 63. Radi se o ustanovama za obrazovanje i osposobljavanje stručnih kadrova za potrebe sporta, stručno istraživačkog rada u području sporta i upravljanja sportskim objektima. Na osnivanje, registraciju, ustroj, pravni položaj, početak obavljanja djelatnosti i prestanak postojanja primjenjuje se Zakon o ustanovama uz navođenje specifičnosti", "uređene su odredbama članka 62. i 63. Radi se o ustanovama za obrazovanje i osposobljavanje stručnih kadrova za potrebe sporta, stručno istraživačkog rada u području sporta i upravljanja sportskim objektima. Na osnivanje, registraciju, ustroj, pravni položaj, početak obavljanja djelatnosti i prestanak postojanja primjenjuje se Zakon o ustanovama uz navođenje specifičnosti koje propisuje ovaj Zakon (sudjelovanje u upravljanju, akt ili program kojim se utvrđuju uvjeti i način obavljanja djelatnosti, ostvarivanje programa, dostava programa nadležnom državnom tijelu). Trgovačka društava za javne sportske objekte uređena su odredbama članaka 64. do 66. Propisano je da u njihovu upravljanju obvezno sudjeluju predstavnici sportskih zajednica (članak 65.), kao i obveza uporabe dobiti u razvoj, održavanje i izgradnju sportskih objekata (članak 66.). Sportski obrt uređen je odredbama članaka 67. do 70. polazeći od postojeće prakse i od Zakona o obrtu koji je temelj za njegovo osnivanje, registraciju, poslovanje i prestanak postojanja uz propisivanje nekih specifičnosti koje su posljedica sporta kao djelatnosti odnosno specifičnost pružanja sportskih usluga na tržištu te neka ograničenja koja iz toga proizlaze. 59 Uvođenjem sportskog obrta inicira se poduzetništvo i samozapošljavanje u području sporta. Trgovačka društva koja se osnivaju za obavljanje sportskih djelatnosti ili u svojoj djelatnosti imaju i registriranu neku sportsku djelatnost (što je postojeća praksa velikog broja trgovačkih društava) navode se u članku 71. Na njihovo osnivanje, registraciju, poslovanje i prestanak postojanja primjenjuje se Zakon o trgovačkim društvima, uz specifičnost izuzimanja djelatnosti sportskih natjecanja koja je na poseban način riješena ovim Zakonom, što je posljedica sudjelovanja u sustavu natjecanja (lige i sl.) na temelju propisa nacionalnih sportskih saveza. Profesionalni sportski klubovi uređeni su odredbama glave VII. (članci 73. do 98.) Profesionalni sportski klub se osniva za obavljanje natjecateljske djelatnosti kao sportsko dioničko društvo. Mogu ga osnivati domaće i strane pravne i fizičke osobe. No, za osnivanje u bilo kojem sportu potrebna je prethodna odluka nacionalnoga sportskog saveza (članak 77.). Profesionalni sportski klub uređen je kao poseban oblik dioničkog društva – sportsko dioničko društvo. Uređena su sva osnovna relevantna pitanja za taj oblik pravne osobe koja se utemeljuje ovim Zakonom, te drugim propisima koji se primjenjuju na dionička društva. Uređena je djelatnost (članak 73.), osnivači (članak 76.) i najniža osnivačka sredstva od 1.000.000.00 kuna kao temeljni kapital (članak 77.). Na temelju članka 78. vlasnik dionica profesionalnog kluba mora se znati, jer se dionice izdaju na ime. Samo u jednom profesionalnom klubu istoga sporta može se imati više od 5% glasova u glavnoj skupštini (članak 79.). Osobe čiji poslovi mogu utjecati na regularnost natjecanja, kao što su sportski suci, menadžeri, vlasnici kladionica i sl., kao i s njima povezane osobe (članak 80.), ne mogu imati dionice u profesionalnim klubovima. Zbog osjetljivosti cjelokupnog postupka “pretvorbe” amaterskih sportskih klubova u profesionalne, kroz članak 81. daju se određena ograničenja u stjecanju dionica. Tako će u prve dvije godine od osnivanja svaki profesionalni klub imati najmanje četiri “vlasnika”, odnosno nitko neće moći imati više od 25% glasova u glavnoj skupštini. Samo izuzetno, uz suglasnost ministarstva nadležnog za poslove sporta, može se imati i više od 25% glasova u", "određena ograničenja u stjecanju dionica. Tako će u prve dvije godine od osnivanja svaki profesionalni klub imati najmanje četiri “vlasnika”, odnosno nitko neće moći imati više od 25% glasova u glavnoj skupštini. Samo izuzetno, uz suglasnost ministarstva nadležnog za poslove sporta, može se imati i više od 25% glasova u glavnoj skupštini profesionalnog kluba. Predviđeno je da se dobit ne može dijeliti dioničarima, što je suglasno praksi u većini europskih zemalja i stavu Hrvatskog nogometnog saveza kao najbrojnijeg sportskog udru\\enja. Tako se člankom 84. želi postići da profesionalni klubovi i dalje budu centar razvoja svoga sporta u gradu i regiji te da, što je više moguće, ulažu i u vlastiti amaterski sportski pogon, pa i u podmladak nekog drugog amaterskog sportskog kluba. Člankom 85. se govori da ista fizička osoba može biti u upravi samo jednog profesionalnog kluba istog sporta, a također se govori i o osobama koje uopće ne mogu biti članovi upravnih ili nadzornih odbora (suci, menadžeri, vlasnici kladionica i sl.). Članci 86., 87. i 88. daju mogućnost amaterskom sportskom klubu da bude osnivač profesionalnog kluba, a da pri tom nastavlja svoju djelatnost, odnosno da se preoblikuje (promijeni status) u profesionalni klub. Nakon osnivanja, u oba slučaja se predviđa raspisivanje javnog poziva za upis dionica nominalne vrijednosti od 100 do 500 kuna s rokovima koji su određeni u članku 89. Kao jedan od načina prevladavanja “vjerovničke krize” u dijelu profesionalnih klubova, predviđa se mogućnost (članak 90.) da vjerovnici, za svoja vjerovnička potraživanja, upišu i preuzmu dionice profesionalnog kluba. Kako je za svaku “pretvorbu” ovakvoga tipa važno utvrditi pravo stanje imovine i obveza, u člancima 91. do 94. propisuje se metodologija, način i osnovni elementi za utvrđivanje kriterija pri utvrđivanju stanja imovine i obveza, posebno za osnivača amaterski klub, a posebno i za novoosnovani profesionalni klub. 60 Pri ministarstvu nadležnom za poslove sporta, temeljem članka 96. ovoga Zakona osniva se Povjerenstvo za praćenje cjelokupnog procesa profesionalizacije klubova u Hrvatskoj. Temeljem članka 97. i 98. utvrđuju se zadaće Povjerenstva kao savjetodavnog tijela ministarstva nadležnog za poslove sporta, koje pak na temelju mišljenja Povjerenstva daje suglasnosti na odluku nacionalnog sportskog saveza o potrebi organiziranja sustava natjecanja profesionalnih klubova (članak 75.), kao i na elaborat o stanju imovine amaterskog sportskog kluba iz članka 91. Očekuje se da će uvjete za osnivanje profesionalnih klubova i liga u prvim godinama primjene ovoga Zakona imati tek nekoliko momčadskih sportova, i to pretežno klubovi prve lige, a daljnje širenje će ovisiti, ne samo o razvoju sportova i klubova, nego i o razvoju ukupnog gospodarstva. Sportska natjecanja uređuju se odredbama glave VIII. (članci 99. do115.). Načela i osnovne elemente sustava sportskih natjecanja i uvjete sudjelovanja naših sportaša i klubova u višedržavnim i regionalnim sustavima natjecanja utvrđuje Hrvatski olimpijski odbor (članak 99. stavak 1.), a nacionalni sportski savezi utvrđuju sustav, uvjete i organizaciju natjecanja u svome sportu te financijske obveze za sudjelovanje u sustavu natjecanja, što se utvrđuje općim aktom i elaboratom (članak 99. stavak 2.). Može se uspostaviti sustav u kojem sudjeluju zajedno amaterski i profesionalni klubovi,", "olimpijski odbor (članak 99. stavak 1.), a nacionalni sportski savezi utvrđuju sustav, uvjete i organizaciju natjecanja u svome sportu te financijske obveze za sudjelovanje u sustavu natjecanja, što se utvrđuje općim aktom i elaboratom (članak 99. stavak 2.). Može se uspostaviti sustav u kojem sudjeluju zajedno amaterski i profesionalni klubovi, ili sustav u kojem sudjeluju samo profesionalni klubovi (članak 99. stavak 3. i 4.). Prijedlog sustava natjecanja samo profesionalnih klubova daju udruženja tih klubova (članak 99. stavak 4). Odluku o organizaciji sustava natjecanja za područje više država ili više inozemnih regija donosi nacionalni savez, kao i odluku o sudjelovanju naših klubova u tim sustavima natjecanja (članak 99. stavak 5. i 6.). Sustav natjecanja donosi se na neodređeno vrijeme, a iznimno na određeno vrijeme ne kraće od četiri godine (članak 99. stavak 7.) Člankom 100. propisano je da je pri donošenju novog sustava natjecanja ili promjene bitnih elemenata sustava natjecanja minimalni rok za njegovu primjenu godinu dana. Navedeno je što se smatra bitnim elementima sustava natjecanja te da su nacionalni sportski savezi za promjenu sustava natjecanja dužni izraditi elaborat o opravdanosti promjene i dati ga Hrvatskom olimpijskom odboru koji daje suglasnost na promjenu sustava natjecanja. Nacionalni savezi organiziraju i vode natjecanja, a vođenje natjecanja mogu povjeriti pojedinoj članici (članak 101.) ili drugoj pravnoj osobi. Članak 102. propisuje da u momčadskim sportovima sportaš profesionalac mora imati ugovor o profesionalnom natjecanju sa sportskim klubom za koji se natječe, ali ne propisuje koji pravni oblik i status ugovora. Sportaši profesionalci mogu sudjelovati samo na natjecanjima na državnoj razini, a ako klub izgubi pravo natjecanja na državnoj razini njegovi sportaši mogu sudjelovati u natjecanjima u sljedećoj natjecateljskoj sezoni. Sudjelovanje sportaša amatera i profesionalaca u istim natjecanjima svojim općim aktom uređuju nacionalni sportski savezi na temelju članka 103. Člankom 104. propisano je kada i na temelju kojih propisa strani državljani mogu nastupati za naše klubove. Člankom 105. stavkom 1. propisuje se prethodna suglasnost nacionalnih saveza za sudjelovanje naših klubova i sportaša u međunarodnim natjecanjima. Člankom 105. stavkom 2. uređuju se pitanja kandidiranja za održavanje velikih sportskih priredaba u Hrvatskoj, kao i sudjelovanje hrvatskih sportaša na velikim međunarodnim natjecanjima i priredbama. Za održavanje velikih sportskih natjecanja i priredbi u Hrvatskoj suglasnost daje Vlada Republike Hrvatske (članak 105. stavak 3.). Sportska natjecanja održavaju se sukladno Zakonu o javnom okupljanju i drugim propisima koji uređuju sprečavanje nereda na sportskim natjecanjima i organizatori su dužni pridržavati se toga Zakona i tih drugih propisa (članak 106.). 61 Članak 107. određuje mjere i radnje koja povećavaju sigurnost natjecanja. Člankom 108. obvezuju se neposredni organizatori sportskih natjecanja da osiguraju natjecateljima i drugim sudionicima natjecanja i gledateljima sigurnost i pružanje osnovne i hitne medicinske pomoći. Člankom 110. određeni su rokovi za utvrđivanje zdravstvene sposobnosti sportaša prije sudjelovanja na natjecanjima te tko i na koji način utvrđuje njihovu zdravstvenu sposobnost. Člankom 111. sprječava se sudjelovanje i obvezivanje sportaša na trening i natjecanje za koga je nadležni liječnik utvrdio zdravstvenu nesposobnost. Članak 112. propisuje zabranu uzimanja dopinga i obvezu dopuštanja kontrole, a članak 113. propisuje postupke", "sportaša prije sudjelovanja na natjecanjima te tko i na koji način utvrđuje njihovu zdravstvenu sposobnost. Člankom 111. sprječava se sudjelovanje i obvezivanje sportaša na trening i natjecanje za koga je nadležni liječnik utvrdio zdravstvenu nesposobnost. Članak 112. propisuje zabranu uzimanja dopinga i obvezu dopuštanja kontrole, a članak 113. propisuje postupke i obveze kad se utvrdi uzimanje nedopuštenih sredstava. Člankom 114. uređena su pitanja doping kontrole životinja (konja) koje sudjeluju u sportskim natjecanjima i obveze klubova, organizatora i sportaša. Člankom 115. formira se povjerenstvo za borbu protiv dopinga u sportu kao stručno savjetodavno tijelo Vlade Republike Hrvatske. Povjerenstvo sustavno prati i koordinira akcije u borbi protiv dopinga i predlaže mjere za sprečavanje dopinga. Sportski objekti uređuju se odredbama glave IX. (članci 116. do 128.). Člankom 116. propisano je što se smatra, u smislu ovoga Zakona, sportskim objektom te da u slučaju sumnje to određuje ministar nadležan za poslove sporta. Člankom 117. propisano je da je za prostorne planove, mreža sportskih objekata obvezna stručna podloga. Mrežu sportskih objekata donose nadležna tijela jedinica lokalne i područne (regionalne) samouprave. Prostorne uvjete, standarde i normative za izradu mreže sportskih objekata utvrđuje ministar nadležan za poslove sporta uz prethodno mišljenje ministra zaštite okoliša i prostornog uređenja (članak 117. stavak 5.). Člankom 118. propisuje se da Hrvatski sabor u okviru Nacionalnog programa sporta uređuje program izgradnje kapitalnih sportskih objekata nacionalnog značaja za daljnji razvoj sporta, da se radi izjednačavanja standarda planiraju u pravilu višenamjenski sportski objekti u svakoj županiji i u Gradu Zagrebu čime se stvaraju uvjeti razvoja sporta u cijeloj Hrvatskoj. Člankom 119. propisuje se da ministar nadležan za poslove sporta propisuje obvezne postupke i sudionike pri izradi programa za projektiranje i izgradnju sportskih objekata (stavak 1.), a uz prethodno mišljenje ministra zaštite okoliša i prostornog uređenja propisuje temeljne zahvate za projektiranje, gradnju i opremanje sportskih objekata (stavak 2.). Također se propisuje da je za izdavanje građevinske dozvole investitor iz javnog sektora, čija je građevinska vrijednost veća od 1.000.000,00 kuna, dužan priložiti suglasnost ministarstva nadležnog za poslove sporta o usklađenosti postupka i glavnog projekta s propisanim uvjetima (stavak 3.). Člankom 120. ministar nadležan za poslove sporta pravilnikom propisuje posebne uvjete koji se odnose na sigurnost korisnika i posjetitelja uređenih skijališta i kupališta. Člankom 121. uređena su sva pitanja uklanjanja, građevinske prenamjene i prenamjene u nesportske svrhe javnih sportskih objekata (uvjeti, suglasnosti tijela, mišljenja sportskih zajednica i dr.). Pri navedenome propisana je obveza izgradnje odgovarajućeg zamjenskog sportskog objekta. Člankom 122. propisano je da je Hrvatski olimpijski centar «Bjelolasica» sportski objekt od interesa za državu. Propisano je kako se interes države i interes sporta ostvaruje (članak 122. stavak 2.) te da se Nacionalnim programom sporta mogu utvrditi i drugi sportski objekti od interesa za državu (članak 122. stavak 1.). Člankom 123. propisano je da u upravljanju sportskim objektima u javnom vlasništvu sudjeluju uz vlasnike i sportske zajednice. Na javnim sportskim objektima cijena komunalnih usluga i energenata formira se kao i za odgojno obrazovne ustanove (članak 124.) 62 Člankom 125. ograničava se mogućnost prenamjene javnog sportskog objekta u neku", "1.). Člankom 123. propisano je da u upravljanju sportskim objektima u javnom vlasništvu sudjeluju uz vlasnike i sportske zajednice. Na javnim sportskim objektima cijena komunalnih usluga i energenata formira se kao i za odgojno obrazovne ustanove (članak 124.) 62 Člankom 125. ograničava se mogućnost prenamjene javnog sportskog objekta u neku drugu svrhu koja nije sportska djelatnost, samo temeljem uvažavanja planskih dokumenata prostornog uređenja i odredbama ovoga Zakona. Člankom 126. uređeno je da se na sportskim objektima stečenim na temelju Zakona o sportu i drugim javnim sportskim objektima pri prijenosu vlasništva moraju uzeti u obzir mjerila predviđena ovim Zakonom. Članak 127. propisuje da se za promjenu vlasničkoga pravnog statusa javnoga sportskog objekta ili njegovu funkcionalnu reorganizaciju izrađuje elaborat o opravdanosti promjene, a Ministarstvo nadležno za poslove sporta daje suglasnost na elaborat. Člankom 128. uređen je zakup na sportskim objektima stečenim na temelju Zakona o športu. Ugrađene su mjere da se sportski objekti koriste za sportske namjene, kontrola zakupa i nadzora namjenskog korištenja sportskih objekata. Pri dodjeli koncesija za ove sportske objekte prednost u dobivanju koncesije imaju sportski klubovi koji su se sportskim objektima koristili. Ministarstvo ima pravo provjere ugovora o zakupu, u skladu s ovim Zakonom. Financiranje sporta uređuje se odredbama glave X. (članci 129. do 132.). Osnovu financiranja u sportu čine sredstva ostvarena vlastitom sportskom djelatnošću, sredstva od članarina, donacija, pružanja usluga na tržištu, sredstva proračuna te drugih izvora u skladu sa zakonom. Sport se financira i iz igara na sreću i nagradnih igara, što je i općeprihvaćeni način financiranja sporta u Europi, a financiranje razvoja sporta i sportskih djelatnosti stimulirat će se posebnim gospodarskim mjerama (članak 129.). Također je propisano da se programi javnih potreba u sportu financiraju iz proračuna na svim razinama (članak 130.). Navedene su aktivnosti, poslovi, djelatnosti i programi za koje se sredstva osiguravaju u državnom proračunu (članak 131.). Određen je postupak od predlaganja do donošenja programa financiranja sporta u proračunu te nadležnosti, raspolaganje i izvješćivanje. Člankom 132. određeno je za koje se javne potrebe u sportu osiguravaju sredstva iz proračuna jedinica lokalne i područne (regionalne) samouprave odnosno općina, gradova, županija i Grada Zagreba te način podnošenja zahtjeva, raspolaganje sredstvima i izvještavanje. Sportske zaklade i sportske fundacije uređene su glavom XI. (članak 133.) kao pravni oblici koji daju mogućnost unapređenja sporta ili neke općekorisne sportske svrhe. Naveden je pravni temelj za njihovo osnivanje. Nacionalni program sporta uređen je glavom XII. (članak 134.). Cilj mu je ostvarenje dugoročnih interesa Republike Hrvatske u području sporta s bitnom razvojnom funkcijom u desetogodišnjem razdoblju. Propisano je što sve obuhvaća, koje su mu zadaće, tko ga donosi, koji će biti nositelji provedbe programa i zadaća, izvori financiranja i drugo. Uz funkciju razvoja sporta ima i pokretačke funkcije razvoja i za ostale djelatnosti i za čitavo područje države. Evidencije i informacijski sustav u sportu uređuje se glavom XIII. (članci 135. i 136.). Člankom 135. propisano je uspostavljanje evidencije u sportu. Ustroj, vrste i druga pitanja evidencija podzakonskim aktom propisuje ministar nadležan za poslove sporta. Člankom 136. definirane su bitne zadaće informacijskog sustava", "djelatnosti i za čitavo područje države. Evidencije i informacijski sustav u sportu uređuje se glavom XIII. (članci 135. i 136.). Člankom 135. propisano je uspostavljanje evidencije u sportu. Ustroj, vrste i druga pitanja evidencija podzakonskim aktom propisuje ministar nadležan za poslove sporta. Člankom 136. definirane su bitne zadaće informacijskog sustava u sportu. Informacijski sustav u sportu uspostavlja ministarstvo nadležno za poslove sporta i Hrvatski olimpijski odbor, u sklopu svoga djelokruga i zadaća. Upravni, inspekcijski i stručni nadzor uređuju se glavom XIV. (članci 137. do 141.). 63 Upravni nadzor nad provedbom ovoga Zakona i propisa donesenih na temelju njega, prema članku 137. stavku 1. i 2. provodi ministarstvo nadležno za poslove sporta kao i nad radom ureda državne uprave nadležnim za poslove sporta u županijama i Gradu Zagrebu. Inspekcijski nadzor uređen je člancima 138. i 139. i provodi se nad pravnim i fizičkim osobama koje obavljaju sportske djelatnosti. Obavljaju ga u prvom stupnju uredi državne uprave u jedinicama područne (regionalne) samouprave (članak 138. stavak 2.). Ministarstvo nadležno za poslove sporta provodi inspekcijski nadzor nad radom javnih ustanova za obavljanje sportskih djelatnosti, nacionalnih sportskih saveza i Hrvatskoga olimpijskog odbora. Propisano je što se utvrđuje provedbom inspekcijskog nadzora (članak 139.). Nadzor nad stručnim radom u sportu uređuje se člankom 140. Provodi se nad svima koji obavljaju stručne poslove u sportu u smislu ovoga Zakona te se određuje da će ministar nadležan za poslove sporta pravilnikom urediti pitanja u vezi s ovim nadzorom. Člankom 141. propisana je obveza tijelima koja vode registre pravnih i fizičkih osoba da o svakom upisu, promjeni i brisanju iz registra osoba koje imaju registrirano obavljanje sportske djelatnosti obavještavaju Ministarstvo nadležno za poslove sporta, dakle da dostavljaju odgovarajuće akte. Pitanja u vezi s Državnom nagradom sporta «Franjo Bučar» uređuju se u glavi XV. (članci 142. do 146.). Ova nagrada je najviše priznanje što ga Republika Hrvatska dodjeljuje za vrhunska dostignuća i doprinos razvoju sporta u Republici Hrvatskoj. Kaznene odredbe su uređene glavom XVI. (Članci 147. do 158.). Propisano je što se smatra prekršajem i određene su visine kazni za prekršaje pravnim, fizičkim i odgovornim osobama. Prijelazne i završne odredbe su u glavi XVII. (članci 159. do 169.) Člankom 159. određeni su nositelji i rokovi za donošenje Nacionalnog programa sporta. Člankom 160. određeni su ministru nadležnom za poslove sporta i drugim ministrima rokovi u kojima su dužni donijeti podzakonske propise. Člankom 161. određeni su rokovi Hrvatskom olimpijskom odboru, nacionalnim sportskim savezima, Hrvatskom športskom savezu invalida i drugim sportskim savezima i sportskim zajednicama u kojima su dužni donijeti odnosno uskladiti pravila i druge akte i provesti odredbe u cilju provedbe ovoga Zakona. Člankom 162. određeni su rokovi školama i osnivačima školskih sportskih saveza za provedbu odredbi iz ovoga Zakona. Člankom 163. dani su rokovi amaterskim sportskim klubovima i svim udrugama iz sustava sporta iz ovoga Zakona za usklađivanje svojih statuta i odre]enih opcih s ovim Zakonom. Člankom 164. dan je rok amaterskim sportskim klubovima koji imaju uvjete za promjenu statusa u profesionalne klubove za promjenu statusa. Člankom 165. dan je rok od", "su rokovi amaterskim sportskim klubovima i svim udrugama iz sustava sporta iz ovoga Zakona za usklađivanje svojih statuta i odre]enih opcih s ovim Zakonom. Člankom 164. dan je rok amaterskim sportskim klubovima koji imaju uvjete za promjenu statusa u profesionalne klubove za promjenu statusa. Člankom 165. dan je rok od tri godine fizičkim osobama koje su temeljem statusa vrhunskih sportaša samostalnim radom obavljali djelatnosti sportske rekreacije, obuke i stručnih poslova u sportu da steknu odgovarajuću stručnu spremu ili stručnu osposobljenost za obavljanje tih poslova. Člankom 166. propisano je da se primjenjuju dosadašnji podzakonski propisi dok se ne donesu novi, na temelju ovoga Zakona. IV. SREDSTVA POTREBNA ZA PROVEDBU ZAKONA 64 U ocjeni potrebnih sredstava iz državnog proračuna polazi se od toga da će Zakon biti usvojen u 2003. godini i da će se početi primjenjivati tijekom ove godine. S obzirom da za kapitalnu izgradnju sportskih objekata još uvijek nisu osigurana sredstva iz dijela prihoda od igara na sreću, za provedbu ovoga Zakona i Nacionalnog programa sporta u državnom proračunu za 2004. godinu biti će potrebno osigurati dodatnih 50.000.000,00 kuna. V. RAZLIKE IZMEĐU RJEŠENJA KOJA SE PREDLAŽU KONAČNIM PRIJEDLOGOM ZAKONA U ODNOSU NA RJEŠENJA IZ PRIJEDLOGA ZAKONA Posebna pozornost posvećena je primjedbama saborskih odbora i klubova stranaka koje su se odnosile na potrebu poboljšanja financiranja sporta i traženja da se predlože konkretna rješenja u Konačnom prijedlogu zakona. Zbog toga navodimo stavove saborskih odbora i klubova zastupnika kako slijedi. Odbor za obitelj, mladež i šport smatra da Vlada treba još jednom dobro promisliti i ponuditi porezne olakšice koje bi motivirajuće djelovale na potencijalne sponzore. Ukazano je da je nekada sport imao isti status kao kultura i da bi trebalo razmotriti mogućnost vraćanja tog statusa. Potrebno je tretiranje sporta u poreznom sustavu kao i kulture, što on svakako zaslužuje, te da su porezne olakšice bolji način pronalaženja sredstava za ulaganje u razvoj športa. Odbor za obrazovanje, znanost i kulturu navodi da se dio proračuna mora namijeniti sportu s napomenom da sve jedinice lokalne samouprave moraju u svojim proračunima predvidjeti sredstva za tu namjenu. Odbor za rad, socijalnu politiku i zdravstvo navodi da je izdvajanje za sport od igara na sreću nedostatno te da bi trebalo povećati sredstva za financiranje sporta osoba s invaliditetom. Odbor za turizam navodi da bi trebalo poticati izgradnju sportskih objekata koji bi bili, kako u funkciji raznovrsnosti turističke ponude, tako i zadovoljavanju potreba svih građana odnosnih područja, te omogućiti da ulaganja u sportske objekte idu iz troškova poslovanja investitora, a ne isključivo iz dobiti tih društava ili eventualnih kreditnih sredstava. Klub zastupnika Hrvatskog bloka (Krunoslav Gašparić) ukazuje da porezni sustav praktički ne priznaje šport u neki poseban sustav, dapače da ima pokušaja da se šport svrsta u kategoriju društvenih djelatnosti i aktivnosti na koje se gleda s podozrenjem, odnosno čak na sivu zonu pogodnu za pranje novca. U osiromašenom gospodarstvu teško se može očekivati da bi se šport mogao financirati samo iz vlastitih izvora zasnovanih na donacijama, članarinama i marketingu. U ovakvoj situaciji spas za šport je stimulirati ulaganje", "djelatnosti i aktivnosti na koje se gleda s podozrenjem, odnosno čak na sivu zonu pogodnu za pranje novca. U osiromašenom gospodarstvu teško se može očekivati da bi se šport mogao financirati samo iz vlastitih izvora zasnovanih na donacijama, članarinama i marketingu. U ovakvoj situaciji spas za šport je stimulirati ulaganje kroz porezne olakšice, a o čemu ovaj prijedlog zakona nažalost ne govori ništa konkretno. Država bi morala financirati svakako obrazovanje, osposobljavanje i onu usku specijalizaciju, ona bi dakle morala ići ka obrazovanju stručno-sportskih radnika, ona mora preuzeti gradnju sportskih objekata, financiranje globalnih natjecanja vrhunskih sportaša itd. Postavljena su pitanja glede financiranja sporta i dat je odgovor. Nudi li predlagatelj Zakona poboljšanje? Nude li se poreske olakšice koje bi motivirale potencijalne sponzore? Nudi li se status športu sličan ili istovjetan onom kakav ima kultura? Ne. Klub zastupnika SDP (Branislav Tušek) navodi da je neizbježno pitanje povećanje sredstava za financiranje sporta. Nismo sigurni da zakon definira i rješava to pitanje. Klub zastupnika HSLS-a (Mario Kovač) ukazuje da treba postaviti pitanje koliko Hrvatska država izdvaja za šport. Hrvatska od 2000. godine u proračunu za šport izdvaja sve manje sredstava. Godinama se planski ne izdvaja niti jedna kuna za potrebnu izgradnju športskih objekata. Po izdvajanjima iz bruto društvenog proizvoda na samom smo dnu europske ljestvice 65 jer izdvajamo samo 0,3% BDP-a za šport, za razliku od niza tranzicijskih zemalja koje izdvajaju 0,6% BDP-a ili više. Jednako tako je i s izdvajanjima za sport od igara na sreću. Klub zastupnika HSS (Dr. Miroslav Furdek) navodi da je najbitnije iznalaženje kvalitetnijih izvora financiranja sporta je će inače sva ova kvalitetna zakonska rješenja biti samo mrtvo slovo na papiru. Klub misli da se treba povećati udio iz dobiti igara na sreću, da se trebaju uvesti porezne olakšice potencijalnim sponzorima i naravno ne zadnje ali vrlo bitno, treba se povećati izdvajanje iz državnog proračuna. Također da bi trebalo osigurati sportu isti status kao i kulturi. Klub zastupnika LIBRA-e (Dr. sc. Zrinjka Glovacki-Bernardi) smatra da prva saborska zadaća, koja proizlazi iz sustavnog bavljenja ovom problematikom, jest da sport u narednom proračunu dobije drukčiji status i drukčije mjesto nego što ga je imao do sada u proračunima. Isto tako očekujemo prijedloge na koji način se financiranje sporta može poduprijeti iz drugih izvora, dakle donacijama, iz sredstava Lutrije Hrvatske i slično. Navode da Hrvatska ima pojedinačne i ekipne velike sportske uspjehe, ali i da je činjenica da Hrvatska u proračunu za sport izdvaja nedopustivo malo. Klub zastupnika HDZ-a (Mr. Zlatko Mateša) ukazuje da hrvatski sport nema krize rezultata, ali ima krizu financiranja organizacije. Zabrinjavajuće je da u okviru vlastitog ministarstva šport sudjeluje sa svega 1% proračuna tog ministarstva. Financiranje ovisi o Hrvatskom saboru i da zastupnici ne trebaju nikome slati poruke, već da se to moramo riješiti u Hrvatskom saboru. Sredstvima prikupljenim od uplata igara na sreću sve će udruge iz ovog izvora dobiti na neki način u postotku puno više nego šport. Zbroj svih udruga u Hrvatskoj, zbroj svih njihovih aktivnosti i zbroj svih njihovih članova nije ni približan broju", "već da se to moramo riješiti u Hrvatskom saboru. Sredstvima prikupljenim od uplata igara na sreću sve će udruge iz ovog izvora dobiti na neki način u postotku puno više nego šport. Zbroj svih udruga u Hrvatskoj, zbroj svih njihovih aktivnosti i zbroj svih njihovih članova nije ni približan broju ljudi koji se u Hrvatskoj bave športom. Šport je po broju sudionika glavna djelatnost uz svakodnevni rad kojim se neko u ovoj zemlji bavi. U pogledu donacija sport treba ima isti status kao kultura. Klub zastupnika HSP HKDU (Mr. sc. Miroslav Rožić) navodi da je financiranje športa zapravo najveći problem ovoga Zakona i ono što je najvažnije za riješiti, jer ako se riješi financiranje sve drugo riješit će se puno lakše. Postići ćemo puno lakše konsenzus oko ostalih stvari. Šport bi trebao imati isti status kao i kultura. Bez obzira na navedeno, a vezano za financiranje sporta kroz poreske olakšice i druge mjere, mora se navesti da nije moguće ta pitanja sustavno riješiti ovim Zakonom, već će se to rješavati zakonima i drugim propisima koji uređuju područje poreza, carina i druga financijska pitanja. Navodimo nove i izmijenjene odredbe koje su posljedica stavova saborskih odbora, stajališta stranačkih klubova i diskusija zastupnika iznesenih tijekom rasprave (prvog čitanja) u Hrvatskom saboru te mišljenja i prijedloga pojedinih ministarstva i ureda, kao i zaključaka na koordinacijama. - U sustav sporta uvrštena su visoka učilišta za školovanje kadrova u sportu (čl. 7.); - Zbog mogućeg sukoba interesa unesene su odredbe o vlasnicima kladionica i menadžerima sportaša kojima se ograničava sudjelovanje u tijelima upravljanja i zastupanju u sportskim klubovima i savezima (čl. 9.); - Iz istog razloga osobama koje neposredno mogu utjecati na uvjete, sustav i regularnost je ograničenje tj. sportskim sucima, delegatima natjecanja sudjelovanja u skupštinama i izvršnim tijelima sportskih saveza (čl. 18.); i povjerenicima propisano - Unesena je odredba kojom se po prvi puta u jednom zakonu o sportu spominju udruge navijača, kao oblik udruživanja građana u sustavu sporta (čl. 14.); - Dana je mogućnost osnivanja međužupanjiskih sportskih saveza ako ne postoje uvjeti za osnivanje županijskih sportskih saveza (čl. 16.); - Propisano je da se studentski sport može financirati i iz proračuna jedinica područne (regionalne) samouprave (čl. 21.); 66 - Temeljem zaključaka saborskih odbora i usuglašenih prijedloga sportskih udruženja (saveza) osoba s invaliditetom unesene su odredbe kojima su stavljene u ravnopravan položaj sve vrste osoba s invaliditetom i svi nacionalni sportski savezi osoba s invaliditetom. Uz Hrvatski paraolimpijski odbor kao autonomni savezi uvršteni su Hrvatski sportski savez gluhih i Specijalna olimpijada. - U djelokrug Hrvatskog olimpijskog odbora unesene su odredbe o osiguravanju kadrovskih i materijalnih uvjeta i organiziranju istraživačko-razvojnog rada u sportu. Hrvatskom olimpijskom odboru dana je ovlast da daje mišljenja je li neka aktivnost sport, a radi učestalih pojava novih sportova odnosno aktivnosti za koje se zahtjeva status sporta (čl. 26.); - Hrvatskom olimpijskom odboru dano je ovlaštenje izdavanja javnih isprava – rješenja o kategorizaciji vrhunskih sportaša na temelju općeg akta o kategorizaciji vrhunskih sportaša te je propisano za koje kategorije se obveze i", "sport, a radi učestalih pojava novih sportova odnosno aktivnosti za koje se zahtjeva status sporta (čl. 26.); - Hrvatskom olimpijskom odboru dano je ovlaštenje izdavanja javnih isprava – rješenja o kategorizaciji vrhunskih sportaša na temelju općeg akta o kategorizaciji vrhunskih sportaša te je propisano za koje kategorije se obveze i prava odnose (čl. 42.); - Vrhunskim sportašima i osobama koje imaju odgovarajuću stručnu spremu ili su stručno osposobljene za stručne poslove u sportu otvorena je mogućnost služenja vojnog roka ili civilne službe po posebnim uvjetima, koje pravilnicima uređuju ministar obrane, ministar rada i socijalne skrbi i ministar nadležan za poslove sporta (čl. 46.); - Propisano je da se status sportskih sudaca, delegata, povjerenika i drugih osoba u funkciji sporta stječe na temelju općih akata nacionalnih sportskih saveza (čl. 48.); - Definiran je status dragovoljaca u sportu te određeno koja prava imaju za vrijeme dragovoljnog rada (čl. 49.); - Definiran je status menadžera sportaša i njihovih ugovora sa sportašima u sustavu sporta Hrvatske, te prava i ovlasti nacionalnih sportskih saveza, obveze menadžera sportaša i sportaša (čl. 50.); - Zbog izričitog zahtjeva Hrvatskog nogometnog saveza utemeljenog na pravilima UEF-e u Konačnom prijedlogu zakona nije predviđena mogućnost podjele dobiti dioničarima profesionalnog kluba, već se ona u cijelosti mora upotrijebiti za razvoj djelatnosti kluba (članak 84.); - U cilju sprečavanja nereda za vrijeme natjecanja u članku 107. preciznije su definirane nedopuštene radnje na sportskim objektima; - Uređena su pitanja u vezi s doping kontrolom životinja (konja) koje sudjeluju u sportskim natjecanjima kao i obveze klubova i organizatora (čl. 114.); - Utemeljeno je Povjerenstvo za borbu protiv dopinga u sportu kao stručno savjetodavno tijelo Vlade Republike Hrvatske. Propisan je izbor i broj članova. Povjerenstvo sustavno prati i koordinira akcije u borbi protiv dopinga i predlaže mjere za sprečavanje uzimanja dopinga (čl. 115.); - Sportski objekti od osobitog interesa za Republiku Hrvatsku mogu se utvrditi i nacionalnim programom sporta (čl. 122.); - Unesene su odredbe o sportskim zakladama i fundacijama jer se putem njih daje mogućnost unapređenja sporta kao općekorisne djelatnosti i ostvarenje općekorisnih sportskih svrha. Kroz zaklade i fundacije posebno se otvara mogućnost inozemnih i domaćih donacija (članak 133.). - Subjekti koji izvršavaju nacionalni program sporta ministarstvu nadležnom za poslove sporta dostavljaju izvješća o izvršenju utvrđenih obveza i provedbi programskih zadaća (članak 134.). - U prelaznim i završnim odredbama propisano je da amaterski sportski klubovi koji imaju uvjete za promjenu statusa u profesionalne klubove taj postupak trebaju dovršiti u roku od godinu dana od dana stupanja Zakona na snagu (članak 164.).. VI. PRIJEDLOZI I MIŠLJENJA NA PRIJEDLOG ZAKONA 67 KOJE PREDLAGATELJ NIJE PRIHVATIO S obzirom da su sportske zajednice važan čimbenik cjelokupnog sustava sporta, nisu se mogla prihvatiti stajališta Odbora za obrazovanje, znanost i kulturu prema kojima bi ulogu zajednica u velikom dijelu trebala preuzeti tijela državne uprave nadležna za sport. Ovim se Zakonom gotovo u detalje propisuje metodologija predlaganja, usvajanja, financiranja, realizacije i kontrola izvršenja programa javnih potreba, a pobrojani su i poslovi kao i subjekti koji će te poslove obavljati (članci: 19, 20,", "prema kojima bi ulogu zajednica u velikom dijelu trebala preuzeti tijela državne uprave nadležna za sport. Ovim se Zakonom gotovo u detalje propisuje metodologija predlaganja, usvajanja, financiranja, realizacije i kontrola izvršenja programa javnih potreba, a pobrojani su i poslovi kao i subjekti koji će te poslove obavljati (članci: 19, 20, 131, 132, 137 i 138). Prema tim odredbama sportske zajednice postaju stručni «servis» cjelokupnog sporta na području na kojem djeluju. One tako objedinjuju, izrađuju i zajednički program sporta predlažu poglavarstvu i skupštini na usvajanje, kontroliraju svoje članice u svezi s realizacijom usvojenog programa, izrađuju kriterije za vrednovanje programa javnih potreba u sportu, poglavarstvima redovito podnose izvješća o realizaciji odobrenih programa, a posve iz praktičnih razloga najčešće su i financijski servis cjelokupnog sustava sporta na svojem području, itd. S druge strane, još značajnija postaje uloga ureda državne uprave u županijama i gradu Zagrebu u svezi s upravnim i inspekcijski nadzorom u okviru kojeg je i nadzor nad kontrolom realizacije programa u sportskim zajednicama, što u proteklom razdoblju u pravilu nije činjeno. Upravo ovakva podjela uloga jamči kompetentnost, stručnost i transparentnost djelovanja svih čimbenika i poslova u svezi realizacije programa javnih potreba sporta u županijama, gradovima i gradu Zagrebu. I uz sve sociološko-kulturne, odgojne, zdravstvene i druge vrijednosti, prijedlog Odbora za obitelj, mladež i sport o stalnoj zabrani točenja alkoholnih pića na stadionima, sportskim dvoranama i drugim sportskim objektima na kojima se svaki dan trenira i igra, nažalost nije moguće prihvatiti zbog mnogih razloga. Zalažemo se za dosljedno provođenje propisa o zabrani točenja alkohola maloljetnim osobama, čime se djelomično postiže očekivana svrha ovog vrijednog, ali za sada neprovedivog prijedloga. Nije prihvaćen prijedlog Odbora za obitelj, mladež i šport da se u članku 3. briše odredba stavka 2. kao nepotrebna, jer Ustav Republike Hrvatske u članku 14. jamči ravnopravnost ljudi bez obzira na rasu, boju kože, spol, vjeru, nacionalnost, političko ili drugo uvjerenje. Ova odredba sastavni je dio i međunarodnih konvencija iz područja sporta, a sport kao specifična ljudska djelatnost, koju uređuje ovaj Zakon, još se jednom nedvosmisleno i izrijekom opredjeljuje i izjašnjava da je dostupan svima. Nije bilo moguće prihvatiti primjedbu Odbora za obitelj, mladež i šport da djelovanje školskih sportskih klubova ne treba propisivati ministar nadležan za poslove sporta. Nije apsurdno da ministar nadležan za poslove prosvjete i sporta propisuje rad školskih sportskih klubova, upravo suprotno - apsurdno bi bilo kada rad i djelovanje školskih sportskih klubova ne bi propisivao nadležni ministar. Svjesni da je jedan od temeljnih postulata tržišnoga gospodarstva upravo raspodjela dobiti, ipak nije bilo moguće prihvatiti primjedbu da se profesionalnim sportskim klubovima ne može ograničavati raspodjela dobiti dioničarima. Profesionalni sportski klubovi u svakom su slučaju specifična sportska dioničarska društva i kao takva imaju neke posebnosti u odnosu na ostala trgovačka društva. Jedna od tih posebnosti je i ograničenje u smislu raspolaganja s ostvarenom dobiti, tako da se ona u cjelini mora utrošiti u razvoj kluba, što je zahtjev europskih sportskih asocijacija i nacionalnih sportskih saveza u sklopu kojih će i djelovati profesionalni klubovi, a takva je praksa već", "ostala trgovačka društva. Jedna od tih posebnosti je i ograničenje u smislu raspolaganja s ostvarenom dobiti, tako da se ona u cjelini mora utrošiti u razvoj kluba, što je zahtjev europskih sportskih asocijacija i nacionalnih sportskih saveza u sklopu kojih će i djelovati profesionalni klubovi, a takva je praksa već godinama prisutna u gotovo svim europskim profesionalnim nogometnim klubovima. O pitanju davanja suglasnosti na organizaciju velikih sportskih priredbi u Hrvatskoj, smatramo da je dovoljna suglasnost Vlade Republike Hrvatske, ali bilo bi vrlo korisno kada bi nadležni saborski odbor, odnosno Hrvatski sabor održao tematsku raspravu i zauzeo stajalište o ovim pitanjima, jer je očit veliki interes za održavanje velikih svjetskih i europskih sportskih priredbi u Republici Hrvatskoj, za koje se kandidature često olako nude i prihvaćaju, a onda se 68 naknadno razmišlja o osiguravanju potrebnih dodatnih (proračunskih) sredstava, kojih naravno pod tim uvjetima nema. U odnosu na primjedbu zastupnika da o broju igrača profesionalaca u amaterskom klubu treba odlučiti nacionalni sportski savez, smatramo da to ne treba u potpunosti prepustiti nacionalnim sportskim savezima, jer bi bilo neprimjereno da u amaterskom klubu, primjerice, igra više od 50% profesionalaca, što se na novi način vrlo precizno rješava člankom 12. ovoga prijedloga Zakona. Ostala pitanja sustava natjecanja u kojem će zajedno nastupati profesionalni i amaterski sportski klubovi te pod kojim uvjetima, regulirat će nacionalni sportski savezi svojim aktima. U odnosu na prijedlog da bi Zakonom trebalo propisati optimalne sportske pripreme za olimpijske igre i slično, smatramo da je pitanje optimalnih priprema sportaša za pojedino natjecanje čisto stručno pitanje. To će se definirati kriterijima o vrednovanju pojedinog dijela javnih potreba u sportu i to zajednički pojedini nacionalni sportski savezi i Hrvatski olimpijski odbor. Činjenica je da se ovim prijedlogom Zakona kao i dosadašnjim Zakonom jedino HOC «Bjelolasica» proglašava kao sportski objekt od posebnog interesa za državu i to pretežno zbog toga što je riječ o jedinom trgovačkom društvu u sportu koje je u vlasništvu Republike Hrvatske. Bilo je nekoliko prijedloga da se tu svrstaju još neki objekti. O tome spadaju li još neki sportski objekti u tu kategoriju, odlučit će Hrvatski sabor u postupku donošenja Nacionalnog programa sporta. Na primjedbu da Prijedlog Zakona nije odgovorio na pitanje što financira država, odnosno koje programe, a koje lokalna i područna samouprava, smatramo da se baš ovim prijedlogom Zakona u detalje člancima 131. i 132. definira koji su to programi javnih potreba koji se financiraju na lokalnoj odnosno državnoj razini. Osim toga ni u kom slučaju se ne bi smjeli financirati programi javnih programa u sportu raspisivanjem natječaja, jer bi to ugrozilo cjelokupnu sportsku djelatnost, koja u klubovima djeluje u višegodišnjem kontinuitetu, slično kao škole u sustavu obrazovanja. Nije se mogla prihvatiti primjedba da strane pravne i fizičke osobe ne bi smjele imati mogućnost obavljanja sportskih djelatnosti u Hrvatskoj jer bi to bilo u suprotnosti sa zakonodavstvom Republike Hrvatske i postojećom praksom koja proizlazi iz našeg Ustava i zakona. Na prijedlog da se redovita zdravstvena zaštita sportaša, koja osobito pada na teret roditelja djece sportaša, ovim Zakonom riješi", "osobe ne bi smjele imati mogućnost obavljanja sportskih djelatnosti u Hrvatskoj jer bi to bilo u suprotnosti sa zakonodavstvom Republike Hrvatske i postojećom praksom koja proizlazi iz našeg Ustava i zakona. Na prijedlog da se redovita zdravstvena zaštita sportaša, koja osobito pada na teret roditelja djece sportaša, ovim Zakonom riješi na drukčiji način, odgovaramo da je zdravstvena zaštita sportaša također dio javnih potreba sporta, te da se obvezni zdravstveni pregledi sportaša sufinanciraju sredstvima proračuna jedinica lokalne i područne (regionalne) samouprave u mjeri u kojoj je to moguće, a u pravilu se uvodi i participacija samih sportaša. S obzirom na ograničena proračunska sredstva, ne može se očekivati da se zdravstveni pregledi sportaša u potpunosti financiraju iz tog izvora i da se to ovim Zakonom utvrdi. Pod pojmom \"odgovarajuća edukacija iz sportske medicine\" smatra se da je imaju liječnici koji su završili specijalizaciju sportske medicine. Kada se govori o prijenosu vlasništva na sportskim objektima, ovaj se Zakon ne bavi načinom na koji će vlasnik otuđiti pojedini sportski objekt, hoće li to na primjer biti natječajem ili pak pogodbom, jer to i nije materija ovog Zakona, ali se zbog zaštite objekta u smislu neopravdanog uklanjanja ili neprihvatljive promjene namjene u neke druge svrhe propisuju vrlo precizne odredbe koje bi to u potpunosti trebale onemogućiti. Što se tiče sportskih objekata koji se nalaze na pomorskom dobru, smatramo da je radi zaštite njihove namjene kao i domicilnih sportskih klubova potrebno i ovim Zakonom predvidjeti njihov prioritet u odnosu na moguću dodjelu koncesije. U odnosu na primjedbu o mogućem sustavu natjecanja u kojem će zajedno nastupati sportaši profesionalci i amateri, ovaj Zakon samo načelno utvrđuje neka osnovna pravila, kao 69 primjerice u članku 12. gdje se kaže da za amaterski sportski klub može nastupati u istom trenutku najviše do 50% igrača profesionalaca. Ostala pravila sustava pojedinih natjecanja propisivat će svojim aktima nacionalni sportski savezi. U gotovo svim europskim zemljama postoje mješoviti sustavi natjecanja u kojima ravnopravno sudjeluju amaterski i profesionalni klubovi, te u jednom klubu igraju zajedno i amateri i profesionalci. Naravno, tamo gdje za to postoje određeni uvjeti postoje i čisto profesionalne lige. Kod nas će najvjerojatnije prevladati mješoviti sustav natjecanja i zbog toga se ta odluka prepušta svakom pojedinom nacionalnom sportskom savezu. Podržavamo prijedlog da se razmotri mogućnost zapošljavanja vrhunskih sportaša u javnim službama kao mogućnost za rješavanje njihovih osnovnih egzistencijalnih pitanja. U svakom slučaju to je jedna od mogućnosti za rješavanje tog statusnog pitanja vrhunskih sportaša. Smatramo, međutim, da je to pitanje više u domeni političkih odluka i dogovora nacionalnih sportskih saveza i Hrvatskog olimpijskog odbora s nadležnim tijelima vlasti i da to ne bi bilo moguće na zadovoljavajući način urediti ovim Zakonom. Nismo mogli prihvatiti primjedbu da bi u Zakon trebalo unijeti odredbe o ženskom sportu «jer … ženski sport jest diskriminiran kod nas». Ovaj Zakon ne dijeli sport na muški i ženski i ne diskriminira žene. Pravni položaj žena i muškaraca koji se bave sportom ili sportskim djelatnostima je ovim Zakonom izjednačen. Prema članku 3. stavku 2. \"Sport mora biti dostupan", "odredbe o ženskom sportu «jer … ženski sport jest diskriminiran kod nas». Ovaj Zakon ne dijeli sport na muški i ženski i ne diskriminira žene. Pravni položaj žena i muškaraca koji se bave sportom ili sportskim djelatnostima je ovim Zakonom izjednačen. Prema članku 3. stavku 2. \"Sport mora biti dostupan svima bez obzira na … spol…\", a člankom 38., u definiciji se navodi \"Sportašica i sportaš\", što je, koliko nam je znano, prvi put da se na ovaj način u nekom zakonu o sportu izjednačuju žene i muškarci. Izraženu \"dvojbu prema lokalnoj samoupravi i njezinoj obvezi da osigura financijske, prostorne i druge uvjete za bavljenje sportom djece i mladih\" i \"kako će to jedinice lokalne samouprave moći ostvariti, osobito one čije gospodarstvo je nedostatno, a proračun ne osigurava dovoljno novca\", ne možemo prihvatiti. Naime, jedinice lokalne i područne (regionalne) samouprave koje su na temelju zakona stekle taj status, moraju osiguravati sredstva u proračunima za funkcioniranje odnosno obavljanje poslova iz svoje nadležnosti i djelokruga, pa i za navedeno u ovom Zakonu glede sporta djece i mladeži. 70"]