"[\" \\n   \\nAzure Quick Start Guide  \\nfor .NET Developers  \\nAzure   \\n2  \\n4  Azure for .NET developers  \\n4  What can Azure do for you?  \\n7  Getting Started with Azure services  \\n7  Running your .NET applications in Azure  \\n7  Azure App Services  \\n8  There are several different types of App Service apps.  \\n9 Azure Functions  \\n10 Azure Logic Apps  \\n11  Azure Virtual Machines  \\n12  A word about microservices and containers  \\n13  Which frameworks and techno\", \"logies can you use in which Azure service?  \\n14  Storing your data in Azure  \\n15  Azure SQL Database  \\n16  Azure Cosmos DB  \\n17  Azure Storage  \\n18  Let\\u2019s explore the different types of Azure Storage:  \\n19  Azure Databases for MySQL, PostgreSQL, and MariaDB  \\n20 Azure SQL Data Warehouse and Azure Data Lake Store  \\n \\nContents   \\n3  \\n21  Securing your .NET applications in Azure  \\n21 Azure Active Directory  \\n22  Azure Key Vault  \\n22  Managed Service\", \" Identity  \\n23  Azure Advisor  \\n \\n23  Other Azure services  \\n23 Enhance your application with performance  \\n23  Machine Learning  \\n24  Internet of Things (IoT)  \\n24  Data Analytics  \\n25  Messaging  \\n25  Media Services  \\n25  Monito ring \\n27  Tools for developing, debugging and troubleshooting  \\n27  Visual Studio and Azure  \\n28  Cloud Explorer  \\n29  Publish to Azure  \\n31  Snapshot Debugger  \\n32  Azure Storage Explorer  \\n33  Azure Storage Emulator  \", \" \\n4 33  Azure Command -Line Interface  \\n35  Azure Functions Core Tools  \\n35  Cosmos DB Emulator  \\n36  Azure DevOps  for build and deployment  \\n39  Summary and how to get started for free  \\n39  Keep learning with an Azure free account  \\n40  About the team  \\n  \\n Azure Quick Start Guide for .NET Developers  5 Azure for .NET developers  \\nIf you are a .NET dev eloper or architect who wants to get started with Microsoft Azure, \\nthis book is for you! Wr\", \"itten by developers for developers in the .NET ecosystem, this \\nguide will show you how to get started with Azure and which services you can use to run \\nyour .NET appl ications and store your data in a more efficient and secure way.  \\nBefore we dive in, let\\u2019s take a moment to see what the cloud, and Microsoft Azure in \\nparticular, can do for you.  \\nWhat can Azure do for you?  \\nAzure provides services that can help you accompli sh many things. The\", \"se range from \\nthe mundane \\u2014such as adding search functionality to your application or spinning up \\na new SQL database to connect to your recent .NET app \\u2014to more exotic projects \\nsuch as implementing continuous integrati on (CI) and continuou s deployment (CD) \\nworkflows. You also can automatically tune your database or set up push notifications \\nto mobile devices, easily and quickly. These are just a few examples of some common \\nprojects that d\", \"evelopers have repeatedly had to  create for themselve s but that are \\nnow available as a service. And you can use these services with little effort \\u2014almost \\nlike flipping a light switch! You can then focus on the pieces of your application that \\nmake it unique \\u2014the features that provide real a dded value for your u sers.  \\nBesides services, Azure offers compute resources in the form of virtual machines (VMs), \\ncontainers, databases, web app serv\", \"ices, and mobile services. You can use these to host \\napplications or to provide a complete infrastructure  for your users, most  of which you \\ncan do through Visual Studio.  \\nThe power of the cloud is that services and resources are incredibly robust and resilient. \\nIt is very unlikely that they will fail to run, because the cloud is smart and self -healing. \\nWith A zure, there are datac enters all over the world, filled with tens of thousands o\", \"f \\nservers. If one server fails, another takes over. If an entire datacenter were to fail (a highly \\nunlikely scenario), another would take over. All this is possible because of t he massive \\nscale of t he cloud.  \\n  \\n Azure Quick Start Guide for .NET Developers  6 One of the most compelling arguments in favor of the cloud is that you can scale up \\nyour services and resources almost infinitely, with just a few clicks of a button. You can\\u2019t \\ndo th\", \"at with on -premises resources unless you\\u2019 re prepared to spend enormous sums of \\nmoney on capital equipment which would remain  largely idle and staff to administer it \\nall. You can scale globally  without having to build data centers around the world  by \\nputting your services anywhere in the world eliminating latency and  provid ing a high -\\nperformance experience to your users, regardless of where they are. It also means that \\nyou can keep yo\", \"ur data where you need it to be , observing data residency \\nrequirements .  \\nEqually important, when you use cloud resou rces, you can scale b ack your services and \\nresources when there is no longer high demand. This allows you to scale up and down \\neven during the course of a normal day keeping applications economical and \\nperformant.  \\nIn addition to massive scalability, off -the-shelf intelligent services, and pay -per-use \\nefficiency, the cl\", \"oud offers increased security. The cloud is used by millions of people, \\n24x7, worldwide. Of course, it  is also attacked by many people. Reputable and \\nexperienced cloud providers like Microsoft recognize the usage  patterns of normal users \\nand those of malicious actors. This means we know how to protect against both the \\nmost common and most unique attacks ou t there. Intelligent monitoring tools, machine \\nlearning algorithms, and artificial i\", \"ntelligence give cloud pro viders the ability to detect \\nattacks in real time and stop them in their tracks.  \\nDecades of experience in security  and massive -scale traffic, combined with top industry \\nsecurity expertise, make the cloud a much more secure environment than any on -\\npremises datacenter.  \\nMore info  \\nTo read more about how Azure secures your applications and data,  \\nread the official Azure  \\n  \\nSecurity blog  \\n,  \\nAzure Security Ov\", \"erview  \\n, \\n and \\n  \\nhow to get started with Azure Security  \\n. \\nWe\\u2019ve briefly explored reasons to begin your migration to the cloud and Microsoft Azure.  \\nNow, let\\u2019s examine which Azure services are useful  for you for running and secur ing your  \\napplications and storing your data.   \\n Azure Quick Start Guide for .NET Developers  7 Getting Started with Azure services  \\nLet\\u2019s explore some of the services that you can use for runnin g your applic\", \"ations in \\nAzure, storing your data in Azure, and securing your application with Azure.  \\nRunning your .NET applications in Azure  \\nOne of the first decisions that you need to make when you start with Azure is which \\nservice(s) to use to run your ap plications in Azure. There are many options. Let\\u2019s start by \\nlaying out which Azure services are most suitable for which application types in Table 1.  \\nTable 1:  Which Azure services are best suited \", \"for which types of applications?  \\nApp Service  \\nWeb Apps  App Service \\nMobile \\nApps Azure  \\nFunctions  Logic Apps  Virtual  \\nMachines  Azure \\nKubernetes   \\nService (AKS)  Container \\nInstances  \\nMonolithic \\nand N -Tier \\napplications      *   \\nMobile app \\nback  end     *   \\nMicroservice \\narchitecture -\\nbased  \\napplications         \\nBusiness pr ocess \\norchestrations \\nand workflows         \\n* For lifting and shifting existing applications to Azure .\", \" \\n  \\nAzure App Services  \\nOne of the easiest and most powerful ways to host your applications in Azure is in Azure \\nApp Service . Azure App Servic e is a group of services that takes care of hosting your \\napplication and abstracting away the complexities of the operating system and \\ninfrastructure. They are highly available by default and will stay up and running for at \\nleast 99.95%  of the time.   \\n Azure Quick Start Guide for .NET Developers  \", \"8 They share powerful features like automatic sca ling, zero -downtime deployments, and \\neasy authentication and authorization. They also allow you to debug your application \\nwhile it is running in production (with the Snapshot Debugger) and work very well with \\nApplication Insights, which you can use to moni tor every aspect of your app, from \\nperformance to usage.  \\nThere are several different types of App Service apps.  \\nAzure Web A pps \\nRunni\", \"ng a .NET web application in Azure is very easy in Azure Web Apps . Web Apps act \\nas a web server as a service, like IIS. And you can simply deploy your A SP.NET or \\nASP.NET Core application with Visual Studio to Web Apps and run it. These can be \\nwebsites, APIs, or any other HTTP -driven application  including Node.js, Python and Java  \\napplications .  \\nOnce your application runs in an App Service web app, you can scale it up or down , add \\neasy\", \" authentication , use deployment slots , enable continuous deployment , and use any \\nof the other App Service feature s. By default, your application is available on the \\ninternet, without you needing to set up a domain name or configure DNS settings, \\nalthough you can do that.  \\n \\nContainers on A pp Services  \\nDevelopers who want the power of App Services but nee d to maintain a higher level of \\ncontrol over their environments can also run conta\", \"iners .  Both Linux  and Windows \\ncontainers  are supported. You can deploy your own containers from the Azure \\nContainer Registry , a private Docker registry or public containers from the Docker Hub. \\nThis allows you to run  a wide range of pre -configured applications from WordPress to \\nRedis which can be deployed either as single containers or  as part of a multi -container \\napplication . Windows co ntainer support also helps you migrate exist\", \"ing ASP.NET apps \\nand WCF services that need access to the Windows OS, install custom components, or \\nuse the Global Assembly Cache ( GAC).  \\n  \\n Try it now  \\n -  \\nGet started by creating an ASP.NET Core  web app in Azure   \\n Azure Quick Start Guide for .NET Developers  9  \\nAzure Mobile Apps  \\nIf you are building mobile applications, you will need a back end that the mobile app \\nconnects to. Usually, this is some sort of API that your app can us \", \"e to retrieve and store \\ndata. Azure Mobile Apps  provides you with such a back end.  You can write it in C# or \\nuse any of the Quickstart applications.  \\n \\nA mobile back end that runs i n Azure Mobile Apps provides unique capabilities. For \\ninstance, you can use offline sync , which enables the mobile app to continue working \\nwhen there is no connection to the back end and sync change s once the connection is \\nrestored. And with push notificatio\", \"ns you can send notifications to the m obile apps \\nusing C# code, regardless of the platform it runs on (iOS, Android, Windows). In addition \\nto these unique features, Mobile Apps shares all the othe r features of Azure App Service.  \\n  \\n \\nAzure Functions (also known as serverless compute)  \\nAzure Function apps  enable you to create Azure Functions in C# and many other \\nlanguages in Visual Studio and other IDEs and editors. Each Functions app con\", \"tains one \\nor more Azure  Functions and provides integration with  authentication and deployment \\nslots.  \\nThe Azure Functions that run in Azure Function apps are small pieces of code t hat you \\nwrite, without you having to worry about the underlying infrastructure or about scaling.  \\nMany refer to this deployment model as Functions as a Service (FaaS).  \\nFunction applications can be simply triggered by a wide variety of events originating \\nboth \", \"inside and outside of Azure. HTTP triggers allow web requests to be served by a \\nfunction app. Event Grid  events can trigger Azure Functions when changes are made to \\nAzure resources such as the container registry and virtual machines.  \\n  \\n Get started by creating an Android app with an Azure mobile app back end  \\n.  \\n Azure Quick Start Guide for .NET Developers  10 Here is an example : You write an Azure Functions app that executes every time \", \"a new \\nimage file is uploaded to Azure Storage. You then take that image, rename it, and \\noutput i t to another Azure Storage account.  \\nThis is very easy to do. You just write the code to rename the image. Azure Functions \\ntakes care of getting the input image when the function is triggered . And it takes care of \\nwriting the image to the other storage account. It takes care of all the plumbing, and \\nyou just write the code.  \\nAzure Functions ev\", \"en handles scaling for you . So it doesn\\u2019t matter if there are 1 ,000 \\nimages that trigger the function at the same time. Azure Functions transparently spins up \\nmore functions to deal with it and they go away when the code is done executing. \\nBecause of this, you only pay for the code that you execute, not for a service t hat runs all \\nthe time, waiting to be triggered.  \\n \\nAzure Functions are great for executing small piec es of code that perfo\", \"rm one or two \\nsteps on an input and an output. If you want to perform more steps of a larger process, \\nyou can use Durable Function s. \\n \\nDurable Functions provide a stateful experience on top of a series of Azure Functions. \\nThey enable complex patterns such as scatter/gather and function chaining. A Durable \\nFunction orchestration may be as simple as coupling together two functions, one  after \\nanother, or as complex as coordinating tens of th\", \"ousands of function calls over weeks.  \\n \\nAzure Logic Apps  \\nDurable Functions are a fantastic orchestration tool for developers who are comfortable \\nwith writing every step of the process inside a series of Functions. For those looking for \\na lower code solution Logic Applications may be better.  With Azure Logic Apps, you can \\norchestrate a process just by weaving API calls together in a visual designer in Visual \\nStudio or the Azure portal. Vi\", \"sual Studio off ers a specific Logic Apps project temp late to \\nget started.  \\n  \\n Get started by creating your first Azure Function with Visual Studi o \\n. \\n   \\n Azure Quick Start Guide for .NET Developers  11 A logic app has a trigger, just like an Azure function does. This can be an outside trigger, \\nlike when a new blob is added, or a certain text is tweeted. Or it can be a manual trigger \\nor a trigger  on a schedule such as every 15 minute s.\", \"  \\nOnce triggered, a logic app takes its input and calls APIs with it to complete a process. \\nYou just click this together by choosing APIs from a large list of available ones and \\nchoosing the input and output for tho se APIs. Azure Functions can also be used for APIs \\nin a logic app. And you can use your own ASP.NET Core APIs.  \\n \\nJust like Azure functions, logic apps scale automatically, you just create the process. It will trigger as \\nmany ti\", \"mes as it is needed and alway s executes the complete process and has reliability features, like \\nretry policies, built in. And because it only runs when it is triggered, you only pay for when it runs \\u2014you \\ndon\\u2019t pay for owning it.  \\n \\nNote:  Azure Logic Apps and Azure Functions work very we ll with the  Azure Event Grid  service. Event Grid allows you to \\nsubscribe to events, like when something happens in your application, and to push that info\", \"rmation as an event that can \\ntrigger a Logic App or an Azure Function.  \\nAzure Virtual Machines  \\nA very different way of running your application is by taking advantage of Azure Virtual \\nMachines . This is an easy way to get started, because you can lift -and-shift existing \\napplications from virtual machines that you run in your datacenter to VMs that run in \\nAzure. There are many predefined VM images that you can use, like Windows Server \\n201\", \"9 that runs IIS and has ASP.NET installed and preconfigured on it. You ca n even \\nbring your own software licenses if you already have one (like for SQL Server).  \\n  \\n Get started by building your first logic app workflow in the Azure porta  \\nl \\n. \\n  \\nHere\\u2019s an   \\nexample  \\n: \\n  \\nA logic app gets triggered by a new blob that is written in  \\nAzure Blob storag e \\n. It takes  the  \\nBlob input, which is an image file, and resizes the image by calling\", \" an Azure function that  \\ndoes just that. Next, it takes the resized image and writes it to another storage account.  \\nAnd finally, it calls the    \\nOffice 365 AP I \\n  \\nto send an email to the administrator that there is a  \\nnew, res ized image available.  \\n   \\n Azure Quick Start Guide for .NET Developers  12 Running your application in a VM doesn\\u2019t provide you the features like zero-downtime \\ndeployments and easy authentication. You are also res\", \"ponsible for patching the \\noperating system and for making sure that antivirus software is up to date.   \\nOn the other hand, it does provide you with the ability to easily scale your VM to a \\nbigger size or automatically scale it down when it isn\\u2019t used that much. Virtual Machine \\nScale Sets  allow for scaling out VMs to a large number of nodes and load balancing \\nwork between them. And it offers you the reliability of running something in Azure.\", \" It is \\nvery unli kely that your VM will stop running, and Microsoft guarantees this uptime with \\na comprehensive SLA .  \\nAnd if you\\u2019re not ready to run your production VMs in Azure you can  still take \\nadvantage of streamlined DevOps and testing with Azure DevTest Labs.  \\n \\nA word about microservices and containers  \\nYou can run your applications in containers , which are very lightweight and start and \\nstop in seconds.  Containers isolate your \", \"application and its dependencies in  a way that \\nguarantees that you\\u2019ll never run into library version conflicts. They can be  based on \\nnumerous popular Linux distributions or Windows Server so no matter the platform you r \\napplication uses  it can run in a container.  \\nA popular approach for cont ainer s is to use them to run a microservices architecture . \\nThis means that you create many small , isolated,  services that each have th eir own \\nf\", \"unction and each have separate development  and deployment lifecycles. Containers \\ncan also be used to lift and shift existing applications to run at scale in the cloud.  \\nAzure provides several services to support running a  microservices architecture in \\ncontainers. Running the increasingly popular orchestrati on engine Kubernetes , Azure \\nKubernetes  Service  (AKS) provides a powerful tool to run anything from  a handful of \\ncontainers to hund\", \"reds of thousands of them . AKS can all  run and orchestrate \\ncontainers . Orchestration of containers is quite different from orchestrating a process , \\nlike Logic Apps does. Orchestrating containers means that you manage their lifecycles. \\nProvision new ones, scale up or down, manage failures, and so on.   \\n  \\n Get started by Creating a Windows virtual machine with the Azure portal  \\n.  \\n Azure Quick Start Guide for .NET Developers  13  \\nWhich \", \"frameworks and technologies can you use in which Azure service?  \\nNow that you know what the options are for running your application in Azure, it is \\nextremely useful to know which ver sion of .NET you can run in these services and what \\nkind of containers they support. Table 2 explains this by showing which framework and \\ncontainer types you can use in which services in Azure.   \\nTable 2:  Which framework and technology can you use in which  Az\", \"ure service  \\n \\nWeb Apps  Mobile \\nApps Functions  Azure VMs  Azure  \\nContainer  \\nInstance  Azure  \\nKubernetes  \\nService \\n(AKS) \\n.NET Framework \\napps       \\n.NET Core apps        \\nLinux Containers        \\nWindows Server \\nContainers        \\n \\n  \\n  \\n You can lear n more about microservices by reading: \\n   \\n  \\n  \\n .NET Microservices  Architecture Guidan ce  \\n Azure Quick Start Guide for .NET Developers  14 Storing yo ur data in Azure  \\nData is a part\", \"icularly important aspect of any modern .NET application, and it comes in \\nall shapes and sizes. Azure provides many types of data stores that can help you \\nmaintain and retrieve data in any scenario.  \\nTable 3  shows w hich data service to use for which scenario .  \\n Database  Cosmos DB  Blob Table File PostgreSQL,  \\nMySQL  SQL Data \\nWarehouse  Data Lake \\nStore \\nRelational data          \\nUnstructured \\ndata          \\nSemistructured \\ndata         \", \" \\nFiles on disk          \\nStore larg e data          \\nStore small \\ndata          \\nGeographic \\ndata \\nreplication          \\nTunable data \\nconsistency           \\n Azure Quick Start Guide for .NET Developers  15  \\nAzure SQL Database  \\nIf you are familiar with .NET, you will likely be familiar with SQL Server . In Azure, you can \\nrun your SQL Server workload in Azure SQL Database . This is SQL Server in the cloud. It \\nis the same thing that you run on\", \" -premises but it offers a lot  of advantages.  \\nYou can do ( almost)  everything with it that you can do with on -premises SQL Server. \\nAnd, in fact, new SQL Server features are incorporated in Azure SQL Database first and \\nlater in the on -premises SQL Server.  \\nYou can use Azure SQL Databases with your favorite tools, like Azure Data Studio , Server \\nExplorer  and SQL Server Data Tools  in Visual  Studio and SQL Server Management \\nStudio .  \\nB\", \"ecause they run in the cloud, Azure SQL Databases are fully managed, scalable, and \\nhigh performing. They are automatically backed up and hav e many advanced features, \\nsuch as:  \\n\\u2022 Single -click Geo-replication , which replicates data to other geographical regions in \\nreal time , incredibly easily .  (Get started with geo -replication .)  \\n\\u2022 Dynamic data masking , which masks sensitive data for certain users at runtime.  \\n(Get started with dynam\", \"ic data masking .)  \\n\\u2022 Auditing , which provides a complete audit trail of all the actions that happen to the \\ndata. ( Get started with Azure SQL Database auditing .)  \\n\\u2022 Automatic database tuning , which monitors the performance of your database and \\ntunes it automatically. ( Get started with Azure SQL Database automatic tuning .) \\n   \\n Azure Quick Start Guide for .NET Developers  16 In addition to all these features, Azure SQL Databases are exc\", \"eptionally reliable by \\ndefault. Without configuring anything,  transaction log backups are made every 5 -10 \\nminutes and differential backup s every 12 hours. These backups are stored three times \\nin the local datacenter and three times in another datacenter. And you can restore \\nbackups from 35 days ago, depending on the pricing tier  that you use.  \\nIt is very easy to use Azure SQL Databases from a .NET application. You can, for instance, \\nuse\", \" the Entity Framework  (or Entity Framework Core ) to access the database and write \\nand read data to and from it. For the most par t accessing data programmatically is no \\ndifferent from access ing data in an on -premise s SQL Server.  \\n \\n  \\nAzure Cosmos DB  \\nAzure Cosmos DB  is a new kind of database that is globally distribut ed and cloud native . \\nHere are some of its key features:  \\n\\u2022 A 99.99% SLA (99.999% for r ead operations ) that include\", \"s low latencies (less than 10 \\nms on reads; less than 15 ms on writes).  \\n\\u2022 Geo-replication , which replicat es data to other geographical regions in real time  \\n(How to distribute data global ly with Azure Cosmos DB ).  \\n\\u2022 Tunable data consistency levels , so you can choose data consistency , enabling a \\ntruly globally distributed data system. You can, for instance, choose strong \\nconsistency , eventual consistency , or session consistency . \\n\\u2022 \", \"Traffic management , which sends users to the data replica to which they are closest.  \\n\\u2022 Limitless global scal e. You pay only for the throughput and storage that y ou need.  \\n\\u2022 Automatic indexing of data . No need to maintain or tune the database anymore.   \\nIn addition to all these features, Cosmos DB offers different APIs with which you can \\nstore and retrieve data, including SQL, Gremlin, MongoDB, Azure Table Storage, and \\nApache Cassandra. \", \"Different APIs handle data in different ways. You can use documents \\nas data as well as unstructured tables, graphs, and blobs. You use the API that fits yo ur \\n  \\n Get started by creating an Azure SQL Database in the Azure Portal  \\n.   \\n Azure Quick Start Guide for .NET Developers  17 needs, and Cosmos DB takes care of the rest. If your  application already uses  one of \\nthese protocols switching to  Cosmos DB is as simple as changing a connecti\", \"on string.  \\nYou benefit from cloud -grade performance, scalability, and reliability, and still u se the \\nprogramming model to which you\\u2019re accustomed.  \\nYou can use Cosmos DB from .NET Framework and .NET Core. For e xample, you can use \\nits SQL API through the NuGet package Micros oft.Azure.DocumentDB  or \\nMicrosoft.Azure. DocumentDB.Core  (for .NET Core).  \\n \\n \\nAzure Storage  \\nWith Azure Storage , one of the most fundamental services in Azure, \", \"you can store data \\nin different forms. It is easy to use, fast, and inexpensive. Azure Storage offers several \\ntypes of storage that you can use for differen t scenarios. All these storage types share \\ncommon features like encryption for data at rest , security through shared access \\nsignatures , and firewalls and virtual networks .  \\nAzure Storage is also very reliable . By default, data is replicated three times within the \\ndatacenter. You can\", \" also choose geo -replicated storage, which, i n addition t o the three \\nlocal replicas, replicates the data three times to another datacenter. You can create your \\napplication in such a manner that it reads from this geo -replicated data, which is close \\nto your users, so that it is geographically high per forming.  \\nYou can use Azure Storage from your .NET Framework and .NET Core applications by \\nusing the WindowsAzure.Storage NuGet package  an\", \"d referencing the specific API that \\nyou need, l ike Microsof t.WindowsAzure.Storage.Blob  (for Blob storage) in a using \\nstatement in your code.  \\n  \\n \\n \\n \\n  \\n Get started with Azure Cosmos DB w ith the SQL API and .NET Core  \\n.  \\n Azure Quick Start Guide for .NET Developers  18 Let\\u2019s explore the different types of Azure Storage:  \\nFile Storage  \\nAzure File storage  uses the SMB pr otocol, which makes it very suitable for lifting and \\nshifting y\", \"our file server into the cloud. When you have files in Azure Files, you can mount \\nan Azure file share to a VM  or even to your own Windows machi ne, to use as external \\nstorage.  \\n \\nAzure Disk Storage  is a similar servic e to Azure File but is dedicated to a single machine. \\nIt is available in four different performance levels from Standard HDD to Ultra SSD . The \\nhigh performance tiers are suitable for heavy I/O workloads such as running SAP H\", \"ANA \\nor complex analytical model s. \\nTable Storage  \\nAzure Table storage  is an inexpensive and extremely fast NoSQL key -value store that \\nyou can use  to store data in f lexible tables. A table can contain one row describing an \\norder and another row describing customer information. You don\\u2019t need to define a \\ndata schema. This makes Table Storage very flexible.  \\n \\nBlob Storage  \\nYou can use Azure Blob storage  to store large unstructured data\", \" \\u2014literally, blobs of data.  \\nThis can be video, image, audio, text, or even virtual hard drive (VHD) files for VMs. \\nAdditionally, you can  use Blob tiers  to reduce your storage costs. By default, blobs are \\nwritten to the hot tier , which means that they are written and read very fast. You can \\nalso put blobs in the cool tier  if you have data that is infrequently accessed and stored \\nfor at least 30 days. The cool tier  is less expensive than\", \" the hot tier . And fina lly, you can \\nstore blobs in the archive tier , that is the least expensive. The archive tier  is for data \\n  \\n Get started with Azure Files  \\n. \\n  \\n  \\n Get started with Azure Table storage  \\n.  \\n Azure Quick Start Guide for .NET Developers  19 that is rarely accessed and stored for at least 180 days. Reading data from the archive \\ntier can take hours. Blob tiering is a great way to save costs i f you are stori ng large \\n\", \"amounts of data.  \\n \\nQueue Storage  \\nAzure Queue storage  is an unusual type of storage in that it is used to store small \\nmessages of data, but its main purpose is to serve as a queue. You put messages on the \\nqueue and other processes pick it up. This pattern  decouples the message sender from \\nthe message processor and results in performance and reliability benefits. Azure Queue \\nstorage is similar to  Microsoft Message Queuing  that you can f\", \"ind in Windows.  \\n \\n  \\n|Note : Azure Service Bus Topics and Queue s also provide queuing m echanisms, with slightly different properties than Azure Storage \\nqueues.  \\nAzure Databases for MySQL, PostgreSQL, and MariaDB  \\nAs a .NET developer, you encounter many different open -source database types in your \\njob. Some of them can now be used in a managed version in Azure.  \\nAzure provides MySQL, PostgreSQL , and MariaDB  databases as managed databas\", \"es, \\nwhich means that you just  spin them up and don\\u2019t have to worry about any of the \\nunderlying infrastructure. Just like Azure SQL Databases and Cosmos DB, these \\ndatabases are universal ly available, scalable, highly secure, and fully managed.  \\nEach of these is suited for slightly diff erent use cases, but in general, their functionality \\noverlaps a lot. You would use Azure Databases for MySQL, PostgreSQL, and MariaDB \\nwhen you are already u\", \" sing one of their on -premises versions and want the advantage \\nof having that run fully managed in th e cloud. Migrating apps that use these databases \\nis much easier when the data can remain in its original platform. Azure also provide s an \\nout of the box bac kend for services like WordPress which rely on open source databases.  \\n  \\n Get started with Azure Blob storage  \\n. \\n  \\n  \\n Get started with Azure Queue storage  \\n.  \\n Azure Quick Start \", \"Guide for .NET Developers  20  \\nAzure SQL Data Warehouse and Azure Data Lake Store  \\nSince we are talking about storing data in Azure, we can\\u2019t leave out the data stores for \\nbig data and data analytics. These are not t ypical stores that you use with your \\napplication, but rather stores that you use for data analytics and reporting.  \\nAzure p rovides two data stores that are very suitable for storing large amounts of data \\nfor data analytics pur\", \"poses: the Azure SQL Data Warehouse  and the Azure Data Lake \\nStore. \\nEach of these can hold petabytes of data. In  fact, Azure Data Lake Store doesn\\u2019t even \\nhave limits on the amount of data and the file sizes that you can store.  \\nYou use Azure SQL  Data Warehouse when you know the questions that you want to \\nanswer with data analytics. You define a data schema that dete rmines what your data \\nwill look like and how it can be used.  \\nYou use Az\", \"ure Data Lake Store when you don\\u2019t know the questions that you  want to \\nanswer yet. You do not have to define a data schema for the Data Lake Store. You store \\ndata in its native format.  \\nYou can work with each of these data stores with tools in Visual Studio. And you can use \\nany SQL tool, like SQL Server Management St udio, to work with Azure SQL Data \\nWarehouse. You can even create eye -popping business intelligence dashboards and \\nreports a\", \" s a non -developer in Power BI . \\nAdditionally, you can use the Azure Management SDK for .NET  to perform management \\noperations on these services. You can, for instance, create a new Data Lake Store \\naccount .  \\n \\n  \\n Get started with Azure Database for MySQL by creating a MySQL server  \\n  \\n  \\n by using the Azure p orta \\nl \\n. \\n  \\n Get started  with Azure SQL Data Warehouse by creating and query  \\n  \\n  \\n  \\n a warehouse in the Azure portal  \\n.  \\n\", \" Azure Quick Start Guide for .NET Developers  21   \\n \\nSecuring your .NET applications in Azure  \\nBesides running your application and storing da ta, you need to secure it. Azure can help \\nyou with that by providing authentication and authorization through Azure Active \\nDirectory  and by helping you to keep secrets safe with Azure Key Vault  and inserting \\ncredentials into your application with Managed Service Identity . Let\\u2019s examine these \\nservi\", \"ces.  \\nAzure Active Directory  \\nAn important part of your  application\\u2019s security is authenticating users before they can \\nuse it. Authentication is not an easy thing to  implement. You need to store user \\nidentities and credentials, implement password management, create a secure \\nauthentication handshake, and so on.   \\nAzure Active Dir ectory  provides all these things and more out of the box. You store your \\nuser identities in Azure Active Dire\", \"ctory and have users authenticate against it, \\nredirecting them to your application only after they are authenticated. Azure Active \\nDirectory takes  care o f password management, including common scenarios like \\u201cI \\nforgot my password.\\u201d Azure Active Directory is used by millions of applications every \\nday, including the Azure portal , Outlook.com , and Office 365 . Because of this, it is able \\nto more readily detect malicious behavior and act on \", \"it. For instance, if a user were to \\nsign in to an application from a location in Europe and then one minute later sign in \\nfrom Australia, Azure Active Directory woul d flag this as malicious behavior and ask the \\nuser for additional credentials through multifactor authentication.  \\nTo programmatically talk to Azure Active Directory, you can us e the Active Directory \\nAuthenticating Library (ADAL) for .NET Framework and .NET Core .  \\n  \\n Get sta\", \"rted with Azure Data Lake Store using the Azure portal  \\n.  \\n Azure Quick Start Guide for .NET Developers  22  \\nAzure Key Vault  \\nIt is important to keep secrets such as passwords and connection strings out of source \\ncode. So where do you put them ? In Azure Key Vault .  \\nAzure Key Vault i s a safe place to store passwords, connection strings, access codes, \\nand certificate keys. It is fully managed by Azure, so you don\\u2019t have to worry about \\nth\", \"e underlying infrastructure. You just spin it up and use it.  \\nYou can use it as a c onfiguration stor e in your applications, just like you would use a  \\nweb.config  file. An administrator can populate the values in the Azure Key Vault, and \\nyour application just pulls it out at startup time or whenever it needs it. This way, \\npasswords will n ever be in source  code and are the responsibility of the Azure Key Vault \\nadministrator.  \\nYou can use\", \" Azure Key Vault using the Microsoft.Azure. KeyVault NuGet package  that \\nyou can use from the .NET Framework and .NET Core. There is even a special syntax  \\nwhich allows pulling secrets from KeyVault in App Services with zero code changes. For \\nmore complex scenarios where configuration changes based on location, release or \\nsome other custom dimension Microsoft is introducing Azure App Configuration  a \\nservice dedicated to providing a centrali\", \"zed configuration location which can be used \\nfrom everything form App Services to a D evOps pipeline.  \\n \\nManaged Service Identity  \\nEven when you use Azure Key Vault, your application must have some credentials in its \\nconfiguration . Something that you use to connect to Azure Active Directory or to Azure \\nKey Vault . Well, it doesn\\u2019t have to anymore. You can now use Azure Managed Service \\nIdentity . \\n  \\n Get started by integrating Azure AD int\", \"o an ASP.NET Core web app  \\n. \\n  \\n Get Started by using Azure Key Vault from an ASP.NET application  \\n.  \\n Azure Quick Start Guide for .NET Developers  23 You can use Managed Service Identity from a lot of services in Azure, including from \\nAzure App Service. From there, you can enable it to i nject credentials into your \\napplication at runtime and use those credentials to access other services, like Azure Key \\nVault.  \\nYou can use the Managed Se\", \"rvice Identity from the .NET Framework and .NET Core \\nusing the Microsoft.Azure.Services.AppAuthentication NuGet package .  \\n \\nAzure Advisor  \\nThere are a lot of moving parts in Azure so Microsoft provide s a tool called Azure \\nAdvisor  which examines your Azure resources and makes recommendations. The \\nrecommendations include how to save money by making more efficient use of Azure \\nresources and suggestions on how to make your Azure resources mo\", \"re secure. The  \\nsecurity advisor will catch a nd rank problems like world readable Blob Storage and give \\ninstructions on how to better secure your environment.  \\nOther Azure services  \\nEnhance your application performance  \\nAzure can also help you to boost your applications\\u2019 pe rformance. One service that he lps \\nwith this is Azure Redis Cache , which provides high -performance, in -memory, key -value \\nstorage. Another is Azure Content Delivery\", \"  Network , or CDN, which can replicate your \\nstatic content, like i mages and video files to points -of-presence all over the world, \\nmaking sure that it is as close to y our users as possible. And fin ally, Azure Traffic \\nManager  can improve application responsiveness by routing users to locations with the \\nlowest latency.  \\nMachine Learning  \\nAzure provides  an industry leading suite of services that can make your application more \\nintelligen\", \"t. Azure Cognitive Services  are a suite of APIs t hat can do things which would \\nbe nearly impossible using traditional programming approaches. You can quickly  build \\n  \\n Get started by using Key Vault from A pp Service with  \\n  \\n  \\n  \\n Managed Service Identity  \\n. \\n   \\n Azure Quick Start Guide for .NET Developers  24 applications which can recognize faces , convert speech to text and understand the \\nmeaning of text. Using the Language Understa\", \"nding  service  you can create bots which \\ncan int elligently respond to requests  in Slack, Microsoft Teams and other forums.  \\nYou can also create your own machine learning algorithms with Azure Machine Learning . \\nTraining jobs created in popular tools such as Tensorflow can be submi tted to run on a \\ncluster of GPU -enabled Virtual Machines , vastly decreasing the time to train models.   \\n \\nInternet of Things (IoT)  \\nWhen you are buil ding a \", \"solution based on the Internet of Things, Azure can help you \\nwith services like Azure IoT Hub , which c an ingest massive  amounts of messages from \\nIoT devices and manage the devices. Azure IoT Suite  makes it possible for you to \\nmanage your IoT dev ices without doing everything yourself. And if you have limited IoT \\nexperience, you can use Azure IoT Central , which is a Saa S solution that e nables you to \\nuse IoT with minimal customization. \", \"And finally, there is Azure IoT Edge , which allows \\nIoT de vices to do some of the calculations locally, instead of having to communicate \\nwith the cloud for every operation.  Trained ML models can even be deployed to edge \\ndevices enabling capabilities such as image recognition in disconnected hardware.  \\nData Analyti cs \\nThere are many  services in Azure for doing data analytics, including Azure Data Factory  \\nfor moving and transforming data;\", \" Azure Analysis Services , which provides an in -\\nmemory data analytics platform; and Azure Da ta Lake Analytics , which can perform U -\\nSQL jobs on Azure Data Lake Store . You can also take advantage of Azure Stream \\nAnalytics  to analyze data on the fly and Azure Time Series Insights , which provides a \\nunique data analytics  platform for time -based data that can store and analyze data and \\ncan show information using its own data visualization\", \" engine. In addition, there is Azure \\nDatabricks , which offers a managed cluster of enhanced Apache Spark \\u2013based analytics \\nengines, and Azure HDInsight , which you can use to spin up managed clu sters of open -\\nsource data analytics platforms and tools, like Apache Storm , Apache Kafka , and \\nApache HBase .   \\n Azure Quick Start Guide for .NET Developers  25 Messaging  \\nAzure also provides services that can help you build scalable architectures\", \" with events \\nand messages . Azure Queue Storage  and Azure Service Bus Topics  and Queues  can help \\nwith that by providing queuing mechanisms that decouple your services . Azure Event \\nGrid can help by subscribing to events, like blobs being added and pushing an event to \\nwhoever is subscrib ed to it. And Azure Event Hubs  can inge st massive amounts of data, \\nwhich you c an process, filter, and store  in your own time. Using messaging to \\ncomm\", \"unicate between services in Azure allow s you to handle load smoothly while also \\npreventing data loss in the event a service is unavailable.  \\n \\nMedi a Services  \\nWorking with (streaming) media can be challenging. Azure Med ia Services  can help you \\nby providing services like encoding , which encodes your media files into the file formats \\nand scre en sizes they need to be. Azure Content Protection  enables you to use DRM \\ntechnologies like Pla\", \"yReady  to make s ure that your content is only used by authorized \\nusers. With live streaming  you can stream media worldwide at massive scale. And by \\nusing Media Analytics  you can enhance media by doing intelligent things like creating \\nsubtitles f or a movie based on speech.  \\nMonitoring  \\nAnd finally, you need to monitor your applications that run in Azur e, to make sure that \\nthey run smoothly. The monitoring tools in Azure fall under the \", \"umbrella of Azure \\nMonitor . There are services like Azure Application Insights  that can help you to monitor \\nevery aspect of your application. Th ere is also Azure Log Analytics , which plugs into \\nevery Azure Service  to gather diagnostics information, and Azure Network Watcher , \\nwhich ca n inspect network traffic from your VMs and over your Virtual Networks .  \\n   \\n Azure Quick Start Guide for .NET Developers  26 Figure 1  A sample monitorin\", \"g dashboard  \\nVisual Studio App Center  provides logging a nd monitoring as part of a fully featured \\nsuite of tools for mobile applications. Azure Security Center , which is your one -stop-\\nshop for all the security aspects of all your services in Azure. Your logs can be visualized \\nusing Azure Dashboards  or Power BI  and you can even trigger custom actions from log \\nevents using Logic Apps .  \\n \\n \\n \\n Azure Quick Start Guide for .NET Developers\", \"  27 Tools for developing, de bugging  \\nand troubleshooting  \\nAs .NET developers and architects, we are spoiled with the incredible tooling of Visual \\nStudio. This extends into the world of Azure, which includes many tools that can make \\ndeveloping and troubleshooting in Azure easier and f un. Let\\u2019s explore these tools.   \\nVisual Studio and Azure  \\nWe all love Visual Studio and Azure does too! If you run any version of Visual Studio \\n2019 or 2017\", \"  and enable the Azure workload , you\\u2019ll be able to seamlessly work  with \\nAzure. And if you can\\u2019t upgrade, that\\u2019s OK, we have you covered there , too. If you are \\nusing Visual Studio 2015, you can download the Visual  Studio 2015 Tools for Azure .  \\nProject templates  \\nOut of the box, you get lots of project templates to work with. You can create web \\napplications f or the cloud, Azure Clou d Services applications , Azure Functions , Azure \\nWebJ\", \"obs , and much more.    \\n Azure Quick Start Guide for .NET Developers  28 Figure 2: Azure project templates in Visual Studio 201 9 with Azure workload  installed  \\n \\nCloud Explorer  \\nAs part of the Azure workload in Visual Studio, you get Cloud Explorer. You can use this \\nto navigate through all your Azure subscrip tions and resources and take action, as in \\nFigure 3, where you can attach a debugger to an App Service Web App.  \\nFrom Cloud Explore\", \"r, you can also do things like open an Azure SQL Database in the \\nVisual Studio Server Explorer and upload files to Azure Stor age. \\nYou can even connect to services to see their streaming logs and change application \\nsettin gs and connection strings in App Service.  \\n \\n  \\n G \\net started by managing your Azure resources with Cloud Explorer  \\n. \\n   \\n Azure Quick Start Guide for .NET Developers  29 Figure 3: Cloud Explorer in Visual Studio  \\n \\nOnce\", \" you have the Azure workload enabled in Visual Studio, you can easily publish to  \\nAzure from various project types. The publish wizard has an option to publish to  Azure \\nApp Service  (for example, host a web site) . Or you can directly publish to specific \\nservices like Azure Cloud Services . All with a few clicks.  \\n \\n  \\nPublish to Azure  \\n  \\n Get started by using the Visual Studio Publish Azure Application wizard  \\n.  \\n Azure Quick Start Guid\", \"e for .NET Developers  30 Figure 4: Publish to Azure  \\n \\n \\nFor a more repeatable process you can set up an Azure DevOps pipeline from inside \\nVisual Studio 2019 which will build, test , and deploy your application to Azure. The \\nPipeline will be kicked off every time there is a check -in to your  source control ensurin g \\nyour application is always up to date.  \\n  \\n \\n Azure Quick Start Guide for .NET Developers  31 Figure 5: Configure a DevOps Pi\", \"peline  \\n \\n \\nSnapshot Debugger  \\nThe Snapshot Debugger  allows you to debug your application while it is running live in \\nproduction , without affecting its performance. This is great, because now you can debug \\nproduction without pausing the app when you hit a bre akpoint. Debugging provides a \\nlot more information than diagnostic logs typically do.  \\n  \\n \\n Azure Quick Start Guide for .NET Developers  32 Note that you do need Visual Studio E nte\", \"rprise to use the Snapshot Debugger. Here\\u2019s \\nhow it works:  \\n1. Attach the snapshot debugger  to your application process in Azure.  \\n2. Add a snappoint  (different from a breakpoint).  \\n3. When the snappoint  is hit, a snapshot  is taken.  \\n\\u2022 The debugger quickly gathers a ll the information it needs about the call stack and \\nvariables and lets the app continue to run.  \\n4. You can now view the snapshot  and inspect everything that you normally \", \"would \\nwhen debugging, without holding up the application.  \\n \\n \\nAzure Storage Explorer  \\nThe Azure Storage Explorer  is a tool for managing your Azure Storage accounts. It\\u2019s a \\nfree, standalone applicat ion from Microsoft that you can download here . You can use it \\nto create new blob containers, upload files, q uery through Table storage , and more. \\nYou can even use it to manage your Cosmos DB storage  and create databases and \\ncollections.  \\n\", \" \\n  \\n  \\n Get started by debugging snapshots on exceptio ns in .NET apps  \\n. \\n  \\n Get started with Storage Explorer  \\n.  \\n Azure Quick Start Guide for .NET Developers  33 Figure 6: Storage Explorer  \\n \\nAzure Storage Emulator  \\nIn the Visual Studio Azu re workload or in the Azure SDK , you\\u2019ll find the Azure storage \\nemulator , which you can use to develop locally against Azure Storage. You can access it \\nthrough Cloud Explorer just like you can acc\", \"ess it in the Azure porta l or through other \\ntools such as Storage Explorer .  \\nThe Azure storage emulator works the same as Azure Storage in the cloud, including \\nhow you authenticate to it. There are some obvious differences, like file size limitations \\nand th e lack of geo -redundant scaling. And the emulator doesn\\u2019t support Azure Files .  \\nOnce you are done developing and t esting locally, you can publish your application to \\nthe cloud and u\", \"se Azure Storage there.  \\n \\nAzure Command -Line Interface  \\nYou can do everything you need to do in Azure from Visual Studio and the Azure \\nportal . But sometimes you want to run scripts to perform command -level operations, \\nlike when you are working with containers. You ca n do that using the Azure Command -\\nLine Interface , or CLI. You can install the Azure CLI on your local development \\n  \\nGet started by configuring and using the storage emul\", \"ator  \\n  \\n  \\n  \\n with Visual Studio  \\n.  \\n Azure Quick Start Guide for .NET Developers  34 computer , use a pre -built Docker container , or use it from within the Azure portal, \\nwhere it is a part o f Azure Cloud Shell .  \\nUsing the CLI in the Azure portal through Cloud Shell is very easy. You don\\u2019t have to \\ninstall an ything and you don\\u2019t have to log in to your Azure Subscription  because you\\u2019ve \\nalready done that to get into the portal.  \\nFigu\", \"re 7: Azure Cloud Shell in the Azure portal  \\n \\nAzure Cloud Shell supports Bash and P owerShell as scripting languages. These might not \\nbe things that you use daily as a .NET developer, but they are worth diving into because \\nthey are powerful tools.  \\nOnce you are in the CLI, you can do anything  from listing al l the Azure resources you \\nhave to provisioning new resources.  \\nYou can also access Cloud Shell directly in the browser at https://sh\", \"ell.azure.com  or via \\nmobile devices such as iOS and Android.  \\n \\n Azure Quick Start Guide for .NET Developers  35 Azure  Functions Core Tools  \\nAzure Functions  run inside Azure App Service Function Apps and are powerful. You can \\nuse them to run small pieces of code that get trig gered by outside sources and bi nd to \\nthings like Azure Blob storage  or Azure C osmos DB .  \\nThe Azure Functions Core Tools  enable you to develop Azure Functions l\", \"ocally. You can \\nrun the local version of Azure Functions runtime on your development computer.  \\nWith the Azure Functions Core Tools, you can develop and test your Azure Functions \\nlocally. And when you\\u2019re done, you ca n publish them to Azure or us e continuous \\nintegration an d continuous delivery  to chec k your Azure Functions code and publish it \\nautomatically to Azure.  \\n \\nCosmos DB Emulator  \\nWhen you are using Azure Cosmos DB , you can us\", \"e the Azure Cosmos DB Emu lator to \\ndevelop locally. The emulator acts just like Cosmos DB would and even provides the \\nsame interface as Cosmos DB does in the Azure portal.  \\nFigure 8: Cosmos DB Emulator local interface  \\n \\n  \\n Get started by creating your first function using Visual S tudio an d \\n  \\n  \\n  \\n test it locally  \\n. \\n \\n Azure Quick Start Guide for .NET Developers  36 The Cosmos DB Emulator also shows up in  the Cloud Explorer in Visua\", \"l Studio, so that \\nyou can easily manage it from there.  \\nBy developing locally against the Cosmos DB emulator, you can develop without \\nincurring costs from a Cosmos DB in Azure. And when you  are ready, you can deploy \\nyour applica tion to Azure and run it against Cosmos DB there, just by changing your \\nconnection string.  \\n \\nAzure DevOps  for build and deployment  \\nOnce you are working on your application, it is vital to integrate your work wi\", \"th the work \\nof other developers (continuous in tegration).  \\nIt is vital to deploy that work to a central location, like an Azure Web App , so that you \\ncan see that it works, and so that it can be tested and promoted through the dif ferent \\nenvironments and can be deployed to production (continuous delivery).  \\nTo make this work, you need to automatically integrate  everybody\\u2019s work and deploy it.  \\nIdeally, you would do these things continuous\", \"ly, whenever somebody commits new \\nwork.  \\nAzure DevOps , can help with that. It is an application lifecycle management system that \\nmanages your work items and sprints, stores and manages your source code, builds \\nyour code, and deploys it to wherever you want. The be st part is, it is very easy to set up.  \\nYou c an put your source code in DevOps  and manage it using the TFS or Git  protocols. \\nOnce you start committing changes, you can h ave t\", \"hose built by a simple build \\npipeline  that executes something like a Visual Studio build , just like you would on your \\nlocal development computer. You can create such a pipeline by just adding tasks in \\nthe DevOps  portal, like in Figure 9.  \\n  \\n  \\n Get started by using the Azure Cosmos DB E mulator  \\n  \\n  \\n for lo cal developmen t and testing  \\n.  \\n Azure Quick Start Guide for .NET Developers  37 Figure 9: DevOps  Build Pipeline  \\n \\nYou can s\", \"et your build up to compile  your code an d run your unit tests e very time \\nsomebody commits. This  is continuous integration.  \\nAnd once the build is done, it can kick off a release pipeline that deploys your code to \\nenvironments including development, te st, staging, and production. You can deploy \\nyour code to anywhere: to on -premises resources or to the cloud. You can even have \\npermissions gate s that require somebody like a product owner\", \" to approve the \\ndeployment to production, putting them in control.  \\nYou create a release pipeline  in the same way as you create a build pipeli ne\\u2014by adding \\ntasks in the Azure DevOps  portal, like in Figure 10. \\n  \\n \\n Azure Quick Start Guide for .NET Developers  38 Figure 10: Azure DevOps  Release Pipeline  \\n \\nAzure DevOps is a  powerful tool that every .NET developer should have in their arsenal. \\nNow you no l onger have an excuse to not do c\", \"ontinuous integration and continuous \\ndeployment.  \\n \\n  \\n \\n  \\n  \\n Get started with Azure  DevOps  \\n . \\n  \\n Download and read the free e -book about DevOps for a  \\n  \\n  \\n  \\n microservic es architecture  \\n. \\n   \\n Azure Quick Start Guide for .NET Developers  39 Summary and how to get started for free  \\nIn this guide, we\\u2019ve introduced the power that Azure can bring to your applications. \\nUsing Azure, you can do incredible things  with your applicatio\", \"ns \\u2014facial and speech \\nrecognition, manage your devices on the Internet of Things in the cloud, scale as much \\nas you want, and pay for what you use.  \\nYou\\u2019ve seen that Azure is a great place for .NET developers and architects and it \\nprovi des tools that have the same world -class quality and depth that you are used to \\nworking with today. The days of having to write co mplicated \\u201cplumbing\\u201d yourself are \\nover. Now you can take advantage of a wea\", \"lth of prebuilt solutions. Free yourself up to \\nwork  on the things that matter, and let Azure take care of the solved problems.  \\nKeep learning with an Azure free account  \\nDo you have  a Visual Studio Subscription? Activate your monthly Azure credit . \\nSign up for an Azure free account  and receive:  \\n\\u2022 A $200 credit to use on any Azure product for 30 days  \\n\\u2022 Free access to our most po pular products for 12 months, including compute, storage, \", \"\\nnetworking, and database  \\n\\u2022 More than 25 products that are always free, in cluding Text Translator, Functions and Active \\nDirectory B2C  \\n \\n  \\nDownload and install language -specific SDKs and tools  at:  \\n  \\n  \\n  \\n   \\n  \\n https://azure.microsoft.com/downloads/   \\n Azure Quick Start Guide for .NET Developers  40 About the team  \\nCesar, Michael, Beth and Barry are passionate abo ut Microsoft Azure and woul d encourage you to reach \\nout to them on\", \" Twitter for questions regarding this book.  \\nCesar de la Torre works for Microsoft Corp in Redmond, Seattle, in the .NET \\nproduct team, focusing on .NET, Azure, Containers & Microservice -based \\narchitectures and creati ng .NET Application Architecture guidance . \\nYou can reach him on Twitter @cesardelatorre  or by following his blog at   \\nhttps://blogs.msdn.microsoft.com/cesardelatorre/ . \\nMichael Crump works at Microsoft on the Azure platform \", \"and is a coder, blogger, \\nand international speaker on var ious cloud development topics. He\\u2019s passionate \\nabout helping developers understand the benefits of the cloud in a no-nonsense  \\nway. \\nYou can reach him on Twitter @mbcrump  or by following his blog at  \\nhttps://www.michaelcrump.net . \\nBarry Luijbregts  is an independent architect and software developer focused on \\npreparing business applications and solutions for the cloud. A  Microsoft \", \"Azure \\nMVP, Barry is a skilled educator and active member of the community providing \\nPluralsight cloud and developer -focused courses and on -site private training \\nsessions for corporate groups. He records podcasts, founded an active .NET User \\nGrou p, and leads technology bootcamps. Barry has a lifelong passion for technology and for IT in \\nparticular. Technology drives his curi osity as he stays current and gains unique access to new \\ntechnol\", \"ogy through Microsoft early adoption programs. Understanding that software is an \\ninvestment, Barry uses his knowledge of cloud direction to advise clients on forward -looking and \\nsustainable lo ng-term solutions. You can reach Barry on Twitter @AzureBarry  and through his \\nwebsite at https://www.azurebar ry.com . \\nBeth Massi is the Product Marketing Manager for the .NET Platform and \\nLanguages at Microsoft. She\\u2019s a long -time community champion\", \" for .NET \\ndevelopers  and on the Board of Directors for the .NET Foundat ion. You can reach \\nher on Twitter @BethMassi .  \\n\"]"