{"": {"Auto Updates in MSIX": "The Windows Store has a great updating mechanism using Windows Update. In most enterprise scenarios, you don't use the Store to distribute your desktop apps. So, you need a similar way to configure updates for your application and pull them to your users.\n\nUsing a combination of Windows 10/Windows 11 features and MSIX packages, you can provide a great updating experience for your users. In fact, the user doesn't need to be technical at all but still benefits from a seamless application update experience.\n\nYou can configure your updates to interact with the user in two different ways:\n\n?\n\nX\n\nHRappinstaller\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6]\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n‹?xm1 version=\"1.0\"- encoding\n\nE&lt;AppInstaller-\n\n-Uri-\"http://sampleapppackages.azurewebsites.net/MSIX\\_HR\\_Demo/HR.appinstaller'\n\n[\"User prompted updates: The OS shows some autogenerated nice UI to notify the user about the application it's about to install. It builds this UI based on the properties you specify on your installation files.\"]\n\n•Version=\"2.0.0.0\"\n\n['Silent updates in the background. With this option, your users don\\'t need to be aware of the updates. =· \"x86\"/&gt;']\n\nYou can also configure when you want to perform updates: either when the application launches or on a regular basis. Thanks to the side-loading features, you can even get these updates while the application is running.\n\nWhen you use this type of deployment, a special file is created called .appinstaller . This simple file contains the following sections:\n\n['The location of the .appinstaller file', \"The application's main MSIX package properties\", 'The update behavior']\n\n<!-- image -->\n\nIn combination with this file, Microsoft has designed a special URL protocol to launch the installation process from a link:\n\n&lt; a href=\"ms-appinstaller:?source=http://mywebservice.azureedge.net/MyApp.msix\"&gt;Install app package &lt;/ a &gt;\n\nThis protocol works on all browsers and launches the installation process with a great user experience on Windows 10/Windows 11. Since the OS manages the installation process, it's aware of the location this application was installed from and tracks all the files affected by the process.\n\nMSIX creates a user interface for installation automatically showing some properties of the package. This allows for a common installation experience for every app.\n\n133 %\n\n-\"UTF-8\"?›\n\nOnce you've generated the new MSIX package and moved it to the deployment server, you just have to edit the .appinstaller file to reflect these changes: mainly the version and the path to the new MSIX file. The next time the user launches the application, the system will detect the change and download the files for the new version in the background. When the download is finished, installation will execute transparently for your user on new application launch."}}