["Zakon o sportu NN 19/16\n\n1. OPCA ODREDBA\nClanak 1.\n\n(1) Ovim se Zakonom ureduju: sustav sporta 1 sportske djelatnosti, strucéni poslovi u sportu,\nsportska natjecanja, financiranje sporta, nadzor 1 ostala pitanja od znaéaja za sport.\n\n(2) Sportske djelatnosti su djelatnosti od posebnog interesa za Republiku Hrvatsku.\n\n(3) Sport mora biti jednako dostupan svima bez obzira na dob, rasu, spol, spolnu orijentaciju,\nvjeru, nacionalnost, drustveni poloz", "aj, politi¢ko ili drugo uvjerenje.\n\n(4) U Republici Hrvatskoj razvoj sporta potic¢e se izgradnjom 1 odrzavanjem sportskih\ngradevina, Skolovanjem 1 usavrSavanjem strucnog kadra, znanstvenim projektima u podrucju\nsporta, gospodarskim mjerama, stimuliranjem partnerstva vladinih 1 nevladinih organizacija u\nsportu te privatnog poduzetniStva 1 financiranjem sporta sredstvima drzave, jedinica lokalne 1\npodruéne (regionalne) samouprave 1 Grada Zagreba.\n\n", "1. NACIONALNI PROGRAM SPORTA\nClanak 2.\n\n(1) Nacionalni program sporta je dokument kojim se utvrduju ciljevi 1 zadace razvoja sporta,\naktivnosti potrebne za provedbu tih ciljeva 1 zadaca te odreduju nositelji razvoja 1 mjere\nkontrole njegove provedbe.\n\n(2) Nacionalni program sporta donosi Hrvatski sabor na prijedlog Vlade Republike Hrvatske\nza razdoblje od osam godina.\n\n(3) Nacionalni program sporta mora sadrzavati:\n\n1. programe stvaranja uvjeta z", "a bavljenje sportom u odgojno-obrazovnom sustavu,\n\n2. programe stvaranja uvjeta za postizanje vrhunskih rezultata hrvatskih sportaSa na\nmedunarodnim natjecanjima,\n\n3. programe stvaranja uvjeta za rekreativno bavljenje sportom radi zaStite 1 poboljSanja\nzdravlja gradana Republike Hrvatske.\n\n(4) Nacionalnim programom sporta utvrduju se obveze drzavnih tiela 1 tijela jedinica lokalne\n1 podrucne (regionalne) samouprave 1 Grada Zagreba, Hrvatskoga oli", "mp1jskog odbora,\nHrvatskoga paraolimpijskog odbora, Hrvatskoga sportskog saveza gluhih, nacionalnih\nsportskih saveza 1 sportskih zajednica u provedbi utvrdenih zadaéa.\n\n(5) Na temelyu Nacionalnog programa sporta, Nacionalno vijece za sport donosi GodiSnj1\nprogram provedbe.\n\n(6) Za svaku zadacu Godisnjeg programa provedbe Nacionalnog programa sporta utvrduju se\nnositelji pripreme 1 provedbe, rokovi, izvori financiranja 1 procjena ucinaka.\n(7) Sred", "stva za provedbu Nacionalnog programa sporta osiguravaju se u drzavnom proracunu\nu razdjelu ministarstva nadleznog za poslove sporta (u daljnjem tekstu: ministarstvo).\n\n(8) Tyela iz stavka 4. ovoga Clanka dostavljaju ministarstvu izvjeS¢éa o izvrSenju utvrdenih\nobveza 1 zadaéa.\n\n(9) IzvrSenje dijela Nacionalnog programa sporta koji se provodi u jedinicama lokalne 1\npodruéne (regionalne) samouprave 1 Gradu Zagrebu sufinancira se 1z proracuna tih j", "edinica.\n\nIll. NACIONALNO VIJECE ZA SPORT\nClanak 3.\n\n(1) Nacionalno vijece za sport najviSe je strucno 1 savjetodavno tielo koje se brine za razvoj 1\nkvalitetu sporta u Republici Hrvatskoj.\n\n(2) Nacionalno vijece za sport:\n\n1. raspravlja o pitanjima od znacaja za sport te predlaze 1 poti¢e donoSenje mjera za\nunapredenje sporta,\n\n2. daje miSljenje Vladi Republike Hrvatske o nacrtu prijedloga Nacionalnog programa sporta,\n3. daje miSljenje o priorit", "etnim projektima, elaboratima 1 studijama koje Ce se financirati u\nsustavu javnih potreba u sportu,\n\n4. utvrduje smjernice za izradu propisa 0 kategorizaciji sportaSa,\n\n5. daje misljenje 0 programima osposobljavanja za strucni rad u sportu 1 predlaze uvjete koje\nmoraju ispuniti ustanove za osposobljavanje kadra u sportu,\n\n6. utvrduje smjernice za izradu propisa koji se odnose na izgradnju 1 kategorizaciju sportskih\ngradevina na razini drzave,\n\n7.", " daje miSljenja 1 preporuke na nacrte prijedloga propisa koji se odnose na sport,\n\n8. daje mi8ljenje o nacrtu prijedloga mreze sportskih gradevina,\n\n9. na trazenje ministarstva nadleznog za poslove sporta daje prethodno misljenje 0 postojanju\ninteresa za prijem u hrvatsko drzavljanstvo fizicke osobe u sustavu sporta koji je strani\ndrzavljanin,\n\n10. obavlja 1 druge poslove utvrdene ovim Zakonom 1 drugim propisima.\n\nClanak 4.\n\n(1) Nacionalno vijece", " za sport ima predsjednika 1 dvanaest Clanova, koje imenuje 1 razrjeSava\nHrvatski sabor i to predsjednika 1 Sest Clanova na prijedlog Vlade Republike Hrvatske, tri\nClana na prijedlog Hrvatskoga olimpijskog odbora, jednog Clana na prijedlog Hrvatskoga\nparaolimpijskog odbora, jednog Clana na prijedlog Hrvatskoga sportskog saveza gluhih 1\njednog Clana na prijedlog Kinezioloskog fakulteta Sveucilista u Zagrebu.\n\n(2) Hrvatski sabor, sukladno stavku 1.", " ovoga Clanka, svake dvije godine imenuje po Sest\nClanova Nacionalnog vijeca za sport, a predsjednika imenuje svake Cetiri godine.\n\n(3) Hrvatski sabor razrieSit Ce Clana Nacionalnog vijeca za sport na prijedlog tijela koje ga je\npredlozilo ili na priyedlog Nacionalnog vijeca za sport ako ¢lan Nacionalnog vijeca sam\nzatrazi razrjeSenje ili ne ispunjava svoju duznost.\n\n(4) Nacionalno vijece za sport na svoje sjednice poziva ministra nadleznog za sp", "ort (u\ndaljnjem tekstu: ministar) te po potrebi druge Clanove Vlade Republike Hrvatske koji mogu\nsudjelovati na raspravi bez prava glasa.\n\n(5) Za raspravu o nekom pitanju ili za pracenje nekog podrucja sporta Nacionalno vijece za\nsport moze osnovati radno tijelo u cijem radu mogu sudjelovati 1 osobe koje nisu Clanovi\nNacionalnog vijeca za sport.\n\n(6) Za svoj rad Nacionalno vijece za sport odgovorno je Hrvatskom saboru kojem najmanje\njednom godisn", "je podnosi izvjeSce.\n\n(7) Administrativne poslove za Nacionalno vijece za sport obavlja ministarstvo.\n\n(8) Nacionalno vijece za sport donosi poslovnik o svom radu.\n\n1. SUSTAV SPORTA I SPORTSKE DJELATNOSTI\nOsobe u sustavu sporta\nClanak 5.\n\n(1) Sustav sporta u Republici Hrvatskoj Cine:\n\n— fizicke osobe,\n\n— pravne osobe 1\n\n— §kolska sportska druStva koja se osnivaju bez pravne osobnosti.\n(2) Fizi¢ke osobe u sustavu sporta jesu:\n\n— sportasi,\n\n— trene", "ri,\n\n— osobe osposobljene za rad u sportu,\n\n— osobe koje sudjeluju u organiziranju 1 vodenju sportskog natjecanja (sportski sudac, sportski\ndelegat 1 sportski povjerenik) 1\n\n— menadZeri u sportu.\n\n(3) Pravne osobe u sustavu sporta su:\n\n— udruge,\n\n— trgovacka druStva 1\n\n— ustanove.\n\nFizicke osobe u sustavu sporta\nSportas\nClanak 6.\n\n(1) SportaSica odnosno sportaS (u daljnjem tekstu: sportaS), u smislu ovoga Zakona, osoba je\nkoja se priprema 1 sudje", "luje u sportskim natjecanjima:\n\n— kao Glan pravne osobe koja obavlja sportsku djelatnost sudjelovanja u sportskim\nnatjecanjima,\n\n— kao osoba koja obavlja samostalnu sportsku djelatnost sudjelovanja u sportskim\nnatjecanjima.\n\n(2) SportaS koji u skladu s odredbom stavka 1. podstavka 1. ovoga ¢lanka sudjeluje u\nsportskim natjecanjima kao Clan pravne osobe moZe imati status profesionalnog sportaSa ili\namatera.\n\n(3) Vrhunski (I., I. 1 HI. kategoria), ", "vrsni ([V. kategorija) il1 daroviti sportas (V. 1 VI.\nkategorya) (u daljnjem tekstu: kategorizirani sportaS) je osoba kojoj je na temelju ostvarenih\nsportskih rezultata 1zdano rjeSenje o razvrstavanju sportaSa u odredenu kategoriju od strane\nHrvatskoga olimpijskog odbora, odnosno Hrvatskoga paraolimpijskog odbora, odnosno\nHrvatskoga sportskog saveza gluhih. Zahtjev za razvrstavanje sportaSa u odredenu kategoriju\nHrvatskom olimpijskom odboru, Hrva", "tskom paraolimpijskom odboru, odnosno Hrvatskom\nsportskom savezu gluhih podnosi sporta8, a podaci navedeni u zahtjevu moraju biti prethodno\novjerovljeni od sportskog kluba ¢1ji je Clan 1 pripadajucega nacionalnoga sportskog saveza.\n(4) Hrvatskom olimpijskom odboru, Hrvatskom paraolimpijskom odboru, odnosno\nHrvatskom sportskom savezu gluhih povjerava se kao javna ovlast utvrdivanje kategorija\nsportaSa 1 donoSenje rjeSenja 0 kategorizaciji sportaSa", ". SportaS se razvrstava u odredenu\nkategoryju s prvim danom sljedeceg mjeseca nakon Sto je ostvario rezultat na temelju kojeg\nstjece pravo na odredenu kategoriju.\n\n(5) Kategorizirani sportaS se upisuje u Registar kategoriziranih sportaSa koji ustrojava 1 vodi\nHrvatski olimpijski odbor, Hrvatski paraolimpijski odbor, odnosno Hrvatski sportski savez\ngluhih.\n\n(6) RjyeSenje iz stavka 4. ovoga Clanka jest upravni akt protiv kojega se zalba podnosi\nmin", "istarstvu.\n\nClanak 7.\n\n(1) Sportas ima pravo na koriStenje sportskih gradevina, usluga strucnog rada, naknadu za\nputne troSkove, naknadu za troSkove smjeStaja 1 prehranu u vrijeme natjecanja 1 priprema,\nnaknadu za pojacanu prehranu 1 nagrade za sportska ostvarenja sukladno propisu, op¢em aktu\nili odluci nadleznog tiyela.\n\n(2) Nagradama za sportska ostvarenja sportaSa smatraju se nagrade odredene prema aktu o\nkategorizaciji sportaSa 1 pravilniku o", " mjerilima za dodjelu nagrada koji donosi ministar na\nprijedlog Hrvatskoga olimpijskog odbora, odnosno Hrvatskoga paraolimpijskog odbora,\nodnosno Hrvatskoga sportskog saveza gluhih, a koje isplacuju Hrvatski olimpijski odbor,\nHrvatski paraolimpijski odbor, Hrvatski sportski savez gluhih, sportski savezi na razini\ngradova 1 Zupania, odnosno nacionalni sportski savezi, Zupanijske 1 gradske sportske\nzajednice te sportski klubovi.\n\n(3) Kategorizirani", " sportaS ima pravo na sportsku stipendiyu. Stipendie kategoriziranih\nsportaSa isplacuju Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor 1 Hrvatski\nsportski savez gluhih, zupanijske 1 gradske sportske zajednice te sportski klubovi, u skladu s\nnjihovim op¢cim aktima.\n\n(4) Kategorizirani sportaS moze upisati, pohadati 1 zavrSiti osnovno 1 srednjoSkolsko\nobrazovanje prema posebnim uvjetima koje pravilnikom propisuje ministar, a visokoSkolsko", "\nobrazovanje samo ako to nye protivno nacelima autonomije sveucilista.\n\n(5) Sportas koji je nastupajuci za Republiku Hrvatsku osvojio medalju na olimpijskim igrama,\nparaolimpijskim igrama 1 olimpijskim igrama gluhih ima pravo na subvenciju Skolarine za\nstudij na visokom u¢ilistu. Sredstva za Skolarinu ¢e se osigurati u drzavnom proracunu.\n\nClanak 8.\n\n(1) Sudjelovanje u sportskim natjecanjima smatra se profesionalnim ako sportaS koji sudjeluje\nu s", "portskim natjecanjima ima sklopljen ugovor o profesionalnom igranju ili ugovor o radu sa\nsportskim klubom ili ako sportaS obavlja samostalnu sportsku djelatnost sudjelovanja u\nsportskim natjecanjima.\n\n(2) Sportas koji profesionalno sudjeluje u sportskim natjecanjima prema stavku |. ovoga\nClanka je osoba kojoj je bavljenje sportom osnovno zanimanje 1 kojemu se po toj osnovi\nuplacuje doprinos za obvezna osiguranja u skladu s posebnim propisima.\n\n(3", ") Status profesionalnog sportaSa kao 1 njegova prava 1 obveze ureduju se aktima\nnacionalnoga sportskog saveza.\nTrener\nClanak 9.\n\n(1) Trener, u smislu ovoga Zakona, osoba je koja programira 1 provodi sportsku pripremu,\nsportsku rekreaciju 1 sportsku poduku.\n\n(2) Trener mora imati stru¢nu spremu najmanje na razini trenera prvostupnika sukladno\nposebnom propisu.\n\n(3) Poslove trenera moze obavljati 1 osoba:\n\n— koja je za te poslove osposobljena putem", " ustanove za osposobljavanje kadra na temelju\nprograma za stjecanje licenciye krovnih svjetskih ili europskih udruzenja odredenog sporta,\n\n— koja je osvojila medalju na olimpijskim igrama, svjetskim ili europskim seniorskim\nprvenstvima, a strucno je osposobljena putem ustanove za osposobljavanje kadra u sportu,\n\n— koja je poslove trenera obavljala najmanje 15 godina do dana stupanja na snagu ovoga\nZakona, a strucno je osposobljena putem ustanove ", "za osposobljavanje kadra u sportu.\n\n(4) Iznimno, ako pravna osoba koja je registrirana za obavljanje sportskih djelatnosti nema\nmogucnosti zaposliti osobu koja ispunjava uvjete za obavljanje strucnih poslova 1z stavka 2. 1\n3. ovoga Clanka, a obavljanje poslova ne trpi odgodu, te poslove moze privremeno obavljati 1\nosoba koja je osposobljena putem ustanove za osposobljavanje kadra u sportu.\n\n(5) Trener 1 osobe 1z stavka 2. 13. ovoga Clanka imaju p", "ravo na nagrade za sportska\nostvarenja.\n\nOsoba osposobljena za rad u sportu(instruktor, voditelj i sl.)\nClanak 10.\n\nOsobom osposobljenom za rad u sportu smatra se osoba koja poduéava gradane osnovnoj\ntehnici pojedinog sporta ili provodi sportsku rekreaciju gradana, a osposobljena je za taj rad\nputem ustanove za osposobljavanje kadra u sportu, s time da sportsku-rekreaciju gradana\nmoze provoditi samo na temelju programa kojega je izradila osoba ko", "ja ima najmanje strucnu\nspremu propisanu za trenera prvostupnika.\n\nOsoba koja sudjeluje u organiziranju i vodenju sportskog natjecanja\nClanak 11.\n\n(1) Osoba koja sudjeluje u organiziranju 1 vodenju sportskog natjecanja (sportski sudac,\nsportski delegat 1 sportski povjerenik), u smislu ovoga Zakona, osoba je koja ispunjava uvjete\npropisane pravilima odgovarajucega nacionalnog saveza.\n\n(2) Sportski sudac 1z stavka 1. ovoga Clanka koji sudjeluje u o", "rganiziranju 1 vodenju sportskog\nnatjecanja u sportovima za koje je, sukladno ovome Zakonu, propisana obveza preoblikovanja\nsportskih klubova-udruga za natjecanje u sportska dioni¢ka druStva (u daljnjem tekstu: §.d.d.)\nkao i osoba koja je to bila u posljednjih tri godine, ne moZe biti:\n\n— €lan tijela sportskog kluba-udruge za natjecanje kao ni Clan uprave ili nadzornog odbora\nS.d.d.-a,\n\n— €lan saveza iz Clanka 46. 1 47. ovoga Zakona,\n\n— osoba ovl", "astena za zastupanje sportskih klubova-udruga za natjecanje, S§.d.d.-a 1 saveza 1z\nClanka 46. 147. ovoga Zakona.\n\nMenadZer u sportu\nClanak 12.\n\n(1) Menadzer u sportu, u smislu ovoga Zakona, osoba je koja je prema pravilima nacionalnog\nsaveza ovlaStena obavljati poslove posredovanja prelaska sportaSa 1z jednoga sportskog kluba\nu drugi sportski klub.\n\n(2) Sve odredbe ovoga Zakona koje se odnose na menadzere u sportu 1z stavka 1. ovoga\nClanka odnose", " se 1 na sve fizicke osobe 1 pravne osobe koje imaju sklopljene ugovore o\nulaganju u sportaSe, odnosno trenere u sustavu sporta na temelju kojih imaju pravo na dio\nprihoda koji proizlaze 1z obavljanja njihove djelatnosti, a koji po svojem sadrzaju odgovaraju\nposlovima menadzZera u sportu 1z stavka 1. ovoga Clanka.\n\nPravne posljedice pravomoéne osude, vodenja kaznenog i prekrSajnog postupka\nClanak 13. (NN 85/15, 19/16)\n\n(1) Osoba pravomoéno osuden", "a na kaznu zatvora u trajanju od najmanje Sest mjeseci za neko\nod kaznenih djela pocinjenog s namjerom, a nie primijenjena uvjetna osuda, ne moze\nsudjelovati u sportskim natjecanjima, organizirati 1 voditi sportska natjecanja, obavlyati\nstrucne poslove u sportu, sudjelovati u radu skupStine ili tijela upravljanja sportske udruge ili\ntrgovackog druStva, niti moze biti ovlaStena za zastupanje te pravne osobe.\n\n(2) Pravna osoba duzna je raskinuti ug", "ovor o radu ili drugi ugovor na temelju kojeg osoba iz\nstavka 1. ovoga Clanka obavlja poslove ili sportsku djelatnost, odnosno razrijesiti je duznosti 1\nfunkcija u roku od osam dana od saznanja za pravomocnu presudu 1 0 tome obavijestiti\nregistarsko tijelo. Na prestanak ugovora o radu primjenjuju se opci propisi o radu.\n\n(3) Osoba protiv koje je pokrenut kazneni postupak zbog kaznenog djela pocinjenog na Stetu\ndjeteta, odnosno maloljetnika udalji", "t Ce se od obavljanja poslova u sportu u kojima dolazi u\nkontakt s djecom, odnosno maloljetnicima do pravomoécnosti presude, odnosno obustave\npostupka.\n\n(4) Osoba koja je u posljednje tri godine pravomoéno kaznjena za prekrSaj u sportu 1 na\nsportskim natjecanjima prema odredbama ovoga Zakona 1 posebnih propisa kojima se\npropisuju prekrSaji u sportu 1 na sportskim natjecanjima, ne moze organizirati 1 voditi sportska\nnatjecanja, obavljati strucne p", "oslove u sportu, sudjelovati u radu skupStine ili tiyela\nupravljanja sportske udruge ili trgovackog druStva niti moze biti ovlaStena za zastupanje te\npravne osobe.\n\nPravne osobe u sustavu sporta\n\nSportske udruge\n\nClanak 14.\n\n(1) Sportskim udrugama, u smislu ovoga Zakona, smatraju se one udruge koje se osnivaju\nradi obavljanja sportskih djelatnosti propisanih ovim Zakonom.\n\n(2) Sportske udruge su i udruge iz glave V. ovoga Zakona.\n(3) Na osnivanje", ", ustroj, pravni polozaj, registraciju 1 prestanak udruga 1z stavka 1.12. ovoga\nClanka primjenjuju se odredbe Zakona o udrugama, ako neka od tih pitanja ovim Zakonom\nnisu drugacije odredena.\n\nTrgovacka druStva\nClanak 15.\n\n(1) Trgovacko druStvo, u smislu ovoga Zakona, druStvo je registrirano za obavljanje sportskih\ndjelatnosti propisanih ovim Zakonom. Ako trgovacko druStvo obavlja sportsku djelatnost\nsudjelovanja u sportskim natjecanjima mora imat", "i pravni oblik dioni¢kog druStva (8.d.d.)\nsukladno ovome Zakonu.\n\n(2) Na osnivanje trgovackih druStava 1z stavka 1. ovoga Clanka primjenjuje se Zakon o\ntrgovackim druStvima, osim u dijelu koji je ovim Zakonom drugaciye odreden.\n\nUstanove\nClanak 16.\n\n(1) Za trajno obavljanje sportskih djelatnosti sportske rekreacije, sportske poduke, upravljanja\n1 odrzavanja sportske gradevine mogu se osnivati ustanove.\n\n(2) Ustanove iz stavka 1. ovoga Clanka osni", "vaju se 1 djeluju u skladu s odredbama Zakona o\nustanovama.\n\n(3) Ustanove 1z stavka 1. ovoga lanka duzne su donyeti akt kojim se ureduju uvjeti 1 nacin\nobavljanja navedenih sportskih djelatnosti, odnosno ostvarivanje programa sportske\ndjelatnosti 1 dostaviti ga ministarstvu radi vodenja evidencyye.\n\nSkolska sportska druStva\nClanak 17.\n\n(1) Radi provodenja izvannastavnih sportskih aktivnosti ucenika, Skolski odbori u osnovnim 1\nsrednjim Skolama os", "nivaju Skolska sportska druStva bez pravne osobnosti.\n\n(2) Sredstva za rad 1 aktivnosti Skolskoga sportskog druStva osiguravaju se 1z drzavnog\nproracuna 1 1z proracuna jedinica lokalne 1 podrucne (regionalne) samouprave 1 Grada\nZagreba na racun Skole.\n\n(3) Skolska sportska druStva za rad i aktivnosti koriste prostore Skole i imaju prioritet u\nnjihovom koriStenju u odnosu na vanjske korisnike prostora Skole.\n\n(4) Ministar pravilnikom propisuje nac", "in osnivanja, zadace, djelokrug 1 nacin rada Skolskih\nsportskih druStava.\n\nSportske djelatnosti\nClanak 18.\n\n(1) Sportske djelatnosti, u smislu ovoga Zakona, jesu:\n— sudjelovanje u sportskom natjecanju,\n\n— sportska priprema,\n\n— sportska rekreacija,\n\n— sportska poduka,\n\n— organiziranje sportskog natjecanja,\n— vodenje sportskih natjecanja 1\n\n— upravljanje 1 odrzavanje sportskom gradevinom.\n\n(2) Sportskom djelatnoScu smatraju se 1 organizirane izvann", "astavne Skolske sportske\naktivnosti i studentske sportske aktivnostt.\n\n(3) Je li neka djelatnost sportska djelatnost, u smislu ovoga Zakona, u slucajyu sumnje utvrduje\nministarstvo uz prethodno misljenje Hrvatskog olimpijskog odbora.\n\nClanak 19.\n\n(1) Sportsku djelatnost sudjelovanja u sportskom natjecanju mogu obavljati fizi¢ke osobe koje\nobavljaju samostalnu djelatnost sudjelovanja u sportskom natjecanju 1 pravne osobe koje su za\nto posebno regi", "strirane (sportski klubovi), a to mogu biti:\n\n— sportske udruge za natjecanje 1\n\n— sportska dioni¢ka druStva.\n\n(2) Sportsku djelatnost sportske pripreme, sportske rekreacije 1 sportske poduke mogu\nobavljati fizicke 1 pravne osobe sukladno odredbama ovoga Zakona.\n\n(3) Sportsku djelatnost organiziranja 1 vodenja sportskog natjecanja mogu obavljati sportske\nudruge 1 trgovacka druStva sukladno odredbama ovoga Zakona.\n\n(4) Sportsku djelatnost upravlja", "nja 1 odrzavanja sportskih gradevina mogu obavljati pravne\nosobe sukladno odredbama ovoga Zakona.\n\nRegistar sportskih djelatnosti\nClanak 20.\n\n(1) Fizi¢ke osobe 1 pravne osobe koje obavljaju sportske djelatnosti upisuju se u registre\nsportskih djelatnosti koje vode uredi drzavne uprave u Zupaniji, odnosno Gradu Zagrebu\nprema sjedistu pravne, odnosno prebivaliStu fizi¢ke osobe.\n\n(2) Ministar pravilnikom propisuje sadrzaj, nacin vodenja te postupak ", "upisa 1 brisanja 1z\nRegistra 1z stavka 1. ovoga €lanka.\n\nPravne osobe koje obavljaju sportske djelatnosti\nClanak 21.\n\nPravne osobe koje obavljaju sportske djelatnosti morayju:\n\n— imati pravo koristenja odgovarajuce sportske gradevine,\n\n— ugovoriti obavljanje strucnih poslova sa za to odgovarajucim Skolovanim odnosno strucno\nosposobljenim osobama u skladu s ovim Zakonom,\n\n— ispunjavati 1 druge uvjete prema pravilima odgovarajucega nacionalnoga spo", "rtskog saveza.\n\nFizicke osobe koje samostalno obavljaju sportske djelatnosti\nClanak 22.\n\n(1) Fizi¢ke osobe mogu samostalno obavljati sportske djelatnosti sudjelovanja u sportskim\nnatjecanjima, sportske pripreme, sportske rekreacije 1 sportske poduke.\n\n(2) Fizi¢ke osobe mogu samostalno obavljati sportske djelatnosti sportske pripreme, sportske\nrekreacije 1 sportske poduke ako:\n\n— imaju opcu, a po potrebi 1 posebnu zdravstvenu sposobnost,\n— imaju o", "dgovarajucu strucnu spremu, odnosno strucnu osposobljenost u skladu s ovim\nZakonom.\n\n(3) Fizi¢ke osobe mogu samostalno obavljati sportsku djelatnost sudjelovanja u sportskim\nnatjecanjima ako:\n\n— imaju opcu, a po potrebi 1 posebnu zdravstvenu sposobnost,\n\n— imaju navrSenih Sesnaest godina,\n\n— imaju status kategoriziranog sportaSa u skladu s ovim Zakonom,\n\n— ispunjavaju posebne uvjete prema pravilima odgovarajucega nacionalnoga sportskog\nsaveza.\n\nO", "bavljanje sportske djelatnosti sudjelovanja u sportskom natjecanju\nSportski klub\nClanak 23.\n\n(1) Sportski klub 1z Clanka 19. stavka 1. ovoga Zakona koji obavlja sportsku djelatnost\nsudjelovanja u sportskim natjecanjima, neovisno 0 pravnom obliku (sportska udruga za\nnatjecanje ili §.d.d.), moze imati profesionalni il1 amaterski status.\n\n(2) Sportski klub moze obavljanje pojedinih ili svih poslova, osim obavljanja djelatnosti\nsudjelovanja u sportsk", "im natjecanjima, povjeriti trgovackom druStvu u odnosu na koje se on\nsmatra vladajucim, u smislu odredaba Zakona o trgovackim druStvima 0 povezanim\ndrustvima, odnosno na koje on ima prevladavajuci utjecaj.\n\n(3) Sportski klub 1 trgovacko druStvo iz stavka 2. ovoga ¢lanka solidarno su odgovorni za\nobveze koje nastanu u njihovom poslovanju.\n\n(4) Sportski klubovi 1z stavka 1. ovoga €lanka razlicitih sportova mogu se udruZzivati u\nsportska druStva.\n\nP", "rofesionalni status sportskih klubova\nClanak 24.\n\n(1) Profesionalni status, u smislu ovoga Zakona, ima onaj sportski klub koji je osnovan radi\nobavljanja sportske djelatnosti sudjelovanja u sportskom natjecanju, ako uvjete 1z Clanka 8.\nstavka 1. ovoga Zakona zadovoljava vise od 50% registriranih sportaSa u seniorsko}\nkonkurenciji, u odnosu na broj prijavljenih sportaSa za natjecateljsku godinu na listi koju vodi\nodgovarajuci nacionalni sportski s", "avez ili ako ispunjava uvjete za stjecanje profesionalnog\nstatusa sukladno pravilima odgovarajucega nacionalnoga sportskog saveza (u daljnjem tekstu:\nprofesionalni sportski klub).\n\n(2) Profesionalni sportski klub 1z stavka 1. ovoga ¢lanka obvezno se upisuje u Registar\nprofesionalnih sportskih klubova koji vodi ministarstvo.\n\n(3) O upisu u Registar donosi se rjeSenje u roku od mjesec dana od dana podnoSenja zahtjeva\nza upis.\n\n(4) Ako nakon upisa u", " Registar profesionalnih sportskih klubova profesionalni sportski klub\nprestane ispunjavati uvjete 1z stavka 1. ovoga Clanka, ministar ¢e donijeti rjeSenje o brisanju 1z\nRegistra.\n\n(5) Ministar pravilnikom propisuje sadrzaj, nacin vodenja te postupak upisa 1 brisanja 1z\nRegistra.\n(6) Profesionalni sportski klub je obvezan Povjerenstvu za profesionalne sportske klubove iz\nClanka 26. ovoga Zakona podnositi jednom godiSnyje:\n\n—racun dobiti 1 gubitka", ",\n\n— 1zvjeS¢e oO registriranim sportaSima seniorske moméadi,\n\n— 1zvjeSce o Clanovima kluba 1 Clanovima tiela kluba,\n\n— plan poslovanja u iducoj poslovnoj godini,\n\n— godisnje financijsko izvjeSce 1\n\n— revizorsko izvjeSce.\n\n(7) Posljedice nepoStivanja obveza iz stavka 6. ovoga Clanka utvrduje nacionalni savez svojim\nopcim aktom.\n\nIspunjavanje novéanih obveza profesionalnoga sportskog kluba\nClanak 25.\n\nNovéane obveze profesionalnih sportskih klubova", " koje proizlaze iz kredita, zajmova ili drugih\npravnih poslova, prema vjerovnicima koji su njegovi Clanovi odnosno dioniéari, Clanovi tiela\nodnosno uprave ili nadzornog odbora mogu se podmirivati tek nakon podmirenja dospjelih\nobveza prema ostalim vjerovnicima.\n\nPovjerenstvo za profesionalne sportske klubove\nClanak 26.\n\n(1) Povjerenstvo za profesionalne sportske klubove (u daljnjem tekstu: Povjerenstvo) osniva\nse kao strucno tijelo radi pracenja ", "obavljanja djelatnosti profesionalnih sportskih klubova.\n(2) Povjerenstvo ima sedam Clanova koje imenuje ministar:\n\n— dva promjenljiva Clana na prijedlog nacionalnoga sportskog saveza ¢iji je Clan profesionalni\nsportski klub na koji se odnosi odluka koju Povjerenstvo treba donijeti,\n\n— jednog stalnog Clana Povjerenstva na prijedlog Hrvatskoga olimpijskog odbora,\n\n— €etiri stalna Clana 1z reda istaknutih stru¢njaka u podrucju sporta 1 sportaSa.\n\n(", "3) Mandat Clanova Povjerenstva traje Cetiri godine.\n\n(4) Povjerenstvo osobito obavlja sljedece poslove:\n\n— vodi evidencijyu o dokumentaciji koyu su mu duzni slati profesionalni sportski klubovi,\n\n— daje suglasnost na izbor revizora 1z Clanka 40. stavka 2. ovoga Zakona,\n\n— daje prethodnu suglasnost na rjeSenje 1z lanka 41. stavka 2. ovoga Zakona,\n\n— daje suglasnost na elaborat 1z Clanka 43. stavka 8. ovoga Zakona,\n\n— daje dopuStenje 1z Clanka 44. ", "stavka 3. tocéke 5. ovoga Zakona,\n\n— utvrduje iznos temeljnoga kapitala u slucaju obveznog ili dragovoljnog preoblikovanja\nsportskog kluba-udruge u §.d.d.,\n\n— vodi evidenciju 0 imateljima dionica u §.d.d.-u,\n\n— prima obavijesti o stjecanju dionica 1z Clanka 33. ovoga Zakona,\n\n— daje suglasnost na stjecanje dionica 1z Clanka 32. ovoga Zakona,\n\n— daje obavijesti o stjecanju dionica 1z Clanka 32. 133. ovoga Zakona nacionalnom sportskom\nsavezu Ciji j", "e Clan §.d.d. u kojem su dionice steéene,\n\n— predlaze pokretanje stecajnog postupka 1z Clanka 45. ovoga Zakona.\n\n(5) Odluke Povjerenstva donose se vecinom od najmanje pet glasova.\n\n(6) Djelokrug 1 nacin rada Povjerenstva poblize se ureduje pravilnikom koji donosi ministar.\n\nSportski klub-udruga za natjecanje\nClanak 27.\n\n(1) Sportska udruga osnovana radi obavljanja sportske djelatnosti sudjelovanja u sportskom\nnatjecanju (u daljnjem tekstu: sports", "ki klub-udruga za natjecanje) obvezno u nazivu sadrzi\nrijeci »sportski klub« ili ispred rijeci »klub« naziv sporta u kojem obavlja djelatnost.\n\n(2) Iznimno, sportski klub-udruga za natjecanje koji se tradicionalno naziva druStvom, a\nosnovan je za natjecanje u jednom sportu, moze koristiti 1 taj naziv uz naziv sporta u kojem se\nnatjece.\n\n(3) Clanovi tijela sportskog kluba-udruge za natjecanje, osobe ovlaStene za zastupanje te\nosobe ovlaStene za vo", "denje poslova po odluci ovlastenog tijela il1 na temelju opcih akta\nsportskog kluba-udruge za natjecanje ne mogu biti osobe:\n\n— koje ne mogu biti ¢lanovi uprave odnosno nadzornog odbora dioni¢kog druStva prema\nodredbama Zakona o trgovackim druStvima 1 zakona kojim se ureduje sprjecavanje sukoba\n\ninteresa u obnaSanju javnih duznosti,\n\n— koje su u posljednje tri godine pravomoéno kaznjene za kaznena djela ili prekrSaje u sportu 1\nu vezi sa sportom,", " kao ni osobe 1z ¢lanka 13. ovoga Zakona,\n\n— koje su Clanovi drugih sportskih klubova — udruga za natjecanje istoga sporta,\n\n— koje su dioni¢ari s.d.d.-a istoga sporta,\n\n— koje su Clanovi tela, osobe ovlaStene za zastupanje te osobe ovlaStene za vodenje poslova\npo odluci ovlaStenog tiela ili na temelyu opcih akta sportskog kluba — udruge za natjecanje\nistoga sporta,\n\n— koje su Clanovi tyela s.d.d.-a istoga sporta,\n\n— koje svojim djelovanjem mogu ", "neposredno utjecati na sustav natjecanja u odgovarajucem\nsportu, a osobito sporta8i koji su profesionalni prema Clanku 8. ovoga Zakona, menadZeri u\n\nsportu, kao i osobe koje su to bile u razdoblju od posljednjih godinu dana,\n\n— €lanovi pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica, kao i\nosobe koje su to obavljale posljednje tri godine,\n\n— €lanovi tyela pravnih osoba koje obavljaju djelatnost organiziranja sportskih k", "ladionica, kao\n1 osobe koje su to bile posljednje tri godine,\n\n— koje s menadZerima u sportu 1 €lanovima pravnih osoba te ¢lanovima tiela pravnih osoba\nkoje obavljaju djelatnost organiziranja sportskih kladionica djeluju zajednicki u smislu ¢lanka\n\n34. stavka 3. ovoga Zakona,\n\n— ovlaStene za zastupanje u pravnoj osobi koja sukladno Clanku 12. stavku 2. ovoga Zakona\nima sklopljene ugovore o ulaganju u fizicke osobe u sustavu sporta.\n\nSportski klub", "-sportsko dioni¢ko druStvo\n\nPojam sportskoga dioni¢kog druStva\nClanak 28.\n\n(1) Sportski klub-sportsko dioni¢ko druStvo je sportski klub koji se osniva, djeluje 1 prestaje\nprema Zakonu o trgovackim druStvima 1 drugim propisima koji se primjenjuju na dionicka\ndruStva, ako ovim Zakonom nije drugacije odredeno.\n\n(2) Na 8.d.d. ne primjenjyuju se odredbe Zakona o preuzimanju dionickih drustava o obvezno}\nponudi za preuzimanje.\n\n(3) Tvrtka sportskoga di", "oni¢ékog druStva mora sadrzavati rijeci »sportsko dionicko druStvo«, a\nskracena tvrtka oznaku »8.d.d.«.\n\n(4) S.d.d. obavlja sportsku djelatnost sudjelovanja u sportskim natjecanjima, a moZe obavljati\ni druge sportske djelatnosti 1 druge djelatnosti u skladu s odredbama zakona.\n\nNastanak sportskoga dioni¢kog druStva\nClanak 29.\n\n(1) S.d.d. moZe nastati:\n\n1. osnivanjem novoga druStva,\n\n2. preoblikovanjem sportskih klubova-udruga za natjecanje u 8§.d", ".d.\n\n(2) Preoblikovanje sportskih klubova-udruga za natjecanje u §.d.d. moze biti:\n\n1. obvezno,\n\n2. dragovoljno.\n\n(3) Dragovoljno se moze preoblikovati svaki sportski klub-udruga za natjecanje, bez obzira na\nto ima li taj sportski klub-udruga za natjecanje profesionalni ili amaterski status 1 bez obzira\nna sport u kojem se natjece.\n\n(4) Na dragovoljno preoblikovanje sportskih klubova-udruga za natjecanje, na odgovarajuci\nse nacin primjenjuju odre", "dbe ovoga Zakona 0 obveznom preoblikovanju.\n\nTemeljni kapital sportskoga dionickog druStva\nClanak 30.\n\n(1) Temeljni kapital 8.d.d.-a iznosi najmanje 500.000,00 kuna.\n\n(2) Ako se temeljni kapital uplacuje dijelom u novcu, a dijelom u stvarima ili pravima, iznos\niz stavka 1. ovoga ¢lanka mora se uplatiti u novcu u potpunosti prije upisa §.d.d.-a u sudski\nregistar.\n\n(3) Temeljni kapital §.d.d.-a koji nastaje obveznim ili dragovoljnim preoblikovanjem", ", u skladu\ns odredbama ovoga Zakona, utvrduje Povjerenstvo po posebnom postupku, odredenom ovim\nZakonom.\n\n(4) S.d.d. moZe izdati samo redovne dionice na ime s nominalnim iznosom.\n\nClanstvo u sportskom dioniékom druStvu\nClanak 31.\n\n(1) S.d.d. mogu osnovati i biti njegovim élanom domace i strane, fizi¢ke i pravne osobe.\n\n(2) Jedna osoba ne mozZe imati dionice u viSe §.d.d.-a istoga sporta u iznosu viSem od 1%\nukupnoga temeljnog kapitala u bilo koje", "m od tih §.d.d.-a.\n\n(3) Stavak 2. ovoga Clanka ne primjenjuje se na Republiku Hrvatsku niti na jedinice lokalne 1\nregionalne (podrucne) samouprave i Grad Zagreb.\n(4) Dionice u §.d.d, izravno, neizravno ili preko povezanih osoba ne mogu imati osobe ¢1j1\nposlovi 1 djelatnosti mogu neposredno utjecati na sustav natjecanja u odgovarajucem sportu, a\nosobito sportaS1, sportski suci, menadZeri u sportu 1 osobe koje su Clanovi pravnih osoba koje\nobavljaj", "u djelatnost organiziranja sportskih kladionica.\n\n(5) Dionice u §.d.d-u, izravno, neizravno ili preko povezanih osoba ne moZe imati §.d.d. koje\nobavlja djelatnost sudjelovanja u sportskim natjecanjima istoga sporta.\n\nOgranicenje i suglasnost za stjecanje znacajnog sudjelovanja u temeljnom kapitalu\nsportskoga dionickog druStva\n\nClanak 32.\n\n(1) Jedna osoba moZe izravno, neizravno ili preko povezanih osoba u §.d.d.-u imati dionice na\nkoje otpada viS", "e od 25% temeljnoga kapitala §.d.d.-a samo uz suglasnost Povjerenstva.\n\n(2) Pri davanju suglasnosti 1z stavka 1. ovoga Clanka osobito se vodi ra¢una o interesima\n§.d.d.-a sporta, sustava natjecanja u tome sportu te posljedicama koje bi mogle nastati ako\nsuglasnost ne bude dana.\n\nObavjeStavanje o stjecanju znacajnog sudjelovanja u temeljnom Kapitalu sportskoga\ndioni¢ckog druStva\n\nClanak 33.\n\n(1) O svakom stjecanju dionica koje se zajedno s dionica", "ma koje ta osoba vec ima, izravno,\nneizravno ili preko povezanih osoba, odnose na najymanje 5% temeljnoga kapitala §.d.d.-a\nstjecatel] mora bez odgadanja, a najkasnije u roku od osam dana od dana sklapanja pravnog\nposla koji je osnova stjecanja, obavijestiti Povjerenstvo.\n\n(2) O svakom daljnjem stjecanju dionica koje se odnose na najmanje 5% temeljnoga kapitala\n§.d.d.-a stjecatel) mora bez odgadanja, a najkasnije u roku od osam dana od dana sklap", "anja\npravnog posla koji je osnova stjecanja, obavijestit1 Povjerenstvo.\n\nPovezane osobe\nClanak 34.\n\n(1) Smatra se, u smislu ovoga Zakona, da su osobe koje stjecu dionice u §.d.d.-u povezane:\n— ako su ugovorile da uskladeno djeluju u vezi sa stjecanjem dionica 1zdavatelja ili u vezi s\nostvarivanjem prava glasa prema izdavatelju,\n\n— ako jedna od njih drzi dionice za racun druge 111\n\n— ako jedna od njih izravno ili neizravno kontrolira drugu ili dru", "ge pravne osobe.\n\n(2) Smatra se da fizicka ili pravna osoba kontrolira pravnu osobu ako ima:\n\n— izravan ili neizravan vecinski udio u temelynom kapitalu te osobe,\n\n— 1zravnu ili neizravnu ve¢cinu glasackih prava u toj osobi,\n\n— pravo imenovati ili opozvati vecinu Clanova uprave ili nadzornog odbora, odnosno drugog\ntijela koje upravlja ili vodi poslovanje te osobe ili\n\n— na neki drugi nacin prevladavajuci utjecaj na tu osobu.\n\n(3) Smatra se da fiz", "icke osobe djeluju zajednicki ako su u krvnom srodstvu (preci 1 potomc1),\n\nposvojenik.\nPosljedice protupravnog stjecanja dionica\nClanak 35.\n\n(1) Stjecatelj koji je stekao dionice suprotno odredbama ovoga Zakona, duzan je bez\nodgadanja otuditi te dionice koje je stekao, premda na to nye imao pravo. Dok to ne u¢cini, ne\nmoze ostvarivati nikakva prava ni 1z jedne dionice niti u jednom §.d.d-u u kojem drzi dionice.\nPrava iz tih dionica ostvaruje povj", "erenik kojega imenuje Povjerenstvo. Povjerenik ne moze\nbiti osoba na koju se odnose ogranicenje 1 zabrana stjecanja dionica 1z Clanka 32. 133. ovoga\nZakona niti s tom osobom povezane osobe. Povjerenik ne moze biti niti osoba koja je dioniéar\ntoga §.d.d.-a pa bi kroz ostvarivanje prava iz tih dionica, zajedno s dionicama koje ima kao\ndionicar, ta osoba bila obuhvacena obvezom dobivanyja suglasnosti 1z ¢lanka 32. ovoga\nZakona.\n\n(2) Svaka osoba koja", " za to sazna na ikoji na¢in mora obavijest 0 tome da je neka osoba stekla\ndionice suprotno odredbama ¢lanka 32. ovoga Zakona bez odgadanja u pisanom obliku\ndostaviti Povjerenstvu, koje ce o tome izvijestiti 8.d.d.\n\n(3) S.d.d. je duzan bez odgadanja obavijestiti Povjerenstvo 0 sazivanju svake glavne skupStine\nu vrijeme dok prava 1z dionica u §.d.d.-u ostvaruje povjerenik. Povjerenik mora sudjelovati u\nradu glavne skupStine te se na njegov zahtjev ", "u zapisnik s glavne skupStine mora unjjeti\nnapomena da glasuje osoba koja na to nema pravo jer je stekla dionice suprotno odredbama\nClanka 32. ovoga Zakona.\n\nPosljedice neobavjeStavanja o stjecanju znacajnog sudjelovanja u temeljnom kapitalu\nsportskoga dionickog druStva\n\nClanak 36.\n\nAko neka osoba u skladu s €lankom 33. ovoga Zakona ne ispuni svoju obvezu obavjeSstavanja\nPovjerenstva o stjecanju znacajnog sudjelovanja u temeljnom kapitalu §.d.d-a", ", na\nodgovarajuci se nacin primjenjuju posljedice protupravnog stjecanja dionica 1z ¢lanka 35.\novoga Zakona glede ostvarivanja prava u §.d.d-u, imenovanja povjerenika 1 odvijanja glavne\nskupStine §.d.d.-a.\n\nUpotreba dobiti sportskoga dionickog druStva\nClanak 37.\n\n(1) Na upotrebu neto dobiti §.d.d.-a primjenjuju se odredbe Zakona o trgovackim druSstvima,\nako odredbama ovoga Zakona nie odredeno drugacije.\n\n(2) Zakonskim rezervama §.d.d.-a u smislu ", "ovoga Zakona smatraju se 1 posebne zakonske\nrezerve u koje se mora unositi dio neto dobiti 8.d.d.-a, pored iznosa koji se unose u zakonske\nrezerve odredene op¢cim propisima.\n\n(3) U posebne zakonske rezerve §.d.d.-a moraju se unositi 1znosi u visini najmanje polovice\nneto dobiti koja preostane nakon Sto se, sukladno odredbama Zakona o trgovackim druStvima,\npodmire gubici iz ranijih godina te zakonske rezerve.\n\n(4) Posebne zakonske rezerve §.d.d.-a", " 1z stavka 3. ovoga Clanka smiju se koristiti samo za\nobavljanje 1 unapredenje sportske djelatnosti sportske pripreme djece.\n\nClanstvo u tijelima sportskoga dioniékog druStva\nClanak 38.\n\n(1) Ista fizi¢ka osoba moze biti Clan uprave ili nadzornog odbora samo u jednom 8.d.d.-u\nistoga sporta.\n\n(2) Uz osobe koje ne mogu biti Clanovi uprave ili nadzornog odbora dioni¢kog druStva prema\nodredbama Zakona o trgovackim druStvima 1 Zakona o sprecavanju suko", "ba interesa u\nobnaSanju javnih duznosti, Clanovi uprave 1 nadzornog odbora §.d.d.-a ne mogu biti niti osobe:\n— koje su u posljednje tri godine pravomocéno kaznjene za kaznena djela ili prekrSaje u sportu 1\nu vezi sa sportom, kao ni osobe 1z ¢lanka 13. ovoga Zakona,\n\n— koje su Clanovi sportskih klubova-udruga za natjecanje istoga sporta,\n\n— koje su dioniéari §.d.d.-a istoga sporta,\n\n— koje su Clanovi tela, osobe ovlaStene za zastupanje te osobe ov", "laStene za vodenje poslova\npo odluci ovlaStenog tiela ili na temelyu opcih akta sportskog kluba — udruge za natjecanje\nistoga sporta,\n\n— koje su Clanovi tiyela §.d.d.-a istoga sporta,\n\n— koje svojim djelovanjem mogu neposredno utjecati na sustav natjecanja u odgovarajucem\nsportu, a osobito sporta8i, menadzeri u sportu, kao 1 osobe koje su to bile u razdoblyu\nposljednjih godinu dana,\n\n— €lanovi pravnih osoba koje obavljaju djelatnost organiziranja", " sportskih kladionica, kao i\nosobe koje su to bile posljednje tri godine,\n\n— €lanovi tyela pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica, kao\n1 osobe koje su to bile posljednje tri godine,\n\n— koje s menadZerima u sportu 1 €lanovima pravnih osoba te ¢lanovima tijela pravnih osoba\nkoje obavljaju djelatnost organiziranja sportskih kladionica djeluju zajednicki u smislu ¢lanka\n34. stavka 3. ovoga Zakona.\n\n(3) U sluéaju dv", "ojbe, misljenje 0 tome jesu li ispunjeni razlozi zbog kojih neka osoba ne moze\nbiti Clanom uprave ili nadzornog odbora §.d.d.-a, a osobito o tome bi li zbog svojeg djelovanja\nmogle neposredno utjecati na sustav natjecanja u odgovarajyucem sportu, daje Povjerenstvo.\nPovjerenstvo moze miSljenje dati na vlastitu inicijativu ili na prijedlog zainteresirane osobe.\n\nObveza obavjeStavanja Povjerenstva\nClanak 39.\n\n(1) S.d.d. mora Povjerenstvu i pripadaju", "cem nacionalnom sportskom savezu redovito, bez\nodgadanja, slati obavijesti o svim vaznijim poslovnim dogadajima, a osobito o:\n\n— ugovorima koje §.d.d. sklapa sa Clanovima uprave 1 nadzornog odbora §.d.d.-a, osim\nugovora 0 obavljanju poslova Clanova uprave odnosno nadzornog odbora za 8.d.d.,\n\n— ugovorima koje §.d.d. sklapa s dioniéarima §.d.d.-a koji drze najmanje 5 % dionica §.d.d.-a,\n— ugovorima koje §.d.d. sklapa s drugim osobama ¢ije djelovanj", "e moze imati utjecaj na\nobavljanje djelatnosti 8.d.d.-a.\n\n(2) Jednom godisnje 8.d.d. mora Povjerenstvu podnositi sljedece dokumente:\n\n—racun dobiti 1 gubitka,\n\n— izvjeSce oO registriranim sportaSima seniorske moméadi,\n\n— godisnje financijsko izvjeSée,\n\n— plan poslovanja u iducoj poslovnoj godini,\n\n— revizorsko izvjeSce.\n\n(3) Nacin 1 rokove podnoSenja akata 1z stavka 2. ovoga Clanka poblize pravilnikom ureduje\nministar.\nObveza provodenja revizije\n", "Clanak 40.\n\n(1) Profesionalni sportski klubovi iz ¢lanka 24. stavka 1. ovoga Zakona duzni su u roku od\ndva mjeseca od dana dostave rjeSenja 0 upisu u Registar profesionalnih sportskih klubova\nobaviti reviziju, koja se provodi u skladu s odredbama Zakona 0 reviziji.\n\n(2) Zadaéa revizora je utvrditi jesu li ostvareni uvjeti za pokretanje stecajnog postupka\nsukladno posebnim propisima, odnosno uvjeti za obvezno preoblikovanje u sportsko dionicko\ndru", "stvo. U okviru revizije osobito se mora utvrditi popis 1 procjena vrijednosti imovine, popis\nsvih trazbina prema profesionalnom sportskom klubu navedenih prema vrstama vjerovnika 1\nnjihovoj visini, pregled poslovanja profesionalnoga sportskog kluba u proteklih pet godina, uz\nposebno iskazane prihode 1 rashode profesionalnoga sportskog kluba u tome razdoblju,\npoblizi opis na Sto se oni odnose te godiSnje racune dobiti 1 gubitka profesionalnoga spo", "rtskog\nkluba u tome razdoblju, procjenu na razini jedne godine, prava igranja na javnoj sportsko}\ngradevini za koju profesionalni sportski klub ima koncesiju te prema pravilima struke utvrditi\nvrijednost trazbina prema profesionalnom sportskom klubu, a pri Cemu osobito treba voditi\nracuna 0:\n\n— vrijednosti imovine 1 obveze profesionalnoga sportskog kluba,\n\n— sposobnosti profesionalnoga sportskog kluba da podmiruje svoje dospjele obveze,\n\n— okolno", "sti je li profesionalni sportski klub u proteklom razdoblju uredno podmirivao svoje\ndospjele obveze,\n\n— tome moze li iu kojem roku 1 na koji naéin profesionalni sportski klub bez dodatnih\nulaganja uopce podmiriti svoja dugovanja,\n\n— tome kakvo bi, bez dodatnih ulaganja, bilo o¢ekivano poslovanje profesionalnoga sportskog\nkluba u buducnosti, koje se utvrduje prema razumnim gospodarskim mjerilima.\n\n(3) Profesionalni sportski klub obvezan je zatrazi", "ti suglasnost Povjerenstva na izbor revizora.\n(4) Profesionalni sportski klub je obvezan odmah nakon obavljene revizije, dostaviti\nrevizorsko izvjeSce ministarstvu 1 Povjerenstvu.\n\nObveza preoblikovanja sportskog kluba-udruge za natjecanje u sportsko dioni¢ko\ndruStvo\n\nClanak 41.\n\n(1) Sportski klub-udruga za natjecanje mora se preoblikovati u §.d.d. u skladu s odredbama\nClanka 43. 144. ovoga Zakona ako su kumulativno ispunjeni sljedeci uvjet:\n\n1. ", "da se radi 0 profesionalnom sportskom klubu u smislu ¢lanka 24. ovoga Zakona u\nnogometu, koSarci 1 rukometu 1 da je izdano rjeSenje 0 upisu u Registar profesionalnih\nsportskih klubova,\n\n2. da na temelju revizie 1z Clanka 40. ovoga Zakona proizlazi da su se kod sportskog kluba-\nudruge za natjecanje stekli uvjeti za pokretanje stecajnog postupka prema posebnim\npropisima, a on nye pokrenut, odnosno da se postojanje navedenih uvjeta moze utvrditi 1 n", "a\ntemelju dokumenata koje je sportski klub-udruga za natjecanje obvezan slati Povjerenstvu u\nskladu sa Clankom 24. stavkom 6. ovoga Zakona ili da se na temelyu godiSnjega financijskog\nizvjeSca 1 godiSnjega revizorskog izvjeS¢a utvrdi da postoje uvjeti za pokretanje stecajnog\npostupka, a on ne bude pokrenut ni u roku od 30 dana od dana kada su ti uvjeti ostvareni.\n\n(2) Ministar, u roku od mjesec dana od dana dostave revizorskog izvjeSéa 1z Clanka ", "40. stavka\n4. ovoga Zakona, uz prethodnu suglasnost Povjerenstva, rjeSenjem utvrduje da su ispunjeni\nuvjeti za obvezno preoblikovanje 1z stavka 1. ovoga lanka.\n(3) Povjerenstvo je duzno suglasnost 1z stavka 2. ovoga ¢lanka dati u roku od 15 dana od dana\nprimitka revizorskog izvjeSéa ili druge dokumentacie 1z Clanka 24. stavka 6. ovoga Zakona.\n(4) RjeSenje 1z stavka 2. ovoga Clanka je konaéno 1 protiv njega se moze pokrenuti upravni\nspor.\n\n(5) Min", "istar, na prijedlog Povjerenstva za profesionalne sportske klubove, moze donyyjeti\nodluku kojom se pored sportova 1z stavka 1. tocéke 1. ovoga ¢lanka uvodi obveza\npreoblikovanja sportskog kluba-udruge za natjecanje u sportsko dionicko druStvo 1 u nekom\ndrugom sportu.\n\nClanak 42.\n\n(1) Republika Hrvatska moze prenijeti svoje trazbine prema sportskim klubovima-udrugama\nza natjecanje, koje su obvezne preoblikovati se u 8.d.d., na jedinicu lokalne sam", "ouprave, u\nkojoj je sjediste sportskog kluba-udruge za natjecanje, prema posebnom ugovoru o prijenosu\nu kojem ¢e se utvrditi prava 1 obveze ugovornih strana.\n\n(2) Pravne osobe u kojima Republika Hrvatska ima ve¢inski udio ili vecinsko pravo glasa\nmogu prenyeti svoje trazbine prema sportskom klubu-udruzi za natjecanje, koja je obvezna\npreoblikovati se u §.d.d., na jedinicu lokalne samouprave, u kojoj je sjediSte sportskog kluba-\nudruge za natjecan", "je, prema posebnom ugovoru o prijenosu u kojem ¢e se utvrditi prava 1\nobveze ugovornih strana.\n\nPostupak provodenja obveznog preoblikovanja sportskog kluba-udruge za natjecanje u\nS.d.d.\n\nClanak 43.\n\n(1) OvlaSteno tijelo sportskog kluba-udruge za natjecanje 1z Clanka 41. stavka 1. ovoga\nZakona duzno je po dostavi rjeSenja 1z Clanka 41. stavka 2. ovoga Zakona zapoéeti postupak\npreoblikovanja.\n\n(2) Postupak preoblikovanja zapo¢inje izradom elaborata", " koji osobito mora sadrzavati:\n\n1. izvjeSce ovlaStenog revizora o stanju imovine, pravima 1 obvezama sportskog kluba-udruge\nZa natjecanje,\n\n2. popis 1 procjenu vrijednosti imovine te popis svih trazbina prema sportskom klubu-udruzi\nZa natjecanje, navedenih prema vrstama vjerovnika 1 njihovo] visini,\n\n3. utvrdenje revizora o vrijednosti trazbina prema sportskom klubu-udruzi za natjecanje,\n\n4. utvrdenje revizora 0 vrijednosti prava koriStenja sport", "ske gradevine koje moZe biti ulog u\ntemeljni kapital §.d.d.-a,\n\n5. pregled poslovanja sportskog kluba-udruge za natjecanje u proteklih pet godina, uz\nposebno iskazane prihode 1 rashode sportskog kluba-udruge za natjecanje u tome razdoblju,\npoblizi opis na Sto se oni odnose te godiSnje racune dobiti 1 gubitka sportskog kluba-udruge za\nnatjecanje u tome razdoblju,\n\n6. popis Clanova sportskog kluba-udruge za natjecanje,\n\n7. popis Clanova tyela sport", "skog kluba-udruge za natjecanje,\n\n8. opis nadleznosti 1 medusobnog odnosa tijela sportskog kluba-udruge za natjecanje,\n\n9. sportske rezultate sportskog kluba-udruge za natjecanje barem u posljednjih pet\nnatjecateljskih sezona, broj reprezentativaca u svim kategorijama, ugovorne vrijednosti\nsportaSa natjecatelja s kojima sportski klub-udruga za natjecanje ima ugovor, broj mladih\nsportaSa po kategorijama,\n\n10. potencijalne dioni¢are §.d.d.-a, pri C", "emu se posebno iskazuju vjerovnici sportskog kluba-\nudruge za natjecanje, na temelju njihovog o¢itovanja na pisani poziv koji im mora uputiti\nsportski klub-udruga za natjecanje, da iskazu svoj interes za pretvaranjem trazbina u ulog u\nS.d.d.-u,\n\n11. procjenu potrebnih dodatnih sredstava za obavljanje djelatnosti §.d.d.-a,\n\n12. procjenu vrijednosti prava igranja na sportskoj gradevini koju je utvrdio ovlaSteni revizor 1\niskaz jedinice lokalne samo", "uprave, u Cijem je vlasni8tvu predmetna sportska gradevina, o\nroku na koji bi sportski klub-udruga za natjecanje imala pravo igranja,\n\n13. prijedlog iznosa temeljnog kapitala §.d.d.-a,\n\n14. nacrt statuta §.d.d.-a u koje se preoblikuje sportski klub-udruga za natjecanje, u kojem\nmora biti odredba da ¢e u roku od dva mjeseca od dana upisa §.d.d.-a u odgovarajuce registre,\n§.d.d. donijeti odluku o povecanju temeljnoga kapitala radi pretvaranja trazb", "ina vjerovnika\nprema §.d.d.-u u uloge,\n\n15. popis pravnih osoba u kojima je sportski klub-udruga za natjecanje Clan, a osobito\ntrgovackih druStava u kojima je sportski klub-udruga za natjecanje Clan uz precizno\nnavodenje visine udjela 1 prava koja udruga ima u tim trgovackim druStvima, te popis pravnih\nosoba preko kojih je sportski klub-udruga za natjecanje obavljala sportske djelatnosti,\n\n16. opis tijeka poslovanja pravnih osoba 1z tocke 15. ovo", "ga stavka,\n\n17. obrazlozenje razloga zbog kojih je sportski klub-udruga za natjecanje svoju djelatnost,\nosim sudjelovanja u sportskim natjecanjima, obavljala preko pravnih osoba 1z tocéke 15. ovoga\nstavka.\n\n(3) Poziv 1z stavka 2. tocke 10. ovoga Clanka sportski klub-udruga za natjecanje mora uputiti\nsvakom vjerovniku osobno. U pozivu se mora navesti da je sportski klub-udruga za natjecanje\nobvezna preoblikovati se u 8.d.d., kao 1 kolika je vrijed", "nost trazbina vjerovnika kojemu se\npoziv upucuje, a utvrdena u postupku reviziye te ga pozvati da se pisanim putem o¢cituje ima li\ninteresa za to da svoju trazbinu pretvori u ulog u §.d.d.-u kroz postupak povecanja temeljnoga\nkapitala nakon okonéanog postupka obveznog preoblikovanja odnosno kroz postupak\npretvaranja trazbine u ulog u §.d.d.-u u petom krugu, sukladno Clanku 44. stavku 3. tocki 5.\novoga Zakona.\n\n(4) Vjerovnik koji ne Zeli pretvorit", "i svoju trazbinu u ulog u §.d.d.-u ostaje vjerovnik §.d.d.-a.\n(5) Odluku 0 povecanju temeljnoga kapitala pretvaranjem trazbina u uloge iz stavka 2. tocke\n10. ovoga ¢lanka donosi uprava §.d.d.-a 1 zamjenjuje odluku glavne skupStine. Pravo na\npretvaranje trazbina za ulog imaju svi vjerovnici §.d.d.-a, pa i oni koji na poziv iz stavka 3.\novoga Clanka nisu iskazali takav interes. Temeljni kapital povecava se za iznos zbroja na\ntemelju Clanka 40. stav", "ka 2. ovoga Zakona utvrdenith vrijednosti trazbina svih vjerovnika. Na\nprovodenje povecanja temeljnoga kapitala na odgovaraju¢ci se nacin primjenjuju odredbe\nopcih propisa 0 uvjetnom povecanju temeljnoga kapitala.\n\n(6) Elaborat iz stavka 2. ovoga Clanka, u roku od petnaest dana od dana dostave rjeSenja 1z\nClanka 41. stavka 2. ovoga Zakona, sportski klub-udruga za natjecanje mora dostaviti\nnacionalnom sportskom savezu i Povjerenstvu. Nacionalni sp", "ortski savez se o tom elaboratu\nmora o¢itovati u roku od petnaest dana od dana dostave elaborata te je svoje ocitovanje duzan\ndostaviti sportskom klubu-udruzi za natjecanje 1 Povjerenstvu.\n\n(7) Sportski klub-udruga za natjecanje moze u roku od petnaest dana od dana dostave\nocitovanja 1z stavka 6. ovoga Clanka dostaviti Povjerenstvu primjedbe na o¢itovanje\nnacionalnoga sportskog saveza.\n\n(8) Povjerenstvo je duzno, u roku od mjesec dana od dana ist", "eka roka 1z stavka 7. ovoga\n¢lanka, dati suglasnost na elaborat te utvrditi pocetni iznos temeljnog kapitala ili moze\nelaborat poslati sportskom klubu-udruzi za natjecanje na doradu. Povjerenstvo moze, prije\ndavanja suglasnosti, zatraziti miSljenje nezavisnih strucnjaka 1 organizaciya.\n\n(9) Pocéetni 1znos temeljnoga kapitala utvrduje se tako da on predstavlja najmanje iznos od 25\n% prosjecnih godisnjih rashoda sportskog kluba-udruge za natjecanje", " u proteklih pet godina.\nPri izraCunavanju prosjecnoga godiSnjeg rashoda ne racuna se ona godina u kojoj je rashod\nbio najmanji u tih pet godina kao ni ona godina u kojoj je rashod bio najve¢i u tih pet godina.\nNa obrazlozeni prijedlog sportskog kluba-udruge za natjecanje koja se preoblikuje,\nPovjerenstvo moze utvrditi temeljni kapital 1 ve¢ci od iznosa utvrdenog u prvoj recenici ovoga\nstavka.\n\nClanak 44.\n\n(1) Nakon Sto dade suglasnost na elabora", "t 1 utvrdi temeljni kapital §.d.d.-a, Povjerenstvo o\ntome obavjeStava sportski klub-udrugu za natjecanje i nacionalni sportski savez.\n\n(2) U roku od petnaest dana od dana dostave obavijesti 1z stavka 1. ovoga Clanka sportski\nklub-udruga za natjecanje upucuje poziv na upis 1 uplatu dionica, na Sto se, ako ovim\nZakonom nie drugacye odredeno, na odgovarajuci nacin primjenyuju odredbe o sukcesivnom\nosnivanju dioni¢kog druStva.\n\n(3) Sportski klub-udru", "ga za natjecanje upucuje poziv na upis 1 uplatu dionica u Cetiri kruga:\n\n1. u prvom krugu poziv se upucuje jedinici lokalne samouprave u kojo] je sjediSte sportskog\nkluba-udruge za natjecanje,\n\n2. ako se u prvom krugu ne upisu 1 uplate sve dionice u roku koji ne moZe biti kraci od osam\ndana niti dulji od petnaest dana, preostali neupisani dio dionica mogu uplatiti ¢lanovi\nsportskog kluba-udruge za natjecanje na koje otpada razmjerno jednak dio te", "meljnoga\nkapitala,\n\n3. ako se 1 nakon drugog kruga ne upisu 1 ne uplate sve dionice u roku koji ne moze biti kraci\nod osam dana niti dulji od petnaest dana, preostali neupisani dio dionica mogu uplatiti ¢lanovi\nsportskog kluba-udruge za natjecanje, koji su upisali 1 uplatili dionice u drugom krugu\nrazmjerno svojim uplatama u drugom krugu,\n\n4. za preostali neupisani dio dionica upucuje se poziv javnosti na upis 1 uplatu dionica, a u\ntom krugu, koj", "i ne moZe biti kraci od petnaest dana niti dulji od mjesec dana, mogu\nsudjelovati 1 Clanovi sportskog kluba-udruge za natjecanje koji su ve¢ upisali 1 uplatili dionice\nu prethodna dva kruga, kao 1 oni koji to nisu uéinili,\n\n5. ako 1 nakon Cetvrtog kruga nisu upisane 1 uplacene sve dionice, Povjerenstvo iznimno\nmoze, vodeci racuna o interesima sporta, dopustiti upucivanje poziva za upis 1 uplatu dionica\nu petom krugu, koji ne moze biti kra¢i od pe", "tnaest dana niti dulji od mjesec dana, svim\nvjerovnicima sportskog kluba-udruge za natjecanje.\n\n(4) Ako 1 nakon €etvrtog, odnosno iznimno dopuStenog petog kruga nisu uplacene 1 upisane\nSve dionice smatra se da preoblikovanje sportskog kluba-udruge za natjecanje nije uspjelo.\n(5) Dionice se u prvom krugu, u postupku 1z stavka 3. ovoga Clanka, mogu uplatiti u novcu 1\npravu koriStenja sportske gradevine. Dio koji se uplacuje u novcu ne moze biti man", "ji od 1.000\n000,00 kuna. Preostale dionice u drugom, trecem 1 Cetvrtom krugu mogu se uplatiti samo u\nnovecu.\n\n(6) Dionice se u petom krugu mogu uplatiti 1 zamjenom trazbina vjerovnika za ulog u §.d.d.-u,\na vrijednost trazbine kao uloga procjenjuje se 1 utvrduje u skladu s Clankom 40. stavkom 2.\novoga Zakona.\n\n(7) Nadlezno tijelo sportskog kluba-udruge za natjecanje duzno je nakon okonéanog postupka\nupisa 1 uplate dionica 1z stavka 3. ovoga lanka ", "doniyeti odluku o prestanku udruge sukladno\nZakonu o udrugama. U tom slucaju ne primjenjuju se odredbe 0 obvezi pokretanja stecajnog\nodnosno likvidacijskog postupka sukladno posebnom propisu.\n\n(8) S.d.d je pravni sljednik sportskog kluba-udruge za natjecanje koja se preoblikovala.\n\nPosljedice neprovodenja obveznog preoblikovanja\n\nClanak 45.\nAko sportski klub-udruga za natjecanje ne provede postupak preoblikovanja u §.d.d., iako se\nuspjelo, minist", "arstvo na prijedlog Povjerenstva, po sluzbenoj duznosti, podnosi zahtjev za\npokretanje stec¢ajnog postupka, a sportski klub-udruga za natjecanje trpi posljedice sukladno\npravilima nacionalnoga sportskog saveza.\n\n1. OBLICI UDRUZIVANJA\nSportski savez\nClanak 46. (NN 94/13, 85/15)\n\n(1) Sportski savez je udruga u koju se udruzuju najmanje tri pravne osobe koje obavljaju\nsportske djelatnosti u istom sportu, a koji radi ostvarivanja zajednickih interesa", " u pojedinom\nsportu osobito: uskladuje aktivnosti svojih Clanica, organizira 1 provodi natjecanja, ureduje\nsustav natjecanja, pitanja koja se odnose na registraciju sportaSa 1 njihov status te stegovnu\nodgovornost sportaSa, promice struc¢ni rad u sportu 1 skrbi se o kategoriziranim sportaSima.\n(2) Na nacionalno] razini 1 na razini jedinica lokalne 1 regionalne (podrucne) samouprave\nmoze se osnovati samo jedan sportski savez za jedan sport.\n\n(3) U", " sluéaju dvojbe, misljenje Sto se smatra istim sportom u smislu ovoga Zakona, daje\nHrvatski olimpijski odbor.\n\n(4) Clanovi Zupanijskoga sportskog saveza su pored sportskih saveza osnovanih za podruéje\njedinica lokalne samouprave 1 pravne osobe koje obavljaju sportsku djelatnost u podrucju za\nkoje se osniva Zzupanijski sportski savez, a sjediSte im je na podrucju zupanije.\n\n(5) U skupStini 1 1izvrSnom tijelu sportskog saveza ne mogu biti 1 imati o", "vlasti u zastupanju:\n\n— €lanovi pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica, kao 1\nosobe koje su to bile posljednje tri godine,\n\n— €lanovi tyela pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica, kao\n1 osobe koje su to bile posljednje tri godine,\n\n— menadzeri u sportu 1 osobe 1z Clanka 12. stavka 2. ovoga Zakona, kao 1 osobe koje su to bile\nposljednjih godinu dana,\n\n— osobe koje ne mogu biti", " €lanovi uprave, odnosno nadzornog odbora dionickog druSstva\nprema odredbama Zakona o trgovackim druStvima 1 zakona kojim se ureduje sprjecavanje\nsukoba interesa u obnaSanju javnih duznosti,\n\n— osobe koje su u posljednje tri godine pravomoéno kaznjene za kaznena djela ili prekrSaje u\nsportu 1 u vezi Sa sportom,\n\n— osobe koje s menadZerima u sportu 1 Clanovima pravnih osoba te €lanovima tijela pravnih\nosoba koje obavljaju djelatnost organiziranja ", "sportskih kladionica djeluju zajednicki u smislu\nClanka 34. stavka 3. ovoga Zakona,\n\n— osobe koje su ovlaStene za zastupanje u pravnoj osobi koja sukladno Clanku 12. stavku 2.\novoga Zakona ima sklopljene ugovore o ulaganju u fizi¢ke osobe u sustavu sporta.\n(6) SkupStina je najviSe tijelo zupanijskoga sportskog saveza, odnosno Sportskog saveza\nGrada Zagreba, u kojoj svaki Clan ima pravo na najmanje jedna glas, na na¢cin utvrden\nStatutom.\n\n(7) Izni", "mno od stavka 6. ovoga Clanka, skupStinu zupanijskoga sportskog saveza, odnosno\nSportskoga saveza Grada Zagreba osnovanog u sportu u kojem najmanje polovina sportskih\nklubova koji sudjeluju u najviSem stupnju nacionalnoga sportskog natjecanja imaju\nprofesionalni status u smislu ¢lanka 24. ovoga Zakona, Cine:\n\n— predstavnici sportskih klubova koji sudjeluju u nacionalnim sportskim natjecanjima na\nnacin da sportski klub koji sudjeluje u najnizem ra", "ngu nacionalnoga sportskog natjecanja ima\njedan glas, a svaki sportski klub koji sudjeluje u neposredno visem rangu nacionalnoga\nsportskog natjecanja ima pravo na dvostruko vise glasova od sportskoga kluba koji sudjeluje u\nneposredno nizem rangu nacionalnoga sportskog natjecanja tog sporta 1\n\n— predstavnik udruzenja sportaSa 1 trenera na nacin ureden statutom zupanijskoga sportskog\nsaveza, odnosno Sportskog saveza Grada Zagreba.\n\nNacionalni sport", "ski savez\nClanak 47. (NN 96/13, 85/15)\n\n(1) Nacionalni sportski savez osniva se ako na podrucju Republike Hrvatske djelujyu najmanje\ntri sportska kluba, odnosno najmanje dva sportska saveza osnovana u istom sportu.\n\n(2) Clanovi nacionalnoga sportskog saveza su sportski savezi Zupanija, Grada Zagreba i\ngradova te sportski klubovi istoga sporta u Republici Hrvatskoj.\n\n(3) Clanovi nacionalnih sportskih saveza mogu biti udruge struénih djelatnika u i", "stome sportu\n(suci, treneri, zdravstveni radnici) te udruge u koje se udruzuju sportaSi istoga sporta.\n\n(4) Nacionalni sportski savez ureduje sustav natjecanja u sportu za koji je osnovan 1 druga\npitanja za Cije je uredivanje ovlaSten prema odredbama ovoga Zakona, te donosi pojedinaéne\nakte kada je za to ovlaSten.\n\n(5) Nacionalni sportski savez potice 1 promice sport u skladu s Nacionalnim programom\nsporta, organizira nacionalna sportska prvenstv", "a, skrbi o nacionalnoj sportskoj ekipi te\npredstavlja sport za koji je osnovan u odgovarajucem medunarodnom sportskom udruzenju.\n(6) Nacionalni sportski savez opcim aktima pored pitanja 1z stavka 4. ovoga Clanka ureduje 1\nuvjete koje moraju ispunjavati sportski klubovi da bi stekli profesionalni status, pitanja koja\nse odnose na posljedice koje proizlaze 1z nepoStivanja obveze 1z Clanka 24. stavka 7.1 Clanka\n45. ovoga Zakona, registraciju sportaS", "a, njihova prava 1 obveze, pravo nastupa stranih\nsportaSa za hrvatske sportske klubove, stegovne odgovornosti sportaSa te prava 1 obveze\nsportskih sudaca 1 zdravstvenih djelatnika ako ova pitanja ne ureduju strukovne udruge ovih\nosoba 1 druga pitanja 1z podrucja svog djelovanya.\n\n(7) SkupStina je najviSe tijelo nacionalnoga sportskog saveza u kojem svaki Clan ima pravo na\nnajmanje jedan glas, na nacin utvrden statutom.\n\n(8) Iznimno, skupStinu nac", "ionalnoga sportskog saveza osnovanog u sportu u kojem najmanje\npolovina sportskih klubova koji sudjeluju u najviSem stupnju nacionalnoga sportskog\nnatjecanja imaju profesionalni status u smislu ¢lanka 24. ovoga Zakona, Cine:\n— predstavnik pojedinoga Zupanijskoga sportskog saveza odnosno Sportskoga saveza Grada\nZagreba s jednim glasom,\n\n— predstavnik pojedinoga sportskoga kluba koji sudjeluje u najviSem stupnju nacionalnoga\nsportskog natjecanja s ", "dva glasa,\n\n— predstavnici sportskih klubova koji sudjeluju u nizim stupnjevima natjecanja od najviSega\nstupnja nacionalnoga sportskog natjecanja, na nacin utvrden statutom 1\n\n— predstavnik udruzenja sportaSa 1 trenera koji sudjeluju u najviSem stupnjyu nacionalnoga\nsportskog natjecanja, na nacin utvrden statutom.\n\n(9) U skupStini 1 izvrSnom tijelu nacionalnog sportskog saveza ne mogu biti i imati ovlasti u\nzastupanju osobe 1z Clanka 46. stavka 5", ". ovoga Zakona.\n\nSportske zajednice\nClanak 48.\n\n(1) Radi ostvarivanja zajednickih interesa u sportu, na podrucju jedinica lokalne 1 podrucne\n(regionalne) samouprave 1 Grada Zagreba osnivaju se sportske zajednice.\n\n(2) Clanovi sportskih zajednica u Zupanijama, Gradu Zagrebu, gradovima i op¢inama su\npravne osobe iz sustava sporta. Clanovi sportskih zajednica mogu biti i druge pravne osobe\ncija je djelatnost zna¢ajna za sport 1 u vezi sa sportom.\n\n(", "3) Sportske zajednice u svom djelokrugu uskladuju aktivnosti svojih Clanova, poticu 1\npromicu sport u skladu s Nacionalnim programom sporta, osobito sport djece, mlade7zi 1\nstudenata 1 osoba s invaliditetom, objedinjuju 1 uskladuju programe sporta te predlazu\nprogram javnih potreba u sportu 1 sudjeluju u njegovu ostvarivanju, skrbe o kategoriziranim\nsportaSima 1 svojim aktima ureduju opseg 1 nacin ostvarivanja njihovih prava te sudjeluju u\nstvara", "nju uvjeta za njihovu pripremu za olimpijske igre, svjetska 1 europska prvenstva te\ndruga velika medunarodna natjecanja, suraduju u ostvarivanju programa Hrvatskoga\nolimpijskog odbora, odnosno Hrvatskoga paraolimpijskog odbora 1 Hrvatskoga sportskog\nsaveza gluhih, promicu strucni rad u sportu 1 sudjeluju u skrbi o javnim sportskim\ngradevinama.\n\n(4) Na razini jedinica lokalne 1 podruéne (regionalne) samouprave 1 Grada Zagreba moze se\nosnovati samo", " jedna sportska zajednica\n\nHrvatski olimpijski odbor\nClanak 49.\n\n(1) Hrvatski olimpijski odbor je najviSa nevladina nacionalna sportska udruga u koju se\nudruzuju nacionalni sportski savezi, sportske zajednice u Zupanijama 1 Gradu Zagrebu te\ndruge udruge Cija je djelatnost od znacaja za promicanje sporta, sukladno pravilima\nHrvatskoga olimpijskog odbora.\n\n(2) Hrvatski olimpijski odbor stvara uvjete za nesmetan razvoj sporta 1 olimpijskog pokreta u", "\nRepublici Hrvatskoj.\n\n(3) Hrvatski olimpijski odbor je u svom djelovanju samostalan.\n\nClanak 50.\n(1) Hrvatski olimpijski odbor ustrojava se 1 prema nacelima olimpijskog pokreta, Olimpijske\npovelje 1 potrebama hrvatskog sporta.\n\n(2) Hrvatski olimpijski odbor svojim pravilima odreduje ustrojstvo 1 nacin rada, Clanstvo 1\nnacin ostvarivanja prava 1 obveza Clanova, nacin uporabe 1 zaStite simbola 1 obiljezja\nMedunarodnoga olimpijskog odbora 1 Hrvatsk", "oga olimpijskog odbora te druga pitanja u svezi\ns djelokrugom 1 zada¢ama Hrvatskoga olimpijskog odbora 1z €lanka 51. ovoga Zakona.\n\nClanak 51.\n\nZadace Hrvatskoga olimpijskog odbora jesu:\n\n— potice 1 promice sport u Republici Hrvatsko}j,\n\n— sudjeluje u predlaganju 1 ostvarivanju mjera za unapredenje 1 razvoj sporta\n\n— sudjeluje u predlaganju 1 provodenju programa javnih potreba sporta u Republici Hrvatskoj,\n— skrbi 1 sudjeluje u organiziranju olim", "piskih igara 1 drugih vaznih medunarodnih sportskih\nnatjecanja,\n\n— utvrduje nomenklaturu sportova,\n\n— uskladuje aktivnosti nacionalnih sportskih saveza, sportskih zajednica u Zupanijama 1 Gradu\nZagrebu u ostvarivanju ukupnog programa sporta,\n\n— provodi 1 skrbi o primjeni medunarodnih sportskih pravila, te donosi akte u svezi s\nnjihovom primjenom,\n\n— djeluje na promicanju strucnog rada u sportu 1 skrbi 0 osposobljavanju 1 usavrSavanju\nstrucnih dje", "latnika putem Hrvatske olimpijske akademye,\n\n— skrbi o promicanju vrhunskih sportskih dostignuca hrvatskih sportaSa i njihovom\nsudjelovanju u nacionalnim sportskim ekipama na olimpijskim igrama, svjetskim 1 europskim\nprvenstvima te drugim velikim medunarodnim sportskim priredbama,\n\n— promice povezivanje Republike Hrvatske putem sporta s drugim drzavama radi veceg\nzblizavanja s drugim narodima, zblizavanja sportaSa 1 drugih sudionika na sportskim\n", "priredbama,\n\n— skrbi o Sirenju olimpiyskih naéela, eti¢kih 1 moralnih normi u sportu,\n\n— skrbi 0 zaStiti stmbola 1 obiljezja Medunarodnoga olimpijskog odbora 1 Hrvatskoga\nolimpijskog odbora,\n\n— predstavlja hrvatski sport pred Medunarodnim olimpijskim odborom 1 odgovarajyucim\nmedunarodnim sportskim organizacijama 1 udruzenjima,\n\n— daje suglasnost na statute svojih Clanica koji moraju biti suglasni sa statutom Hrvatskoga\nolimpijskog odbora,\n\n— obav", "lja i druge zadace koje su utvrdene ovim Zakonom, drugim propisima, svojim Statutom\n1 pravilima,\n\n— sudjeluje u organiziranju 1 poti¢e znanstvene 1 razvojne projekte u sportu,\n\n— sudjeluje u predlaganju 1 unapredenju zdravstvene skrbi u sportu.\n\nClanak 52.\n\n(1) Pri Hrvatskom olimpijskom odboru djeluju Vijece sportske arbitraze 1 Sportsko arbitrazno\nsudiSte kao samostalna 1 nezavisna tijela za sportsku arbitrazu 1 za ryjeSavanje sporova u vezi\nSa ", "sportom.\n\n(2) Vijece sportske arbitraze odlucuje o zahtjevu za izvanrednim preispitivanjem odluka\nsportskih saveza, sportskih zajednica, sportskih klubova 1 drugih sportskih udruga protiv kojih\nsu iscrpljena ili ne postoje druga sredstva pravne zaStite, a rijec je o sportu ili pitanju vaznom\nza izvrSavanje zadaca Hrvatskoga olimpijskog odbora koje su utvrdene ovim Zakonom.\n\n(3) Sportsko arbitrazno sudiste odlucuje o zahtjevu stranaka koje su ugov", "orile nadleznost tog\nsudiSta u sporovima nastalim u vezi s obavljanjem sportske djelatnosti, a o pravima kojima\nmogu slobodno raspolagati ako zakonom nije odredeno da za odlucivanje o odredenoj vrsti\nsporova postoji iskljuciva nadleznost redovnog suda.\n\n(4) Vijece sportske arbitraze obavlja opci nadzor nad radom Sportskoga arbitraznog sudiSta 1\ndaje pravna miSljenja na zahtjev Hrvatskoga olimpijskog odbora ili na prijedlog nacionalnih\nsportskih s", "aveza, sportskih klubova i sportskih udruga.\n\n(5) Aktima Hrvatskoga olimpijskog odbora poblize se ureduje nadleznost, sastav 1 ustroj te\npravila 0 postupku pred Vijecem sportske arbitraze 1 Sportskim arbitraznim sudiStem.\n\nSportske udruge osoba s invaliditetom 1 njihova udruzenja\nClanak 53.\n\n(1) Radi provodenja sportskih natjecanja 1 sportsko-rekreativnih aktivnosti osoba s\ninvaliditetom, osobe s invaliditetom mogu osnivati svoje sportske udruge ", "1 sportska druStva\nosoba s invaliditetom.\n\n(2) Sportske udruge 1 sportska druStva osoba s invaliditetom mogu se osnivati po sportovima 1\npo vrstama invaliditeta koje utvrduje Hrvatski paraolimpijski odbor 1 Hrvatski sportski savez\ngluhih.\n\n(3) Sportske udruge 1 sportska druStva 1z stavka 2. ovoga Clanka udruzuju se u sportske saveze\nosoba s invaliditetom na razini gradova, zupanija 1 Grada Zagreba te u nacionalne sportske\nsaveze osoba s invalidit", "etom.\n\n(4) Sportski savezi osoba s invaliditetom osobito uskladuju aktivnosti svojih Clanica,\norganiziraju 1 provode natjecanja osoba s invaliditetom, ureduju pitanja koja se odnose na\nregistraciju sportaSa osoba s invaliditetom, status sportaSa 1 drugih sportskih djelatnika te\nstegovnu odgovornost sportaSa 1 sportskih djelatnika, promicu struc¢ni rad u sportu 1 skrbe se o\nkategoriziranim sportaSima s invaliditetom.\n\nHrvatski paraolimpiski odbor,", "\nHrvatski sportski savez gluhih\n\nClanak 54.\n\n(1) Sportski savezi osoba s invaliditetom 1z ¢lanka 53. ovoga Zakona udruzuju se u Hrvatski\nparaolimpijski odbor, odnosno Hrvatski sportski savez gluhih.\n\n(2) Ustanove 1 druge pravne osobe za provodenje specificnih sportsko-rekreativnih aktivnosti\nosoba s invaliditetom udruzuju se u Specijalnu olimpijadu Hrvatske sa statusom nacionalnoga\nsportskog saveza.\n\n(3) Hrvatski paraolimpijski odbor, odnosno Hrv", "atski sportski savez gluhih opcim aktom\nutvrduju kategorizaciju sportaSa s invaliditetom, sustav, uvjete 1 organizaciju sportskih\nnatjecanja osoba s invaliditetom u skladu s pravilima sporta 1 normama medunarodnih\nsportskih udruzenja osoba s invaliditetom, sudjeluju u medunarodnim sportskim pokretima\nosoba s invaliditetom 1 udruzuju se u odgovarajuca medunarodna sportska udruzenja osoba s\ninvaliditetom, skrbe 0 pripremama i sudjelovanju na svjets", "kim, europskim 1 sli¢énim\nprvenstvima 1 igrama osoba s invaliditetom te sudjeluju u njihovu organiziranju. Hrvatski\nparaolimpiski odbor skrbi o nastupu hrvatskih sportaSa na paraolimpijskim igrama te\nsudjeluje u njihovu organiziranju. Hrvatski sportski savez gluhih skrbi o nastupu hrvatskih\nsportasa na olimp1jskim igrama gluhih te sudjeluje u njihovu organiziranju.\n(4) Kategorizirani sportaS s invaliditetom, odnosno kategorizirani gluhi sportas 1", "ma prava 1z\nClanka 7. ovoga Zakona.\n\nUdruZenja Skolskih sportskih druStava i Hrvatski Skolski sportski savez\nClanak 55.\n\n(1) Radi uskladivanja aktivnosti Skolskih sportskih druStava 1 provodenja sportskih natjecanja,\nSkolska sportska druStva udruzuju se u Skolske opcinske, gradske 1 Zupanijske saveze 1 Skolski\nsportski savez Grada Zagreba.\n\n(2) U jedinicama lokalne 1 podrucne (regionalne) samouprave 1 Gradu Zagrebu moZe se\nosnovati samo jedan Sko", "lski sportski savez.\n\n(3) Hrvatski Skolski sportski savez je nacionalni Skolski sportski savez u koji se udruzuju\nZupanijski Skolski sportski savezi 1 Skolski sportski savez Grada Zagreba, a radi uskladivanja\naktivnosti svojih Clanica 1 organiziranja natjecanja Skolskih sportskih druStava.\n\n(4) Sredstva za rad 1 aktivnosti Skolskih saveza osiguravaju se u drzavnom proracunu 1\nproracunima jedinica lokalne 1 podruéne (regionalne) samouprave te Grad", "a Zagreba, a\nHrvatskoga Skolskoga sportskog saveza u drzavnom proracunu.\n\n(5) Ministar pravilnikom propisuje nacin osnivanja, zadace, djelokrug 1 nacin rada Skolskih\nsportskih saveza.\n\nStudentske sportske udruge 1 Hrvatski akademski sportski savez\nClanak 56.\n\n(1) Radi obavljanja sportske djelatnosti sukladno ovom Zakonu na visokim u¢ilistima\nosnivaju se studentske sportske udruge.\n\n(2) Programi studentskih sportskih udruga financiraju se iz sreds", "tava drzavnog proracuna\npreko ministarstva, proracuna visokih uciliSta, studentskih zborova, sveuciliSnih studentskih\nsportskih saveza 1 Hrvatskoga akademskog sportskog saveza te 1z sredstava proracuna\njedinica lokalne 1 podrucne (regionalne) samouprave.\n\n(3) Studentske sportske udruge za obavljanje svojih aktivnosti koriste prostor visokih ucilista 1\nimaju prioritet u njihovom koriStenju u odnosu na vanjske korisnike.\n\nClanak 57.\n\n(1) Studentske", " sportske udruge koje djeluju pri jednom visokom uéiliStu udruzuju se u\nstudentski sportski savez koji uspostavlja 1 vodi sustav sportskih natjecanja u sklopu visokih\nucili8ta.\n\n(2) Studentski sportski savezi visokih uéiliSta s podrucja Republike Hrvatske, radi\nuskladivanja aktivnosti svojih Clanica, organizacije natjecanja 1 skrbi o statusu studenata\nsportaSa udruzuju se u Hrvatski akademski sportski savez sa statusom nacionalnoga\nsportskoga sav", "eza.\n\n(3) Programi studentskih sportskih saveza financiraju se 1z sredstava drzavnog proracuna\npreko ministarstva, proracuna visokih ucilista, studentskih zborova visokih ucilista,\nHrvatskoga akademskog sportskog saveza 1 sredstava proracuna jedinica lokalne 1 podrucne\n(regionalne) samouprave.\n\n(4) Programi, poslovi i djelatnosti koje se odnose na zadace Hrvatskoga akademskog\nsportskog saveza financiraju se 1z sredstava drzavnog proracuna preko m", "inistarstva 1 sredstava\nkrovne studentske organizacije sukladno posebnom propisu.\n(5) Hrvatski akademski sportski savez op¢im aktom utvrduje sustav, uvjete 1 organizaciju\nsportskih natjecanja studenata u skladu s pravilima sporta 1 normama medunarodnih\nstudentskih sportskih udruzenja, sudjeluje u medunarodnim studentskim sportskim pokretima\n1 udruzuje se u odgovarajuca medunarodna studentska sportska udruzenja, skrbi o pripremama\n1 sudjelovanju n", "a univerzijadama, studentskim svjetskim, europskim 1 sli¢nim prvenstvima 1\nigrama te sudjeluje u njithovu organiziranju. Hrvatski akademski sportski savez uskladuje\naktivnosti svojih Clanica, organizira nacionalna studentska natjecanja, skrbi o statusu\nstudenata sportaSa te ureduje druga pitanja 1z podrucja svoga djelovanya.\n\nSportske udruge u sportskoj rekreaciji\nClanak 58.\n\n(1) Radi zadovoljavanja potreba za ocuvanjem, odrzavanjem, poboljSanjem", " 1 unapredenjem\npsihofizickih sposobnosti 1 zdravlja te obogacivanjem slobodnog vremena tjelesnim\nvjezbanjem 1 sportskim aktivnostima, gradani mogu osnivati sportske udruge kao druStva\nsportske rekreacije.\n\n(2) Osnivaé udruge iz stavka 1. ovoga ¢lanka moze biti 1 jedna pravna osoba.\n\n(3) Savezi za sportsku rekreaciju osnivaju se u opcinama, gradovima 1 Zupanijama, ako se\nudruze najymanje tri druStva ili udruge sportske rekreacije 1z opcina ili gr", "adova.\n\n(4) Hrvatski savez sportske rekreacije osniva se kao nacionalni sportski savez u koji se\nudruzuju savezi sportske rekreacije Zupanija, Grada Zagreba te gradski 1 opcinski savezi.\n(5) Clanovi druStava i saveza sportske rekreacije mogu biti i druge pravne i fizi¢ke osobe koje\nse bave sportskom rekreacijom ili je njihova djelatnost vezana uz sportsku rekreaciju.\n\n1. STRUCNI POSLOVI U SPORTU\nClanak 59.\n\nStrucni poslovi u sportu, u smislu ovog", "a Zakona, jesu:\n\n— programiranje 1 provodenje sportske pripreme,\n\n— programiranje 1 provodenje sportske poduke djece 1 mladezi u sportskim Skolama,\n— programiranje 1 provodenje sportske rekreacije,\n\n— programiranje 1 provodenje izvannastavnih Skolskih sportskih aktivnosti,\n\n— poduéavanje osoba osnovno] tehnici pojedinog sporta.\n\nClanak 60.\n\n(1) Struéne poslove u sportu 1z Clanka 59. podstavka 1.12. ovoga Zakona mogu obavljati\nosobe koje imaju odg", "ovarajucu strucnu spremu najmanje na razini trenera prvostupnika 1\nosobe koje su osposobljene putem ustanove za osposobljavanje kadra na temelju programa za\nstjecanje licencije krovnih svjetskih ili europskih udruzenja odredenog sporta.\n\n(2) Struéne poslove u sportu 1z Clanka 59. podstavka 3. ovoga Zakona mogu obavljati osobe\nkoje imaju odgovarajucu stru¢nu spremu najmanje na razini trenera prvostupnika.\n\n(3) Struéne poslove u sportu 1z Clanka 59", ". podstavka 4. ovoga Zakona mogu obavljati osobe\nkoje imaju odgovarajucu strucnu spremu na razini sveuciliSnog studija 1 ispunjavaju uvjete za\nucitelja odnosno nastavnika tjelesne 1 zdravstvene kulture sukladno posebnom propisu.\n\n(4) Struéne poslove u sportu 1z Clanka 59. podstavka 5. ovoga Zakona mogu obavljati osobe\nkoje su osposobljene za rad u sportu putem ustanova za osposobljavanje kadra u sportu.\n(5) Struénu spremu, odnosno strucnu osposob", "ljenost 1z stavka 1., 2., 3.14. ovoga ¢lanka\npotrebnu za obavljanje strucnih poslova u sportu 1z Clanka 59. ovoga Zakona, prema vrsti 1\nslozenosti odredenih poslova, pravilnikom propisuje ministar.\n\nVII. SPORTSKA NATJECANJA\nClanak 61.\n\n(1) Naéela 1 osnovne elemente sustava sportskih natjecanja u Republici Hrvatskoj te uvjete\nsudjelovanja hrvatskih sportaSa 1 sportskih klubova na medunarodnim sportskim natjecanjima\nutvrduje Hrvatski olimpijski odb", "or.\n\n(2) Sustav, uvjete 1 organizaciju sportskih natjecanja u pojedinom sportu utvrduje nacionalni\nsportski savez u skladu s nacéelima 1 elementima sustava koje je utvrdio Hrvatski olimpijski\nodbor, 1 prema pravilima sporta 1 normama medunarodnih sportskih udruzenja. Sustav\nnatjecanja mora se doniyeti najmanje jednu godinu prije pocetka primjene tog sustava.\n\n(3) Nacionalni sportski savez organizira 1 vodi sportska natjecanja, vodenje 1 organizir", "anje\nnatjecanja moze povjeriti svojoj Clanici ili drugoj pravnoj osobi registriranoj za obavljanje\nsportske djelatnosti.\n\n(4) Medunarodna sportska natjecanja 1 medunarodne sportske priredbe organiziraju se u\nskladu s ovim Zakonom 1 u skladu s uvjetima koje propisuju medunarodna sportska\nudruzenja.\n\n(5) Odluku o organiziranju sustava sportskih natjecanja za podrucje vise drzava ili vise\ninozemnih regija te odluku o sudjelovanju sportskih klubova 1", " sportaSa iz Republike Hrvatske\nu viSedrzavnim ili inozemnim regionalnim sustavima natjecanja donosi nacionalni sportski\nSaveZz.\n\n(6) Odluku o organizaciji 1 organiziranje sportskih natjecanja za podrucje jedne ili vise\njedinica lokalne 1 podrucne (regionalne) samouprave, odnosno Grada Zagreba, u skladu s\naktom 1z stavka 2. ovoga Clanka donose 1 organiziraju sportski savezi osnovani na tim\npodrucjima, a za podrucje drzave nacionalni sportski save", "zi.\n\nClanak 62.\n\n(1) Strani drzavljanin moze sudjelovati u sportskom natjecanju za domacu pravnu osobu koja\nobavlja djelatnost sudjelovanja u sportskom natjecanju pod uvjetima koje utvrdi odgovarajuci\nnacionalni sportski savez.\n\n(2) Stranim drzavljaninom, iz stavka 1. ovoga ¢lanka, ne smatra se drzavljanin drzava Clanica\nEuropske unye 1 drugih drzava Europskoga ekonomskog prostora.\n\nClanak 63.\n\n(1) Prijedlog za odrzavanje olimpijskih igara, medit", "eranskih igara, kao 1 ostalih medunarodnih\nmultisportskih natjecanja 1 priredaba u Republici Hrvatskoj daje Hrvatski olimpijski odbor, a\nza Odrzavanje svjetskih 1 europskih prvenstava 1 kupova u pojedinim sportovima daje\nnacionalni sportski savez uz suglasnost Hrvatskoga olimpijskog odbora.\n\n(2) Kriterije 1 mjerila za isticanje kandidature 1 odrzavanje medunarodnih sportskih natjecanja\nu Republici Hrvatskoj 1z stavka 1. ovoga Clanka op¢im aktom u", "tvrduje Hrvatski olimpijski\nodbor.\n\n(3) Pri isticanju kandidature za odrzavanje olimpijskih igara, svjetskih 1 europskih prvenstava\nte medunarodnih regionalnih Sportskih natjecanja na teritoriju Republike Hrvatske, potrebna\nje prethodna suglasnost ministarstva te iznimno Vlade Republike Hrvatske ukoliko je takva\nsuglasnost propisana pravilima medunarodnih sportskih udruzenja u €1j0j je nadleznosti\nodrzavanje predmetnog natjecanja.\n\n(4) Prijedlog ", "za odrzavanje svjetskih 1 europskih prvenstava 1 kupova u pojedinim sportovima\nza osobe s invaliditetom 1 gluhe osobe daje nacionalni sportski savez uz suglasnost\nHrvatskoga paraolimpijskog odbora, odnosno Hrvatskoga sportskog saveza gluhih.\n\nClanak 64.\n\nNeposredni organizator sportskih natjecanja, u sportskoj gradevini u kojoj se odrzava sportsko\nnatjecanje ili sportska priredba, obvezan je osigurati sigurnost 1 pruzanje medicinske pomoc1.\n\nVIII", ". SPORTSKE GRADEVINE\nClanak 65.\n\n(1) Sportskim gradevinama smatraju se uredene 1 opremljene povrSine 1 gradevine u kojima se\nprovode sportske djelatnosti, a koje osim op¢ih uvjeta propisanih posebnim propisima za te\ngradevine zadovoljavaju 1 posebne uvjete u skladu s odredbama ovoga Zakona.\n\n(2) Javnim sportskim gradevinama smatraju se gradevine koje su u vlasniStvu Republike\nHrvatske, odnosno u vlasniStvu jedinica lokalne 1 podrucne (regionalne)", " samouprave 1 Grada\nZagreba te se trajno koriste u izvodenju programa javnih potreba u sportu.\n\nClanak 66.\n\n(1) Hrvatski sabor na prijedlog Vlade Republike Hrvatske, koja prethodno pribavlja miSljenje\nNacionalnog vijeca za sport, tijela jedinice lokalne 1 podruéne (regionalne) samouprave 1\nGrada Zagreba, pripadajucih sportskih zajednica 1 odgovarajucih sportskih saveza donosi\nmrezu sportskih gradevina.\n\n(2) Mrezom sportskih gradevina odreduje se ", "plan izgradnje, obnove, odrzavanja 1 upravljanja\nsportskim gradevinama.\n\n(3) Mreza sportskih gradevina obvezna je podloga za izradu dokumenata prostornog uredenja.\n(4) Prostorne uvjete, standarde 1 normative sportskih gradevina obuhvacenih mrezom\nsportskih gradevina te posebne uvjete za planiranje, programiranje, projektiranje, gradnju,\nodrzavanje 1 sigurnost korisnika sportskih gradevina propisuje pravilnikom muinistar uz\nprethodnu suglasnost mi", "nistra nadleznog za poslove zaStite okoliSa, prostornog uredenja 1\ngraditeljstva.\n\n(5) U postupku izdavanja lokacijske dozvole za sportsku gradevinu, tijelo koje 1zdaje\nlokacijsku dozvolu pribavlja miSljenje ministarstva o uskladenosti s uvjetima iz stavka 4.\novoga Clanka.\n\nClanak 67.\n(1) Sportske gradevine od posebnog interesa za Republiku Hrvatsku, u smislu ovoga Zakona,\nsu gradevine utvrdene Nacionalnim programom sporta 1 posebnom odlukom Vlad", "e Republike\nHrvatske.\n\n(2) Osim sportskih gradevina od posebnog interesa za Republiku Hrvatsku utvrdenih sukladno\nstavku 1. ovoga lanka, sportskom gradevinom od posebnog interesa za Republiku Hrvatsku\nsmatra se 1 Hrvatski olimpijski centar Bjelolasica.\n\n(3) Interes 1z stavka 2. ovoga Clanka ostvaruje se osobito kroz ovlast Vlade Republike\nHrvatske koju provodi zajedno s drugim pravnim osobama, koje drze u vlasnisStvu nekretnine\nkoje Cine ovu spor", "tsku gradevinu, kroz trgovacko druStvo za obavljanje sportske djelatnosti,\npri emu Republika Hrvatska mora imati viSe od polovine udjela ili dionica na temelju\nulozenih nekretnina ili novéanih sredstava.\n\n(4) Izgradnja sportskih gradevina, koja se utvrduje Nacionalnim programom sporta, potice se\nfinanciranjem iz drzavnog proracuna, jedinica lokalne 1 podrucne (regionalne) samouprave, 1z\ndiela prihoda od igara na sre¢cu 1 ulaganjem privatnih osoba", " te poticanjem partnerstva\nvladinih, nevladinih organizacija u sportu 1 privatnog poduzetniStva.\n\nClanak 68.\n\n(1) Prenamijeniti povrSinu planiranu za javnu sportsku gradevinu, ukloniti ili prenamiyeniti\njavnu sportsku gradevinu za namjene koje nisu sportske djelatnosti moze se samo uz\nsuglasnost ministarstva na temelju prethodnog miSljenja sportske zajednice na ¢ijem se\npodrucju nalazi sportska gradevina.\n\n(2) Suglasnost iz stavka 1. ovoga Clanka", " ne moZe se izdatt:\n\n— ako jedinica lokalne, odnosno regionalne (podrucne) samouprave nie planirala\nodgovarajucu zamjensku povrSinu 1\n\n— ako investitori prenamjene javne sportske gradevine, odnosno vlasnik javne sportske\ngradevine koja se uklanja ne preuzme obvezu 1 osigura uvjete izgradnje odgovarajuce\nzamjenske javne sportske gradevine.\n\n(3) Iznimno od odredaba stavka 2. ovoga Clanka suglasnost se moze dati samo ako se radi o\ngradevini od poseb", "nog interesa za Republiku Hrvatsku.\n\nClanak 69.\n\nUpravljanje javnim sportskim gradevinama moze se povjeriti 1 sportskim klubovima 1\nsavezima, sportskoj zajednici, ustanovama 1 trgovackim druStvima registriranima za\nobavljanje sportske djelatnosti upravljanja 1 odrzavanja sportskih gradevina.\n\nClanak 70.\n\n(1) U nadzornom odboru trgovackog druStva koje upravlja sportskim gradevinama u\nvlasniStvu jedinice lokalne 1 podruéne (regionalne) samouprave 1", " Grada Zagreba, najmanje\njedan Clan mora biti predstavnik sportske zajednice.\n\n(2) U upravnom vijecu ustanove za upravljanje javnom sportskom gradevinom najmanje\njednu trecinu Clanova Cine predstavnici sportskih zajednica, odnosno sportskih udruga koje su\nkorisnici javnih sportskih gradevina.\n\n1. ZDRAVSTVENA ZASTITA\nClanak 71.\n\n(1) U sportskom natjecanju moze sudjelovati osoba za koju je u razdoblju od Sest mjeseci\nprije sportskog natjecanja utvr", "dena opéa zdravstvena sposobnost, a kada je to propisano\npravilnikom koji donosi ministar nadlezan za zdravstvo uz suglasnost ministra 1 posebna\nzdravstvena sposobnost, ako propisima nacionalnoga sportskog saveza nije odredeno krace\nrazdoblyje.\n\n(2) Opéu 1 posebnu zdravstvenu sposobnost utvrduje ovlasteni lyecnik, odnosno specialist\nsportske medicine, specialist medicine rada 1 sporta ili lijecnici drugih specyalnosti koji\nimaju zavrSeni poslijed", "iplomski studi 1z medicine rada 1 sporta. Listu ovlaStenth lijecnika\nutvrduje ministarstvo nadlezno za poslove zdravlja, uz suglasnost ministra.\n\n(3) Uvjete za obavljanje zdravstvenih pregleda, vrstu 1 opseg pregleda, nacin vodenja\nevidenciye 1 medicinske dokumentacije sportaSa te rokove u kojima se provode zdravstveni\npregledi za ucenike koji sudjeluju u natjecanjima Skolskih sportskih drustva, pravilnikom\npropisuje ministar nadlezan za zdravstv", "o uz prethodno misljenje ministra.\n\n(4) Obveza utvrdivanja zdravstvene sposobnosti postoji 1 za druge osobe u sportu sukladno\nodredbama akata nacionalnih sportskih saveza.\n\n(5) Op¢u 1 posebnu zdravstvenu sposobnost ucenika za sudjelovanje na natjecanjima Skolskih\nsportskih druStava utvrduje nadlezan lijecnik specijalist Skolske medicine, odnosno izabrani\nlijeénik specyalist pediyatar ili izabrani lijecnik specialist opce 1/il1 obiteljske medicine", ".\n\nClanak 72.\n\n(1) SportaSi ne smiju uzimati nedopuStena sredstva (doping) niti smiju primjenjivati postupke\nkoji su nedopuSteni prema pravilima Hrvatskog olimpijskog odbora, Medunarodnog\nolimpijskog odbora 1 Svjetske antidoping agencije (u daljnjem tekstu: WADA).\n\n(2) Trener, ovlaSteni lijecnik, 1 druge osobe u sportu ne smiyu sportaSu davati nedopuStena\nsredstva ili od sportaSa traziti 111 poticati ga da uzima nedopuStena sredstva ili primjenju", "je\npostupke koji su nedopuSteni pravilima 1z stavka 1. ovoga Clanka.\n\n(3) Ako se utvrdi da su sporta§ ili osoba 1z stavka 2. ovoga Clanka postupali protivno\nodredbama 1z stavka 1. 1 2. ovoga ¢lanka osoba 1 tijelo koji su to utvrdili duzni su postupiti\nsukladno pravilima 1z stavka 1. ovoga Clanka 1 sukladno ovome Zakonu.\n\n(4) Sportasi su obvezni dopustiti obavljanje dopinske kontrole.\nClanak 73.\n\nBrisan.\n\n1. FINANCIRANJE SPORTA I OBJAVA FINANCIJSK", "IH IZVJESCA\nClanak 74. (NN 94/13)\n\n(1) Osnovu financiranja sporta Cine prihodi koje pravne 1 fizi¢ke osobe koje obavljaju\nsportsku djelatnost ostvare obavljanjem sportske djelatnosti, Clanarine koju ostvaruju sportske\nudruge, dio prihoda od priredivanja igara na srecu 1 sredstva kojima jedinice lokalne 1\npodruéne (regionalne) samouprave 1 Grad Zagreb 1 drzava pomazu obavljanje sportskih\ndjelatnosti.\n(2) Republika Hrvatska, jedinice lokalne 1 podr", "uéne (regionalne) samouprave i Grad Zagreb\nutvrduju javne potrebe u sportu 1 za njihovo ostvarivanje osiguravaju financijska sredstva 1z\nSvojih proracuna u skladu s ovim Zakonom.\n\n(3) Financiranje profesionalnog sporta od strane Republike Hrvatske, jedinice lokalne 1\npodrucne (regionalne) samouprave i Grada Zagreba sukladno odredbama ovoga Zakona, ako\nima ucinak na trgovinu izmedu Republike Hrvatske 1 drugih drzava €lanica Europske unije,\nmoguCe ", "je ako je sukladno propisima o drzavnim potporama (Clanak 107. Ugovora o\nfunkcioniranju Europske unije).\n\nClanak 75. (NN 85/15)\n\n(1) Javne potrebe u sportu na drzavnoj razini jesu:\n\n1. poticanje 1 promicanje sporta, osobito sporta djece, mladezi, studenata 1 osoba s\ninvaliditetom,\n\n2. poticanje planiranja 1 1zgradnje sportskih gradevina,\n\n3. skrb o vrhunskim sportasima,\n\n4. djelovanje nacionalnih sportskih saveza, Hrvatskoga olimpijskog odbora, H", "rvatskoga\nparaolimpijskog odbora 1 Hrvatskoga sportskog saveza gluhih,\n\n5. djelovanje informacijskog sustava u sportu,\n\n6. dodjeljivanje drzavne nagrade za sport »Franjo Buéar« 1 drzavnih nagrada za vrhunska\nsportska postignuéa,\n\n7. medunarodna sportska suradnja 1 medunarodne obveze Republike Hrvatske u sportu,\n\n8. znanstveni 1 razvojni programi u sportu.\n\n(2) Programe javnih potreba 1z stavka 1. ovoga ¢lanka donosi Hrvatski sabor na prijedlog\nVl", "ade Republike Hrvatske, zajedno s drzavnim prora¢unom.\n\n(3) Za izvrSenje programa javnih potreba 1z stavka 1. ovoga Clanka osiguravaju se sredstva u\ndrzavnom proracunu 1 1z diela prihoda od priredivanja igara na srecu 1 nagradnih igara u\nsmislu Zakona o priredivanju igara na sre¢cu 1 nagradnih igara.\n\n(4) Programe zadovoljavanja javnih potreba 1z stavka 1. ovoga Clanka koji se odnose na\ndjelovanje Hrvatskoga olimpijskog odbora 1 nacionalnih sport", "skih saveza, organiziranje 1\nprovodenje nacionalnih prvenstava 1 medunarodnih sportskih natjecanja reprezentativne\nrazine 1 skrbi o vrhunskim sportaSima, predlaze Hrvatski olimpijski odbor koji je odgovoran\nza izvrSenje programa 1 utroSak financijskih sredstava. O izvrSenju programa javnih potreba 1\nutroSku financ1jskih sredstava Hrvatski olimpijski odbor podnosi 1zvjeS¢e Hrvatskom saboru 1\nministarstvu u rokovima propisanim u Zakonu o proracunu.", "\n\n(5) Programe zadovoljavanja javnih potreba 1z stavka 1. ovoga Clanka koji se odnose na\ndjelovanje Hrvatskoga paraolimpijskog odbora 1 Hrvatskoga sportskog saveza gluhih predlazu\nHrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih, svaki u svom djelokrugu 1\nodgovorni su za izvrSenje programa za koje su sredstva osigurana. IzvjeS¢a o izvrSenju\nprograma 1 utroSku financijskih sredstava Hrvatski paraolimpijski odbor 1 Hrvatski sportski\ns", "avez gluhih u rokovima 1 postupku propisanim za donoSenje drzavnog proracuna podnose\nministarstvu u rokovima propisanim u Zakonu o proracunu.\n\n(6) Programe za zadovoljavanje javnih potreba 1z stavka 1. ovoga Clanka koji se odnose na\nfinanciranje studentskih sportskih udruga 1 Hrvatskoga akademskoga sportskog saveza\npredlaze ministarstvu Hrvatski akademski sportski savez u rokovima 1 postupku donoSenja\ndrzavnog proracuna te je odgovoran za izvrSen", "je programa za koje su sredstva osigurana u\ndrzavnom proracunu, a izvjeS¢a 0 izvrSenju programa 1 utroSku financijskih sredstava podnosi\nministarstvu u rokovima propisanim u Zakonu o proracunu.\n\n(7) Programe za zadovoljavanje javnih potreba 1z stavka 1. ovoga Clanka koji se odnose na\nfinanciranje sporta djece 1 mladezi, posebice sportske djelatnosti Hrvatskoga Skolskoga\nsportskog saveza, poticanje planiranja 1 izgradnje sportskih gradevina, dodje", "ljivanje drzavne\nnagrade za sport »Franjo Buéar« 1 drzavnih nagrada za vrhunska sportska postignu¢éa, za\nmedunarodnu sportsku suradnju 1 medunarodne obveze Republike Hrvatske u sportu,\nznanstvene 1 razvojne programe u sportu, djelovanje informacijskog sustava u sportu Vladi\nRepublike Hrvatske predlaze ministarstvo u rokovima 1 postupku propisanom za donoSenje\ndrzavnog proracuna.\n\n(8) Za izvrSenje programa javnih potreba 1z stavka 7. ovoga Clanka ", "ministarstvo odreduje\nnositelje provedbe, prati 1 nadzire izvrSenje programa te prati koriStenje 1 utroSak sredstava.\n\n(9) Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor, Hrvatski sportski savez gluhih 1\nHrvatski akademski sportski savez prijedloge svojih programa javnih potreba 1 financijske\nplanove koji se odnose na izvrSenje programa javnih potreba dostavljaju na suglasnost\nministarstvu u rokovima utvrdenim Pravilnikom 1z stavka 13. ", "ovoga ¢lanka.\n\n(10) Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor, Hrvatski sportski savez gluhih,\nHrvatski akademski sportski savez 1 Hrvatski Skolski sportski savez svoje programe javnih\npotreba 1 financijske planove koji se odnose na izvrSenje programa javnih potreba ne mogu\nmiyjenjati 1/ ili dopunjavati tijekom poslovne godine bez suglasnosti ministarstva.\n\n(11) Planirani godiSnji iznos financiranja programa javnih potreba i financ", "ijske planove koji\nse odnose na izvrsenje programa javnih potreba u sportu 1z ovoga Clanka za Hrvatski\nolimpijski odbor, Hrvatski paraolimpijski odbor, Hrvatski sportski savez gluhih, Hrvatski\nakademski sportski savez 1 Hrvatski Skolski sportski savez ministar utvrduje Odlukom nakon\ndonoSenja Drzavnog proracuna.\n\n(12) Nakon donoSenja Odluke 1z stavka 11. ovoga Clanka korisnici sredstava 1z stavka 11.\novoga Clanka sklopit ce s ministarstvom ugovor", "e kojima ¢e biti definirana medusobna prava 1\nobveze.\n\n(13) Ministar Pravilnikom, uz prethodno misljenje Ministarstva financija, detaljnije propisuje\nmetodologiju 1 rokove za izradu 1 dostavu Programa javnih potreba, nacin izvrSavanja\nPrograma javnih potreba, nacin 1 rokove izvjeStavanja 0 provedbi Programa javnih potreba te\nmetodologiju izrade financijskog plana.\n\nClanak 76. (NN 85/15)\n\n(1) Javne potrebe u sportu za koje se sredstva osiguravaju ", "1z proracuna jedinica lokalne 1\npodruéne (regionalne) samouprave 1 Grada Zagreba su programi, odnosno aktivnosti, poslovi 1\ndjelatnosti od znac¢aja za jedinicu samouprave:\n\n1. poticanje 1 promicanje sporta,\n\n2. provodenje sportskih aktivnosti djece, mladezi 1 studenata,\n\n3. djelovanje sportskih udruga, sportskih zajednica 1 saveza,\n\n4. sportska priprema, doma¢éa 1 medunarodna natjecanja te opca 1 posebna zdravstvena zastita\nsportasa,\n\n5. zapoSlja", "vanje osoba za obavljanje strucnih poslova u sportu,\n\n6. sportsko-rekreacijske aktivnosti gradana,\n\n7. sportske aktivnosti osoba s teSko¢ama u razvoju 1 osoba s invaliditetom,\n\n8. planiranje, izgradnja, odrzavanje 1 kori8tenje sportskih gradevina znaéajnih za jedinicu\nlokalne 1 podrucne (regionalne) samouprave 1 Grada Zagreba,\n9. provodenje 1 financiranje znanstventh 1 razvojnih projekata elaborata 1 studija u funkciji\nrazvoja sporta.\n\n(2) Progra", "me javnih potreba 1z stavka 1. ovoga Clanka predlaze sportska zajednica.\n\n(3) Programe javnih potreba 1z stavka 1. ovoga Clanka, koji se odnose na provodenje sportskih\naktivnosti djece 1 mladezi, nadleznim tijelima za poslove sporta u jedinicama podrucne\n(regionalne) samouprave 1 Gradu Zagrebu predlazu Skolski sportski savezi 1 sportske\nzajednice.\n\n(4) Programe 1z stavka 1. ovoga Clanka, na prijedlog sportske zajednice, odnosno Skolskih\nsportskih", " saveza, donosi jedinica lokalne 1 podrucne (regionalne) samouprave, zajedno s\ngodisnjim proracunom\n\n(5) Sredstvima za zadovoljavanje javnih potreba iz stavka 1. tocke 1. do 7. ovoga €lanka\nraspolaze sportska zajednica u jedinicama lokalne 1 podrucne (regionalne) samouprave 1\nGradu Zagrebu. Sredstva za izvrSenje programa zadovoljavanja javnih potreba iz stavka 1.\novoga Clanka jedinica lokalne samouprave prenosi na racun sportske zajednice, Grada\n", "Zagreba, grada ili opcine.\n\n(6) Za ostvarivanje programa javnih potreba iz stavka 1. ovoga Clanka jedinice lokalne 1\npodruéne (regionalne) samouprave 1 Grad Zagreb osiguravaju financijska sredstva u svom\nproracunu.\n\n(7) O izvrSenju programa javnih potreba 1z stavka 1. ovoga lanka 1 utroSku sredstava 1z\nstavka 5. ovoga Clanka, sportska zajednica Zupanije, Grada Zagreba, grada 1l1 op¢cine\nizvjeStava jedinicu lokalne odnosno regionalne (podrucne) sa", "mouprave u rokovima\npropisanim Zakonom o proracunu.\n\n(8) Tyela jedinica lokalne 1 podruéne (regionalne) samouprave 1 Grada Zagreba nadlezna za\nposlove sporta prate 1 nadziru izvrSenje programa javnih potreba 1z stavka 1. ovoga Clanka te\nprate koriStenje 1 utroSak sredstava za te programe.\n\n(9) Jedinice lokalne 1 podrucéne (regionalne) samouprave 1 Grad Zagreb mogu opcim aktom\ndetaljnije propisati metodologiju 1 rokove za izradu 1 dostavu Programa", " javnih potreba, na¢cin\nizvrSavanja Programa javnih potreba, nacin 1 rokove izvjeStavanja 0 provedbi Programa\njavnih potreba te metodologiju izrade financijskog plana 1z ovoga lanka.\n\nClanak 76.a (NN 85/15)\n\n(1) Pravne osobe u sustavu sporta obvezne su javno objavljivati godisnje financijske izvjeStaje\nsukladno odredbama ovoga Zakona te posebnih propisa kojima je uredeno podrucje\nfinancijskog poslovanja 1 racunovodstva.\n\n(2) Pravna osoba u sustav", "u sporta obvezna je objaviti godisnje financiske izvjeStaje na svojim\nmreznim stranicama, u roku od petnaest dana od dana predaje financijskog izvjeStaja\nMinistarstvu financija, odnosno drugoj instituciji koju Ministarstvo financija ovlasti za\nzaprimanje 1 obradu financijskih izvjeStaja, ako njezin godiSnji proracun iznosi najymanje pet\nmilijuna kuna u poslovnoj godini za koju se godiSnji financijski 1zvjeStaji sastavljaju.\n\n(3) Odredbe ovoga Cla", "nka na odgovarajuci na¢in se primjenjuju na sve oblike udruzivanja\nodredene Zakonom.\n\n1. INFORMACIJSKI SUSTAV U SPORTU\nClanak 77.\n\n(1) U svrhu sustavnog pracenja stanja u sportu 1 njegovoga dugorocnog razvoja ministarstvo\nustrojava informacijski sustav u sportu.\n\n(2) Osnivanje, ustroj i ovlasti informacijskog sustava u sportu i vrste, sadrzaj 1 oblik\ninformacija koje prikuplja pravilnikom propisuje ministar.\n\n(3) Informacijski sustav u sportu vod", "i ministarstvo.\n\nClanak 78.\n\nInformacijski sustav u sportu osobito prikuplja 1 azurira informacije o aktivnostima osoba\nkoje obavljaju sportske djelatnosti, utroSku sredstava namijenjenih programu provedbe\nNacionalnog programa sporta, sustavu natjecanja, stru¢nom kadru u sportu, planiranju,\nizgradnji 1 odrzavanju sportskih gradevina, djeci sportaSima, kategoriziranim sportaSima 1\nrekreativnim aktivnostima gradana.\n\nXII. DRZAVNE NAGRADE U SPORTU\nD", "rzavna nagrada za sport »Franjo Bucar«\nClanak 79.\n\n(1) Drzavna nagrada za sport »Franjo Buéar« (u daljnjem tekstu: drzavna nagrada) najviSe je\npriznanje koje Republika Hrvatska dodjeljuje za iznimna postignuéa 1 doprinos od osobitog\nznacenja za razvoj sporta u Republici Hrvatskoj.\n\n(2) Drzavna nagrada dodjeljuje se strucnim 1 javnim djelatnicima u podrucju sporta,\nsportaSima, pravnim 1 fizickim osobama koje obavljaju sportsku djelatnost te drugim", " pravnim\n1 fizi¢kim osobama zasluznim za razvoj sporta.\n\n(3) Drzavna nagrada dodjeljuje se u obliku medalje s likom Franje Buéara, posebne diplome 1\nnovéane nagrade.\n\nClanak 80.\n\n(1) Drzavna nagrada dodjeljuje se za viSegodisnje uspjeSno djelovanje u sportu, osvajanje\nolimpijske medalje, iznimno znanstveno, strucno 1 pedagoSko ostvarenje ili sportsko\ndostignuce.\n\n(2) Odluku o dodjeli drzavne nagrade donosi Odbor drzavne nagrade sporta »Franjo Buc", "ar«\n(u daljnjem tekstu: Odbor drzavne nagrade).\n\n(3) Predsjednika 1 osam Clanova Odbora drzavne nagrade imenuje Hrvatski sabor iz reda\nuglednih sportskih 1 javnih djelatnika, istaknutih sportaSa 1 drugih istaknutih strucnjaka 1z\npodrucja sporta na vrijeme od Cetiri godine, na prijedlog ministra.\n\n(4) Drzavna nagrada se dodjeljuje kao godiSnja nagrada 1 nagrada za zivotno djelo. Svaka od\ntih nagrada moze se dodijeliti samo jednom.\n\n(5) Godisnje se", " moze dodijeliti najviSe petnaest drzavnih nagrada, od toga tri za Zivotno djelo.\n(6) Ministar donosi pravilnik kojim poblize ureduje uvjete za dodjelu drzavne nagrade, nacin\nrada Odbora drzavne nagrade 1 druga pitanja znacajna za dodjelu drzavne nagrade.\n\nClanak 81.\n(1) Dodjela drzavne nagrade za sport »Franjo Bucar« od nacionalnog je interesa a sredstva\npotrebna za dodjelu drzavne nagrade osiguravaju se u drzavnom proracunu Republike\nHrvatske.\n", "\n(2) Visinu novéanog diela godiSnje nagrade 1 nagrade za zivotno djelo »Franjo Bucar«\nodlukom ¢e odrediti ministar.\n\nDrzavna priznanja osvajacima medalja na olimpijskim igrama, paraolimp1jskim igrama,\nolimpijskim igrama gluhih i svjetskim prvenstvima u olimpijskim sportovima 1 disciplinama\n\nClanak 81.a (NN 94/13)\n\n(1) Sportas koji je osvojio medalju na olimpiskim igrama, paraolimpijskim igrama,\nolimpijskim igrama gluhih i svjetskim seniorskim prv", "enstvima u olimpijskim sportovima 1\ndisciplinama, kao drzavno priznanje za poseban doprinos ugledu Republike Hrvatske,\nostvaruje na vlastiti zahtjev pravo na trajnu novCanu mjesecnu naknadu ako ima ispunjene\nsljedece uvjete:\n\n— hrvatsko drzavljanstvo,\n\n— prebivaliste u Republici Hrvatskoj,\n\n— navrSenih 45 godina zivota,\n\n— nie pravomoéno osuden na bezuvjetnu kaznu zatvora za pocinjeno kazneno djelo.\n\n(2) Iznos trajne novéane mjesecne naknade spor", "taSu 1z stavka 1. ovoga Clanka u neto iznosu\niznosi:\n\n— 100% prosjecéne neto place po zaposlenome u pravnim osobama u Republici Hrvatskoj u\ngodini koja prethodi stjecanju prava na naknadu prema objavi Drzavnog zavoda za statistiku\nZa osvojenu zlatnu medalju na olimpijskim igrama, paraolimpijskim igrama 1 olimpijskim\nigrama gluhih;\n\n— 80% prosjecne neto place po zaposlenome u pravnim osobama u Republici Hrvatskoj u\ngodini koja prethodi stjecanju p", "rava na naknadu prema objavi Drzavnog zavoda za statistiku\nZa OSvojenu srebrnu medalju na olimpijskim igrama, paraolimpijskim igrama 1 olimpijskim\nigrama gluhih te za osvojenu zlatnu medalju na svjetskim seniorskim prvenstvima u\nolimpijskim sportovima i disciplinama;\n\n— 60% prosjecne neto place po zaposlenome u pravnim osobama u Republici Hrvatskoj u\ngodini koja prethodi stjecanju prava na naknadu prema objavi Drzavnog zavoda za statistiku\nza osv", "ojenu bronéanu medalju na olimpiskim igrama, paraolimpijskim igrama 1 olimpijskim\nigrama gluhih te za osvojenu srebrnu medalju na svjetskim seniorskim prvenstvima u\nolimpijskim sportovima i disciplinama;\n\n— 40% prosjeéne neto place po zaposlenome u pravnim osobama u Republici Hrvatskoj u\ngodini koja prethodi stjecanju prava na naknadu prema objavi Drzavnog zavoda za statistiku\nza osvojenu bronéanu medalju na svjetskim seniorskim prvenstvima u oli", "mpijskim\nsportovima 1 disciplinama.\n(3) O priznanju 1 gubitku prava na trajnu novcéanu mjesecnu naknadu sportaSu odlucuje\nministarstvo ryeSenjem.\n\n(4) Protiv ryeSenja ministarstva iz stavka 3. ovoga Clanka zalba nije dopuStena, ali se moze\npokrenuti upravni spor.\n\n(5) Trajna novéana mjesecna naknada koju ostvaruje sportaS 1z stavka 1. ovoga Clanka je\ndozivotna, ne moze biti predmet nasljedivanja, a gubi se ako sportaS viSe ne ispunjava sve\nuvjete", " propisane stavkom 1. ovoga Clanka.\n\n(6) Sportas 1z stavka 1. ovoga Clanka podnosi ministarstvu zahtjev za ostvarivanje prava na\ntrajnu novcanu mjesecnu naknadu, a uz zahtjev se obvezno prilazu 1 dokazi 0 ispunjavanju\nuvjeta.\n\n(7) SportaS koji nakon Sto mu je rjeSenjem ministarstva priznato pravo na trajnu novéanu\nmjesecnu naknadu, prestane ispunjavati neki od uvjeta 1z stavka 1. ovoga Clanka, obvezan je u\nroku od 15 dana od dana prestanka ispunj", "avanja uvjeta, obavijestiti ministarstvo o nastaloj\npromjeni.\n\n(8) Ministarstvo jednom godiSnje provodi kontrolu ispunjenosti uvjeta iz stavka 1. ovoga\nClanka za sve sportaSe kojima je ryjeSenjem ministarstva priznato pravo na trajnu novcanu\nmyjesecnu naknadu.\n\n(9) Radi kontrole ispunjenosti uvjeta 1z stavka 8. ovoga Clanka, sportaSi koji ostvaruju pravo\nna trajnu novcanu mjesecnu naknadu obvezni su na zahtjev ministarstva dostaviti dokaze o\nispu", "njenosti uvjeta 1z stavka 1. ovoga Clanka.\n\n(10) Sportas koji je osvojio viSe medalja, a koji ispunjava uvjete 1z stavka 1. ovoga Clanka,\nmoze ostvariti pravo na trajnu novéanu mjesecnu naknadu samo u iznosu za osvojenu jednu\nmedalju, pri Cemu je mjerodavan iznos naknade koji ostvaruje za najviSu medalju.\n\n(11) Pitanja vezana za dodjeljivanje trajnih novéanih naknada detaljnije ureduje Vlada\nRepublike Hrvatske uredbom.\n\n(12) Sredstva za isplate t", "rajnih novéanih mjeseénih naknada sportaSima 1z ovoga Clanka\nosiguravaju se u drzavnom proracunu Republike Hrvatske.\n\n(13) Obvezu javnih davanja na neto iznose naknada 1z stavka 2. ovoga ¢lanka podmiruje\nisplatitelj na nacin 1 u slucaju kada je isto propisano posebnim propisima.\n\nDrzavne nagrade za vrhunska sportska postignuca\nClanak 82.\n\n(1) Drzavne nagrade za vrhunska sportska postignuca dodjeljuju se sportaSima, sportskim\nekipama 1 djelatnim s", "trucnim sportskim osobama (izbornik, trener, sportski lijecnik,\nfizioterapeut, serviser 1 sl.) koje utvrduje nacionalni sportski savez, kao priznanje za osvojene\nzlatne, srebrne 1 bronéane medalje, odnosno za osvojeno, prvo, drugo ili trece mjesto na\nolimpijskim, paraolimpijskim igrama i olimpijskim igrama gluhih te svjetskim 1 europskim\nseniorskim prvenstvima u olimpijskim 1 paraolimpijskim sportovima 1 disciplinama te u\nolimpijskim sportovima i", " disciplinama za gluhe.\n\n(2) Nagrada se moze dodiyeliti 1 sportaSu, sportskoj ekipi ili struénoj sportskoj osobi za\nosvojenu zlatnu medalju, prvo mjesto na svjetskim 1 europskim seniorskim prvenstvima u\nneolimpijskim, neparaolimpijskim sportovima 1 neolimpijskim sportovima gluhih koji u\nRepublici Hrvatskoj imaju dulju tradiciju te u sluéajevima kada sportsko postignuce pojedinca\nili sportske ekipe 1ma osobitu medunarodnu vrijednost 1 znacaj.«.\n\nC", "lanak 83.\n\n(1) Drzavne nagrade za vrhunska sportska postignuca dodjeljuju se u novecu.\n\n(2) Sredstva za nagrade 1z stavka 1. ovoga Clanka osiguravaju se u drzavnom proracunu.\n(3) Kriterije za dodjeljivanje drzavnih nagrada za vrhunska sportska postignuéa, iznose tih\nnagrada 1 nacin njihova dodjeljivanja utvrduje Vlada Republike Hrvatske uredbom.\n\nXII. NADZOR\nNadzor nad zakonitoscu rada\nClanak 84.\n\nNadzor nad zakonitoS¢u rada pravnih osoba 1z sust", "ava sporta 1 njihovih op¢ih akata obavlja\nministarstvo.\n\nInspekcijski nadzor\nClanak 85.\n\nInspekcijski nadzor nad provedbom ovoga Zakona 1 na temelju njega donesenih propisa\nprovodi sportska inspekcija u skladu s posebnim zakonom.\n\nXIV. PREKRSAJNE ODREDBE\nClanak 86. (NN 85/15)\n\n(1) Novéanom kaznom od 30.000,00 do 100.000,00 kuna kaznit Ce se za prekrSaj pravna\nosoba ako:\n\n1. zapocne obavljati sportsku djelatnost prije nego Sto bude upisana u regis", "tar sportskih\ndjelatnosti koji vodi ured drzavne uprave u Zupaniji, odnosno ured Grada Zagreba\nnadlezan za poslove sporta,\n\n2. obavljanje strucnih poslova u sportu povjeri osobi koja za to ne ispunjava uvjete,\n\n3. trazi ili dopusti da u sportskom natjecanju sudjeluje osoba kojoj nije utvrdena opca\nzdravstvena sposobnost ili posebna zdravstvena sposobnost,\n\n4. ne izvr8i upis u Registar profesionalnih klubova, predviden pravilnikom o upisu,\n\n5. ne ", "postuje obveze podnoSenja 1 dostavljanja potrebne dokumentacie u zakazanom\nroku Povjerenstvu za profesionalne sportske klubove propisanih ovim Zakonom,\n6. ne postuje obvezu podnoSenja 1 dostavljanja potrebne dokumentacie u postupku\nobveznog preoblikovanja propisanih ovim Zakonom,\n\n7. pravna osoba u sustavu sporta ne 1zvrSava obveze 1 zadace propisane ovim Zakonom,\n\n8. ne postuje ogranicenja vezana uz osobe koje sudjeluju u organiziranju 1 vodenju", "\nsportskog natjecanja propisane ovim Zakonom,\n\n9. koja ne objavi godiSnji financijski izvjeStaj sukladno Clanku 76.a ovoga Zakona.\n\n(2) Za prekrSaje iz stavka 1. ovoga Clanka kaznit Ce se 1 odgovorna osoba u pravnoj osobi\nnovéanom kaznom od 5.000,00 do 15.000,00 kuna.\n\nClanak 87.\n\nNovéanom kaznom od 10.000,00 do 15.000,00 kuna kaznit ¢e se za prekrSaj fizi¢ka osoba\nkoja obavlja samostalnu djelatnost u sustavu sporta ako:\n\n1. obavlja strucne poslo", "ve u sportu bez odgovarajuce razine obrazovanja, odnosno\nstrucne osposobljenosti,\n\n2. zapocne obavljati sportsku djelatnost prije upisa u registar sportskih djelatnosti ili\nnastavi obavljati sportsku djelatnost nakon brisanja 1z registra sportskih djelatnosti.\n\nClanak 88.\n\n(1) Novéanom kaznom od 5.000,00 do 15.000,00 kuna kaznit ¢e se za prekrSaj Skola ako\nnovéana 1 druga sredstva dana za aktivnost 1 rad Skolskoga sportskog druStva upotrijebi za\n", "druge namjene, a ne iskljucivo za rad 1 djelovanje Skolskoga sportskog druStva.\n\n(2) Za prekrSaj 1z stavka 1. ovoga Clanka kaznit Ce se 1 odgovorna osoba u Skoli novéanom\nkaznom od 3.000,00 do 10.000,00 kuna.\n\nClanak 89.\n\n(1) Za prekrSaje propisane Clankom 86. 1 87. ovoga Zakona mogu se izre¢i sljedece zaStitne\nmijere:\n\n1. zabrana obavljanja sportske djelatnosti fizic¢koj osobi u trajanju od jednog mjeseca do jedne\ngodine,\n\n2. zabrana obavljanja ", "sportske djelatnosti pravnoj osobi u trajanju od tri mjeseca do jedne\ngodine.\n\n(2) Imovinska korist ostvarena prekrSajem propisanim Clankom 86. 1 87. oduzet ¢e se.\n\n1. PRIJELAZNE I ZAVRSNE ODREDBE\nClanak 90.\n\n(1) Osobe koje na dan stupanja na snagu ovoga Zakona obavljaju poslove trenera, a ne\nispunjavaju uvjet 1z Clanka 9. stavka 2. ovoga Zakona, duzne su u roku od najviSe jedanaest\ngodina od dana stupanja na snagu ovoga Zakona ste¢i odgovarajucu", " strucnu spremu.\n\n(2) Osobe koje su do dana stupanja na snagu ovoga Zakona obavlyjale poslove trenera\nnajmanje 15 godina ili koje su osvojile medalju na olimpijskim igrama, europskim ili\nsvjetskim seniorskim prvenstvima, a koje nisu strucno osposobljene putem ustanove za\nobrazovanje kadra u sportu, mogu nastaviti raditi na tim poslovima, a stru¢nu osposobljenost\nmoraju steci u roku od tri godine od dana stupanja na snagu ovoga Zakona.\n\nClanak 91.", "\n\n(1)Vlada Republike Hrvatske ¢e donijeti Uredbu 0 osnivanju Hrvatske agencije za borbu\nprotiv dopinga u sportu u roku od dva mjeseca od dana stupanja na snagu ovoga Zakona.\n(2)Vlada Republike Hrvatske ¢e donieti Uredbu o kriterijima za dodjeljivanje drzavnih\nnagrada za vrhunska sportska postignuéa, iznose tih nagrada 1 na¢in njihova dodjeljivanja u\nroku od dva mjeseca od dana stupanja na snagu ovoga Zakona.\n\n(3) Prijedlog osoba za prvi saziv Nac", "ionalnog vijeca za sport ovlaStene osobe 1z Clanka 4.\nstavka 1. ovoga Zakona duzne su podniyeti Hrvatskom saboru najkasnije u roku od Sest\nmjeseci od dana stupanja na snagu ovoga Zakona.\n\n(4) Iznimno od odredbe Clanka 4. ovoga Zakona, prilikom imenovanja prvog saziva\nNacionalnog vijeca za sport, Hrvatski sabor imenovat ¢e svih dvanaest Clanova, a zdrijebom\nce se odluciti o tome kojih Sest Ce imenovati na mandat od dvie, dok ¢e preostalih Sest\nime", "novati na Cetiri godine.\n\n(5) Vlada Republike Hrvatske duzna je Hrvatskom saboru podnijeti prijedlog Nacionalnog\nprograma sporta najkasnije u roku od devet mjeseci od dana stupanja na snagu ovoga Zakona.\n(6) Pravilnik 1z Clanka 77. stavka 2. ovoga Zakona ministar je duzan donyeti najkasnije u roku\nod godinu dana od dana stupanja na snagu ovoga Zakona.\n\nClanak 92.\n\n(1) Hrvatski sportski savez invalida 1 Hrvatski sportski savez gluhih od dana stupa", "nja na\nsnagu ovoga Zakona nastavljaju radom kao Hrvatski paraolimpijski odbor 1 Hrvatski sportski\nsavez gluhih.\n\n(2) Savezi 1z stavka 1. ovoga Clanka duzni su uskladiti svoje akte 1 poslovanje s odredbama\novoga Zakona u roku od €etiri mjeseca od dana njegova stupanja na snagu.\n\nClanak 93.\n\nClanak 62. stavak 2. ovoga Zakona primjenjivat ée se od dana stupanja Republike Hrvatske u\npunopravno Clanstvo Europske unjye.\n\nClanak 94.\n\n(1) Republika Hrvat", "ska i pravne osobe u kojima Republika Hrvatska ima vecinski udio 111\nvecinsko pravo glasa, odgadaju, do pet godina od dana stupanja na snagu ovoga Zakona, od\nsportskih klubova-udruga za natjecanje za koje, u smislu ovoga Zakona, nije utvrden\nprofesionalni status, naplatu trazbina koje su do stupanja na snagu ovoga Zakona dospjele, a\nnisu naplacene.\n\n(2) Republika Hrvatska 1 jedinice lokalne 1 podrucne (regionalne) samouprave mogu odgoditi,\ndo pet", " godina od dana stupanja na snagu ovoga Zakona, od sportskih klubova — udruga za\nnatjecanje za koje, u smislu ovoga Zakona, nije utvrden profesionalni status, obvezu pla¢anja\njavnih davanja koje su do stupanja na snagu ovoga Zakona dospjele, a nisu naplacene.\n\n(3) OvlaScuje se ministar da provedbenim propisom, uz suglasnost ministra nadleznog za\nfinancije, propiSe nacin provedbe stavka 1. 12. ovoga Clanka.\n(4) Sportski klubovi-udruge za natjecanj", "e 1z stavka 1.12. ovoga ¢lanka ako u vremenu\nodgode naplate trazbina 1/1li javnih davanja 1z stavka 1. 12. ovoga Clanka, izgube amaterski\nstatus, u smislu ovoga Zakona, gube pravo na odgodu naplate trazbina 1/ili javnih davanja 1z\nstavka 1.12. ovoga Clanka.\n\n(5) Sportski klubovi-udruge za natjecanje kojima je utvrden profesionalni status, ako u\nvremenu odgode naplate trazbine 1/1li javnih davanja 1z stavka 1. 1 2. ovoga Clanka, izgube\nprofesional", "ni status, ne stjecu pravo na odgodu naplate trazbina 1/ili javnih davanja, sukladno\nstavcima 1.12. ovoga Clanka.\n\nClanak 95.\n\n(1) Ministar ¢e propise 1z Clanka 7. stavka 2., lanka 17. stavka 4., ¢lanka 20. stavka 2., lanka\n24. stavka 5., élanka 26. stavka 6., ¢lanka 39. stavka 3., lanka 55. stavka 5., ¢lanka 60. stavka\n5., lanka 66. stavka 4., €lanka 80. stavka 6. 1 Clanka 94. stavka 3. ovoga Zakona donyeti u\nroku od mjesec dana od dana stupanja", " na snagu ovoga Zakona.\n\n(2) Ministarstvo nadlezno za poslove zdravstva utvrdit ce listu ovlaStenth liecnika-specijalista\nsportske medicine, odnosno specialista medicine rada 1 sporta koji Ge utvrdivati opcu 1\nposebnu zdravstvenu sposobnost 1z Clanka 71. stavka 2. ovoga Zakona u roku od tri mjeseca\nod dana stupanja na snagu ovoga Zakona.\n\n(3) Ministar nadlezan za zdravstvo ¢e propis 1z Clanka 71. stavka 3. ovoga Zakona donyeti u\nroku od tri mjese", "ca od dana stupanja na snagu ovoga Zakona.\n\nClanak 96.\n\n(1) Sportski klubovi-udruge za natjecanje duzni su zahtjev za upis u Registar profesionalnih\nsportskih klubova 1z Clanka 24. stavka 2. ovoga Zakona podnyyeti u roku od 15 dana od dana\ndonoSenja pravilnika 1z Clanka 24. stavka 5. ovoga Zakona.\n\n(2) Sportske udruge duzne su uskladiti svoj rad, djelovanje 1 donijeti opce akte sukladno\nodredbama ovoga Zakona u roku od tri mjeseca od dana njegova", " stupanja na snagu.\n\nClanak 97.\n\nSportski klubovi duzni su u roku od tri mjeseca od dana stupanja na snagu ovoga Zakona\nuskladiti se sa zahtjevom 1z Clanka 23. stavka 2. ovoga Zakona.\n\nClanak 98.\n\nObvezuje se Vlada Republike Hrvatske podniyeti Hrvatskom saboru prijedlog mreZe sportskih\ngradevina 1z Clanka 66. stavka 1. ovoga Zakona u roku od godinu dana od dana stupanja na\nsnagu ovoga Zakona.\n\nClanak 99.\n\n(1) Propisi doneseni na temelju odredbi Z", "akona o sportu (»Narodne novine« br. 111/97.,\n13/98. 1 24/01.) ili odrzani na snazi na temelyu odredbi toga Zakona ostaju na snazi, osim\nodredbi koje su suprotne odredbama ovoga Zakona, do donoSenja propisa na temelju\nodredaba ovoga Zakona.\n\n(2) Opci akti doneseni na temelju odredbi Zakona o sportu (»Narodne novine« br. 111/97.,\n13/98. 1 24/01.) ostayu na snazi, osim odredbi koje su suprotne odredbama ovoga Zakona, do\ndonoSenja op¢cih akata na te", "melju odredaba ovoga Zakona.\n(3) Nazivi, op¢i akti, dokumenti 1 druge isprave koji su utvrdeni, doneseni, odnosno izdani do\nstupanja na snagu ovoga Zakona, a sadrze rijec: »sport« nemaju obvezu mijenjati ju u riyec:\n»Ssport«.\n\nClanak 100.\n\nPostupci zapoceti prema odredbama Zakona o sportu (»Narod ne novine«, br. 111/97., 13/98.\n1 24/01.) 1 propisa donesenih na temelju toga Zakona dovrSit Ce se prema odredbama toga\nZakona.\n\nClanak 101.\n\nDanom stup", "anja na snagu ovoga Zakona prestaje vaziti Zakon o sportu (»Narodne novine« br.\n111/97., 13/98. 1 24/01.).\n\nClanak 102.\nOvaj Zakon stupa na snagu osmoga dana od dana objave u »Narodnim novinama«.\n\nKlasa: 620-01/06-01/01\nZagreb, 9. lipnja 2006.\n\nPrijelazne i zavrSne odredbe iz NN 124/10:\n\nClanak 5.\n\n(1) Hrvatska agencija za borbu protiv dopinga u sportu (u daljnjem tekstu: HADA) pripaja se\nHrvatskom zavodu za toksikologiju koji danom stupanja na s", "nagu ovoga Zakona mijenja\nnaziv u: »Hrvatski zavod za toksikologiju 1 antidoping«.\n\n(2) Danom stupanja na snagu ovoga Zakona Hrvatski zavod za toksikologiju 1 antidoping (u\ndaljnjem tekstu: Zavod) nastavlja neprekinuti kontinuirani rad u borbi protiv dopinga u svim\nmedunarodnim asocijacijama u kojima je do stupanja na snagu ovoga Zakona djelovala\nHADA, te preuzima sva prava 1 obveze u borbi protiv dopinga na temelyu medunarodnih\n\nkonvenciya.\n\n(3)", " Danom stupanja na snagu ovoga Zakona, Zavod preuzima sredstva, prava, obveze,\nposlove, pismohranu 1 drugu dokumentaciju te sluzbenike 1 namjeStenika HADA-e.\n\nClanak 6.\n\nDanom stupanja na snagu ovoga Zakona prestaje vaziti Uredba 0 osnivanju Hrvatske agencije\nprotiv dopinga u sportu (»Narodne novine«, br. 18/07.).\n\nClanak 7.\nOvaj Zakon stupa na snagu danom objave u »Narodnim novinama«.\n\nKlasa: 620-01/10-01/02\nPrijelazne i zavrSne odredbe iz NN 85", "/15:\nClanak 9.\n\n(1) Zupanijski sportski savezi, odnosno sportski savez Grada Zagreba i nacionalni sportski\nSaveZi Osnovani u sportu u kojem najmanje polovina sportskih klubova koji sudjeluju u\nnajvisem rangu nacionalnog sportskog natjecanja imaju profesionalni status u smislu Clanka\n24. Zakonu o sportu (»Narodne novine«, br. 71/06., 150/08., 124/10., 124/11., 86/12. 1\n94/13.), duzni su u roku od Sest mjeseci od dana stupanja na snagu ovoga Zakona", " provesti\nizbore za skupStinu 1 sazvati skupStinu Zupanijskih sportskih saveza, odnosno sportskog\nsaveza Grada Zagreba 1 nacionalnih sportskih saveza u skladu s odredbama Clanka 2. 1 3.\novoga Zakona.\n\n(2) Protekom roka iz stavka 1. ovoga Clanka zupanijski sportski savezi, odnosno sportski\nsavez Grada Zagreba 1 nacionalni sportski savezi osnovani u sportu u kojem najmanje\npolovina sportskih klubova koji sudjeluju u najviSem rangu nacionalnog sport", "skog natjecanja\nimaju profesionalni status u smislu ¢lanka 24. Zakona o sportu (»Narodne novine«, br. 71/06.,\n150/08., 124/10., 124/11., 86/12. 1 94/13.) nece se financirati 1z sredstava javnih potreba u\nsportu dok ne provedu uskladenje s odredbama 1z Clanaka 2. 13. ovoga Zakona.\n\nClanak 10.\n\nMinistar nadlezan za sport donijet ¢e pravilnik iz Clanka 5. ovoga Zakona u roku od 60 dana\nod dana stupanja na snagu ovoga Zakona.\n\nClanak 11.\n\nOvaj Zakon ", "stupa na snagu osmoga dana od dana objave u »Narodnim novinama«.\n"]