"[\"Na temelju \\u00a2lanka 27. Statuta Hrvatskog olimpijskog odbora, a u skladu s \\u00e9lancima 45. i 46. Zakona o sportu (Narodne novine br.141/2022) i \\u00e9lanka 13. Zakona o udrugama (Narodne novine br. 74/2014., 70/2017.,98/2019. i 151/2022. ), SkupStina Hrvatskog olimpijskog odbora, na svojoj 41. sjednici odrzanoj 6. studenog 2015. godine, donijela je Statut Hrvatskog olimpijskog odbora (broj: 928/15, od 6. studenog 2015. ), a odluke o izmjenama i dopunama Statuta Hrvatskog olimpijskog odbora usvojene su na 43. sjednici Skup&tine Hrvatskog olimpijskog odbora odrzanoj 29. veljac\\u00e9e 2016. godine, (broj: 216/16 od 01. oZujka 2016. ), na 50. sjednici Skupstine Hrvatskog olimpijskog odbora odrzanoj 28. velja\\u00a2e 2018. godine (broj: 358/2018 od 19.04.2018. }, na 55. sjednici Skupstine Hrvatskog olimpijskog odbora odrzanoj 8. srpnja 2020. (broj: 438/20 od 10. 07.2020. ), na 58. elektroni\\u00e9koj sjednici Skupstine Hrvatskog olimpijskog odbora dana 5. studenog 2020. godine (broj: 761/20 od 19.11.2020. ), na 65. sjednici SkupStine Hrvatskog olimpijskog odbora odrzanoj 13. rujna 2022. godine (broj: 1029/2022 od 13.09.2022. ), na 67. sjednici SkupStine Hrvatskog olimpijskog odbora odrzanoj 27. veljace 2023. godine (broj: 267/2023 od 03.03.2023), na 69. elektroni\\u00a2\\u00e9koj sjednici Skupstine Hrvatskog olimpijskog odbora odrzanoj elektronickim glasovanjem Clanova Skupstine HOO-a u razdoblju od 09.-14.kolovoza 2023. (broj: 1082/2023 od 30.08.2023.) kao i na 73. sjednici Skupstine Hrvatskog olimpijskog odbora odrzanoj 09. srpnja 2024. godine (Klasa; 030-08/24-01/3, urbroj: 442-01-05-24-1) slijedom kojih se utvrduje STATUT HRVATSKOG OLIMPUSKOG ODBORA procisceni tekst 1. IZVORISNE OSNOVE Olimpijski pokret u Hrvatskoj je joS 1894. poceo promicati Franjo Bu\\u00e9ar, no ideja o prijemu u medunarodnu olimpijsku obitelj mogla se ostvariti tek uspostavom samostalne Republike Hrvatske. Izrazavajuci stoljetnu Zelju hrvatskih sportasa i sportskih djelatnika da Hrvatska bude priznatim \\u00a2lanom Medunarodnog olimpijskog odbora na sjednici Hrvatskog olimpijskog odbora, odrzanoj 10. rujna 1991. godine u Zagrebu je utemeljen Hrvatski olimpijski odbor i usvojena su Pravila Hrvatskog olimpijskog odbora. Hrvatski olimpijski odbor osnovali su nacionalni sportski savezi 29 olimpijskih sportova i tri udruzenja. Odluka o privremenom priznanju Hrvatskog olimpijskog odbora donesena je 17. sijecnja 1992. godine u Lausannei od strane predsjednika i \\u00a2etiri potpredsjednika Medunarodnog olimpijskog odbora, a u skladu s ovlastima koje im je povjerio Izvrsni odbor Medunarodnog olimpijskog odbora, na sastanku 4., 5. i 6. prosinca 1991. godine u Lausannei. Navedenom odlukom Medunarodni olimpijski odbor pozvao je Hrvatski olimpijski odbor da sudjeluje na 16. Zimskim olimpijskim igrama u Albertvilleu i na Igrama 25. olimpijade u Barceloni. Potpuno priznanje Hrvatskog olimpijskog odbora uslijedilo je na 101. zasjedanju Medunarodnog olimpijskog odbora u Monacu, 24. rujna 1993. godine. Il. TEMELNE ODREDBE Elanak 1. Statutom Hrvatskog olimpijskog odbora (dalje u tekstu: Statut) ureduje se naziv, sjediste, zastupanje, izgled pe\\u00e9ata, ciljevi i djelatnosti kojima se ostvaruju ciljevi, ustrojstvo i nacin rada, \\u20aclanstvo i nagin ostvarivanja prava i obveza \\u20aclanova, natin uporabe i zastite simbola i obiljezja Medunarodnog olimpijskog odbora i Hrvatskog olimpijskog odbora, na\\u00e9in osiguranja javnosti rada, natin stjecanja i raspolaganja imovinom, prestanak postojanja, postupak s imovinom u sluaju prestanka postojanja, te druga pitanja u vezi s djelokrugom i zada\\u00e9ama Hrvatskog olimpijskog odbora. Clanak 2. (1) Hrvatski olimpijski odbor (dalje u tekstu: HOO)\", \"je krovno sportsko udruZenje u Republici Hrvatskoj, u koje se udruzuju nacionalni sportski savezi, sportske zajednice u Zupanijama i Gradu Zagrebu te druge pravne osobe Cija je djelatnost od zna\\u00e9aja za promicanje sporta i olimpijskog pokreta u Republici Hrvatskoj, sukladno ovom Statutu, a prema na\\u00e9elima olimpijskog pokreta i Olimpijske povelje (2) HOO je obvezan postovati odredbe Olimpijske povelje i odluke Medunarodnog olimpijskog odbora (dalje u tekstu: MOO) kao vrhovnog tijela olimpijskog pokreta. (3) HOO se obvezuje, sukladno zada\\u00e9ama i ulozi_na_nacionalnoj_razini, sudjelovati u aktivnostima promicanja mira i Zena u sportu. Isto se tako obvezuje podrZavati i poticati promidzbu sportske etike, boriti se protiv dopinga i pokazivati odgovornu brigu za pitanja okoliga. (4) Da bi ispunio svoju zada\\u00e9u, HOO moie suradivati s vladinim, odnosno drZavnim tijelima u Republici Hrvatskoj s kojima uspostavlja skladne odnose, pri \\u20acemu ta aktivnost ne smije biti u suprotnosti s Olimpijskom poveliom. HOO suraduje is neviadinim tijelima u Republici Hrvatskoj, koja djeluju ili su povezana s djelatno\\u00e9u HOO-a. (5) HOO mora \\u00e9uvati svoju autonomiju i oduprijeti se pritiscima svake vrste od politickih, pravnih, vjerskih, ekonomskih i drugih pritisaka koji su u suprotnosti s Olimpijskom poveljom. (6) HOO je \\u00e9lan Udruzenja nacionalnih olimpijskih odbora (ANOC), Europskih olimpijskih odbora (EOC), Medunarodnog odbora Mediteranskih igara (ICMG), Europske nevladine sportske organizacije (ENGSO), Medunarodnog fair play odbora (IFPC) i Europskog fair play pokreta (EFPM). Clanak 3. (1) HOO je u svom djelovanju samostalan. (2) HOO se ustrojava i djeluje sukladno odredbama Olimpijske povelje, Zakona o sportu i Zakona o udrugama. (3) HOO je neprofitna pravna osoba. (4) HOO se upisuje u Registar udruga Republike Hrvatske pri nadleznom upravnom tijelu Grada Zagreba, Registar neprofitnih organizacija pri Ministarstvu financija Republike Hrvatske, te u Eidenciji pravnih osoba u sportu. Elanak 4. (1) Puni naziv je: Hrvatski olimpijski odbor. (2) Skraceni naziv je: HOO. (3) Osim punog i skra\\u00e9enog naziva na hrvatskom jeziku, moze se koristiti i puni naziv na engleskom jeziku. (4) Puni naziv na engleskom jeziku je: Croatian Olympic Committee. (5) Skraceni naziv na engleskom jeziku je: NOC of Croatia. (6) Naziv na engleskom jeziku moze se koristiti samo uz istodobno navodenje naziva na hrvatskom jeziku, koji se navodi na prvom mijestu. (7) U sluzbenoj uporabi HOO-a je hrvatski jezik i latini\\u00e9no pismo, dok se u korespondenciji s inozemstvom koristi engleski ili francuski jezik. (8) Puni naziv na francuskom jeziku je Comit\\u00e9 Olympique Croate. (9) Skra\\u00e9eni naziv na francuskom je: CNO Croate. Elanak 5. (1) HOO djeluje na podru\\u00e9ju Republike Hrvatske. (2) SjediSte HOO-a je u Zagrebu, Odranska 1/1. Elanak 6. HOO ne dopusta rasnu, etnicku, nacionalnu, vjersku, politi\\u00e9ku i spolnu diskriminaciju te krSenje sloboda i prava Covjeka i gradanina. Glanak 7. Za svoje obveze HOO odgovara cijelom svojom imovinom, u skladu sa zakonom. Elanak 8. (1) HOO ima znak i zastavu odobrenu od Izvrsnog odbora Medunarodnog olimpijskog odbora. (2) Znak HOO-a sastoji se od tri elementa: rijeci Hrvatska (ili Croatia) iznad koje se nalazi pet olimpijskih krugova, a ispod rijeci je Sest crvenih kvadrata sastavljenih u obliku obrnutog trapeza. (3) Zastava HOO-a je bijele\", \"boje, omjera Sirine i duzine 1 prema 2, sa znakom HOO-a smjestenim u sredini zastave. Sredi&nja to\\u00a2ka znaka poklapa se s to\\u00a2kom u kojoj se sijeku dijagonale zastave. Zastavu, znak i himnu koje \\u00e9e koristiti HOO u svojim aktivnostima, ukljucujuci i olimpijske igre, mora odobriti Izvr\\u00a7ni odbor MOO-a. Clanak 9. (1) HOO ima peat i Stambilj. (2) Pe\\u00e9at je okruglog oblika, promjera 30 mm, s ispisanim tekstom uz rub: \\u201cHrvatski olimpijski odbor - Croatian Olympic Committee\\\", a u sredini se nalazi znak HOO-a. (3) Stambilj je pravokutnog oblika, dug 50 i Sirok 20 mm, s ispisanim tekstom: \\\"Hrvatski olimpijski odbor - Croatian Olympic Committee, Trg Kregimira Cosi\\u00e9a 11, HR-10000 Zagreb\\\". \\u20aclanak 10. (1) HOO predstavija predsjednik HOO-a, a u njegovoj odsutnosti ili sprijecenosti dopredsjednik ili drugi lan Vije\\u00e9a kojeg odredi predsjednik, odnosno kojeg odredi Vijece HOO-a (dalje u tekstu: Vijece) u slu\\u00e9aju nemogu\\u00e9nosti da predsjednik o tome odlu\\u00e9i. (2) U svim poslovima HOO zastupaju predsjednik HOO-a (dalje u tekstu: predsjednik) i glavni tajnik HOO-a (dalje u tekstu: glavni tajnik). (3) Odredene poslove zastupanja predsjednik odnosno glavni tajnik mogu prenijeti na tre\\u00e9e osobe, na temelju pisane punomo\\u00e9i, kojom se odreduju ovlasti i opseg zastupanja. Clanak 11. (1) Rad HOO a je javan. (2) Javnost rada osigurava se i ostvaruje na nacin utvrden ovim Statutom. Il. CIUEVI, PODRUCGJE DJELOVANJA SUKLADNO CILJEVIMA | DJELATNOST Clanak 12. (1) Ciljevi HOO-a su: - promicanje olimpijskih na\\u00e9ela, eti\\u00a2kih i moralnih normi u sportu poticanje i promicanje cjelokupnog hrvatskog sporta te njegovo predstavijanje pred MOO om i drugim odgovarajucim medunarodnim sportskim organizacijama i udruzenjima _ uskladivanje i poticanje aktivnosti nacionalnih sportskih saveza fazvoj i promicanje sporta na drZavnoj razini te poticanje i suradnja u provedbi aktivnosti u podrudju razvoja sporta na razini zupanija, gradova i opcina (2) HOO sukladno ciljevima djeluje na podru\\u00a2ju sporta. (3) Djelatnost HOO-a u ispunjavanju navedenih ciljeva je: poticanje i promicanje sporta i olimpizma u Republici Hrvatskoj, razvijanje, promicanje i zaStita olimpijskog pokreta sukladno Olimpijskoj povelji promicanje temeljnih nacela i vrijednosti olimpizma u Republici Hrvatskoj, osobito u podru\\u00e9jima sporta i obrazovanja, promicanjem olimpijskih obrazovnih programa na svim razinama skola, sportskih institucija i institucija tjelesnog odgoja kao i poticanjem stvaranja institucija posvecenih olimpijskom obrazovanju, kao Sto je to Hrvatska olimpijska akademija, olimpijski muzej i drugi programi, ukljucujuci i kulturne programe, koji se odnose na olimpijski pokret. poticanje etickih i moralnih na\\u00e9ela, poStivanje Ijudskog dostojanstva, fair playa, tolerancije, nenasilja i kulture sporta djelovanje na odrzavanju skladnih odnosa i suradnje s odgovarajucim drzavnim i nedrzavnim tijelima sudjelovanje u radu Nacionalnog vijeca za sport sudjelovanje u predlaganju i provodenju nacionalne strategije sporta i nacionalnog plana razvoja sporta, te u provedbi Nacionalnog programa sporta, sudjelovanje u predlaganju i ostvarivanju mjera za unapredenje i razvoj sporta provodenje postupka kategorizacije sportova za sportove koji su razvrstani u Nomenklaturi sportova i sportskih grana u nadleZnosti HOO-a i donoSenje odluke o rangiranju sportova i razvrstavanju u kategorije sudjelovanje u predlaganju i provodenju dijela programa javnih potreba u sportu drzavne razine djelovanje na razvijanju prijateljstva, medusobnog razumijevanja i ravnopravnosti te izgradnji boljeg i\", \"mirnijeg svijeta poduzimanje mjera protiv svih oblika diskriminacije i nasilja u sportu zalaganje za ravnopravnost spolova u sportu poticanje sporta djece i mladih promocija sporta putem medija zalaganje za razvoj sportske rekreacije-sporta za sve uskladivanje i kontrola aktivnosti nacionalnih sportskih saveza i suradnja u provedbi aktivnosti u podrugju razvoja sporta sa sportskim zajednicama u Zupanijama i Gradu Zagrebu u ostvarivanju programa javnih potreba sporta drzavne razine, odnosno ukupnog programa sporta i utvrdene strategije razvoja sporta poticanje razvoja vrhunskih sportskih dostignu\\u00e9a hrvatskih sportaga i njihovog sudjelovanja u nacionalnim ekipama na olimpijskim i mediteranskim igrama, svjetskim i europskim prvenstvima, te drugim velikim medunarodnim sportskim natjecanjima sudjelovanje u provedbi zdravstvene skrbi u sportu sudjelovanje u provedbi aktivnosti, pripadajucih pravila i postupaka za borbu protiv dopinga u sportu, kao i koriStenja supstanci te postupaka koje zabranjuje MOO ili medunarodni savezi zaStita i o\\u00a2uvanje \\u00e9ovjekova okolifa, te uklju\\u00e9enje u svjetski pokret u borbi protiv klimatskih promjena brigom i aktivnostima za postizanje odrzivog razvoja u sustavu sporta zastita povrsina i objekata za sport borba protiv svih oblika politi\\u00e9ke i komercijalne zloupotrebe sporta i sportaga poduzimanje aktivnosti i mjera za\\u00e9tite djece u sportu te o svakom kr\\u00e9enju prava djece, osobito svim oblicima nasilja nad djecom, spolne zloporabe, zanemarivanja ili nehajnog postupanja, zlostavijanja ili izrabljivanja djece u sportskim natjecanjima ili u vezi sa sportom obavijestiti nadlezna tijela koordiniranje lanova HOO-a pri izradi protokola za postupanje u slu\\u00a2aju nasilja medu djecom u sportskim klubovima sudjelovanje u organiziranju i poticanju znanstvenih i razvojnih projekata u sportu utvrdivanje sustava, uvjeta i na\\u00e9ela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj sudjelovanje u organiziranju olimpijskih igara i drugih velikih medunarodnih sportskih natjecanja i priredbi poticanje i poduzimanje aktivnosti za unapredenje strucnog rada u sportu i skrbi o osposobljavanju i usavrsavanju strucnih djelatnika u sportu te obrazovanje sportskih djelatnika u svrhu promicanja temeljnih na\\u00e9ela olimpizma putem programa HOO-a i Hrvatske olimpijske akademije, kao i drugih odgovarajucih ustanova i organizacija provedba stru\\u00e9nog nadzora nad radom trenera koji su financirani kroz program javnih potreba u sportu drzavne razine kontrola i izvjestavanje tijela drzavne uprave nadleZnog za sport o ucinku svih programa, a posebno razvojnih programa za sportase i trenere koji su financiranji kroz program javnih potreba u sportu drzavne razine nadzor nad stru\\u00e9nim radom nacionalnih sportskih saveza, sukladno \\u00a2lanku 110. Zakona o sportu utvrdivanje nomenklature sportova dostavljanje podataka u Nacionalni informacijski sustav u sportu poduzimanje aktivnosti za primjenu medunarodnih sportskih pravila te donoSenje akata u vezi s njihovom primjenom djelovanje na povezivanju Republike Hrvatske putem sporta s drugim drzavama radi zblizavanja s drugim narodima, zblizavanja sportasa i drugih sudionika u sportu \\u20acuvanje neovisnosti i autonomije HOO a i sporta odupiranjem pritiscima svake vrste od politickih, pravnih, vjerskih, ekonomskih i drugih pritisaka koji su u suprotnosti s Olimpijskom poveljom obavijanje i drugih zadaca koje su utvrdene zakonom, ovim statutom i drugim propisima. (4) Osim djelatnosti iz stavka 3. ovog \\u00e9lanka HOO moze obavijati i gospodarsku djelatnost odnosno marketinsku djelatnost, kao dio aktivnosti promocije sporta radi osiguranja sredstava za financiranje zada\\u00e9a i ostvarenja ciljeva HOO-a. HOO\", \"svoju gospodarsku djelatnost ne smije obavijati radi stjecanja dobiti. Ukoliko u obavijanju svoje gospodarske djelatnosti HOO ostvari dobit, ona se mora koristiti isklju\\u00e9ivo za obavljanje i unapredenje djelatnosti HOO-a, kojima se ostvaruju ciljevi HOO-a, utvrdeni ovim Statutom, sukladno zakonu. Clanak 13. (1) HOO ima iskljucive ovlasti predstavijanja hrvatskog sporta na olimpijskim igrama, te svjetskim, europskim i regionalnim visesportskim natjecanjima koja se odrzavaju pod pokroviteljstvom MOO-a ili Europskih olimpijskih odbora. (2) HOO je duzan sudjelovati na natjecanjima navedenim u prethodnom stavku ovog \\u00a2lanka, u skladu s Olimpijskom poveljom. (3) HOO stvara, organizira i vodi svoje delegacije na olimpijske igre, te svjetska, europska i regionalna visesportska natjecanja koja se odrzavaju pod pokroviteljstvom MOO-a ili EOC-a, te je odgovoran za ponaSanje Clanova delegacije. (4) HOO odlu\\u00e9uje o prijavi sportaga koje su predloZili njihovi nacionalni sportski savezi. Izbor sportaSa temelji se ne samo na sportskom dostignucu ve\\u00e9 i na njihovim sposobnostima da budu primjer mladosti svoje zemlje. O uskladenosti prijava nacionalnih sportskih saveza s odredbama Olimpijske povelje brine HOO (5) HOO ustrojava i vodi sluzbenu evidenciju o osvaja\\u00e9ima medalja na olimpijskim igrama i zimskim olimpijskim igrama te svjetskim prvenstvima u olimpijskim sportovima i disciplinama. (6) HOO izdaje uvjerenje iz evidencije iz stavka 5. ovog \\u00e9lanka na zahtjev sportaSa osvaja\\u00e9a medalje u svrhu ostvarivanja prava na trajnu nov\\u00e9anu mjese\\u00e9nu naknadu osvajaca medalja na olimpijskim igrama i svjetskim prvenstvima u olimpijskim sportovima i disciplinama, sukladno odredbama Zakona o sportu. (7) HOO vodi sluzbenu evidenciju o trenerima i izbornicima koji su obavijali stru\\u00e9ne poslove vodenja sporta\\u00e9a ili ekipe na sportskom natjecanju, odnosno olimpijskim igrama /i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama/, i koji su zasluzni za medalju koja je osvojena na olimpijskim igrama te izdaje uvjerenje izbornicima i trenerima, na njihov zahtjev, u svrhu ostvarivanja prava na trajnu mjese\\u00e9nu nov\\u00e9anu naknadu, sukladno odredbama Zakona o sportu. (8) HOO je iskljucivo ovlagten da odabere i imenuje grad koji se moze prijaviti za organizaciju Olimpijskih igara u Republici Hrvatskoj. (9) HOO usvaja i primjenjuje Svjetski kodeks protiv dopinga, na taj nacin osiguravajuci da strategije i pravila HOO-a protiv dopinga, \\u00e9lanstvo i zahtjevi financiranja, te rezultati upravljackih postupaka budu u skladu sa Svjetskim kodeksom protiv dopinga i postuju sve uloge i odgovornosti nacionalnog olimpijskog odbora koji su navedeni unutar Svjetskog kodeksa protiv dopinga. (10) HOO ima zadacu &tititi olimpijsko vlasnistvo te je odgovoran Medunarodnom olimpijskom odboru za postivanje pravila i dopunskih propisa pravilima Olimpijske povelje vezanim uz skrb za zaStitu prava koja se odnose na olimpijske igre i olimpijskom viasnistvo, koje obuhva\\u00e9a olimpijski simbol, olimpijsku zastavu, olimpijsko geslo, olimpijske znakove, olimpijsku himnu, olimpijski plamen i olimpijske baklje te olimpijske oznake na podrucju Republike Hrvatske, a ovlasten je poduzimati mjere za zabranu korigtenja olimpijskog vlasnigtva, ako je to u suprotnosti s pravilima ili dopunskim propisima Olimpijske povelje. (11) HOO utvrduje svoju opredijeljenost i spremnost poduzimanja aktivnosti za podrzavanje integriteta sporta, uklju\\u00e9ujuci za&titu gistih sportasa i poStenog natjecanja, kao i za borbu protiv manipulacije natjecanjima pridrZavaju\\u00e9i se normi Kodeksa olimpijskog pokreta o sprjecavanju manipulacije sportskim natjecanjima, sukladno pripadaju\\u00a2em op\\u00e9em aktu\", \"HOO-a, pri \\u00e9emu zahtijeva od svojih Glanova da u\\u20acine isto. Elanak 14. (1) HOO-u je Zakonom o sportu, povjerena javna oviast za utvrdivanje kategorija sportasa i donoSenje rjesenja o kategorizaciji sportasa. (2) HOO ustrojava i vodi registar kategoriziranih sportasa. Iv. \\u20acLANSTVO Elanak 15. (1) Clanovi HOO a su: nacionalni sportski savezi sportske zajednice u Zupanijama te Gradu Zagrebu druge pravne osobe Cija je djelatnost od interesa za razvoj hrvatskog sporta i olimpijskog pokreta sukladno ovom Statutu. (2) Odluku o u\\u00e9lanjenju u HOO donosi Skupstina HOO-a (dalje u tekstu: SkupStina). (3) Popis Clanova HOO-a vodi se elektronicki, a za svaku Clanicu Saveza obvezno sadrii: e podatak o nazivu \\u00a2lana OIB \\u00e9lana datum pristupanja HOO u kategoriji Clanstva datum prestanka Clanstva (za one Clanove koji nisu vise clanovi HOO-a) (4) Popis \\u00e9lanova HOO-a je dostupan na uvid svim Clanovima i nadleZnim tijelima, na njihov zahtjev. Clanak 16. (1) Clanovi HOO-a samostalne su, autonomne udruge s pravnom osobnog\\u00a2u i odredenim pravima, obvezama i odgovornostima u HOO-u, koje iskazuju: - svojim ustrojem, programskom i poslovnom djelatnoscu - osiguravanjem financijskih sredstava i drugih uvjeta za svoju djelatnost pravom odlu\\u00a2ivanja iz svog djelokruga. (2) Clanovi HOO-a mogu biti punopravni, pridruzeni i privremeni te po\\u00e9asni \\u00e9lanovi. Punopravni \\u00e9lanovi Clanak 17. (1) Punopravni \\u00e9lanovi HOO-a mogu biti: nacionalni sportski savez, sportska zajednica u Zupanijama i Gradu Zagrebu ako ispunjava slijede\\u00e9e kriterije i uvjete: 1. Nacionalni sportski savez: da je medunarodnu federaciju istog sporta priznao MOO ili da je u\\u00e9lanjena u pripadaju\\u00e9e udruzenje medunarodnih sportskih federacija / SportAccord da je osnovan sukladno Zakonu o sportu i Zakonu o udrugamai registriran kod nadleznog upravnog tijela Zupanije odnosno Grada Zagreba da je svrha osnivanja i djelovanja razvoj i unapredenje, Sirenje i promicanje sporta u Republici Hrvatskoj prema na\\u00e9elima sporta i olimpizma da ima tijela saveza izabrana i registrirana sukladno statutu, Zakonu o sportu i Zakonu o udrugama, te da ima op\\u00e9e akte utvrdene navedenim zakonima i usvojene od nadleznih tijela saveza da ima osigurane kadrovske i stru\\u00e9ne te osnovne materijalne uvjete za rad i djelovanje da drugi nacionalni savez istog sporta nije u\\u00e9lanjen u HOO da prihva\\u00e9a Statut HOO a. 2. Sportska zajednica Zupanije i Grada Zagreba (dalje u tekstu: sportska zajednica): da je osnovana sukladno Zakonu o sportu i Zakonu o udrugama i registrirana kod nadleznog upravnog tijela Zupanije odnosno Grada Zagreba da je svrha osnivanja i djelovanja razvoj i unapredenje, Sirenje i promicanje cjelokupnog sporta na podrugju njenog djelovanja prema na\\u00e9elima sporta i olimpizma daima tijela sportske zajednice izabrana i registrirana sukladno statutu, Zakonu o sportu i Zakonu o udrugama da prihva\\u00e9a Statut HOO a. (2) Punopravni \\u00e9lan HOO a je i Hrvatski klub olimpijaca, ako ispunjava slijedece uvjete: da je osnovan sukladno Zakonu o sportu i Zakonu o udrugama i registriran kod nadleznog upravnog tijela Zupanije odnosno Grada Zagreba da je svrha osnivanja i djelovanja razvoj i unapredenje sporta i olimpizma da ima tijela Kluba izabrana i registrirana sukladno statutu, Zakonu o sportu i Zakonu udrugama da prihva\\u00e9a Statut HOO a. Pridruzeni \\u00e9lanovi Elanak 18. PridruZeni Clanovi HOO\", \"a mogu biti: 1. Nacionalni sportski savez koji ne ispunjava kriterije i uvjete iz Clanka 17. tocke 1. u alinejama 1.15. ako SkupStina odluci da je njihovo udlanjenje od interesa za hrvatski sport u cijelosti. 2. Pravna osoba - udruga i ustanova Cija je djelatnost od znacenja za hrvatski sport (dalje u tekstu: udruga) ako ispunjava slijedece kriterije i uvjete: da je odgovarajucu medunarodnu udrugu priznao MOO ili da je uclanjen u pripadajuce udruZenje medunarodnih sportskih federacija / SportAccord da je osnovana sukladno zakonu i registrirana pri nadleznom tijelu da je svrha osnivanja i djelovanja udruge doprinos razvoju i unapredenju, Sirenju i promicanju cjelokupnog sporta u skladu s na\\u00e9elima sporta i olimpizma daima osigurane kadrovske, stru\\u00e9ne i osnovne materijalne uvjete za rad i djelovanje da prihva\\u00e9a Statut HOO a. Elanak 19. (1) Zahtjevu za u\\u00e9lanjenje nacionalni sportski savez i sportska zajednica ili udruga prilazZu dokaze o ispunjavanju kriterija i uvjeta navedenih u Clancima 17. i 18. ovog Statuta, a naroCito: Statut rjeSenje o upisu u registar nadleznog tijela obavijest Drzavnog zavoda za statistiku o razvrstavanju poslovnog subjekta u djelatnosti popis \\u00a2lanova podatke o osobama ovlaStenim za zastupanje i predstavljanje opis osnovnih znacajki sporta, dosadasnjeg djelovanja saveza ili udruge, te opci akt o sustavu, uvjetima i organizaciji sportskih natjecanja tog sporta kad zahtjev za uclanjenje podnosi nacionalni sportski savez. (2) Ukoliko za odredeni jedan sport djeluje jedna medunarodna federacija tog sporta koju je priznao MOO ili koja je u\\u00e9lanjena u pripadajuce udruzenje medunarodnih sportskih federacija - - SportAccord, a u Republici Hrvatskoj se iz takvog sporta samovoljnim izdvajanjem (cijepanjem) osnuje drugi ili vise saveza, HOO ne\\u00e9e udovoljiti zahtjevima novoosnovanih saveza ili udruga za u\\u00e9lanjenje u HOO. Privremeni Clanovi Elanak 20. (1) SkupStina moze privremeno priznati novi nacionalni sportski savez na rok od dvije godine ili drugo razdoblje koje utvrdi Skupstina, a u kojem ce HOO pratiti djelovanje podnositelja zahtjeva za udlanjenje, a nakon kojeg u slu\\u00e9aju da nije donesena odluka o prijemu u \\u00a2clanstvo HOO-a, privremeno priznanje automatski gubi valjanost. Za vrijeme privremenog \\u00e9lanstva pripadajuci nacionalni sportski savez ima prava i duznosti kao i pridruzeni \\u00a2lanovi HOO-a. Vijece HOO-a ovlaSteno je donijeti op\\u00e9i akt o na\\u00e9inu i postupku na koji se utvrduje ispunjenje uvjeta iz ovog Statuta za prijem u \\u00e9lanstvo HOO-a kao i o uvjetima za promjenu statusa \\u00e9lana HOO-a iz privremenog u pridruzeno, odnosno punopravno ili obrnuto. (2) Odredba prethodnog stavka ovog \\u00e9lanka ne primjenjuje se ako prijem za u\\u00e9lanjenje podnosi nacionalni sportski savez \\u00a2ija je medunarodna federacija istog sporta uklju\\u00e9ena u program olimpijskih igara. Elanak 21. (1) Clanovi HOO-a u ostvarivanju zajednickih interesa, zada\\u00e9a i poslova, odredenih zakonom, ovim Statutom i Olimpijskom poveljom imaju prava i obveze: sudjelovati u radu HOO a i njegovih tijela i davati prijedloge radi Sto uspjesnijeg ostvarivanja ciljeva i zada\\u00e9a HOO a birati predstavnike u Skup8tinu u skladu s odredbama ovog Statuta provoditi aktivnosti kojima se ostvaruju zada\\u00e9e i ciljevi utvrdeni ovim Statutom sudjelovati u utvrdivanju i provodenju dijela programa javnih potreba u sportu drZavne razine u nadleZnosti HOO a te prema vlastitom\", \"sudjelovanju u tom programu ostvarivati pravo na financiranje programskih zada\\u00a2\\u00e9a iz sredstava HOO a u skladu s odredbama Zakona o sportu kojima se definiraju javne potrebe u sportu na drZavnoj razini u nadleZnosti HOO a i kriterijima koje utvrduje HOO, a sukladno odredbama op\\u00a2ih akata HOO a, te na zahtjev HOO a, dostavljati izvjeS\\u00e9a u dijelu programa javnih potreba sporta drZavne razine u kojem sudjeluje \\u00e9lan HOO a dostavljati HOO u statut kao i svaku izmjenu i dopunu statuta, na prethodno misljenje radi utvrdivanja suglasnosti da je statut lana HOO a suglasan sa Statutom HOO a i Zakonom o sportu, a prije registracije pri nadleznom upravnom tijelu Zupanije odnosno Grada Zagreba. uskladiti op\\u00e9i akt o sustavu, uvjetima i organizaciji sportskih natjecanja u pojedinom sportu s op\\u00a2im aktom HOO a o na\\u00e9elima i osnovnim elementima sustava sportskih natjecanja u Republici Hrvatskoj provoditi odluke i zaklju\\u00e9ke HOO a i njegovih tijela te odgovarati za njihovo izvrsavanje ostvarivati druga prava i izvrSavati druge obveze u skladu sa zakonom i ovim Statutom. (2) Pridruzeni \\u20aclanovi HOO-a imaju prava, obveze i odgovornosti utvrdene prethodnim stavkom ovog \\u00e9lanka, osim: prava odlugivanja u Skupstini (3) SkupStina moze na prijedlog Vije\\u00a2a HOO-a donijeti odluku da se prava i obveze \\u00a2lana HOO-a nad kojim je otvoren ste\\u00e9ajni postupak stavijaju u mirovanje, osim prava na financiranje odredenih programskih zada\\u00a2a sportskog programa Clana HOO-a u ste\\u00e9aju, o \\u00a2cijem opsegu i namjeni odlucuje Vije\\u00a2e HOO-a, u okviru usvojenog proracuna HOO-a (4) Kod utvrdivanja prethodnog misljenja na Statut, odnosno izmjene i dopune Statuta Clana HOO-a, slijedom odredbe stavka 1. alineja 5. ovog clanka, HOO \\u00a2e poStovati specifi\\u00a2nosti pojedinog sporta, nacionalnog sportskog saveza ili lokalne sportske zajednice, koje su isti unijeli u Statut. Po\\u00e9asni \\u00a2lanovi \\u20aclanak 22. (1) Za po\\u00e9asne \\u00e9lanove HOO-a Skupstina imenuje fizicke osobe narotito zasluzne za dugogodisnji doprinos uspjesnom djelovanju HOO-a, razvoju sporta i olimpizma, na temelju posebnog akta na prijedlog Vijeca. (2) Po\\u00e9asni \\u00e9lanovi mogu sudjelovati u radu SkupStine bez prava glasa. Prestanak \\u00a2lanstva \\u20aclanak 23. (1) Clanu HOO-a prestaje \\u00e9lanstvo: - na vlastiti pisani obrazloZeni zahtjev \\u00a2lana brisanjem iz registra nadleznog upravnog tijela Zupaanije odnosno Grada Zagreba kada vise ne udovoljava osnovnim uvjetima za \\u00e9lanstvo u HOO u iz lanka 17. i 18. ovog Statuta. pokretanjem stecajnog postupka 13 ako se rjeSenjem nadleZnog upravnog tijela Zupanije odnosno Grada Zagreba utvrdi da je Clan prestao djelovati \\u2014 isklju\\u00e9enjem iz HOO a. (2) U slu\\u00e9aju pokretanja stezajnog postupka nad nacionalnim sportskim savezom, HOO odlukom Vije\\u00e9a HOO a preuzima skrb o nacionalnoj sportskoj ekipi te poduzima potrebne aktivnosti za zaStitu interesa sportaga i stecenih prava na medunarodnoj razini. Clanak 24. Kada Clan HOO a svojim djelovanjem: ne ostvaruje ciljeve i zadace zbog kojih je osnovan ne pridrzava se ili kr3i na\\u00e9ela i pravila Olimpijske povelje i ovog Statuta ne izvrSava ine provodi odluke i zakljucke tijela HOO a, ne djeluje sukladno Zakonu o sportu i Zakonu o udrugama, odnosno nema tijela izabrana i registrirana sukladno navedenim zakonima i/ili nema op\\u00e9e akte propisane zakonom i usvojene od nadlegnih tijela, podlijeze mjerama i sankcijama\", \"utvrdenim ovim Statutom. Elanak 25. (1) Radi djelovanja iz clanka 24. Ovog Statuta, Clanovima HOO-a mogu se izre\\u00a2i: a) miere: upozorenje opomena b) sankcije: suspenzija _ isklju\\u00e9enje iz \\u00e9lanstva HOO a. (2) Izricanje mjera ili sankcija utvrdenih u stavku 1. ovog Clanka zavisi o vrsti, teZini i stupnju udinjene povrede ili prekr&aja iz lanka 24. ovog Statuta, a primjenjuje se: Za lakSu povredu: upozorenje ili opomena 2a tezu povredu: suspenzija ili iskljucenje iz lanstva HOO a. (3) O izricanju mjere upozorenja ili opomene odlucuje Vijece. Na prvoj sljedecoj sjednici SkupStine, Vijece izvjestava o izrecenoj mjeri iz prethodnog stavka. (4) O suspenziji ili isklju\\u00e9enju iz Clanstva odlucuje SkupStina. (5) U slu\\u00e9aju hitne potrebe Vijece moze izreci i sankciju suspenzije, o \\u20acemu kona\\u00e9nu odluku donosi SkupStina na prvoj sljedecoj sjednici koja se treba odrzati najkasnije u roku od 60 dana. (6) Posebnim aktom HOO-a ureduju se pitanja provodenja postupka za utvrdivanje povreda ili prekrSaja iz \\u00a2lanka 24. i izricanje odgovarajucih mjera i sankcija utvrdenih u stavku 1. ovog \\u00e9lanka. Vv. USTROJSTVO Glanak 26. (1) Tijela HOO a jesu: 1. SkupStina 2. Predsjednik 3. Vijece 4. Nadzorni odbor 5. Eti\\u00a2ki odbor 6. Komisija sportaSa (2) Samostalno i nezavisno tijelo za rjeSavanje sporova koji se mogu pojaviti izmedu HOO-a i njegovih \\u00e9lanova vezano uz nadleZnosti HOO-a, kao i u pogledu povrede Olimpijske povelje, ovog Statuta i drugih opcih akata HOO-a je: Komisija za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i Clanica (3) Samostalno te operativno i institucionalno nezavisno tijelo za antidoping je: Zalbeno vijece za antidoping (4) Clanovi tijela HOO-a temeljem \\u00e9lanstva u njima, osim tijela iz stavka 3. ovog \\u00e9lanka, ne ostvaruju pravo na nov\\u00e9anu naknadu. (5) U tijelima HOO-a potrebno je osigurati sudjelovanje 40% osoba podzastupljenog spola. 15 1. Skup$Stina a) NadleZnosti SkupStine Clanak 27. Skupstina je najvise upravijacko tijelo HOO-a koje obavija sljede\\u00e9e zadace: donosi Statut i op\\u00e9e akte te njihove izmjene i dopune utvrduje strategiju i politiku razvoja hrvatskog sporta u nadlezZnosti HOO-a donosi odluke o u\\u00e9lanjenju u medunarodne sportske i nedrzavne asocijacije od interesa za HOO i hrvatski sport verificira uspostavljanje odnosa s drugim nacionalnim olimpijskim odborima odlucuje o isticanju kandidature za organizaciju olimpijskih igara, mediteranskih igara i drugih visesportskih natjecanja za koje je potrebno donijeti odluku odlu\\u20acuje o verifikaciji svojih \\u00e9lanova, izboru predsjednika i \\u20acetiri dopredsjednika, \\u00e9lanova Vije\\u00e9a, Clanova Nadzornog odbora, \\u00e9lanova Komisije za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i \\u00e9lanica, \\u00e9lanova Zalbenog vije\\u00e9e za antidoping, vanjskog revizora i likvidatora, te donosi odluku o njihovom razrjeSenju odluuje o statusu svojih \\u00e9lanova - u\\u00e9lanjenju, sankcijama i prestanku \\u00e9lanstva donosi op\\u00a2i akt kojim se utvrduju na\\u00e9ela i osnovni elementi sustava sportskih natjecanja u Republici Hrvatskoj imenuje Eti\\u00a2ki odbor i osniva Hrvatsku olimpijsku akademiju osniva posebna povjerenstva za izvrsavanje odredenih zada\\u00e9a usvaja godisnje i viSegodisnje planove i programe dijela javnih potreba sporta drzavne razine u nadleznosti HOO-a, godi&nji financijski plan HOO-a, odnosno dio programa javnih potreba sporta drzavne razine u nadleZnosti HOO-a i financijski plan HOO-a za slijedecu godinu, kao i njegove izmjene i dopune, a iznimno u\", \"slu\\u00e9aju potrebe privremeni financijski plan HOO-a, te izvjeS\\u00e9a o izvrSenju programa i financijski izvjestaj za prethodnu godinu. donosi projekt priprema i sudjelovanja na olimpijskim i zimskim olimpijskim igrama donosi kriterije za lokalne sportske zajednice na razini gradova u odnosu na \\u00e9lanstvo u Odboru lokalnih sportskih zajednica donosi odluku o promjeni ciljeva i djelatnosti, prestanku rada i raspodjeli preostale imovine obavlja i druge poslove i zadace odredene zakonom, te je nadlezna i za sva pitanja za koja nije utvrdena nadleznost drugih tijela HOO-a, kada se radi o pitanjima koja po svom zna\\u00a2aju upucuju na nadleznost najviseg tijela upravijanja HOO-a. b) Sastav SkupStine Elanak 28. (1) SkupStinu Cine: po jedan predstavnik nacionalnih sportskih saveza, Zupanijskih sportskih zajednica i Grada Zagreba, te udruga i ustanova tri predstavnika Komisije sportasa tri predstavnika Hrvatskog kluba olimpijaca, natjecatelja na olimpijskim igrama Glanovi MOO a u Hrvatskoj po funkciji po\\u00e9asni \\u00e9lanovi MOO a u Hrvatskoj po funkciji. (2) Pravo glasa u SkupSstini imaju svi predstavnici nacionalnih sportskih saveza iz lanka 17. ovog Statuta, sportskih zajednica zupanija i Grada Zagreba, sva tri predstavnika Komisije sportasa i Hrvatskog kluba olimpijaca, te \\u20aclanovi MOO-a u Hrvatskoj. (3) Predstavnici Komisije sportSa se moraju povuci sa svojih mjesta u Skupstini HOO-a najkasnije krajem tre\\u00e9e olimpijade nakon posljednjih olimpijskih igara u kojima su sudjelovali. (4) Drzava i njezina tijela kao i druga tijela javne viasti i nedrzavnih institucija, sukladno Olimpijskoj povelji, ne mogu imenovati svoje predstavnike u SkupStinu. Clanak 29. (1) Predstavnici nacionalnih sportskih saveza uclanjenih u medunarodne federacije olimpijskih sportova moraju imati vecinu glasova u Skup5Stini. (2) Radi provedbe odredbe stavka 1. ovog \\u00a2lanka predstavnici nacionalnih sportskih saveza uclanjenih u medunarodne federacije olimpijskih sportova imaju po dva glasa u Skup&tini. Clanak 30. (1) Za Elana SkupStine moze biti izabrana osoba koja ispunjava slijedece uvjete i kriterije: da je drzavijanin Republike Hrvatske da je afirmiran sporta\\u00e9 ili sportski djelatnik da prihvaca i promi\\u00e9e na\\u00e9ela i pravila Olimpijske povelje, Etickog i Medicinskog kodeksa, Svjetskog kodeksa protiv dopinga te ovog Statuta dase nije ogrijeSio o eti\\u00e9ke norme i na\\u00e9ela olimpijskog pokreta da nije kaZnjen disciplinskom kaznom nacionalnog sportskog saveza, osim kazne koju su dobili sportaSi u sustavu natjecanja danema zapreke iz \\u00e9lanka 114. odnosno \\u00e9lanka 111. stavci 1. i2. Zakonao sportu da nije zaposten ili angaziran po ugovoru o djelu ili drugom odgovarajucem ugovoru, u HOO u, odnosno u \\u00e9lanovima HOO a, na teret sredstava financijskog plana HOO a (2) Clanovi Skup&tine obvezni su potpisati posebnu izjavu o postivanju Olimpijske povelje i ovog Statuta. (3) Odbijanje potpisa izjave iz prethodnog stavka ovog Clanka ima zna\\u00e9aj ostavke, te je \\u00e9lan HOO-a, kojeg predstavlja, duzan predloziti novog predstavnika. (4) Jedan \\u00e9lan SkupStine moje biti predstavnik, sto ukljucuje i zamjenu predstavnika, samo jednog Clana HOO-a. c) Mandat Skup8tine Clanak 31. (1) Mandat SkupStine traje \\u00e9etiri godine, a podinje te\\u00e9i danom odrzavanja izborne sjednice Skupstine na kojoj se verificira vecina mandata predstavnika \\u00e9lanova HOO-a za novi saziv SkupStine. (2) Ista osoba moze biti ponovno izabrana u Skupstinu za novo mandatno razdoblje. Naknadno izabranom \\u00e9lanu Skup8tine mandat traje do isteka\", \"mandata saziva SkupStine za koji je izabran. (3) Iznimno, u slu\\u00e9aju sprije\\u00e9enosti Clana Skupstine da sudjeluje na sjednici SkupStine, nadlezno tijelo nacionalnog sportskog saveza, sportske zajednice i udruge moze, na temelju pisane odluke, imenovati zamjenika za tu sjednicu. (4) Mandat zamjenskog \\u00e9lana za tu sjednicu podlijeze verifikaciji SkupStine. Elanak 32. (1) Izbori predstavnika u Skup&tinu objavijuju se najkasnije 60 dana prije odrZavanja izborne SkupStine novog saziva. (2) Izbornu sjednicu SkupStine saziva predsjednik na temelju odluke Vijeca. Clanak 33. (1) Clanovi Skup&tine sudjeluju u radu i odlucivanju zasnivajuci svoje stajaliste prije svega na: zahtjevima provodenja utvrdene strategije razvoja sporta u Republici Hrvatskoj zajednitkim obvezama i odgovornostima za ostvarivanje programa javnih potreba u sportu Republike Hrvatske teZnjama k ostvarivanju sportskih vrijednosti koje pridonose razvitku, afirmaciji ugledu hrvatskog sporta i Republike Hrvatske zajedni\\u00e9kim interesima svih udruzenih \\u00e9lanica i obvezi izvrSenja ciljeva i zadaca HOO a utvrdenih zakonom, ovim Statutom i Olimpijskom poveljom. (2) Obveza je \\u00a2lanova Skupstine u svakoj prigodi zastupati i Stititi interese HOO-a, hrvatskog sporta i olimpizma te interese udruge koju predstavijaju. (3) Clanovi Skup&tine duzni su prije svake sjednice Skup\\u00e9tine ili Odbora provesti konzultacije s udrugom koju predstavljaju oko materijala za tocke dnevnog reda na sjednicama. \\u20aclanak 34. Elanu Skup&tine mandat moze prestati: - \\u2014 istekom trajanja mandata na koji je izabran - gubitkom drzavijanstva Republike Hrvatske podnoSenjem neopozive ostavke opozivom od strane nacionalnog sportskog saveza, sportske zajednice odnosno udruge \\u00a2iji je predstavnik nastupanjem okolnosti zbog kojih vise ne moZe obavijati duznost kada se utvrde uvjeti nespojivosti odredenih funkcija i duznosti u HOO u, odnosno njegovoj Stru\\u00e9noj sluzbi i njegovim tlanovima ako je \\u00e9lan SkupStine predstavnik saveza ili druge udruge nad kojom je pokrenut stecajni postupak razrjesenjem. Clanak 35. (1) U slu\\u00e9ajevima iz \\u00e9lanka 34. alineje 1. do 6. ovog Statuta, \\u00e9lanstvo prestaje automatski, bez provodenja posebnog postupka, verifikacijom stanja na sjednici SkupStine. (2) U slu\\u00e9aju razrjeSenja iz \\u00e9lanka 34. alineje 8. ovog Statuta, mandat lana u SkupStini moze prestati u slucaju: ako ne prihva\\u00e9a, ne promice, ne pridrZava se ili kr3i na\\u00e9ela i pravila Olimpijske povelje, Etickog, ili Medicinskog kodeksa, Svjetskog kodeksa protiv dopinga te ovog Statuta ako svojim nedoli\\u00e9nim ponaganjem &teti interesima ili ugrozZava ugled HOO a i olimpijskog pokreta u hrvatskoj javnosti ili na medunarodnom planu ako tijekom dvije godine neopravdano izostaje sa sjednica Skup$tine, ili ne izvr\\u00e9ava zada\\u00a2e koje proizlaze iz Statuta i odluka Skup$tine i njezinih tijela. (3) RazrjeSenje \\u00e9lana SkupStine zbog jednog ili vige razloga iz stavka 2. ovog \\u00e9lanka moze zatraziti nacionalni sportski savez, Zupanijska zajednica ili udruga, te \\u00e9lanovi Skupstine. (4) RazrjeSenje lana SkupStine zbog razloga iz \\u00e9lanka 34. alineja 7. ovog Statuta SkupStini prediaze Vije\\u00e9e HOO-a. (5) U slu\\u00e9aju kad razrjeSenje Clana Skup\\u00e9tine trazi \\u00e9lan Skup\\u00e9tine, takav zahtjev se stavija na razmatranje ako ga je podrialo najmanje petnaest \\u00e9lanova SkupStine s pravom glasa. Clanak 36. (1) Odluku o prestanku \\u00e9lanstva u SkupStini zbog jednog ili vie utvrdenih razloga iz \\u00e9lanka 35. stavka 2. ovog Statuta, donosi Skup\\u00e9tina na temelju pisanog zahtjeva ovlastenog tijela ili osobe iz Clanka 35. stavka 3. ovog\", \"Statuta, dvotrecinskom vecinom glasova nazo\\u00e9nih \\u00e9lanova s pravom glasa na sjednici Skupstine. (2) Clan SkupStine o \\u20acijem se prestanku \\u00e9lanstva u Skup$tini raspravlja, ima pravo prije glasovanja pred Skupstinom izloiiti svoj stav, a u slu\\u00e9aju da osporava podneseni zahtjev za njegovo razrjeSenje moze zatraziti misljenje Etickog odbora, koje \\u00e9e biti razmatrano na Skup8tini zajedno s podnesenim zahtjevom za razrjeSenje. (3) RazrijeSeni lan Skupstine ne moze vise postati Elanom Skup\\u00e9tine niti Obavijati bilo koju drugu funkciju u HOO-u, ako je razrijeSen u skladu s \\u00e9lankom 35. stavcima 2. i 3. ovog Statuta. (4) Isklju\\u00e9eni \\u00e9lan MOO-a ne moze vige biti lan HOO-a. d) Sjednice SkupStine Clanak 37. (1) SkupStina HOO-a odlucuje o pitanjima iz svoje nadleznosti na sjednicama. 20 (2) Sjednice SkupStine saziva i predsjedava im predsjednik, a u slu\\u00e9aju njegove odsutnosti ili sprijecenosti jedan od dopredsjednika kojeg on oviasti. (3) Izborne sjednice SkupStine saziva predsjednik, a predsjedava joj troclano radno predsjednistvo koje se bira izmedu \\u00a2lanova SkupStine s pravom glasa. U radno predsjednistvo ne mogu biti birani kandidati za predsjednika HOO-a. (4) Sjednice SkupStine saziva predsjednik: kad ocijeni potrebnim, a najmanje dva puta godisnje natemelju zakljucka Vijeca na obrazlozeni zahtjev najmanje jedne trecine Clanova SkupStine na obrazlozZeni pisani zahtjev Nadzornog odbora. (5) Skupstina moze pravovaljano odlucivati ako je na sjednici nazocan onaj broj \\u00a2lanova SkupStine \\u00a2iji ukupan broj glasova Cini za jedan glas vise od polovine ukupnog broja glasova \\u00e9lanova SkupStine s pravom glasa. (6) Clanu SkupStine na izbornoj sjednici SkupStine HOO a, oduzet \\u00a2\\u00e9e se pravo glasa u slu\\u00e9aju da je predstavnik Elana HOO a koji nema urednu registraciju o vazecim mandatima tijela upravljanja i zastupanja. \\u20aclanak 38. (1) Sjednice SkupStine mogu biti redovne, izvanredne, tematske, svecane i izborne. (2) Izvanredne i tematske sjednice SkupStine saziva predsjednik na viastitu inicijativu, ili na temelju zaklju\\u00e9ka, odnosno zahtjeva iz Clanka 37. stavka 4. alineje 2. do 4. ovog Statuta. (3) Zahtjev za sazivanje izvanredne sjednice Skupstine mora sadrzavati prijedlog dnevnog reda i pisano obrazlozenje s prijedlogom tema za dnevni red sjednice. (4) Ako nadlezno tijelo SkupStine ovlasteno za sazivanje sjednice Skupstine, prema odredbi \\u00e9lanka 37. stavak 2., ne sazove izvanredu sjednicu Skupstine u roku od 30 dana od dana prijema zaklju\\u00e9ka, odnosno zahtjeva za sazivanje izvanredne sjednice postavijenog u skladu s odredbama ovog Statuta, inicijator moze sam sazvati trazenu izvanrednu sjednicu SkupStine. (5) Tematske sjednice SkupStine odrzavaju se osobito, radi razmatranja posebne problematike olimpijskih sportova, neolimpijskih sportova ili sporta na lokalnoj razini. (6) Sve\\u00e9ane sjednice Skupstine mogu se sazvati povodom Velikog dana hrvatskog sporta 17. sije\\u00e9nja, odnosno drugog datuma kojeg odredi Vije\\u00e9e HOO-a, te Hrvatskog olimpijskog dana 10. rujna. 21 (7) Izborne sjednice Skup\\u00e9tine odrzavaju se svake \\u00e9etiri godine, nakon odrzanih olimpijskih igara. (8) U slu\\u00e9aju isteka mandata tijelima HOO-a, SkupStinu HOO-a saziva zadnja osoba za zastupanje upisana u Registar udruga ili najmanje 1/3 punopravnih \\u00e9lanova HOO-a, koje su upisane u popis clanova HOO-a prije isteka mandata tijelima HOO-a. Clanak 38.4 (1) Iznimno, u slu\\u00e9aju izvanrednih okolnosti i u hitnim slu\\u20acajevima, odnosno u situacijama kad je odluka Skup&tine hitna, a nema\", \"dovoljno vremena ili drugih uvjeta da se odrzi redovna sjednica Skup\\u00e9tine, SkupStina moze donijeti odluku glasovanjem \\u00e9lanova SkupStine bez neposrednog dolaska \\u00a2lanova SkupStine na sjednicu, izjaSnjavanjem o prijedlogu odluke putem e-maila (elektroni\\u00e9ka sjednica). (2) Za organizaciju navedene elektroni\\u00e9ke sjednice dostavlja se prijedlog ili pitanje \\u00a2lanu Skup8tine s prijedlogom da se izjasni ,Za\\u201c, ,,Protiv\\u201d ili ,SuzdrZan\\u201c u odnosu na prijedlog odluke koju je potrebno usvojiti na hitan na\\u00e9in bez sazivanja sjednice. (3) Takve odluke zahtijevaju prihvacanje od strane vecine svih \\u00e9lanova SkupStine HOO-a s Pravom glasa, uklju\\u00e9uju\\u00e9i provedbu odredbe iz \\u00e9lanka 29. stavak 2. Statuta, ali iskljucujuci primjenu odredbe lanka 31. stavak 3. Statuta. (4) O elektroni\\u00e9koj sjednici sastaviti \\u00e9e se, a zatim i verificirati, zapisnik na slijede\\u00e9oj redovnoj sjednici Skupstine HOO-a. \\u20aclanak 39. (1) SkupStina donosi odluke dvotrecinskom vecinom glasova nazo\\u00e9nih \\u00e9lanova na SkupStini s pravom glasa, u slijedecim slu\\u00e9ajevima: kod donoSenja Statuta HOO a kao i njegovih izmjena i dopuna kod odlugivanja o prestanku \\u00e9lanstva u Skup8tini u skladu s \\u00e9lankom 36. stavak 1. ovog Statuta. (2) Odluku o prestanku rada HOO-a donosi SkupStina dvotrecinskom vecinom ukupnog broja glasova Clanova u Skup\\u00e9tini s pravom glasa. (3) O svim drugim pitanjima, osim stavaka 1. i 2. Ovog Clanka, Skup3tina donosi odluke vecinom glasova nazo\\u00e9nih \\u00e9lanova s pravom glasa na sjednici SkupStine. (4) U slu\\u00e9aju jednakog broja glasova zai protiv odlucuje glas predsjedavaju\\u00e9eg SkupStine. Clanak 40. Glasovanje u Skup8tini je javno osim: 22 ako SkupStina dvotrecinskom vecinom glasova nazocnih Clanova s pravom glasa, odlugi da je glasovanje o pojedinim pitanjima tajno i kad se glasuje o izboru tijela HOO a, a broj predlozenih kandidatata je veci od broja osoba koje se bira za pojedino tijelo. \\u20aclanak 41. Kada se radi o: ulanjenju HOO a u MOO i asocijacije njegovih Clanova \\u2014 isticanju kandidature za organizaciju olimpijskih igara uspostavljanju odnosa s drugim nacionalnim olimpijskim odborima projektu priprema i sudjelovanja na olimpijskim igrama, kod odlugivanja se uzimaju u obzir samo glasovi Elanova SkupStine predstavnika nacionalnih sportskih saveza uclanjenih u medunarodne federacije olimpijskih sportova, \\u00a2lanova Vijeca, predstavnika Komisije sportasa i Hrvatskog kluba olimpijaca. Clanak 42. Poslovnikom o radu Skupstine podrobnije se ureduju sazivanje, sadrzaj rada i tijek sjednica, prava, obveze i odgovornosti \\u00a2lanova SkupStine u vezi sa sjednicom, kao i druga pitanja od znacenja za odrzavanje sjednica. e) Stalna radna tijela SkupStine Elanak 43. Stalna radna tijela SkupStine jesu: odbor Ijetnih olimpijskih sportova odbor zimskih olimpijskih sportova odbor neolimpijskih sportova odbor lokalnih sportskih zajednica Clanak 44. (1) Odbor Ijetnih olimpijskih sportova cine \\u00e9lanovi SkupStine koji su predstavnici nacionalnih sportskih saveza Ciji su sportovi ukljuceni u program igara olimpijade (/jetne). U Odboru Ijetnih 23 olimpijskih sportova ne sudjeluju predstavnici nacionalnih sportskih saveza \\u00a2iji sportovi su ukljuceni u program zimskih olimpijskih igara. (2) Odbor zimskih olimpijskih sportova eine \\u00e9lanovi SkupStine koji su predstavnici nacionalnih sportskih saveza Ciji su sportovi ukljugeni u program zimskih olimpijskih igara. (3) Odbor neolimpijskih sportova \\u00e9ine \\u00e9lanovi SkupStine koji su predstavnici svih neolimpijskih nacionalnih sportskih saveza, punopravnih i pridruzenih Clanova HOO-a koji nisu na programu igara olimpijade niti zimskih olimpijskih igara. (4)\", \"Odbor lokalnih sportskih zajednica gine \\u00e9lanovi Skup8tine koji su predstavnici sportskih zajednica u Zupanijama i Gradu Zagrebu te predstavnici sportskih zajednica u pojedinim gradovima prema odluci Skup8tine. (5) Svi Clanovi u stalnim radnim tijelima Skup\\u00e9tine pri odlugivanju raspolazu s jednim glasom. (6) Stalna radna tijela Skup&tine sastaju se u pravilu prije sjednica Skup\\u00e9tine ili prema potrebi. (7) Odbori mogu, prema potrebi, djelovati zasebno ili zajednicki, sa drugim odborima, na svojim sjednicama. \\u20aclanak 45. (1) Sjednice stalnih radnih tijela Skup&tine saziva i predsjedava im jedan od \\u00e9lanova Vije\\u00e9a HOO- a iz redova predstavnika u Skup&tini HOO-a koji sukladno odredbi \\u00e9lanka 44. Statuta HOO-a cine pripadajuci odbor, a kojeg Skup&tina imenuje za predsjednika tog stalnog radnog tijela. (2) Stalno radno tijelo Skup&tine donosi poslovnik o svom radu. Clanak 46. (1) Odbor Ijetnih olimpijskih sportova bavi se pitanjima u odnosu na sudjelovanje na igrama olimpijade, europskim i mediteranskim igrama, te drugim visesportskim priredbama pod pokroviteljstvom MOO-a za sve sportove koji su ukljuceni u program igara olimpijade, program europskih i mediteranskih igara, kao i drugim pitanjima aktivnosti tih nacionalnih sportskih saveza vezanih uz program javnih potreba u sportu na drzavnoj razini, a naro\\u00a2ito: razmatra prijedlog kriterija za nastup_na igrama olimpijade, olimpijskim igrama mladih, europskim i mediteranskim igrama za sve sportove fazmatra prijedlog liste sudionika igara olimpijade, olimpijskih igara mladih, europskih i mediteranskih igara fazmatra prijedlog programa priprema za igre olimpijade, olimpijske igre mladih, europske i mediteranske igre razmatra prijedlog liste potencijalnih i evidentnih kandidata za sudjelovanje na igrama olimpijade, olimpijskim igrama mladih, europskim i mediteranskim igrama 24 sudjeluje u pripremi kriterija za izradu dijela programa javnih potreba sportu na drzavnoj razini u nadleZnosti HOO a razmatra prijedlog financijskog plana HOO a, u dijelu koji se odnosi na programe utvrdene ovim Clankom Satuta razmatra prijedlog kriterija za kategorizaciju sportaSa razmatra prijedlog na\\u00e9ela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj za nacionalne sportske saveze \\u00a2lanove HOO a. (2) Kad odbor |jetnih olimpijskih sportova razmatra pitanja u odnosu na europske odnosno mediteranske igre, u njegovu radu s pravom glasa sudjeluju i Clanovi SkupStine koji su predstavnici nacionalnih sportskih saveza koji nisu na programu igara olimpijade, ali su u programu europskih odnosno mediteranskih igara. Elanak 47. Odbor zimskih olimpijskih sportova bavi se pitanjima u odnosu na sudjelovanje na zimskim olimpijskim igrama te drugim viSesportskim priredbama pod pokroviteljstvom MOO-a za sve sportove koji su ukljuceni u program zimskih olimpijskih igara, kao i drugim pitanjima aktivnosti tih nacionalnih sportskih saveza vezanih uz program javnih potreba u sportu na drzavnoj razini, a naro\\u00e9ito: razmatra prijedlog kriterija za nastup na zimskim olimpijskim igrama i zimskim olimpijskim igrama mladih za sve sportove razmatra prijedlog liste sudionika zimskih olimpijskih igara i zimskih olimpijskih igara mladih razmatra prijedlog programa priprema za zimske olimpijske igre i zimske olimpijske igre mladih razmatra prijedlog liste potencijalnih i evidentnih kandidata za sudjelovanje na zimskim olimpijskim igrama i zimskim olimpijskim igrama mladih sudjeluje u pripremi kriterija za izradu dijela programa javnih potreba sportu na drzavnoj razini u nadleznosti HOO a razmatra prijedlog financijskog plana HOO a, u dijelu\", \"koji se odnosi na programe utvrdene ovim Clankom Satuta razmatra prijedlog kriterija za kategorizaciju sportasa razmatra prijedlog nacela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj za nacionalne sportske saveze Clanove HOO a. 25 Elanak 48. Odbor neolimpijskih sportova bavi se pitanjima aktivnosti nacionalnih sportskih saveza sportova koji nisu uklju\\u00e9eni u program igara olimpijade, niti zimskih olimpijskih igara, a naro\\u00e9ito: sudjeluje u pripremi kriterija za izradu dijela programa javnih potreba u sportu drzavne razine u nadleZnosti HOO-a razmatra prijedlog financijskog plana HOO-a u dijelu koji se odnosi na programe utvrdene ovim \\u00e9lankom Satuta razmatra prijedlog kriterija za kategorizaciju sportaga razmatra prijedlog nacela i osnovnih elemenata sustava sportskih natjecanja u Republici Hrvatskoj za nacionalne sportske saveze \\u00e9lanove HOO-a. Elanak 49. Odbor lokalnih sportskih zajednica bavi se pitanjima sporta na razini zupanija, gradova i op\\u00e9ina, a naro\\u00a2ito: razmatra pitanja organizacije i djelovanja sporta na lokalnoj razini poti\\u00a2e medusobnu suradnju izmedu lokalnih sportskih zajednica razmatra prijedlog financijskog plana HOO-a u dijelu koji se odnosi na programe poticanja razvoja sporta potice suradnju lokalnih sportskih zajednica i tijela lokalne i podru\\u00e9ne (regionalne) samouprave predlaze Skup\\u00e9tini kriterije za lokalne sportske zajednice na razini gradova u odnosu na \\u20aclanstvo u Odboru lokalnih sportskih zajednica. Elanak 50. (1) Staina radna tijela Skup5tine mogu pravovaljano odlugivati ako je prisutna natpolovi\\u00e9na vecina svih \\u20aclanova. (2) Sve odluke stalna radna tijela donose vecinom glasova prisutnih Clanova. (3) U radu stalnih radnih tijela SkupStine obavezno sudjeluju predstavnici Stru\\u00e9ne sluzbe HOO-a. Clanak 51. Mandat stalnih radnih tijela SkupStine traje paralelno s mandatom Skup3stine. 26 2. Predsjednik Clanak 52. (1) Predsjednik obavija sljedece zadace i poslove: predstavija i zastupa HOO u zemlji i inozemstvu Saziva i predsjedava sjednicama SkupStine i Vijeca poduzima i poti\\u00e9e aktivnosti za promicanje olimpizma i primjenu Olimpijske povelje i ovog Statuta poti\\u00e9e aktivnosti na razvoju i unapredenju funkcioniranja djelatnosti hrvatskog sporta potpisuje protokole, konvencije i deklaracije medunarodnih sportskih i nevladinih asocijacija i institucija od interesa za hrvatski sport potpisuje opce akte HOO a koje donosi SkupStina i Vijece potpisuje verificirane zapisnike odrzanih sjednica SkupStine i Vijeca kojima predsjeda predlaze SkupStini kandidate za dopredsjednike i clanove Vijeca i predlaze Vijecu kandidate za glavnog tajnika pokrec\\u00e9e rjeSavanje pitanja razrjeSenja Clanova Vijeca te dopredsjednika voditelj je delegacije HOO a na olimpijskim, europskim i mediteranskim igrama i drugim viSesportskim priredbama kojima je nazocan izvrSava i druge aktivnosti i obveze sukladno odlukama i zaklju\\u00e9cima Skupstine i Vijeca, odredbama Olimpijske povelje i drugih medunarodnih propisa u sportu, opcim aktima HOO a i ovim Statutom. (2) Za svoj rad predsjednik je odgovoran Skup$tini. (3) U slu\\u00e9aju odsutnosti ili sprijecenosti predsjednika, zamjenjuje ga jedan od dopredsjednika kojeg oviasti predsjednik, odnosno kojeg odredi Vijece u slu\\u00e9aju nemogucnosti da predsjednik o tome odludi. Elanak 53. Za predsjednika moZe biti izabrana osoba koja udovoljava sljedecim uvjetima i kriterijima: - daje drzavljanin Republike Hrvatske da je ugledan sportski djelatnik 27 da viada jednim od sluzbenih jezika MOO a, engleskim ili francuskim da se nije ogrijesio o etitke norme i moraina na\\u00e9ela olimpizma da prihva\\u00e9a ovaj Statut i Olimpijsku povelju da nema\", \"zapreke iz \\u00e9lanka 114. odnosno 111. stavci 1. | 2. Zakona o sportu i \\u00e9lanka 19. stavci 2. i 3. Zakona o udrugama da je Clan Skup8tine. Clanak 54. (1) Predsjednika bira SkupStina na na\\u00e9in i po postupku utvrdenom posebnom odlukom SkupStine o provodenju izbora. (2) Mandat predsjednika traje \\u00e9etiri godine i ista osoba moze biti ponovno izabrana za novo mandatno razdoblje. (3) Kandidate za predsjednika mogu istaci nacionalni sportski savezi, punopravni clanovi HOO-a udlanjeni u mati\\u00e9ne medunarodne federacije olimpijskih sportova izmedu svih \\u00e9lanova SkupStine s pravom glasa. (4) Za isticanje kandidata za predsjednika potrebno je najmanje 10 potpisa punopravnih \\u00e9lanova HOO-a o podrzavanju njegove kandidature. (5) Odluku o pokretanju postupka isticanja kandidata za predsjednika donosi Vije\\u00e9e, kod redovnog izbora, zajedno s odlukom o sazivanju izborne sjednice Skupstine najmanje 60 dana prije termina odrzavanja sjednice, o \\u00e9emu u dalinjem roku od osam dana obavjestava pisanim putem Clanove HOO a. Po\\u00e9asni predsjednik Clanak 55. SkupStina moze, na prijedlog Vijeca izabrati za po\\u00e9asnog predsjednika Hrvatskog olimpijskog odbora, osobu koja je kao predsjednik Hrvatskog olimpijskog odbora svojim izuzetnim radom doprinijela ugledu i razvoju Hrvatskog olimpijskog odbora i olimpijskog pokreta u Hrvatskoj i svijetu. 3. Vijece Clanak 56. (1) Vije\\u00e9e je izvr8no tijelo HOO-a koje obavija sljedece zadace i poslove: prediaze Statut i op\\u00e9e akte HOO a te njihove izmjene i dopune 28 utvrduje akt kojim HOO sudjeluje u predlaganju i provodenju nacionalne strategije razvoja sporta i nacionalnog plana razvoja sporta, te utvrduje elemente za sudjelovanje u predlaganju i ostvarivanju mjera za unapredenje razvoja sporta imenuje glavnog tajnika na temelju provedenog natjecaja i razrjeSava ga imenuje osobe s posebnim ovlastima u stru\\u00a2nim sluzbama na prijedlog glavnog tajnika predlaze uclanjenje u medunarodne sportske i nedrzavne asocijacije od interesa za HOO inicira uspostavljanje i odrzavanje odnosa s drugim nacionalnim olimpijskim odborima predlaze isticanje kandidature za organizaciju olimpijskih igara i drugih viSesportskih natjecanja o kojima odlucuje SkupStina prediaze godisnje i viSegodisnje programe javnih potreba sporta drzavne razine u nadleZnosti HOO-a, godiSnji financijski plan HOO-a, odnosno program javnih potreba sporta drzavne razine u nadleZnosti HOO-a i financijski plan HOO-a za slijedecu godinu, a iznimno u slucaju potrebe privremeni financijski plan HOO-a, te utvrduje prijedlog izvjes\\u00e9a o izvrSenju programa i financijskog izvjeStaja za prethodnu godinu odobrava pokroviteljstvo HOO a pod utvrdenim uvjetima predlaze uclanjenje novih \\u00e9lanova u HOO-a i utvrduje pravila postupka za prijem novih clanova daje preporuke nacionalnim sportskim savezima za uClanjenje u medunarodne federacije predlaze pocasne Clanove HOO a isti\\u20ac\\u00e9e kandidate za Clanstvo u tijelima MOO-a i drugim asocijacijama Ciji je HOO clan imenuje i opoziva predstavnike HOO-a u drugim organizacijama, institucijama i tijelima utvrduje prijedlog projekta priprema i sudjelovanja hrvatskih sportasa na igrama olimpijade i zimskim olimpijskim igrama, a u slu\\u00a2\\u00e9aju Zurne potrebe ovlasteno je utvrditi izmjene i dopune projekta, ukljucujuci i izmjene i dopune Kriterija za razvrstavanje sportasa u kategorije olimpijskih kandidata, koje se na prvoj slijedecoj sjednici SkupStine podnose na verifikaciju, te donosi projekt priprema i sudjelovanja hrvatskih sportasa na europskim i mediteranskim igrama, te drugim viSesportskim natjecanjima utvrduje sudionike olimpijskih igara, olimpijskih igara\", \"mladih, europskih i mediteranskih igara te drugih visesportskih natjecanja u nadleznosti HOO-a imenuje predsjednike i \\u00a2lanove stalnih i povremenih radnih tijela Vijeca, te Clanove urednistva publikacija HOO-a i web redakcije HOO-a 29 odreduje predstavnike HOO-a za sudjelovanje na inozemnim ili tuzemnim skupovima odlucuje o na\\u00e9inu stjecanja i kori8tenja sredstava u okviru usvojenog programa i financijskog plana HOO-a razmatra izvjes\\u00e9a revizija utvrduje prijedlog odluke o promjeni ciljeva i djelatnosti, prestanku rada i raspodjeli imovine HOO-a upravija i raspolaze osnovnim sredstvima u vlasnistvu HOO-a izri\\u20ace mjere i sankcije u skladu s \\u00e9lankom 24. i 25. ovog Statuta imenuje Clanove Zirija za dodjelu \\u201cNagrade HOO-a Matija Ljubek\\u201d i Nagrade ,,Drazen Petrovic\\u201d te raspisuje natje\\u00e9aj, odnosno objavu za dodjelu tih nagrada utvrduje nomenklaturu sportova u Republici Hrvatskoj, s podjelom na ekipne i pojedina\\u00e9ne sportove utvrduje nagin provodenja postupka kategorizacije sportova u HOO-u za sportove koji su razvrstani u Nomenklaturi sportova i donosi odluku o rangiranju sportova i razvrstavanju u kategorije u nadleznosti HOO-a utvrduje nagin i postupak za provedbu nadzora nad stru\\u20acnim radom nacionalnih sportskih saveza utvrduje kriterije i nazin provedbe kontrole uginka svih programa koje realizira HOO, a posebno razvojnih programa za sportage i programe za trenere koji se financiraju kroz program javnih potreba u sportu drzavne razine utvrduje kriterije, na\\u00e9in i postupak provedbe stru\\u20acnog nadzora nad radom trenera koji su financiranji kroz program javnih potreba u sportu drzavne rizine utvrdivanje prethodnog misljenja o postojanju interesa za prijam u_hrvatsko drzavljanstvo fizi\\u00e9ke osobe u sustavu sporta koja je strani drZavijanin, na trazenje tijela drzavne uprave nadleZnog za sport odlucuje 0 poslovodnom ustrojstvu stru\\u00e9nih sluzbi HOO-a, te donosi op\\u00e9e akte o njihovom radu donosi op\\u00e9e akte koji reguliraju pitanja iz nadleznosti Vije\\u00e9a HOO-a, te razmatra i odlucuje o pitanjima iz podrugja djelovanja HOO-a, a koja nisu u nadleznosti SkupStine ili kojeg drugog tijela HOO-a u skladu s odredbama ovog Statuta donosi poslovnik o svom radu 30 obavijai druge zada\\u00e9e i poslove koje mu povjeri Skupstina, odnosno koje su mu stavijene u nadleZnost ovim Statutom ili drugim aktom HOO a (2) Vije\\u00e9e za svoj rad odgovara Skup&tini. Clanak 57. (1) Vije\\u00e9e \\u00e9ini 23 Elana, medu kojima su po funkciji: predsjednik \\u20acetiri dopredsjednika Glan MOO a u Hrvatskoj predstavnik Komisije sportasa. (2) Cetiri dopredsjednika i ostale \\u00a2lanove Vije\\u00e9a, na prijedlog predsjednika bira SkupStina, iz sastava SkupStine, pri Gemu se u predlaganju i biranju dopredsjednika i \\u00a2lanova Vijeca treba voditi ra\\u00e9una o odgovarajucoj zastupljenosti predstavnika Clanova HOO-a s pravom glasa u Skup&tini HOO-a (olimpijski sportovi, neolimpijski sportovi, sportske zajednice), ukljucujuci primjenu pravila 28. to\\u00a2\\u00e9ka 3. (1.2) Olimpijske povelje prema kojoj predstavnici nacionalnih sportskih saveza u\\u00a2\\u00e9lanjenih u medunarodne federacije olimpijskih sportova imaju vecinu u Vijec\\u00a2u HOO-a. (3) Ukoliko nema \\u00e9lana MOO-a u Hrvatskoj kao \\u00e9lana Vijeca HOO-a po funkciji, Skupstina bira lana Vijeca na to mjesto uvaZavajuci odredbu stvaka 1. ovog \\u00e9lanka. Clanak 58. Za \\u00e9lana Vije\\u00e9a moze biti izabrana samo osoba koja udovoljava kriterijima i uvjetima iz \\u00a2clanka 30. stavka 1. ovog Statuta. Clanak 59. Slijedom odredaba Olimpijske povelje: vecinu od ukupnog broja \\u00e9lanova Vijeca cine Clanovi iz\", \"reda nacionalnih sportskih saveza u\\u00e9lanjenih u medunarodne federacije olimpijskih sportova te u Vijecu treba biti najmanje 40% zena od ukupnog boja Clanova Vijeca. Clanak 60. (1) Mandat Vije\\u00e9a traje paralelno mandatu SkupStine \\u00a2etiri godine i ista osoba moze biti ponovno izabrana za novo mandatno razdoblje. (2) Za slu\\u00e9aj razrjeSenja Clana Vije\\u00e9a primjenjuju se odredbe Clanaka 34. i 35. ovog Statuta. 31 (3) Mandat \\u00e9lanu Vijeca prestaje i u slu\\u00e9aju kad je osobi koja je \\u00e9lan Vije\\u00e9a prestao mandat lana Skup8tine. (4) Mandat Glanovima Vije\\u00e9a Prestaje i u slu\\u00e9aju da predsjednik HOO-a podnese ostavku ili bude razrijeSen s te funkcije. Clanak 61. (1) Vijece djeluje na sjednicama. (2) Za donoenje pravovaljanih odluka potrebna je nazo\\u00e9nost ve\\u00e9ine od ukupnog broja \\u00e9lanova Vijeca. (3) Vije\\u00e9e donosi odluke ve\\u00e9inom glasova nazo\\u00e9nih \\u00e9lanova, javnim glasovanjem. (4) Iznimno, od odredbe stavka 3. ovog Clanka dvotrecinskom vecinom glasova \\u00e9lanova Vije\\u00e9a donose se odluke o suspenziji lana Skuptine kao i o Poslovniku o radu Vije\\u00e9a. (5) U slu\\u00e9aju jednakog broja glasova za i protiv, odlu\\u00e9uje glas predsjedavajuceg. Clanak 62. (1) Sjednicama Vije\\u00e9a predsjedava predsjednik, a u slu\\u00e9aju njegove odsutnosti ili sprijecenosti jedan od dopredsjednika kojeg on oviasti. (2) Poslovnikom o radu Vije\\u00e9a podrobnije se odreduju pitanja u vezi s odrZavanjem sjednica. Clanak 63. (1) Sjednice Vije\\u00e9a saziva predsjednik prema potrebi, a najmanje Sest puta godignje. (2) Predsjednik je obvezan sazvati sjednicu Vije\\u00e9a i na obrazlozeni pisani zahtjev najmanje jedne trecine Clanova Vijeca. (3) Sjednice Vije\\u00e9a mogu biti radne ili sve\\u00e9ane. (4) Sjednice Vije\\u00e9a mogu biti otvorene ili zatvorene za javnost, zavisno o sadriaju i zna\\u00e9enju predmeta koji su na raspravi, o \\u20acemu odlucuje Vije\\u00e9e. Clanak 64. (1) Za izvrSavanje odredenih zada\\u00a2a, Vijece svojom odlukom osniva stalna i povremena radna tijela, odnosno povjerenstva. (2) Stalna radna tijela Vije\\u00e9a su: - Zdravstvena komisija Komisija za ravnopravnost spolova u sportu 32 Komisija za sportsko graditeljstvo i okolis Komisija za medunarodne odnose Komisija za razvoj sporta Komisija za digitalizaciju i digitalne medije Komisija za marketing Komisija za informiranje i izdavastvo Komisija za dual karijeru u sportu (3) Povremena radna tijela ili povjerenstva osnivaju se za izvrsenje odredenih zada\\u00a2a. \\u20aclanak 65. (1) Odlukom o osnivanju radnih tijela Vijece odreduje njihov sastav, djelokrug i ovlasti. (2) Na radna tijela Vijeca ne moze se prenijeti odlucivanje u pitanjima koja su ovim Statutom stavljena u nadleZnost Vijeca. (3) Vijece imenuje predsjednike radnih tijela i na njihov prijedlog imenuje Clanove. (4) Vijece verificira programe rada, usvaja prijedloge i izvjeSca radnih tijela. (5) Vije\\u00e9e postavlja tajnike radnih tijela, u pravilu iz sastava strucnih sluzbi HOO-a, na prijedlog glavnog tajnika. Clanak 66. Clanovi Vije\\u00e9a izvrSavaju zadace koje im nalozi Skup&tina, Vijece ili predsjednik. Elanak 67. Obveza je \\u00a2lanova Vije\\u00e9a u svakoj prigodi zastupati i Stititi interese HOO-a, cjelokupnog hrvatskog sporta i olimpijskog pokreta. 4. Nadzorni odbor Elanak 68. Nadzorni odbor Hrvatskog olimpijskog odbora (dalje u tekstu: Nadzorni odbor) tijelo je HOO-a sa zadacom: nadzora nad djelatnos\\u00e9u HOO a provjere zakonitosti u radu i materijalno financijskom poslovanju u HOO u 33 nadzora izvrSavanja odluka i zaklju\\u00e9aka Skup3Stine i Vije\\u00e9a fazmatranje\", \"revizorskog izvjeS\\u00e9a vanjskog revizora i usvajanje revizorskog izvjeS\\u00e9a unutarnjeg revizora kontrola provedbe naloga revizija i davanje uputa i zada\\u00e9a unutarnjoj reviziji provjere pridrZavanja utvrdenih normi i akata HOO a i postivanja ovog Statuta. Clanak 69. (1) \\u20aclanove Nadzornog odbora bira SkupStina tajnim glasovanjem na na\\u00e9in i po postupku utvrdenom posebnom odlukom Skupstine o provodenju izbora u HOO-u. (2) Za izbor \\u00e9lanova Nadzornog odbora mogu biti predlozeni samo kandidati punopravnih \\u20aclanova HOO-a koji nisu \\u00e9lanovi Skup8tine i drugih tijela HOO-a, kao i osobe koje nisu zaposlene ili angazirane po ugovoru o djelu ili drugom odgovaraju\\u00e9em ugovoru, u HOO-u, odnosno u \\u20aclanovima HOO-a, na teret sredstava proracuna HOO-a. Elanak 70. (1) Nadzorni odbor broji pet \\u00e9lanova. (2) Clanovi Nadzornog odbora na prvoj konstituirajucoj sjednici biraju svog predsjednika. (3) Mandat Nadzornog odbora traje Cetiri godine i ista osoba mode biti ponovno birana u novom mandatnom razdobliju. (4) Nadzorni odbor radi na sjednicama, koje saziva predsjednik Nadzornog odbora slanjem pisanog poziva i materijala za to\\u00e9ke dnevnog reda, najmanje pet dana prije dana odrzavanja sjednice Nadzornog odbora. (5) Za pravovaljano donoSenje odluka potrebno je da na sjednici Nadzornog odbora bude nazocno vise od polovice \\u00e9lanova Nadzornog odbora. Odluke se donose vecinom glasova nazo\\u00a2nih \\u00e9lanova Nadzornog odbora. U slu\\u00e9aju jednakog broja glasova ,,za\\u201c ili \\u00bbprotiv\\u2019 odlu\\u00e9uje glas predsjednika odnosno lana koji rukovodi radom Nadzornog odbora. Elanak 71. Nadzorni odbor svoje zada\\u00e9e iz lanka 68. ovog Statuta obavlja nad djelatnoS\\u00e9u: - HOO-a i njegovih tijela \\u20aclanova HOO a u dijelu koji je u nadleznosti HOO a, odnosno kod pravnih i fizi\\u00e9kih osoba kojima je HOO namjenski doznacio sredstva, u dijelu tih dozna\\u00e9enih sredstava. Elanak 72. Radi izvorne informiranosti i uspjesnog djelovanja: 34 predsjedniku Nadzornog odbora dostavlja se poziv s materijalima za sjednice Vijeca predsjednika i \\u00a2lanove Nadzornog odbora poziva se na sjednice Skupstine predsjednik i \\u00a2lanovi Nadzornog odbora dobivaju zapisnike sjednica Vijeca i SkupStine. Clanak 73. (1) Nagin rada Nadzornog odbora propisuje se poslovnikom o radu koji donosi Nadzorni odbor. (2) Stru\\u00e9ne, administrativne i tehnicke poslove za Nadzorni odbor obavijaju strucne sluzbe HOO-a. (3) Stru\\u00e9na sluzba HOO-a, kao i predsjednik i glavni tajnik duzZni su dostaviti na uvid sve trazene dokumente potrebne za rad Nadzornog odbora. 5. Eti\\u00a2ki odbor Elanak 74. (1) HOO osniva Eti\\u00e9ki odbor kao nezavisno tijelo HOO-a osnovano radi razvijanja i modernizacije osnova etickih pravila u sportu, temeljenih na vrijednostima i principima zajam\\u00e9enim Olimpijskom poveljom i ovim Statutom, te skrbi o pridrZavanju i postivanju nac\\u00e9ela i pravila Olimpijske povelje, Statuta HOO-a i drugih opcih akata od strane \\u00a2lanova Skupstine HOO-a, drugih tijela u njihovom radu kao i ostalih sudionika u sportu. (2) Eti\\u00a2ki odbor ima pet \\u00e9lanova, a imenuje ih Skup$tina na prijedlog \\u00e9lanova HOO-a i/ili \\u20aclanova Skup$tine. (3) Clanovi Eti\\u00e9kog odbora ne mogu biti osobe koje su \\u00e9lanovi Skup&tine HOO-a ili bilo kojeg drugog upravlja\\u00e9kog tijela HOO-a, kao ni osobe koje imaju zapreke utvrdene \\u00a2lankom 111. stavci 1. i 2. Zakona o sportu. (4) Mandat Etickog odbora traje \\u00e9etiri godine, a iste osobe mogu biti ponovno imenovane za \\u00a2lana Eti\\u00a2kog odbora. (5) Eti\\u00e9ki\", \"odbor sudi u vijecu. Predsjednik Eti\\u00a2kog odbora saziva sjednice vijeca, a odluke se donose vecinom glasova svih Clanova vije\\u00e9a Etickog odbora. (6) Posebnim aktom SkupStne ureduju se pitanja ustrojstva, djelokruga i natina rada Etitkog odbora. 6. Komisija sportaSa HOO a Clanak 75. Komisija sportaSa HOO-a (dalje u tekstu: Komisija sportaSa) je stalno tijelo HOO-a, koje se osniva sukladno odredbama Olimpijske povelje i Smjernica MOO-a za osnivanje komisija sportaga nacionalnih olimpijskih odbora, \\u00e9ija misija je predstavljanje misljenja sportaSa i njihovo 35 aktivno sudjelovanje u tijelima HOO-a, koje treba osigurati da se pri dono&enju odluka HOO-a uzmu u obzir migljenja i stavovi sportaga. Clanak 76. Djelovanje Komisije sportasa obuhva\\u00e9a: fazmatranje pitanja koja se odnose na sportage i davanje prijedloga i miSljenja tijelima HOO a Zastupanje prava i interesa sportaSa i davanje preporuka poduzimanje aktivnosti za obrazovanje sportaga i rjeSavanje drugih pitanja zna\\u00e9ajnih za sportase odrzavanje kontakata s Komisijom MQO a i EOO a za sportaSe te Hrvatski klubom olimpijaca promovira i poti\\u00a2e aktivnosti za primjenu i poStovanje Etickog kodeksa MOO a suradnju sa sportskim komisijama nacionalnih sportskih saveza i Hrvatskim klubom olimpijaca _ biranje predsjednika Komisije sporta\\u00e9a, tri predstavnika u Skupstinu HOO a i medu njima jednog Clana Vijec\\u00e9a HOO a sudjelovanje u predlaganju sportaga kandidata Republike Hrvatske za sportske komisije MOO a i EOO a, sukladno kriterijima koje utvrduje MOO i EOO suradnju u aktivnostima za primjenu i postovanje pravila Olimpijske povelje MOO a, koja se odnose na sportase, borbu protiv svakog oblika diskriminacije i nasilja u sportu, kao i protiv uporabe supstanci i te postupaka koje zabranjuje MOO ili medunarodni savezi djelovanje na razvijanju prijateljstva, medusobnog razumijevanja i ravnopravnosti te izgradnji fair play odnosa u sportu i Zivotu. Clanak 77. (1) Clanove Komisije sportaSa biraju sporta$i izmedu predlozenih kandidata koje su predloZile sportske komisije nacionalnih sportskih saveza olimpijskih i neolimpijskih sportova punopravnih clanova HOO-a. (2) Jedan nacionalni sportski savez, odnosno jedan sport mode imati u Komisiji sportaga samo jednog \\u00e9lana. (3) U Komisiji sportaga trebaju biti zastupljena ravnopravno oba spola, koliko god je to mogu\\u00e9e. (4) Komisija sportaSa je sastavijena od: - Sest \\u00e9lanova \\u2014 predstavnika Ijetnih olimpijskih sportova, medu kojima su tri sportasice i tri sportasa - dva lana \\u2014 predstavnika zimskih olimpijskih sportova, medu kojima je jedna sportasica i jedan sportag - dva Clana \\u2014 predstavnika neolimpijskih sportova, medu kojima je jedna sportagica i jedan sportas (5) Elanovi Komisije sportasa po svojoj funkciji su: - \\u20aclan Komisije MOO-a za sportage - lan Komisije EOO-a za sportage. 36 (6) Za Elana Komisije sportaSa moZe biti birana osoba koja ispunjava slijedece uvjete: daje drzavijanin Republike Hrvatske dau vrijeme izbora ima navrsenih 18 godina Zivota danije kaznjavana zbog dopinskih prekrSaja danema prepreke iz lanka 111. stavci 1. | 2. Zakona o sportu dase osoba ukoliko je kandidat olimpijskih sportova, u vrijeme isticanja kandidature za izbor \\u00e9lana Komisije sportasa aktivno natjece u reprezentativnoj vrsti nacionalnog sportskog saveza punopravnog \\u00e9lana HOO a, u sportu na programu igara olimpijade odnosno zimskih olimpijskih igara, te da je nastupila na igrama olimpijade odnosno zimskim olimpijskim igrama\", \"koje prethode izboru za Clana Komisije sporta\\u00e9a ili na igrama olimpijade odnosno zimskim olimpijskim igrama Cetiri godine prije provedbe izbora dase osoba ukoliko je kandidat neolimpijskih sportova, u vrijeme isticanja kandidature za izbor \\u00e9lana Komisije sportasa aktivno natjece u reprezentativnoj vrsti nacionalnog sportskog saveza neolimpijskog sporta Ciji nacionalni sportski savez je punopravni Clan HOO a, te da je u razdoblju od prethodne \\u00e9etiri godine prije provedbe izbora, nastupila kao natjecatelj na sluzenom prvenstvu svijeta organiziranom pod ingerencijom pripadajuce medunarodne sportske federacije. Elanak 78. birani. (2) Clanovi Komisije sporta\\u2019a HOO-a medu sobom biraju predsjednika Komisije sporta\\u2019a svake \\u20acetiri godine, odnosno kada predsjedniku istekne mandat ili kada mu iz drugih razloga prestane mandat u Komisiji. (3) Mandat \\u00e9lanova Komisije sportaSa po funkciji traje dok traje njihov status Clana Komisije MOO-a i/ili EOO-a za sporta\\u00e9e. (4) Izbori za Elanove Komisije sportaSa odrzavaju se glasovanjem sportaSa za vrijeme igara olimpijade, odnosno zimskih olimpijskih igara. Izbori Clanova Komisije sportasa neolimpijskih sportova organizira se na dan osnivanja HOO-a, 10. rujna svake Cetiri godine, odnosno drugog odgovaraju\\u00e9eg termina ako izbore nije moguce provesti tog dana iz opravdanih razloga, organiziranjem posebnog glasovanja za izbor sportasa i sportaSice-predstavnika neolimpijskih sportova. Glasovanje se organizira na odvojenim listama za sportase igara olimpijade, zimskih olimpijskih igara i sportaSe neolimpijskih sportova. Kandidate na liste za glasovenje predlazu komisije sportaSa nacionalnih sportskih saveza, u kojima su te komisije osnovane. (5) Vije\\u00e9e HOO-a ima pravo, na prijedlog predsjednika HOO-a predloziti do najvise dva kandidata na listu sportaSa o kojima se glasuje za izbor clanova Komisije sportasa, koji se isticu ukoliko je odredeni sport propustio kandidirati sportaSa koji ispunjava uvjete za uvrstenje na listu kandidata, a njegove sposobnosti i rezultati, kao i rezultati pripadajuceg sporta opravdavaju takvu kandidaturu, pri Cemu kandidat mora ispunjavati sve uvjete za uvrstenje na listu kandidata utvrdene pravilnikom o radu Komsije sportasa. 37 (6) Komisija sportasa djeluje na sjednicama Komisije. Sjednice Komisije sporta&a organiziraju se najmanje dva puta godiSnje. Rad na sjednici Komisije sportaSa valjano se odvija ako je na toj sjednici nazo\\u00e9na najmanje polovina \\u00e9lanova Komisije sportaSa, a odluke, zaklju\\u00e9ci i preporuke Komisije se usvajaju vecinom glasova nazo\\u00e9nih \\u00e9lanova. (7) Odredbe koje utvrduju izbore kao i djelovanje Komisije sporta\\u2019a utvrduju se posebnim pravilnikom o radu Komisije sportaga koji donosi Skupstina HOO-a. Clanak 79. brisan \\u20aclanak 80. brisan Clanak 81. brisan \\u20aclanak 82. brisan Komisija za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i \\u00e9lanica \\u20aclanak 83. (1) Komisija za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i \\u00e9lanica je nezavisno tijelo HOO-a koje rjeSava sporove koji se mogu pojaviti izmedu HOO-a i njegovih \\u00e9lanova vezano uz nadleznosti HOO-a te skrbi o pridrZavanju i postivanju nagela i pravila Olimpijske povelje, Statuta HOO-a i drugih op\\u00a2ih akata, sukladno \\u00e9lanku 25. ovog Statuta, od strane: \\u20aclanova HOO a anova tijela HOO a \\u20aclanova radnih tijela HOO a sporta\\u00e9a i trenera korisnika programa HOO a i drugih korisnika prava (s osnove radno pravnog statusa u \\u00a2lanovima HOO a, sudjelovanja u financiranju sredstvima HOO a i sli\\u00e9no). (2) Komisiju za rjeSavanje disciplinskih pitanja i prijepora izmedu\", \"HOO-a i \\u00e9lanica \\u00e9ini deset Clanova, od toga pet \\u00e9lanova prvostupanjskog tijela i pet clanova drugostupanjskog tijela, koje imenuje na vrijeme od \\u00e9etiri godine Skup\\u00e9tina HOO-a, na prijedlog Vije\\u00e9a HOO-a iz redova istaknutih pravnika poznavatelja sporta i sportskog sustava. Svako vijece radi u sastavu od po tri Clana (predsjednik i dva \\u00e9lana). (3) Komisija za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i \\u00e9lanica sudi u vije\\u00e9u, sukladno odredbi prethodnog stavka, a sjednice svakog vijeca saziva predsjednik pripadajuceg vijeca. Odluke se donose vecinom glasova svih \\u00e9lanova pripadajuceg vijeca. (4) Posebnim aktom SkupStne ureduju se pitanja ustrojstva, djelokruga i na\\u00a2ina rada Komisije za rjeSavanje disciplinskih pitanja i prijepora izmedu HOO-a i \\u00e9lanica. 38 (5) Zalba na spor do kojeg dode prigodom ili u svezi s olimpijskim igrama iskljucivo se podnosi Sportskom arbitraznom sudu u Lausanni sukladno Kodeksu sportske arbitraze. Rok za podnoSenje Zalbe je dvadeset jedan (21) dan nakon primitka odluke koja se odnosi na Zalbu. Nezavisno tijelo za antidoping Zalbeno vije\\u00e9e za antidoping Clanak 83.A. Zalbeno vijece za antidoping samostalno je te operativno i institucionalno nezavisno tijelo koje djeluje pri Hrvatskom olimpijskom odboru nadlezno za postupanje i odlucivanje o zalbama u odnosu na sporove i pitanja koja proizlaze iz ili su u vezi s hrvatskim nacionalnim pravilima za antidoping i pripadajucim propisima. Postupak pred Zalbenim Vije\\u00e9em za antidoping ureduje se pripadajucim Pravilnikom VI. GLAVNI TAJNIK Elanak 84. Glavni tajnik obavija duZnost profesionalno, a imenuje ga na temelju javnog natjecaja Vijece HOO-a. \\u20aclanak 85. (1) Glavni tajnik imenuje se na odredeno vrijeme, u pravilu na Cetiri godine, a ista osoba moze biti ponovno imenovana za glavnog tajnika. (2) HOO i glavni tajnik zaklju\\u00e9uju ugovor o radu na odredeno vrijeme, kojim odreduju medusobna prava obveze i odgovornosti. (3) Glavni tajnik ostvaruje prava iz radnog odnosa u Strucnoj sluzbi HOO-a. Elanak 86. Za glavnog tajnika moZe biti imenovana osoba koja ispunjava sljedece uvjete i kriterije: - da je drzavljanin Republike Hrvatske - da posjeduje visoku stru\\u00e9nu spremu - daima najmanje pet godina radnog iskustva na rukovodecim poslovima - da vlada jednim od sluzbenih jezika MOO-a, engleskim ili francuskim - dase nije ogrijesio o eticke norme i moralna na\\u00a2\\u00e9ela sporta i olimpizma da nema zapreke iz Clanka 114. odnosno 111. stavci 1. i 2. Zakona o sportu i \\u00a2lanka 19. stavci 2.13. Zakona o udrugama 39 prednost pri izboru ima osoba koja poznaje sustav i djelovanje sporta, koja je ugledni sportski djelatnik i koja ima iskustva na rukovodecim poslovima u sportu. \\u20aclanak 87. Glavni tajnik, provodi i osigurava provodenje opcih akata i programa HOO-a, te odluka i zakljucaka Skupstine, Vije\\u00e9a i predsjednika HOO-a, te osobito obavija slijedece poslove i zadace: zastupa HOO u zemiji i inozemstvu, a u pojednim situacijama, a po ovlasti Vije\\u00e9a ili predsjednika, i predstavlia HOO sklapa ugovore i poduzima pravne radnje u ime i za ra\\u00e9un HOO-a odgovoran je za zakonitost rada HOO-a organizira i koordinira pripremu materijala za sjednice Skup$tine i Vije\\u00e9a odgovoran je za podnogenje prijedioga godisnjeg programskog i financijskog izvijeS\\u00e9a Skupstini HOO-a, obvezan je tijekom poslovne godine\", \"provesti samoprocjenu udinkovitosti i djelotvornosti funkcioniranja sustava financijskog upravljanja i kontrola HOO-a odgovoran je za pravodobnu provedbu zaklju\\u20acaka i odluka Skup&tine i Vije\\u00e9a, obavjeStava nositelje zada\\u00e9a o odlukama i zaklju\\u00e9cima, te obavjestava Vije\\u00e9e i SkupStinu 0 izvrSenju odluka i zaklju\\u00e9aka Odgovoran je za podnoSenje dokumenata nadleznim tijelima sukladno propisima, te za dostavljanje zapisnika s redovne sjednice SkupStine Saveza nadleZnom uredu koordinira radom radnih tijela Vije\\u00e9a i skrbi o provodenju njihovih zakljucaka sudjeluje u radu Vije\\u00e9a bez prava glasa poduzima aktivnosti za izvrSavanje zada\\u00e9a i obveza \\u00e9lanova HOO-a organizira i koordinira suradnju s MOO-om, njegovim tijelima i ostalim asocijacijama \\u00a2iji je HOO \\u00e9lan organizira i koordinira suradnju s drugim nacionalnim olimpijskim odborima predlaze rjeSenja za unapredenja djelatnosti i poslovanja HOO-a predlaze Vijecu op\\u00e9i akt o ustrojstvu i radu Strucne sluzbe HOO-a kao i imenovanje rukovoditelja Stru\\u00e9nih sluzbi HOO-a 40 provodi aktivnosti za javnost rada HOO a lan je vodstva delegacije HOO a na olimpijskim igrama, europskim i mediteranskim igrama i drugim viSesportskim priredbama obavija i druge poslove iz svog djelokruga i po odlukama Skup$Stine, predsjednika i Vijeca. Elanak 88. (1) O svim ugovorima i isplatama u vrijednostima vecim od 6.636 EUR-a kao i o svim isplatama izvrSenim mimo usvojenog proracuna, glavni tajnik duzZan je izvijestiti Vijece na prvoj slijedecoj sjednici. (2) Za svoj rad i poslovanje glavni tajnik je odgovoran Vijecu i predsjedniku. Vil. STRUCNA SLUZBA Elanak 89. (1) Za obavijanje poslova HOO-a osniva se Stru\\u00e9na sluzba. (2) Stru\\u00e9na sluzba HOO-a obavlja stru\\u00e9ne, administrativne i tehni\\u00a2ke poslove, zadace iz podrucja sporta i medunarodnih sportskih odnosa i aktivnosti te izvrsava obveze utvrdene zakonima, propisima i odlukama HOO-a. Elanak 90. Ustrojstvo i na\\u00e9in rada Stru\\u00e9ne sluzbe ureduje se opcim aktom kojeg donosi Vijece. \\u20aclanak 91. (1) Stru\\u00e9na sluzba HOO-a moze, osim poslova za potrebe HOO-a, obavijati odredene strucne i ostale poslove za druge subjekte na ugovornim osnovama. (2) Radom Stru\\u00e9ne sluzbe rukovodi glavni tajnik, koji podnosi izvjes\\u00a2e o radu Stru\\u00a2ne sluzbe Vije\\u00a2u HOO-a po potrebi i /ili zahtjevu Vije\\u00a2a HOO-a. Vill. HRVATSKA OLIMPUSKA AKADEMUJA Clanak 92. Radi sustavnog poticanja i promicanja olimpizma, promidzbe olimpijskih na\\u00a2ela, fair playa i tolerancije, sudjelovanja u realizaciji programa Olimpijske solidarnosti te provedbe stru\\u00a2nog osposobljavanja i usavrSavanja osoba koje obavijaju stru\\u00a2ne poslove u sportu, a sukladno Olimpijskoj povelji, posebnim aktom SkupStine HOO-a osniva se Hrvatska olimpijska akademija. 41 IX. HRVATSKI FAIR PLAY ODBOR Elanak 93. (1) Hrvatski fair play odbor je nezavisno tijelo koje djeluje pri Hrvatskom olimpijskom odboru, Ciji Clanovi su predstavnici osnivata HOO-a i Hrvatskog zbora sportskih novinara. (2) Hrvatski fair play odbor promovira i razvija fair play u sportu i svakodnevnom Zivotu, potice afirmaciju op\\u00a2ih eti\\u00a2kih vrijednosti te poduzima aktivnosti za postupanje i ponaSanje svih sudionika u sportu na principima tolerancije i medusobnog postovanja, u skladu s pravilima i na\\u20acelima Olimpijske povelje, odredbama Statuta HOO-a, pravilima Medunarodnog fair play odbora i Europskog fair play pokreta. X. ZAKLADA HRVATSKIH SPORTASA Clanak 94. (1) Zakladu hrvatskih sportaga, sa statusom samostalne pravne osobe, osnovao je HOO, u suradnji s Hrvatskim klubom olimpijaca i Sportskim novostima. (2) Zaklada hrvatskih sportaga\", \"je osnovana i djeluje radi ostvarivanja op\\u00e9ekorisne i dobrotvorne svrhe davanjem nov\\u00e9ane i druge potpore sportasima, a iznimno i trenerima kao i \\u00e9lanovima obitelji sportasa, koji su tijekom ili nakon svoje sportske karijere ostali bez mogu\\u00e9nosti da viastitim sredstvima ostvare osnovne uvjete za egzistenciju, uvjete stanovanja, lijecenja, stvaranja mogucnosti za zapoiljavanje, pomo\\u00e9 u stvaranju uvjeta za Skolovanje __ ili osposobljavanje i sl. Xi. SREDSTVA I FINANCIRANJE Clanak 95. (1) Imovinu HOO-a gine nov\\u00e9ana sredstva, nepokretne i pokretne stvari te druga imovinska prava. (2) Osnovu financiranja djelatnosti i programa HOO-a i Clanova HOO-a gine prihodi ostvareni viastitom djelatno&\\u00a2u, iz sredstava drzavnog prora\\u00e9una i drugih izvora u skladu sa zakonom (prihod od igara na sre\\u00e9u itd. ). (3) Za izvrSavanje programskih zada\\u00a2a i aktivnosti \\u00e9lanova HOO-a od zajednickog interesa, koji su Zakonom o sportu ozna\\u00e9eni kao javne potrebe sporta drZavne razine i o \\u00e9ijem je izvrSenju duZan skrbiti HOO, sredstva osigurava HOO. (4) HOO se za realizaciju programa HOO-a moze kratkoro\\u00e9no zaduZiti o \\u20acemu odluku donosi Vijece HOO-a, na razdoblje od najduze 12 mjeseci u slu\\u00e9ajevima kada se teku\\u00e9im priljevima sredstava ne mogu pokriti dospjele obveze, a do visine utvrdene financijskim planom HOO-a, dok odluku o dugoro\\u00e9nom zaduzenju HOO-a donosi Skupstina HOO-a sukladno propisima. Ugovor o kratkoro\\u00e9nom odnosno dugoro\\u00e9nom zaduZenju temeljem navedenih odiuka 42 zaklju\\u00e9uje glavni tajnik HOO-a ili druga osoba ovlastena za zastupanje HOO-a, odnosno osoba koju osoba ovlastena za zastupanje HOO-a za to ovlasti temeljem posebnog akta, a do visine utvrdene financijskim planom HOO-a. Elanak 96. Za ostvarivanje programskih zadaca iz \\u00a2lanka 21. stavka 1. alineje 4. ovog Statuta HOO osigurava \\u00e9lanovima HOO-a sredstva na temelju akta o kriterijima i mjerilima programiranja i financiranja javnih potreba sporta drzavne razine u nadleZnosti HOO-a, i to za: sluzbene nastupe i kvalifikacijska natjecanja, zavrsne pripreme reprezentativnih selekcija i pojedinaca za olimpijske igre, svjetska i europska prvenstva i kupove, mediteranske igre, medunarodna natjecanja mladezi, sluzbene medudrzavne susrete, drzavna prvenstva te ostale sportske priredbe i manifestacije od zajednickog ili opceg interesa zdravstvenu zastitu, dopingku kontrolu, dopunsku prehranu (vitaminizaciju) te osiguranje, testiranje i opremanje sportasa permanentnu skrb o posebno talentiranim mladim sportasima i olimpijskim kandidatima, kao i o trenerima korisnicima razvojnih programa HOO a podmirivanje troskova \\u00e9lanarina i kotizacija medunarodnim sportskim asocijacijama, sudjelovanja u radu tijela mati\\u00e9nih medunarodnih federacija i dijela troSkova poslovanja. Elanak 97. (1) Prora\\u00e9unska sredstva i ostala sredstva ostvarena u skladu sa zakonom su namjenska i mogu se samo tako koristiti. (2) Sredstva ostvarena na olimpijskom programu i od olimpijske solidarnosti koriste se namjenski prema vaZecim propisima MOO-a i HOO-a. (3) Sredstvima koja HOO ostvari vlastitom djelatnoS\\u00a2u, raspolaze HOO i koristi ih za unapredenje djelatnosti HOO-a i njegovih \\u00e9lanova, primjenom vazecih akata i odluka SkupStine i Vijeca. (4) Vlastita sredstva HOO-a se sukladno usvojenom financijskom planu od strane nadleznog tijela mogu dodijeliti i za druge pravne osobe koje provode programe koji su od znacaja za hrvatski sport i provedbu zada\\u00e9a HOO-a (pravne osobe osnovane od strane HOO-a i druge prvane osobe). Elanak 98. (1) Raspored planiranih sredstava za ostvarivanje programskih aktivnosti HOO-a vrsi\", \"se godisnjim programom i financijskim planom HOO-a, na temelju akta o kriterijima i mjerilima programiranja i financiranja sporta drzavne razine. (2) Izmjene i dopune financijskog plana obvezno se provode u slucaju zna\\u00a2ajnih odstupanja nastalih prihoda i rashoda u odnosu na planirane, a posebice u slu\\u00e9aju nastanka novih obveza 43 za koje sredstva nisu osigurana, odnosno smanjenja prihoda, a Vije\\u00e9e HOO-a je nadlezno utvrditi Sto se smatra znagajnim odstupanjem nastalih prihoda i rashoda u odnosu na planirane, sukladno posebnom opcem aktu, sukladno odredbama \\u00e9lanka 70. stavci 9., 10. \\u00a7 11. Zakona o sportu. (3) Naredbodavac za izvrSenje programa i financijskog plana je glavni tajnik. (4) Glavni tajnik duZan je na svakoj redovnoj sjednici Skupstine podnijeti izvijes\\u00e9e o ostvarivanju financijskog plana. (5) Glavni tajnik takoder je duzan na svakoj sjednici izvjeStavati Vijece HOO-a o financijskom poslovanju HOO-a. (6) Godisnji_ financijski izvjeStaj HOO-a, usvaja Skup$tina i predaje se Ministarstvu financija, odnosno drugoj instituciji koju Ministarstvo financija ovlasti za zaprimanje i obradu financijskih izvjestaja, a javno se objavijuje putem Registra neprofitnih organizacija i na sluzbenoj mreznoj stranici HOO-a. (7) Nad godignjim financijskim izvjeStajem HOO-a provodi se revizija sukladno propisima, a revizorsko izvjes\\u00e9e o obavljenoj reviziji godisnjeg financijskog izvjeStaja se podnosi Skup\\u00e9tini HOO-a. XI. = KONTROLA POSLOVANJA Elanak 99. Nad godisnjim financijskim izvjescem i poslovanjem HOO-a obavezno se provodi (vanjska) revizija. Clanak 100. (1) U Stru\\u00e9noj sluzni osniva se i djeluje posebna sluzba unutarnje revizije, koja djeluje prema uputama Nadzornog odbora. (2) Unutarnja revizija HOO-a obavijat ce unutarnje revizije u skladu s medunarodnim revizijskim standardima za unutarnju reviziju kao i propisima i smernicama koje ureduju unutarnju reviziju za javni sektor u Republici Hrvatskoj. Unutarnja revizija obavija se u HOO-u, te kod pravnih i fizi\\u00e9kih osoba kojima je HOO namjenski doznacio sredstva, u dijelu tih namjenski dozna\\u00e9enih sredstava. XH. NACIN RJESAVANJA SPOROVA, SUKOBA INTERESA | NESPOJIVOST ODREDENIH POSLOVA | FUNKCHA Clanak 101. Kada postoji spor izmedu HOO-a i njegovih Clanova, kao i spor na nacionalnoj razini koji nastane iz ili u vezi s primjenom ovog Statuta i opcih akata HOO-a, koji nije moguce rijesiti sporazumno, odnosno koji nije moguce rijegiti na na\\u00e9in utvrden odredbama ovog Statuta, rjeSavanje spora se povjerava Komisiji za rjeSavanje disciptinskih pitanja i prijepora izmedu HOO-a i \\u20aclanica. 44 \\u20aclanak 102. Sukladno odredbama Zakona o sportu, Zakona o javnoj nabavi te drugim pripadajucim propisima, a u odnosu na nadleZnosti tijela HOO-a utvrduje se zastita opceg interesa hrvatskog sporta, sportaSa i HOO-a u odnosu na_ pojedinatne interese pojedinaca, Clanova HOO-a i \\u00e9lanova tijela HOO-a, te se sukladno odredbama ovog Statuta utvrduje da su Clanovi tijela HOO- a kao i Stru\\u00e9ne sluzbe HOO-a duzne i odgovorne voditi brigu o postojanju eventualnog sukoba interesa u radu tijela HOO-a ili obnaSanja odredene duznosti u HOO-u, kao i poduzeti odgovarajuce radnje i postupke za njihovo sprjecavanje i otklanjenje. O postojanju sukoba interesa u HOO-u odluku donosi Vijece HOO-a. XIV. JAVNOST RADA \\u20aclanak 103. (1) Rad HOO a je javan. (2) Javnost rada ostvaruje se: pravodobnim dostavijanjem materijala za raspravu \\u00a2lanovima tijela HOO a i drugim pozvanim osobama koji\", \"se na njih mogu odnositi obavjestavanjem sredstava javnog informiranja o odrzavanju sjednica obavjeStavanjem javnosti o radu i poslovanju HOO a putem sredstava informiranja i na tiskovnim konferencijama objavom Statuta, opcih akata HOO a te informacija na mreZnim stranicama HOO a na druge prigodne nacine. (3) Iznimno, kada to zahtijeva sadrzaj dnevnog reda, sjednice Vijeca mogu biti zatvorene za javnost. Glanak 104. _ briSe se XV. NAGRADE I PRIZNANJA Elanak 105. (1) Nagrada Hrvatskog olimpijskog odbora Matija Ljubek (dalje u tekstu: Nagrada HOO-a Matija Ljubek) najvige je drustveno sportsko priznanje koje se dodjeljuje svake godine, u znak priznanja i \\u20acasti za osobit doprinos razvoju sporta u Republici Hrvatskoj, kao nagrada za Zivotno djelo, najzasluZnijim pojedincima te udrugama za dugogodisnje djelovanje u sportu. 45 (2) Poslovnikom o dodjeli Nagrade HOO-a Matija Ljubek ureduje se postupak raspisivanja natjecaja za dodjelu Nagrade HOO, uvjeti i nacin predlaganja kandidata te rad Zirija. Clanak 106. (1) HOO za svaku godinu proglaSava najuspjeSnije sportage, odnosno izabire i proglasava najuspjesnije pojedince i ekipe, zene i muSkarce, a za izuzetan doprinos promicanju Hrvatske u svijetu pojedinca-muSkarca ili Zenu, ili ekipu, sportasa i sportagicu navje\\u00e9a nada hrvatskog sporta, te najuspjeSnijeg trenera. (2) Pravilnikom o izboru i proglaSenju najuspjeSnijih hrvatskih sportaSa i trenera ureduju se na\\u00a2cin i postupak sluZbenog izbora i proglaSenja najuspjesnijih hrvatskih sportaga za postignute najvece sportske dosege i izuzetan doprinos promicanju Hrvatske u svijetu u tijeku jedne godine. Clanak 107. (1) Nagrada ,,Drazen Petrovi\\u00e9\\u201c Je nagrada koja se dodjeljuje najuspjesnijem sportagu i sportasici, ekipi mladih dobnih kategorija, sportskom paru, Stafeti ili posadi te sportasu i sportagici najvecoj nadi hrvatskog sporta, primjenom kriterija najvrednijih plasmana postignutih tijekom nekoliko prethodnih godina u sportskoj karijeri sportaga, sportagica odnosno ekipa mladih dobnih kategorija na sluzbenim medunarodnim sportskim natjecanjima. (2) Pravilnikom o izboru i proglaSenju najuspjeSnijih sportaga mladih dobnih kategorija - Nagrada ,,Drazen Petrovi\\u00e9\\u201d ureduje se postupak, uvjeti i nacin predlaganja kandidata, te izbor i postupanje Odbora za izbor i proglagenje najuspjeSnijih sportasa mladih dobnih kategorija,.. Clanak 108. HOO moze ustanoviti i druge nagrade i priznanja Sto se ureduje posebnim aktom koji donosi Vijece. XVI. PRESTANAK Clanak 109. (1) HOO prestaje s radom kada se ispune zakonom propisane pretpostavke ili ako to odludi SkupStina dvotrecinskom vecinom glasova svih \\u00e9lanova Skuptine s pravom glasa. (2) U slu\\u00e9aju prestanka s radom o imovini HOO-a odlu\\u00e9uje Skup$tina sukladno zakonu. (3) Ako SkupStina ne donese odluku iz prethodnog stavka, u slu\\u00e9aju prestanka rada HOO-a, imovina HOO-a prelazi u vlasnigtvo sportske udruge koja \\u00a2e nastaviti djelatnost nacionalnog olimpijskog odbora na podrugju Republike Hrvatske. (4) Ukoliko sportska udruga iz prethodnog stavka ne\\u00e9e postojati, imovinu HOO-a pruzet \\u00e9e Republika Hrvatska. Ako je HOO primio financijska sredstva iz prora\\u00e9una ili iz drugih javnih 46 izvora, u slu\\u00e9aju prestanka postojanja, ostatak sredstava vratit \\u00a2e se u proracun iz kojeg su financijska sredstva dodijeljena. Likvidator \\u20aclanak 110. (1) Likvidator je fizi\\u00e9ka osoba koju bira i opoziva Skupstina HOO-a u skladu s odredbama ovog Statuta. (2) SkupStina HOO-a moze odlu\\u00e9iti da likvidator HOO-a bude i pravna osoba. (3) Osobu koja se bira za likvidatora\", \"HOO-a, predlaze predsjednik HOO-a, uvaZavajuci potrebnu stru\\u00e9nost i iskustvo te osobe, s obzirom na nadleZnosti likvidatora, a koja ne smije imati zapreke iz \\u00e9lanka 19, stavci 2. i 3. Zakona o udrugama. (4) Pokretanjem postupka likvidacije HOO-a prestaju ovlastenja tijela i osoba ovlastenih za zastupanje HOO-a. (5) Likvidator zastupa HOO u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u Registar udruga kao osoba ovlaStena za zastupanje HOO-a do okon\\u00e9anja postupka likvidacije i brisanja HOO a iz Registra udruga. (6) Likvidator likvidaciju HOO-a provodi u skladu s odredbama Zakona o udrugama. XVII. ZAVRSNE ODREDBE Clanak 111. (1) Promjene i dopune ovog Statuta vrse se na nacin i po postupku predvidenom za njihovo donoSenje. (2) Tumag\\u00e9enje ovog Statuta daje SkupStina. (3) Svi opi akti HOO-a i njegovih \\u00e9lanova uskladit \\u00e9e se s odredbama ovog Statuta u roku od Sest mjeseci od dana stupanja Statuta na snagu. \\u20aclanak 112. (1) Statut HOO-a mora se podnijeti na odobrenje MOO-u, kao i naknadne promjene ili izmjene Statuta HOO-a, po proceduri koju propisuje Olimpijska povelja. (2) Ako postoji sumnja o zna\\u00e9enju ili tumacenju Statuta, ili ako postoji proturjec\\u00e9nost izmedu ovog Statuta i Olimpijske povelje, mjerodavan je tekst Olimpijske povelje. 47 Clanak 113. (1) Statut stupa na snagu danom donoSenja, a primjenjuje se danom upisa u Registar udruga Republike Hrvatske, osim odredbe iz \\u00e9lanka 59, alineja druga, koja se slijfedom preporuka Medunarodnog olimpijskog odbora stavija u Statut s primjenom od slijedeci izbora u HOO-u (2024). (2) Danom stupanja na snagu ovog Statuta Hrvatskog olimpijskog odbora - protix\\u00e9eni tekst, prestaje vaziti Statut HOO-a \\u2014 pro\\u00e9ig\\u00e9eni tekst broj: 268/23 od 3.3.2023. Glavni tajnik \\\\ | Hrvatskog olimpijskog odbora Hrvatskog olimpijskog odbora mr.sc. Siniga Kraja\\u00e9 dr.sc. Zlatko Matega Mhd Klasa; 030 08/24 01/3 Ur. Broj; 442 01 05 24 2 48\"]"