["Na temeljem ¢lanka 13. Zakona o udrugama (Narodne novine 74/14, 70/17., 98/19. i 151/22, lanka\n37. Zakona o sportu (Narodne novine 141/22), SkupStina Hrvatskog judo saveza, na sjednici odrzanoj\ndana, 20. prosinca 2023. godine donosi\n\nSTATUT\nHRVATSKOG JUDO SAVEZA\n\n|. OPCE ODREDBE\n\nClanak 1.\n\nOvim Statutom utvrduju se odredbe o nazivu, sjedistu, o zastupanju, izgledu peéata, o ciljevima i\npodrucju djelovanja Hrvatskog judo saveza, (u daljnjem tekst", "u: Savez) sukladno ciljevima,\ndjelatnostima kojima se osiguravaju ciljevi, kao i gospodarske djelatnosti koje se obavljaju sukladno\nzakonu, nacin osiguranja javnosti rada, Clanstvo Saveza, tijela Saveza, djelokrug i na¢in rada, a u\nsvrhu ostvarivanja potreba i interesa judo sporta, kao i naéin predstavijanja Republike Hrvatske u\npripadajucem medunarodnom sportskom udruzenju, prestanku postojanja Saveza, o imovini,\nnacinu stjecanja i raspolaganju ", "imovinom, o postupku s imovinom u sluéaju prestanka postojanja\nSaveza te drugim pitanjima vaZnim za Savez.\n\nSavez je jedini nacionalni sportski savez koji poti¢e i promiée judo i vrijednosti judo sporta u\nRepublici Hrvatskoj.\n\nSavez je osnovan 12. ozujka 1961. godine u Zagrebu pod nazivom Judo savez Hrvatske.\n\nIzraze koji se koriste u ovom statutu, a imaju rodno znacenje, odnose se jednako na Zenski i muski\nrod.\n\nClanak 2.\nNaziv Saveza je: HRVATS", "KI JUDO SAVEZ.\n\nSkraceni naziv Saveza je: HJS.\n\nPored naziva na hrvatskom jeziku, Savez Ce u medunarodnim odnosima koristiti naziv na engleskom\njeziku: CROATIAN JUDO FEDERATION.\n\nPored skracenog naziva na hrvatskom jeziku, Savez €e u medunarodnim odnosima koristiti skraéeni\nnaziv na engleskom jeziku: CRO JUDO.\n\nClanak 3.\nSavez djeluje na teritoriju Republike Hrvatske.\n\nSjediste Saveza je u gradu Zagrebu.\n\nOdluku o adresi Saveza kao i promjeni adr", "ese Saveza, ureduje se Odlukom koju donosi Upravni\nodbor Saveza.\n\nClanak 4.\nSavez je neprofitna pravna osoba, upisana u Registar udruga Republike Hrvatske pri nadleZnom\ngradskom uredu Grada Zagreba, Registar neprofitnih organizacija pri Ministarstvu financija\nRepublike Hrvatske i Evidenciju pravnih osoba u sportu.\n\nClanak 5.\nSavez je samostalan u ostvarivanju svojih ciljeva utvrdenih ovim Statutom, a za svoje obveze\nodgovara cijelom svojom imovin", "om u skladu sa zakonom.\n\nSavez se ustrojava i djeluje sukladno odredbama Zakona o sportu i Zakona o udrugama.\n\nClanak 6.\nSavez predstavijaju i zastupaju predsjednik Saveza i glavni tajnik Saveza.\n\nIznimno, Upravni odbor Saveza na prijedlog predsjednika Saveza moze i druge osobe ovlastiti za\nzastupanje.\n\nClanak 7.\nSavez ima peCat.\n\nUporaba, izgled i Cuvanje pecata ureduju se odlukom koju donosi Upravni odbor Saveza.\n\nClanak 8.\nSavez ima znak i zas", "tavu.\n\nOpis znaka i zastave Saveza te uporaba i zaStita, ureduju se odlukom koju donosi Upravni odbor\nSaveza.\n\nClanak 9.\nSavez je osnivac i punopravni Clan Hrvatskog olimpijskog odbora (HOO).\n\nSavez je Clan Medunarodne judo federacije (IJF) i Europske judo unije (EJU).\n\nSavez se moze uclaniti ili udruziti i u druge domace i medunarodne organizacije i udruge kad je to\nod interesa za judo sport, a nije u suprotnosti s drugim zakonskim propisima kao", " i propisima\nmedunarodnih organizacija kojih je élan.\n\nClanak 10.\nU Savezu nije dozvoljen niti jedan vid diskriminacije (klupski, rasni, nacionalni, etniéki, spolni, vjerski,\npoliticki i drugi), te sprjecavanje sloboda i prava €ovjeka i gradanina.\n\nhw\n\nCILJEVI, PODRUCJE DJELOVANJE SUKLADNO CILJEVIMA | DJELATNOST SAVEZA\n\nSvojim djelovanjem Savez ima za cilj brigu i ostvarenje programa javnih potreba u judo sportu,\nstvaranje i provedbu pozitivne po", "litike promicanja i razvoja judo sporta u Republici Hrvatskoj i\ninozemstvu, sukladno Zakonu, te ostalim propisima i zakonima Republike Hrvatske.\n\n1. CILJEVI SAVEZA\n\nClanak 11.\n\nCiljevi Saveza su:\n\nrazvitak i promicanje judo kao sporta i juda kao edukativne i inkluzivne metode,\n\nSstvaranje uvjeta za postizanje vrhunskih dometa u judo sportu,\n\nSirenje aktivnosti judo sporta osobito djece i mladeii,\n\nrazvijanje i promicanje medusobne suradnje udruze", "nih élanica Saveza,\n\npromicanje i ostvarivanje nacionalne i medunarodnih sportskih veza i suradnje,\nostvarivanje uvjeta za edukaciju sportasa, trenera i sudaca,\n\nsudjelovanje u borbi protiv dopinga, koristenja supstanci i zabranjenih postupaka u judo\nsportu, a u skladu sa svjetskim kodeksom protiv dopinga,\n\npromicanje odgojnih zadaca u judo sportu u duhu fair-play-a, razumijevanja, tolerancije i\nodgovornosti kroz bavijenje judom, sprjecavanje svi", "h oblika nasilja u sportu pogotovo prema\ndjeci i mladima,\n\npromicanje olimpijskih ideala.\n\nDJELATNOST SAVEZA\n\nClanak 12.\n\nSavez u ispunjavanju navedenih ciljeva svojim djelovanjem:\n\nsudjeluje, provodi i utvrduje politiku razvoja judo sporta u Republici Hrvatskoj,\n\npotice i promice judo sporta u skladu s aktima strateSkog planiranja razvoja sporta na\nnacionalnoj razini, odnosno nacionalnom strategijom razvoja sporta i nacionalnim planom\nrazvoja sp", "orta,\n\nutvrduje sustava, uvjete i organizaciju sportskih natjecanja u judu, u skladu s naéelima i\nelementima sustava koje je opcim aktom utvrdio Hrvatski olimpijski odbor, a prema\npravilima sporta i normama medunarodnih sportskih udruzenja,\n\npredstavija judo sport pred sportskim i drzavnim tijelima Republike Hrvatske, te\nodgovarajucim medunarodnim sportskim udruzenjima,\n\nsuraduje s odgovarajucim krovnim medunarodnim udruzenjima,\n\nsuraduje s Hrvat", "skim paraolimpijskim odborom, Hrvatskim savezom slijepih i slabovidnih,\nHrvatskim Skolskim sportskim savezom i Hrvatskim akademskim sportskim savezom.\nsudjeluje u provedbi programa javnih potreba sporta u Repubilici Hrvatskoj i u provedbi\nnacionalnog programa sporta,\n\nsudjeluje u pripremanju godisnjih i visegodisnjih planova i programa razvoja judo sporta na\npodrucju Republike Hrvatske,\n\nnadgleda ukupnu djelatnost u judo sportu,\n\norganizira nacio", "nalna judo prvenstava, neposredno ili preko svojih Elanica, te medunarodna\nnatjecanja i priredbi,\n\n7)\nutvrduje i provodi sustav, uvjete i organizaciju judo natjecanja u Republici Hrvatskoj,\norganizira nastupanje hrvatske judo reprezentacije na odgovarajucim medunarodnim\nnatjecanjima,\n\npromiée i provodi nacionalne projekte vezane uz odgoj i obrazovanje djece i mladih,\ntemeljene na principima i vrijednostima juda kao olimpijskog sporta, te potice i", " druge\nposebne projekte u cilju borbe protiv ovisnosti, smanjenja nasilja i promicanja zdravog\nnaCcina zivota,\n\nuskladivanje aktivnosti svojih Clanica i pruzanje struénu pomoc u radu,\n\nutvrduje djelovanje na pitanjima koja se odnose na registraciju, status i stegovnu\nodgovornost sportaga i drugih sportskih djelatnika i stru€nih osoba u judo sportu,\n\ndjeluje na unapredivanju i skrbi zdravstvene zaStite sportasa,\n\nbrine za odrZivi razvoj judo sport", "a,\n\nskrb o sportsko - rekreativnim aktivnostima u judo sportu\n\nsudjeluje u prikupljanju i azuriranju informacija za Nacionalni informacijski sustav u sportu,\nna trazenje tijela drzavne uprave nadleznog za sport daje prethodno misljenje o postojanju\ninteresa za prijam u hrvatsko drzavijanstvo fizicke osobe u sustavu sporta koja je strani\ndrzavljanin,\n\ndjeluje na stvaranju materijalnih, kadrovskih i drugih uvjeta u smislu unaprjedenja |\npostizanja ", "vrhunskih judo dostignu¢a i rezultata,\n\nskrbi o vrhunskim sportasima i nacionalnim judo ekipama,\n\nutvrduje plan potreba struénih kadrova u judo sportu, organizira i provodi osposobljavanje\nstrucnih kadrova u judo sportu,\n\nprovodi struéno usavrSavanje i licenciranje strucnih kadrova,\n\nvodi struéne i administrativne poslova vezano uz osobe koje obavljaju stru¢ne poslove u judo\nsportu,\n\norganizira i provodi promidzbenu, izdavacku i informativnu djel", "atnost u judo sportu, po\npotrebi izdaje struéne knjige, Casopise i publikacije, te skuplja dokumentaciju i povijesne\npodatke vezane za judo sport,\n\nprati aktualna pitanja financiranja judo sporta, te nadleznim tijelima predlaze poduzimanje\nodredenih mijera,\n\nprati, razmatra i predlaze politiku korigtenja, odrzavanja i izgradnje objekata za judo sport,\norganizira vodenje i upravljanje objektima koji su mu povjereni ili ih ima u viasnistvu,\n\nu znak", " priznanja za razvoj, promicanje i uspjeh u judo sportu daje priznanja, pohvale i\nnagrade,\n\nsudjeluje u borbi protiv dopinga, koristenja supstanci i zabranjenih postupaka u judo sportu,\na u skladu sa svjetskim kodeksom protiv dopinga, ukljucujuci i poStivanje pravila nacionalnog\ntijela nadleZnog za borbu protiv dopinga, a osobito vezano uz provedbu testiranja,\n\npoti¢e provedbu etiékih i moralnih nagéela, postivanje ljudskog dostojanstva, fair pla", "ya,\ntolerancije, zastite djece u sportu, nenasilja i kulture sporta,\n\npoduzima mjera protiv svih oblika diskriminacije i nasilja u sportu,\n\nzalaze se za ravnopravnost spolova u sportu,\n\nobavija i druge poslove koji su mu povjereni sukladno Zakonu o sportu, Zakonu o udrugama\ni ostalim propisima Republike Hrvatske.\n\nClanak 13.\nSavez ima javnu ovliast za donoSenje opcih akata, kojima se ureduje:\n* sustav judo natjecanja i to najmanje jednu godinu pr", "ije pocetka primjene tog sustava,\n* materijalni, tehnicki i strucni uvjeti za u¢lanjenje judo udruga u Clanstvo Saveza,\n* nacin licenciranja stru¢nih kadrova u judo sportu sukladno Zakonu o sportu,\n* nacin registracije sportasa,\n* prava i obveze sportaSa, trenera, sudaca i Clanica Saveza,\n* pravo nastupa stranih sportaSa za sportske klubove u judo sportu u Republici Hrvatskoj,\n* stegovna odgovornost osoba u sustavu judo sporta,\n* druga pitanja iz", " nadleznosti Saveza sukladno Zakonu o sportu te pravilima svjetskog i\neuropskog saveza judo sporta.\n\nClanak 14.\nRadi uspjesnog izvrSavanja djelatnosti utvrdenih u ovom Statutu, Savez suraduje sa nadleznim\ntijelima drzavne vlasti i drugim odgojno-obrazovnim i struénim ustanovama te drugim fiziékim i\npravnim osobama.\n\nSavez moze obavijati i druge djelatnosti, osim djelatnosti iz oblasti judo sporta, sukladno propisima\nKojima je to uredeno.\n\nSavez, ", "kao pravna osoba koja djeluju u sustavu sporta, duzan je poduzimati mjere zastite djece u\nsportu, u svojim programima i postupanju kao i u djelovanju i postupanju Clanica Saveza, te o\nsvakom krSenju prava djece, posebice svim oblicima nasilja nad djecom, spolne zloporabe,\nzanemarivanja ili nehajnog postupanja, zlostavljanja ili izrabljivanja djece u sportu mora obavijestiti\npoliciju, nadlezno tijelo za socijalnu skrb odnosno druga nadlezna tijela", ".\n\n3. GOSPODARSKA DJELATNOST SAVEZA\n\nClanak 15.\nSavez moze radi obavljanja gospodarskih djelatnosti osnovati trgovacko drustvo, zadrugu, druge\ngospodarske subjekte, a uzajamne odnose urediti ugovorom.\n\nSavez gospodarske djelatnost moze obavijati pored djelatnosti kojima se ostvaruju njegovi ciljevi\nutvrdeni statutom, ali ih ne moze obavijati radi stjecanja dobiti za svoje Clanove ili treée osobe.\n\nAko u obavljanju gospodarskih djelatnosti Savez o", "stvari visak prihoda nad rashodima, on se moze\nupotrijebiti iskljucivo za ostvarenje ciljeva Saveza utvrdenih Statutom.\n\nill. | CLANSTVO, USTROJ | DJELOVANJE SAVEZA\n\nClanak 16.\nZa primitak u Clanstvo Saveza potrebno je ispunjavati sljedece uvjete:\n* da je svrha njegova osnivanja i djelovanja razvoj i unapredenije, Sirenje i promicanje judo\nsporta na podrucju njegova djelovanja prema naéelima juda i olimpizma,\n* da je osnovan sukladno Zakonu, te u", "redno registriran kod nadleznog tijela drzZavne uprave |\nostalim registrima sukladno Zakonu i Statutu.\n\n* daimapravo koristenja ili je viasnik sportskog objekta koji udovoljava propisima judo sporta,\nkoji udovoljava uvjetima za sigurnost i zdravije sportasa i drugih osoba za bavijenje judo\nsportom,\n\n¢ da ima ugovorene odnose s osobom koja ima propisanu struénu spremu, odnosno koja je\nosposobljena za obavijanje strucnih poslova u judo sportu u skl", "adu sa Zakonom Oo sportu,\n\n¢ da prihvaca Statut i druge opce akte Saveza, Statut | pravila Hrvatskog olimpijskog odbora\nkao i pripadajucih medunarodnih sportskih udruzenja,\n\ne naéela i pravila Olimpijske povelje, Etickog i Medicinskog kodeksa, te Svjetskog kodeksa\nprotiv dopinga (WADA).\n\nClanak 17.\n“lanice Saveza sukladno odredbama ovog Statuta su judo klubovi, zupanijski judo savezi, gradski\njudo savezi i Zagrebacki judo savez.\n\nZlanice Saveza s", "ukladno odredbama ovog Statuta mogu biti i strukovne sportske udruge u istome\nsportu, udruge sportskih klubova istog sporta i ranga natjecanja te udruge u koje se udruzuju\nsportaéi i treneri istog sporta, sukladno odredbama ovog Statuta.\n\nClanak 18.\nClanstvo u savezu moze biti privremeno i punopravno.\n\nizmedu dvije sjednice Skupstine Saveza, odluku o prijemu u privremeno élanstvo donosi Upravni\nodbor Saveza po ispunjavanju uvjeta iz Clanka 20. ov", "og Statuta.\n\nPrivremeni ¢lan Saveza ima sva prava i obaveze punopravnog Clana Saveza osim prava odlucivanja\nu tijelima saveza.\n\nStatus punopravnih élanica Saveza stjecu se po donosenju odluke SkupStine o prijemu u Clanstvo.\n\nClanak 19.\nZahtjevu za uélanjenje potrebno je priloziti:\n\n* odluku skupStine o udruzivanju u Savez, .\n\n* opresliku statuta kluba/saveza/udruge uskladenim s ovim Statutom,\n\n* presliku rjeSenja o upisu u Registar udruga Republi", "ke Hrvatske,\n\n* izvadak iz Evidencije pravnih osoba u sportu,\n\n* oresliku rjeSenja o upisu u registar neprofitnih organizacija pri Ministarstvu financija\nRepublike Hrvatske,\n\n* presliku o obavijesti Drzavnog zavoda za statistiku o razvrstavanju prema NKD-u,\n\n* broj bankovnog racuna na obrascu banke,\n\n* popis (ime, prezime, OIB, datum i godina rodenja) o klupskoj registraciji najmanje dvadeset\n20) aktivnih Clanova,\n\n* podatke o osobama oviastenim ", "za zastupanje (kontakt e-mail, mobitel),\n\n* potvrdu ili ugovor o pravu koristenja sportskog objekta, te udovoljava uvjetima za sigurnost\n: zdravije sportaga i drugih osoba za bavijenje judo sportom,\npresliku ugovorenih odnosa s osobom koja ima propisanu strucnu spremu odnosno koja je\nosposobljena za obavljanje stru¢nih poslova u judo sportu u skladu sa Zakonom o sportu,\nizjava o prihvacanju Statuta Saveza i drugih opcih akata Saveza, i pravila pr", "ipadajucih\nmedunarodnih sportskih udruzenja, nacela i pravila Olimpijske povelje, Etickog i\nMedicinskog kodeksa, te Svjetskog kodeksa protiv dopinga (WADA),\n\npotvrdu o uplati godisnje Clanarine Savezu.\n\nClanak 20.\n\nSavez vodi popis svojih Clanica.\n\nGlavni tajnik Saveza zaduZen je za azuriranje evidencije Clanica, te objavi na mreznoj stranici Saveza.\n\nPopis Clanica vodi se elektronicki, a za svaku Clanicu Saveza obvezno sadrzi:\n\nnaziv Clanice,\n\na", "dresu Clanice,\n\ndatum primitka i prestanka u Clanstvo,\nkategoriju Clanstva,\n\nkontakt telefon i elektronske adrese Clanice,\nOIB Clanice.\n\nPopis Clanica Saveza dostupan je svim Clanicama i nadleznim tijelima, na njihov zahtjev.\n\nClanak 21.\n\nClanice imaju pravo:\n\n()\n\nimati svoje predstavnike u SkupStini Saveza,\n\npredlagati, birati i biti birani u tijela Saveza,\n\nsudjelovati u radu strucnih tijela Saveza,\n\nsudjelovati na natjecanjima u organizaciji S", "aveza sukladno vazecim opcim aktima Saveza,\nsudjelovati na struCnim seminarima, tecajevima i ostalim dogadanjima sukladno opcim\naktima Saveza,\n\nbiti informirane o svim relevantnim zbivanjima u podru¢ju judo sporta dostupnim Savezu.\n\nveze Clanica su:\n\naktivno sudjelovati u realizaciji pojedinih dijelova godisnjeg plana rada Saveza prihvacajuci\nduZnosti organizatora pojedinih natjecanja i ostalih aktivnosti predvidenih programom\nSaveza kao i opcim ", "aktima,\n\naktivo sudjelovati sa Clanstvom na najmanje tri (3) natjecanja u tekucoj godini sukladno\nkalendaru Saveza (obaveza se odnosi na Clanice iz lanka 18., stavak 1.),\n\nsudjelovati na stru¢nim seminarima, tecajevima i ostalim dogadanjima sukladno opcim\naktima Saveza,\n\noodnositi trazena izvjeséa,\n\nuredno placati Clanarinu te podmirivati druge financijske obveze utvrdene odlukama\nJpravnog odbora ili opcim aktima Saveza,\n\nna zahtjev Saveza, obave", "zne su omoguCiti svojim Clanovima sudjelovanje u aktivnostima\nSaveza,\n\nuskladiti svoj Statut i op¢e akte s ovim Statutom i drugim op¢cim aktima Saveza,\ne druge obveze koje odredi Upravni odbor ili Skupstina Saveza.\nClanak 22.\n“lanica Saveza, kao niti bilo tko drugi ne moze organizirati domaca ili medunarodna sportska\nnatjecanja, priredbe i druge aktivnosti u judo sportu bez prethodne suglasnosti Saveza.\n\nJkoliko élanica ne bude izvrgavala svoje o", "bveze pokrenut ¢e se stegovni postupak sukladno\nPravilniku o stegovnoj odgovornosti Saveza.\n\nClanak 23.\nClanstvo u Savezu privremene i punopravne Clanice prestaje:\n¢ na vlastiti zahtjev uz obrazlozenje,\n¢ ako se utvrdi da je Glan prestao djelovati sukladno Statutu,\n© ako nije odrzao skupStinu najmanje dvije godine,\ne akose broj Clanova smanji ispod broja odredenog za primanje u élanstvo,\ne ako Glan svojim djelovanjem znatno otezava ostvarivanja c", "iljeva i djelatnosti Saveza,\ne prestankom postojanja Clana.\n\nOdluku o brisanju iz élanstva za privremene Clanove donosi Upravni odbor Saveza, dok za\nounopravne élanove donosi SkupStina Saveza.\n\nPrestankom élanstva ne prestaju financijske obveze koje je dotadasniji élan imao prema Savezu, a\nkoje su nastale do trenutka prestanka Clanstva.\n\nIV. USTROJ | UPRAVUANJE U SAVEZU\n\nClanak 24.\n\nU Savezu djeluju sljedeca tijela:\n\ne SkupStina Saveza,\n\ne Predsj", "ednik Saveza,\n\ne Upravni odbor Saveza,\n\n¢ Glavni tajnik Saveza,\n\ne Nadzorni odbor Saveza,\n\ne Stegovna komisija Saveza,\n\ne Stalne iad hoc komisije.\n\n“od izbora élanova tijela Saveza, potrebno je voditi brigu o:\n\n¢ struénoj osposobljenosti, znanjima i drugim kvalitetama osoba u odnosu na ciljeve i\nnadleznosti Skupstine, Upravnog odbora, Nadzornog odbora, Stegovne komisije odnosno\ndrugih tijela saveza,\n\n* nepostojanje prepreka sukladno Zakonu o spor", "tu i Zakonu o udrugama kao i ovim Statutom,\n\n¢ postivanju sluzbene preporuke Medunarodnog olimpijskog odbora o potrebi zastupljenosti\nodredenog broja Zena u sastavu tijela Saveza, odnosno osigurati zastupljenost do 40% osoba\npodzastupljenog spola.\n\non\n\n4.1. SkupStina Saveza\n\nClanak 25.\nSxupstina Saveza je najvise tijelo upravijanja Savezom.\n\nSkupStinu sacinjavaju:\n\n* po jedan predstavnik élanice Saveza, sukladno élanku 17. Ovog Statuta, a prema p", "opisu\nClanica Saveza, te ukoliko élanice na dan odrzavanja izborne sjednice Skuptine imaju urednu\nregistraciju s vazecim mandatima tijela upravijanja i zastupanja i podmire materijalne i/ili\nfinancijske, te druge obveze prema Savezu,\n\n* sedam (7) Clanova Upravnog odbora Saveza.\n\n4.1.1. Predstavnici u Skup8tini Saveza\n\nClanak 26.\nPredstavnik u Skupstini Saveza moze biti osoba:\n\n* koja je drzavijanin Republike Hrvatske,\n\n* koja je navrSila 18 godin", "a i potpuno je poslovno sposobna, koja se nije ogrijegila o etiéke\nnorme i nacela olimpijskog pokreta,\n\n* koja prihvaca Statut Saveza, Statut Hrvatskog olimpijskog odbora, Statut i pravila\npripadajuceg medunarodnog sportskog udruzenja, nacela i pravila Olimpijske povelje, te\nSvjetskog kodeksa protiv dopinga (WADA),\n\n* koja nema zapreke iz lanka 111. stavci 1. i 2. odnosno iz élanka 114. Zakona o sportu.\n\nredstavnici u Skup8&tini Saveza za svoj ra", "d odgovorni su Skup$Stini i Clanici €iji su predstavnici.\nNa !zbornoj sjednici Skupstine Clanovi Upravnog odbora ne mogu biti predstavnici u SkupStini.\n4.1.2. NadleZznosti SkupStine\n\nClanak 27.\nS*upStina obavija sliiedeée poslove:\n\n* utvrduje strategiju razvoja judo sporta u Republici Hrvatskoj, u skladu s aktima strateskog\nplaniranja razvoja sporta na nacionalnoj razini,\n\n* bira predsjednika Saveza, dopredsjednika, élanove Upravnog odbora, Clano", "ve Nadzornog\nodbora i Clanove Stegovne komisije, te donosi odluku o njihovom razrjesenju,\n\n* bdira radna tijela SkupStine Saveza,\n\n* usvaja godisnje i visegodisnjeg programe judo sporta drzavne razine, odnosno programe\nrada Saveza,\n\n* usvaja financijski plan,\n\n* usvaja financijsko izvjesée,\n\n* donosi Pravilnik o stegovnoj odgovornosti,\n\n* donosi odluku u prijem i prestanku punopravnog Clanstva u Savezu,\n\n* utvrduje materijalne, tehniéke i struéne", " uvjete za uclanjenje sportskih kiubova u élanstvo\nSaveza,\n\nWw\n¢ donosi Statut Saveza, kao i njegove izmjene i dopune, te druge opce akte za koje je ovim\nStatutom ili odlukom SkupStine utvrdena nadleZnost SkupStine odnosno koje pravilnike\nUpravni odbor Saveza predlozi SkupStini na donoSenje,\n\n* pravilnik o sustavu uvjetima i organizaciji natjecanja u judo sportu na prijedlog Upravnog\nodbora Saveza,\n\n* donosi odluku o udruZzivanju u medunarodne i ", "nacionalne sportske organizacije koje\ndjeluju u judo sportu ili su s njim povezane,\n\n* odlucuje o promjeni ciljeva i djelatnosti, gospodarskih djelatnosti, prestanku rada i\nraspodjeli preostale imovine Saveza u slucaju prestanka rada Saveza,\n\n¢ donosi odluku o imenovanju i razrjeSenju pocasnih odnosno zasluznih Clanova Saveza,\n\n¢ donosi odluku o prestanku rada Saveza,\n\n* obavijai druge poslove i zadace odredene zakonom, Statutom Hrvatskog olimpij", "skog odbora\ni ovim Statutom, te je nadlezna i za sva pitanja za koja eksplicitno nije utvrdena statutarna\nnadleznost drugih tijela Saveza, kada se radi o pitanjima koja po svom zna¢aju upucuju na\nnadleznost najviseg tijela upravijanja Savezom.\n\n4.1.3. Sjednice SkupStine\n\nClanak 28.\nSkupStina Saveza odlucuje o pitanjima iz svoje nadleznosti na sjednicama.\n\nSjednice SkupStine saziva i predsjedava im predsjednik, a u slucaju njegove odsutnosti ili\ns", "prijecenosti, dopredsjednik.\n\nSjednicama SkupStine predsjedava troclano radno predsjednistvo (predsjedavajuci i dva Clana\nradnog predsjednistva), koje predlaze predsjednik ili dopredsjednik Saveza, a bira ih SkupStina.\n\nZapisnik sjednice SkupStine vodi zapisnicar, a potpisuju ga predsjednik Saveza, dva (2) ovjerovitelja\nzapisnicar. Zapisnicara i ovjerovitelje zapisnika bira SkupStina.\n\nJtvrdivanje pravovaljanosti mandata Clanova SkupStine provodi", " Verifikacijska komisija u sastavu\noredsjednik i dva Clana Verifikacijske komisije, a bira ih SkupStina.\n\nZ2 provodenje izbora zaduzena je Izborna komisija u sastavu predsjednik i dva Clana Izborne\n«omisije, Clanovi Verifikacijske komisije mogu biti i Clanovi Izborne komisije, a bira ih SkupStina.\n\n>rije utvrdivanja dnevnog reda sjednice predsjednik Verifikacijske komisije konstatira na osnovu\noredanih evidencijskih listi¢a, i izvjeséa Verifikaci", "jske komisije, postojanje kvoruma, odnosno\nsazotnosti vise od polovice ukupnog broja Clanova SkupStine neophodnih za pravovaljano\noclucivanje. Poslije usvajanja dnevnog reda prelazi se na raspravu o pojedinim tockama\nredoslijedom koji je utvrden.\n\nNa Skup&tini se o svakoj tocéci dnevnog reda otvara rasprava prije nego Sto se 0 njoj odlucuje.\n> pojedinom se pitanju raspravija sve dok ima prijavijenih govornika, a potom predsjedavajuci\nr2spravu zak", "ljucuje tekstom akta ili odluke koja se stavija na glasovanje.\n\n-_-\ned rasprava o nekim pitanjima traje duze, predsjedavajuci moze ograniciti trajanje izlaganja.\nSjednice SkupStine mogu biti redovne, elektroniéke, izvanredne, sveéane i izborne.\n\ncantjev za sazivanje sjednice SkupStine, uz pisani zahtjev, moze podnijeti Upravni odbor, Nadzorni\nocbor ili najmanje 1/2 Clanica Saveza. Zahtjev mora sadrzavati prijedlog dnevnog reda i pisano\nodrazlozen", "je s potpisima Clanova Upravnog ili Nadzornog odbora ili potpisima 1/2 élanica Saveza.\n\nAxo predsjednik ne sazove sjednicu SkupStine u roku od 30 dana od dana prijema zahtjeva za\nsazivanje sjednice SkupStine Saveza postavijenog u skladu s odredbama ovog Statuta, predlagatelj\nmoze sam sazvati trazenu sjednicu SkupStine u roku od 30 dana, po isteku roka od 30 dana.\n\nsvecane sjednice SkupStine mogu se sazvati povodom obiljezavanja odredenog povijesn", "og datuma\nza Savez, odnosno iz druge potrebe iste prirode.\n\nzborne sjednice SkupStine odrzavaju se svake éetiri (4) godine.\n\nzdornim sjednicama SkupStine predsjedava troclano radno predsjednistvo koje se bira izmedu\nclanova SkupStine.\n\nJ slucaju isteka mandata tijelima Saveza, SkupStinu Saveza saziva zadnja osoba za zastupanje\nupisana u Registar udruga ili najmanje 1/3 Clanica Saveza koje su upisane u popis lanica Saveza prije\n‘steka mandata tije", "lima Saveza.\n\nzvanredna sjednica SkupStine Saveza je skupstina koja se saziva sukladno odredbama ovog Clanka,\n2 odnosi se na sjednicu iz prethodnog stavka ovog élanka.\n\nClanak 29.\nPoziv se objavijuje na mreznim stranicama Saveza najkasnije 10 dana prije Odrzavanja sjednice\nSkupStine.\n\nPoziv s predlozenim dnevnim redom i materijalima, s oznakom dana, poéetka i mjesta odrzavanja\nsjednice Skupstine Saveza, Salju se Clanicama Saveza najkasnije 10 dan", "a prije odrzavanja sjednice\nSxupSstine elektronickom postom.\n\nok za dostavu materijala moze biti i kraci od 10 dana, a dio materijala se moze dostaviti ina samoj\nsjednici SkupStine saveza.\n\nClanak 30.\nSkupstina moze pravovaljano odlu¢ivati ako je na sjednici nazo¢éna natpoloviéna vecina élanova\nSkupStine.\n\n/ slucaju da u zakazano vrijeme poéetka rada Skupstine ne bude prisutna natpoloviéna vedina\n~ anova Skupstine pricekat ce se jedan sat, ukolik", "o i nakon toga sjednici SkupStine ne prisustvuje\nnatpolovicna vecina Clanova Skup$Stine, ista se nece odrzati.\n\n“-\nSc uke Skupstine se donose javnim glasovanjem.\nSc uka SkupStine je donesena ako za nju glasuje vecina nazo¢nih Clanova na sjednici Skupstine.\n\n~ racu sjednice SkupStine vodi se zapisnik, kojeg potpisuje izabrani zapisniéar na sjednici SkupStine\n\noe\n\n-—-\n\ns2veza, te zapisnik ovjeravaju dva ovjerovitelja zapisnika, takoder izabranih na", " sjednici Skupstine\nS2veza, koji se trajno Cuva u arhivi Saveza.\n\nClanak 31.\n~pravni odbor moze donijeti odluku glasovanjem Clanova SkupStine bez neposrednog dolaska\n~ anova Skupstine na sjednicu, izjasnjavanjem o prijedlogu odluka putem elektronicka po$te ili video\n\npozva, koji omogucava identifikaciju ¢clanova i evidenciju njihova prisustva te dvosmjernu\neomunikaciju.\n\n2 organizaciju navedene elektronicke sjednice dostavlja se prijedlog odluka ", "Clanovima Skup$Stine s\n»eciogom da se izjasne ,,Za\", ,,Protiv“ ili ,Suzdrzan“ o predlozenoj odluci.\n\nDo ©\n’\n\n7 2eve odluke zahtijevaju prihvacanje od strane vecine svih Clanova SkupStine Saveza s pravom glasa.\n\n2/ektronickoj sjednici sastaviti Ce se, a zatim i verificirati, zapisnik na slijedecoj redovnoj sjednici\neupstine Saveza.\n\n~\n—\n-\n™~\n—\n\n4.1.4. Mandat SkupStine\n\nClanak 32.\n‘andat SkupStine Saveza traje Cetiri (4) godine, a pocinje teci dano", "m verifikacije mandata\n\nprecstavnika Clanice za Clanove SkupStine Saveza.\n\nst2 osoba moze biti ponovno izabrana u SkupStinu za novo mandatno razdoblije.\n. 5 ucaju sprijecenosti predstavnika Clanice u SkupStini Saveza, Clanica Saveza vrsi izbor zamjenskog\n\nClanak 33.\n2m enskom predstavniku Clanice na sjednici SkupStine Saveza, oduzet ¢e se pravo glasa u slucaju\nt2 < anica Saveza nema urednu registraciju o vazecim mandatima tijela upravljanja i zas", "tupanja.\n\n2mca Saveza duzna je do pocetka sjednice SkupStine dostaviti Savezu dokaz, odnosno kopiju\n\n~=senja ili izvod iz Registra udruga Republike Hrvatske iz kojeg je moguc¢e utvrditi urednu registraciju\nzecim mandatima tijela upravijanja i zastupanja te Clanice.\n\na)\nClanak 34.\n=novi Skupstine sudjeluju u radu i odlucivanju temeljeci se na:\n\n* aktivnom predlaganju prijedloga zakljucaka u cilju doprinosa unapredenju razvoja judo\nsporta u Republi", "ci Hrvatskoj,\n\n* zahtjevima provodenja utvrdene politike i strategije razvoja judo sporta u Republici\nHrvatskoj,\n\n* provedbi zajedni¢ékih obveza i odgovornosti pri ostvarivanje planova juda, a posebno za\nostvarivanje programa javnih potreba sportu Republike Hrvatske, u dijelu judo sporta,\n\n* teinjama k ostvarivanju sportskih vrijednosti koje pridonose razvoju, afirmaciji i ugledu\nhrvatskog juda i Republike Hrvatske,\n\n* zajedniékim interesima svih", " udruzenih Clanica i obvezi izvrsenja ciljeva i zadaca Saveza\nutvrdenih Zakonom i ovim Statutom.\n\n>redstavnik élanice — ¢lan SkupStine Saveza ima prava i obveze:\n\n* sudjelovati u radu Skup$tine i drugih tijela u koje je izabran,\n\n* odludivatio pitanjima o kojima odlucuje Skupstina,\n\n* izvjestavati Clanice koje predstavija o radu Skupstine io svom radu u Skupstini Saveza i drugih\ntijela Saveza,\n\n* pokretati raspravu o pitanjima iz djelokruga SkupS", "tine i predlagati odgovarajuce odluke,\n\n* sudjelovati u izvrSavanju zadaéa utvrdenih odlukama Skup5Stine,\n\n* traziti struénu pomoc od tijela Saveza,\n\n* obveza je Glanova Skup$Stine u svakoj prigodi zastupati i Stititi interese Saveza, judo sport i\nolimpizam, te interese udruge koju predstavija.\n\n4.2.  Predsjednik Saveza\n\nClanak 35.\n\\endat predsjednika traje Getiri (4) godine i iste osobe mogu biti ponovno birane za novo mandatno\n\n>redsjednik obav", "ija sljedece zadace i poslove:\n\noredstavija i zastupa Savez u zemiji i inozemstvu,\n\nsaziva i predsjedava sjednicama Skupstine i Upravnog odbora Saveza, te potpisuje akte,\n\nodlukei zapisnike koje oni donose,\n\n* odgovoran je za zakonitost rada Saveza i ispunjavanje zakonom, drugim propisima ili\nugovorima utvrdenih obveza Saveza,\n\n* skrbi o izvr$enju odluka i zakljuéaka SkupStine i Upravnog odbora,\n\n* podnosi izvjes¢a o svom i radu Upravnog odbora S", "kupstini Saveza,\n\n* odgovoran je za podnoSenje prijedloga godisnjeg financijskog plana i financijskog izvjesca\nSkupstini Saveza za prethodnu godinu,\n\n* yodi poslove sukladno odlukama Skupstine i Upravnog odbora Saveza,\n\n* ooti¢e aktivnosti razvoja i promocije judo sporta,\n\n« oredlaze Skup&tini kandidate za dopredsjednika, Clanove Upravnog odbora, Nadzornog\nodbora i Stegovne komisije Saveza,\n\n* ookreée rjeSavanje pitanja razrjesenja Clanova Upravn", "og odbora Saveza,\n\n* sklapa ugovore i poduzima pravne radnje u ime i za racun Saveza,\n* obavijaidruge zadacée po ovlasti Skupstine i Upravnog odbora Saveza utvrdene opcim aktima\nsvim Statutom, ili koje su u svezi s funkcijom predsjednika.\n\nClanak 36.\nSeeds ednik Saveza odgovoran je za svoj rad Skupstini i Upravnom odboru.\nDooredsjednik Saveza zamjenjuje odsutnog ili sprijecenog predsjednika Saveza u obavljanju\nsoslowa i zadaéa, utvrdenih prethodn", "im élankom, kojeg za to ovlasti predsjednik ili Upravni odbor.\n\nClanak 37.\nT= oredsjednika moiZe biti izabrana osoba koja udovoljava sljedecim uvjetima i kriterijima:\n\n* da je drzavijanin Republike Hrvatske,\n\n* da je potpuno poslovno sposobna,\n\n* dajeugledan sportski djelatnik,\n\n* dasenije ogrijesila o eticke norme i nacela sporta i olimpijskog pokreta,\n\n* da prihvaéa Statut Saveza, Statut Hrvatskog olimpijskog odbora, Statut i pravila pripadajuc", "ih\nmedunarodnih sportskih udruzenja, na¢ela i pravila Olimpijske povelje, te Svjetskog kodeksa\norotiv dopinga (WADA),\n\n* danema prepreke iz Zakona o sportu,\n\n« koja nema zapreke iz ¢lanka 111. stavci 1. i 2. odnosno iz ¢élanka 114. Zakona o sportu,\n\n* da poznaje jedan svjetski jezik koji je u sluzbenoj uporabi medunarodnog sportskog\nudruzenja prema odredbama Statuta tih udruzenja.\n\nClanak 38.\n>redsjednika bira SkupStina, a na temelju pisanog prij", "edloga kandidata, koji imaju pravo podnijeti\n\n= Pisani prijedlog kandidata treba podrzati 10 Clanica Saveza, s tim da ista ¢lanica moze\n4-ati istodobno samo jednog kandidata.\n\nvb\n\n“véaju redovnog izbora predsjednika Saveza, kao i u sluéaju izvanrednih izbora, Clanice Saveza\n=s< su Uredu Saveza dostaviti pisani prijedlog kandidata za predsjednika s obrazlozenjem\n\n-_\n\n«2snije 60 dana prije odrzavanja sjednice Skupstine.\n\n“spjelim prijedlozima kandi", "data za predsjednika Saveza, Ured Saveza duzno je obavijestiti sve\nope Slenice u roku od 15 dana po isteku roka za dostavu pisanih prijedloga kandidata.\n\n22 predsjednika istaknuto vise kandidata, od kojih u prvom krugu glasovanja niti jedan ne\nsotrebnu vecinu glasova Clanova SkupStine, u drugom krugu glasovanja na izbornu se listu\n\n+ ona dva kandidata koja su u prvom krugu dobili najveci broj glasova.\n\na by ib\n\nClanak 39.\nu =u da predsjednik, koj", "eg je izabrala SkupStina ne izvrsava svoje obveze sukladno odredbama\n= -stuts. svojim radom tezZe povrijede zakon, odredbe Olimpijske povelje, odredbe Statuta ili\n=o) 2s &ole je utvrdila SkupStina ili svojim djelovanjem sprjecavaju provodenje odluka Skupstine,\n\ni\n\n7\n\n——\n_—-s\n-_-\n\nza razrjesenje predsjednika sliiedom odredbe iz stavka 1. ovog élanka mogu podnijeti\naveza pisanim zahtjevom koji treba podrzati 1/2 Clanica Saveza, a predsjednika moze ", "se\nti ina temelju njegovog osobnog zahtjeva.\n\n\"4\n=\n>\n\n- Sucaju trajne sprijecenosti ili podnoSenja neopozive ostavke predsjednika zamjenjuje\nSoprecsjednik, ali najduze do nove izborne sjednice SkupStine Saveza koja se odrzava u roku od 90\nten2 oc nastupanja navedenih okolnosti.\n\n43. Upravni odbor\n\n-—-= -\n-\n-~-\n\n-\n_ —<—\n\n~~? - =\n.\n\nwe\n\nClanak 40.\nodbor je upravno tijelo Saveza koje obavija sliiedece poslove i zadaée.\n\norijediog strategije razvoja ", "judo sporta u RH,\n\nprijediog Statuta, odnosno njegovih izmjena i dopuna, koje donosi skupStina Saveza,\norijediog godisnjeg i visegodisnjeg plana judo sporta na drzavnoj razini, odnosno program\nrada Saveza, koje donosi skupStina Saveza,\n\nfinancijski plan, uvjete i nacin koristenja financijskog plana, koje donosi skupstina Saveza,\nfinancijsko izvjeSce, koje donosi skupStina saveza.\n\ngodisnji kalendar natjecanja i opée uvjete za sudjelovanje na tim ", "natjecanjima,\n\nodiuku o prijemu u privremeno Clanstvo Saveza,\n\nopce akte koji reguliraju pitanja iz nadleznosti Upravnog odbora, te razmatra i odluéuje o\npitanjima iz podrucja djelovanja Saveza, koja nisu u nadleznosti Skup$tine ili kojeg drugog\ntijela Saveza u skladu s odredbama ovog Statuta,\n\nodluku o dodjeli nagrada i priznanja u judo sportu Republike Hrvatske,\n\nmjere i aktivnosti za unapredenje i stvaranje najpovoljnijih materijalnih i financ", "ijskih uvjeta\nza realizaciju planova Saveza,\n\nodiuku o adresi Saveza kao i promjeni adrese Saveza,\n\nodluku 0 uporabi, izgledu i Cuvanju peéata Saveza,\n\nodluku o opisu znaka i zastave Saveza, te uporabi i njihovoj za&titi,\n\nPravilnik o financijskom materijalnom poslovanju saveza,\n\nPravilnik o licenciranju trenera,\n\nPravilnik o stegovnoj odgovornosti,\n\nSudacki pravilnik,\n\nodluku o sudjelovanju sportskih klubova i sportaSa iz Republike Hrvatske u vi", "Sedrzavnim ili\ninozemnim regionalnim sustavima natjecanja,\n\nPravilnike za druga pitanja iz svoje nadleznosti sukladno Zakonu o sportu te pravilima\nMedunarodne judo federacije i Europske judo unije,\n\nodluku o prijemu u privremeno Clanstvo Saveza,\n\nb-\nwi\n* opce akte koji reguliraju pitanja iz nadleznosti Upravnog odbora, te razmatra i odlucuje o\npitanjima iz podrucja djelovanja Saveza, koja nisu u nadleznosti SkupStine ili kojeg drugog\ntijela Savez", "a u skladu s odredbama ovog Statuta,\n\n* mijere i aktivnosti za unapredenje i stvaranje najpovoljnijih materijalnih i financijskih uvjeta\nza realizaciju planova Saveza,\n\n™meruje:\n\n* giavnog tajnika Saveza na temelju provedenog javnog natje¢aja i razrjeSava ga,\n\n* Jlikvidatora Saveza i razrjeSava ga,\n\n* predstavnika Saveza u SkupStini Hrvatskog olimpijskog odbora, te predstavnike u drugim\norganizacijama, institucijama i tijelima i razrjeSava ih,\n\n*", " strucno-trenersku komisiju, komisiju sportaSa, natjecateljsku komisiju, sudacku komisiju,\n<omisiju za kate i pojaseve, komisiju za Skolski sport, komisiju za Zene, komisiju za inkluzivni\njudo, te donosi odluku o djelokrugu njihova rada i ovlasti,\n\n* ostala radna tijela Saveza, a moze imenovati i stalne ili povremene komisije, odnosno radne\n\ngrupe za koje se ukaZe potreba, te donosi odluku o djelokrugu njihova rada i ovlasti.\nie:\n\n* udruzivanje u", "medunarodne i nacionalne sportske organizacije,\n\n* program osnovne djelatnosti judo sporta kao i drugih djelatnosti Saveza sukladno propisima,\n\n* pravilnik o sustavu uvjetima i organizaciji natjecanja u judo sportu, SkupStini Saveza,\n\n* osobe za proglaSenje pocasnog i zasluZnog Clana Saveza.\n\nSc ucuje o:\n\n* organizaciji i nacinu obavijanja stru¢nih, administrativno-tehnickih i pomoénih poslova za\npotrebe Saveza i udruzenih Clanica,\n\n* isticanju k", "andidature za organizaciju medunarodnih natjecanja u RH,\n\n* davanju suglasnosti udruzenim Clanicama i Clanovima za sudjelovanje na medunarodnim\nnatjecanjima.\n\n* davanju inicijative za odrZavanje redovne, elektronicke, izborne, izvanredne ili svecane\nSjednice SkupStine.\n\n>rovodi i skrbi o:\n\n* provodenju odluka i zaklju¢aka SkupStine ako ovim Statutom, ili samim odlukama i\nzakljuccima to nije povjereno drugom tijelu Saveza,\n\n* izvrSavanju financijs", "kog plana Saveza, rasporedu i koristenju sredstava,\n\n* organizaciji i realizaciji strategije i svih planova Saveza i odgovoran je za njihovo izvrsenje,\n\n* upravija pokretnom i nepokretnom imovinom Saveza,\n\n* razmatra pitanja iz rada udruzenih Clanica i poduzima odgovarajuce mjere za unapredenje\nnjihova rada, kao i za otklanjanje nepravilnosti u radu,\n\n* obavijai druge poslove i zadace odredene Statutom ili drugim op¢im aktima Saveza, odnosno\nodlu", "kom Skup$Stine Saveza.\n\na\n;\nm\nWw\n\n=\n=\n\n_oravni odbor za svoj rad odgovara SkupStini.\n\nClanak 41.\nGreen ocdor ima sedam (7) Clanova, medu kojima je po funkciji predsjednik Saveza.\n\n_ Qe@0 @genju kandidata za Clanove Upravnog odbora novoizabrani predsjednik ce voditi raCuna o\n“~® osposobljenostii drugim kvalitetama i osobinama osoba u odnosu na nadleznosti Upravnog\nw@bere te c2 ne postoje prepreke sukladno Zakonu o sportu kao i da ispunjavaju uvjet", "e utvrdene\nptret pom ¢anka 26. stavak 1. ovog Statuta ovim Statutom.\n\n_ © ote ce sta kandidata za Clanove Upravnog odbora, koju je predlozio predsjednik, ne bude\n) ~e@tere od strane SkupStine, pojedina¢no ce se glasovati o svakom pojedinom kandidatu, a\n\nyet) et © prediaze onoliko novih kandidata koliko ih ne bude prihvaceno s liste.\n_@m@ Vorevnog odbora izvrsavaju zadace utvrdene ovim Statutom, odnosno koje im naloZi\n“a m2. Uoravni odbor ili pred", "sjednik, u skladu s aktima saveza i zakonom.\n\n“vets © ¢anova Upravnog odbora u svakoj prigodi zastupati i Stititi interese Saveza i judo sporta.\n\nClanak 42.\n\\/e@ecet Genova Upravnog odbora traje Cetiri (4) godine i ista osoba moze biti ponovno izabrana za\nmwa Tendatno razdoblie.\n\n_ | ee 6 ce Gen Upravnog odbora ne izvrSava svoje obveze sukladno odredbama Statuta, isti moze\n=o \"enn e$en s funkcije Clana Upravnog odbora.\n\n) eno © e= © Cana Upravnog", " odbora vrSi se na isti nacin kao i njegovo biranje.\n> @0 Oe D2 rezrjeSenje Clana Upravnog odbora, slijedom odredbe stavka 2. ovog Clanka, moze dati\n\njet ete «© — Gan Upravnog odbora, a Clan Upravnog odbora moze biti razrijeSen i na osobni\naS.\n\ns \"8 rerrjesenog Clana Upravnog odbora bira se novi Clan po istom postupku po kojem je\n“2m Jorevnog odbora koji je razrijeSen, odnosno koji je prestao s obavijanjem funkcije Clana\n% O¢Dora, a mandat novoiz", "abranog Clana Upravnog odbora traje do kraja mandata tog\n= Jpr2wmog odbora Saveza.\n\n' ——\n\nClanak 43.\n™ odor djeluje na sjednicama, a moze djelovati i izjaSnjavanjem telefonski ili putem\n== poste Clanova Upravnog odbora.\n\n» See@Sem< orevovaljanih odluka potrebna je nazocnost, odnosno telefonsko izjaSnjavanje ili\n\n\"= @eem e outem elektronske poste vecine od ukupnog broja Clanova Upravnog odbora.\n\n™ oor conosi odluke javnim glasovanjem, a odluka je ", "donesena vecinom glasova prisutnih\n\n=  @r2veog odbora ili vecinom glasova telefonskog izjaSnjavanja ili izjasnjavanja putem\n© poste Clanova Upravnog odbora.\n\n17\n\nSednicama Upravnog odbora predsjedava predsjednik, a u sluéaju njegove odsutnosti ili\nspr etenosti dopredsjednik.\n\n© ednice Upravnog odbora saziva predsjednik.\n\n44.  Glavni tajnik\n\n— ~\n- — 7\n-—— =~\n\n—\ni\n\n=\neI\n\nuy\n\n=\n\nte\n\n_\n\n-\n~~.\n*\n\nClanak 44.\nma glavnog tajnika kojeg svojom odlukom nepo", "sredno imenuje Upravni odbor Saveza, nakon\n\n>vedenog javnog natjeéaja, sukladno Zakonu, a imenuje se do opoziva.\n\ntajnik svoju funkciju obavija profesionalno, a prava i obveze izmedu Saveza i glavnog tajnika\n\nClanak 45.\n\nnog tajnika moze biti birana osoba koja ispunjava sliedece uvjete:\n\nda je drzavijanin Republike Hrvatske,\n\nda ima visoku struénu spremu drustvenog smjera prema vazecim propisima 0 akademskim i\nstru¢nim nazivima i akademskom stupn", "ju,\n\nda ima 5 godina iskustva na upravijackim poslovima,\n\nda je dokazani sportski duZnosnik ili djelatnik,\n\nda poznaje hrvatski i svjetski judo sport i funkcioniranje njihovih asocijacija,\n\nda poznaje rad na osobnom racunalu,\n\nda se nije ogrijesio o eti¢ke norme i moralna na¢ela sporta i olimpizma,\n\nda nema zapreke iz élanka 111. stavci 1. i 2. odnosno iz Clanka 114. Zakona oO sportu,\n\nda se sluzi jednim od sluzbenih jezika Medunarodne judo feder", "acije.\n\nClanak 46.\n\nei tajnik sudjeluje u radu SkupStine, Upravnog odbora i svih drugih tijela Saveza.\n\ntajnik provodi i osigurava provodenje opcih akata i programa Saveza te odluka i zakljucaka\nine Saveza, Upravnog odbora i predsjednika Saveza, te osobito obavlja sljedece poslove i\n\ncafiealed\nacace\nracace:\n\nzastupa i predstavija Savez,\n\nodgovoran je za zakonitost rada Saveza i ispunjavanje zakonom, drugim propisima ili\nugovorima utvrdenih obveza", " Saveza,\n\nodgovoran je za podnoSenje prijedloga godisnjeg financijskog plana i financijskog izvijesca\nSkupStini Saveza,\n\nnalogodavac je za izvrsenje financijskog plana Saveza,\n\nobavija struéne i administrativne poslove,\n\nodgovara za pripremu materijala za sjednice tijela Saveza,\n\nyodi poslove sukladno odlukama SkupStine i Upravnog odbora Saveza,\n\nodgovoran je za podnoSenje dokumenata nadleznim tijelima sukladno propisima, te za\ndostavijanje zapis", "nika s redovne sjednice Skupstine saveza nadleznom uredu,\n\nskrbi o suradnji Saveza s pripadajucim medunarodnim organizacijama judo sporta, te\n\n18\nSavezima tog sporta drugih drzava,\n\n¢ suraduje s ministarstvima i drugim drzavnim tijelima, Hrvatskim olimpijskim odborom i\ndrugim organizacijama vaznim za judo sport,\n\n¢ suraduje s Clanicama Saveza na razvoju i unapredenju judo sporta ,\n\n¢ vodi i azurira evidenciju ¢lanica Saveza, te je odgovoran za om", "oguCavanje svakodnevnog\nuvida i davanje podataka o aktualnom lanstvu u Savezu,\n\n¢ sklapa ugovore i poduzima pravne radnje u ime i za raéun Saveza,\n\n* organizira pristup medijima,\n\n* provodi usvojene planske dokumente Saveza, osigurava javnost rada Saveza,\n\n¢ organizira i rukovodi poslovima Ureda Saveza,\n\n¢ obavija i druge poslove utvrdene Statutom, drugim op¢im aktima ili odlukama Skup$tine,\nUpravnog odbora i predsjednika Saveza.\n\nGlavni tajnik z", "a svoj rad odgovara Upravnom odboru.\n\nClanak 47.\nGlavni tajnik moze biti razrijeSen duznosti ako svojim radom neopravdano ne izvrsava odnosno\nodbije izvrSavati odluke Upravnog odbora.\n\nOdluku 0 razrjeSenju donosi Upravni odbor Saveza.\n\ninicijativu za razrjeSenje duZnosti Glavnog tajnika mogu dati predsjednik Saveza, Upravni odbor i\nNadzorni odbor Saveza.\n\nDo razrjeSenja moze do¢i i na viastiti zahtjev Glavnog tajnika Saveza.\n\n4.5. | Nadzorni odbo", "r\n\nClanak 48.\nNadzorni odbor se sastoji od tri (3) élana, predsjednik i dva (2) Clana.\n\nViandat Nadzornog odbora traje 4 godine.\n\nKandidate za Clanove Nadzornog odbora predlaze predsjednik Saveza, pri Cemu kandidati trebaju\n‘spunjavati uvjete utvrdene odredbom élanka 26. stavak 1. ovog Statuta.\n\nClan Nadzornog odbora ne moie biti élan drugog radnog tijela Saveza.\n\nClanak 49.\nNadzorni odbor je oviasten za:\n¢ kontrolu provodenja zakonitosti u radu ", "i poslovanju Saveza,\n¢ nadzor materijalno-financijskog poslovanja Saveza,\n* nadzor izvrSavanja odluka i zakljuéaka Skup$tine i Upravnog odbora,\n¢ poduzimanje drugih mjera u svezi sa svojim poslovima, zadaéama i djelokrugom rada.\n\nUred Saveza, kao i druga tijela Saveza, duzni su Nadzornom odboru pruziti sve trazene i potrebne\n\n19\n\npodatke, omoguciti uvid u dokumentaciju i osigurati uvjete za rad.\nNadzorni odbor je za svoj rad odgovoran Skupstini S", "aveza kojoj podnosi izvjesée o svom radu.\n\nO uocenim nepravilnostima Nadzorni odbor obavjestava Ured Saveza, Upravni odbor, odnosno\nSkupStinu Saveza kao i tijelo u Cijem je radu nastala nepravilnost.\n\nAko se utvrdena nepravilnost ne otkloni u roku od 30 dana od zaprimljenog zahtjeva, Nadzorni\nodbor je duzan o tome obavijestiti ovlastena drzavna tijela.\n\nNadzorni odbor djeluje na sjednicama, a odluke, zakljucke i preporuke donosi natpoloviénom\nvec", "inom Clanova Nadzornog odbora.\n\n4.6. Stegovna komisija\n\nClanak 50. .\nStegovna komisija Saveza je tijelo koje odlucuje o stegovnoj odgovornosti élanova i osoba koje\nsudjeluju u programima Saveza, provodi stegovne postupke u prvom stupnju, a temeljem Pravilnika\no stegovnoj odgovornosti koji donosi SkupStina Saveza.\n\nClanak 51.\nStegovna komisija se sastoji od tri (3) Clana, predsjednik i dva (2) élana a bira ih Skup&tina Saveza,\nna prijedlog predsje", "dnika Saveza, na mandat od Cetiri godine. Kandidati za élanove Stegovne\nkomisije trebaju ispunjavati uvjete utvrdene odredbom ¢lanka 26. stavak 1. ovog Statuta.\n\nStegovna komisija donosi odluke vecinom glasova.\n\nStegovna komisija odluCuje 0 stegovnoj odgovornosti ¢lanica Saveza, kao i fiziékih osoba koje\nsudjeluju u radu tijela ili programu Saveza, zbog pocinjenih povreda prava i obveza utvrdenih\nodredbama ovog Statuta, odredbama Pravilnika o ste", "govnoj odgovornosti te drugih akata Saveza,\nsa slijedecim djelokrugom:\n\n¢ prima prijave za pokretanje stegovnog postupka koje ulazu Clanice i drugi sudionici Saveza,\n\n* provodi stegovne postupke u I. stupnju inicirane po prijavi ili po sluzbenoj duZnosti, provodi\n\nmjere utvrdene Pravilnikom o stegovnoj odgovornosti,\n¢ prati i predlaze izmjene i dopune Pravilnika o stegovnoj odgovornosti Saveza,\n¢ obavijai druge zadace, temeljem odluka SkupStine, ", "koje su u djelokrugu njenog rada.\n\nZalba na odluku Stegovne komisije se u roku od 15 dana od primitka odluke podnosi Upravnom\n\nodboru Saveza koji stegovni postupak rjeSava u II. stupnju.\nOdluka Upravnog odbora saveza povodom Zalbe je konaéna.\n\n20\nClanak 52.\nStegovna komisija za svoj rad i djelovanje odgovara SkupSstini.\n\nV. | NACIN RJESAVANJA SPOROVA | SUKOBA INTERESA UNUTAR SAVEZA\n\nClanak 53.\nSukladno odredbama Zakona o sportu, Zakonu o udrugama", ", te drugim pripadajucim propisima, kao\n‘ u odnosu na nadleznosti tijela Saveza i zaStitu opceg interesa u odnosu na pojedinacne interese\nélanova, Upravni odbor Savez samostalno odlucuje o nacinu rjeSavanja sporova nastalih u vezi s\nobavljanjem sportske djelatnosti judo sporta.\n\nVI. UNUTARNJI NADZOR\n\nClanak 54.\nClanovi Saveza sami nadziru rad Saveza.\n\nAko élanica Saveza ili druga osoba koja sudjeluje u radu ili programu Saveza smatra da je odluko", "m\nili postupanjem nekog tijela Saveza povrijeden Statut ili drugi opci akt Saveza, oviastena je na to\nupozoriti Ured Saveza ili Upravni odbor Saveza, te zahtijevati da se nepravilnosti otklone.\n\nAko se upozorenje ne razmotri u roku od 30 dana od dana dostavljenog pisanog zahtjeva, i po\nzahtjevu ne odgovori, odnosno ako se u tom roku ne o¢ituje nadlezno tijelo Saveza i nepravilnosti\nne otklone u daljnjem roku od 30 dana, Clanica, odnosno druga oso", "ba koja sudjeluje u radu ili\norogramu Saveza, a podnijela je zahtjev za otklanjanje nepravilnosti, moze podnijeti tuzbu\nnadleznom sudu prema sjedigtu udruge radi zastite svojih prava propisanih statutom Saveza.\n\nVil. IMOVINA | MATERUJALNO-FINANCISKO POSLOVANJE\n\nClanak 55.\nmovinu Saveza Cine nekretnine, pokretna imovina, prava | novéana sredstva.\n\nSavez vodi poslovne knjige i sastavija financijska izvjes¢a prema propisima kojima se ureduje nacin\nf", "inancijskog poslovanja i vodenja raCunovodstva neprofitnih organizacija.\n\nSavez osigurava novéana sredstva od gospodarske djelatnosti, dijela Clanarine, kotizacije, sredstava\nostvarenih od programskih sredstava Hrvatskog olimpijskog odbora, sredstava od sponzora,\n\ndJotacija, donacija, fondova i drugih izvora sukladno zakonu.\n\nClanak 56.\nNovéana sredstva Saveza nalaze se na njegovim poslovnim racunima.\n\n2aspodjela ukupnih financijskih sredstava vr", "éi se financijskim planom u skladu s programom rada.\n\n21\n>rora¢unska sredstva strogo su namjenska i mogu se koristiti iskljucivo z@ posiove | zacace\n>rinvacene godisnjim programom i financijskim planom i rashodima proracunskih sredstava.\n\nVioguéom razlikom prihoda i rashoda ostvarenom obavljanjem gospodarskih djelatnosti, sukladno\nodredbama ovog Statuta i pripadajucih propisa, raspolagati Ce Upravni odbor, sukladno programu i\n“nancijskom planu Sa", "veza, a ona moze biti koristena iskljucivo u svrhu ostvarivanja ciljeva Saveza.\n=yventualno ostvareni visak prihoda nad rashodima u poslovanju rasporeduje se financijskim\nolanom na slijedecu godinu u svrhu unapredenja judo sporta.\n\n-inancijski plan Saveza donosi, mijenja i dopunjuje SkupStina Saveza.\n\nNaredbodavac za izvrSenje financijskog plana je glavni tajnik Saveza, a Upravni odbor moze svojom\nodlukom utvrditi i druge osobe s ovlaStenjima u m", "aterijalno-financijskom poslovanju.\n\nMaterijalno-financijsko poslovanje Saveza organizira se i vodi u skladu sa zakonom i opcim aktima\nSaveza.\n\nGodignji financijski izvjestaj Saveza usvaja SkupStina i predaje se Ministarstvu financija, odnosno\ndrugoj instituciji koju Ministarstvo financija ovlasti za zaprimanje i obradu financijskih izvjestaja, a\n\njavno se objavljuje putem Registra neprofitnih organizacija sukladno zakonskim propisima.\n\nClanak 57", ".\nSavez moze stjecati nekretnine, pokretnu imovinu i prava.\n\nSavez moze raspolagati svojom imovinom samo za ostvarivanje ciljeva i obavijanje djelatnosti\nodredenih ovim Statutom, u skladu sa zakonom.\n\nZa svoje obveze Savez odgovara cjelokupnom imovinom.\nClanice Saveza i élanovi njegovih tijela ne odgovaraju za obveze Saveza.\n\nNad Savezom se moZe provesti stecaj, sukladno zakonu.\n\nVill. | SIGURNOST, ZASTITA | RED NA SPORTSKIM NATJECANJIMA\n\nClanak ", "58.\nSportaéi i treneri, suci i druge sluzbene osobe na natjecanju, te Clanovi upravijackih tijela Clanica\nSaveza i Saveza, duZni su svojim javnim nastupima popularizirati sportske ideje i ponasanje, koji\niskljuéuju eventualno izbijanje sukoba ili nereda na sportskim natjecanjima.\n\nClanice Saveza i Savez, organizatori sportskih natjecanja, duZni su u pripremama za organizaciju kao\ni usamom odrzavanju natjecanja poduzeti sve mjere kako bi se na nat", "jecanju osigurala sigurnost\nnatjecatelja i gledatelja i otklonila mogucnost eventualnih sukoba ili nereda na sportskom\nnatjecanju.\n\n22\nZa primjenu ove odredbe odgovorna je osoba oviastena za zastupanje organizatora natjecanis\nukoliko Savez ili nadleZno tijelo organizatora u tu svrhu izricito ne oviaste drugo tijelo, odgoveraucu\nsluzbu ili osobu, odgovornu za pripremu i provedbu mjera sigurnosti, zaStite sudionika natjecanja te\nreda na sportskom n", "atjecanju.\n\nOrganizatori iz prethodne toéke duZni su za vrijeme natjecanja osigurati medicinsku pomoce za sve\nsudionike, odnosno nazoénost osobe osposobljene i ovlaStene za pruzanje medicinske pomoci.\n\nPonaganja ¢lanova Saveza, suprotno odredbama stavka 1. ovog C¢lanka predstavijaju stegovni\nprijestup u skladu s Pravilnikom o stegovnoj i materijalnoj odgovornosti Saveza.\n\nIX. STRUCNI | ADMINISTRATIVNI POSLOVI\n\nClanak 59.\nZa obavljanje struénih, t", "ehniékih, administrativnih i drugih poslova Saveza moze se angazirati\npotreban broj djelatnika koji poslove mogu obavijati volonterski, honorarno ili profesionalno,\nangaziranjem odredenog broja vanjskih suradnika ili izvrsitelja koji poslove mogu obavijati\nvolonterski, honorarno ili profesionalno, a obavijanje odredenog posla moze se povijeriti |\nodgovarajucoj vanjskoj pravnoj osobi, temeljem odluke Upravnog odbora, Predsjednika ili Glavnog\ntajni", "ka Saveza, a sukladno zakonskim propisima.\n\nStruéne poslove izbornika i trenera u Savezu mogu obavljati osobe koje imaju odgovarajucu strucnu\nspremu za obavijanje struénih poslova u judo sportu, odnosno osobe koje su osposobljene i\nusavrgene za obavljanje struénih poslova u sportu sukladno Zakonu o sportu i pripadajucim\n\noropisima.\n\nSredstva za place i rad djelatnika u Savezu osiguravaju se financijskim planom u skladu s financijskim\nolanom Savez", "a i Hrvatskog olimpijskog odbora.\n\nUredom Saveza rukovodi glavni tajnik Saveza.\n\nNa Ured Saveza se ne mogu prenositi poslovi i zada¢e o kojima odlucuju tijela Saveza.\n\nX. JAVNOST RADA\n\nClanak 60.\nJavnost rada ostvaruje se upoznavanjem svojih clanica i drugih zainteresiranih tijela i organizacija\nodnosno javnosti o projektima, odlukama, smjernicama i zakljuccima tijela Saveza.\n\nObavjestavanje javnosti i élanstva vrSi se objavijivanjem opcih i drug", "ih akata Saveza, na mreznim i\n\ndru&tvenim stranicama Saveza, a moze biti i u €asopisu, biltenu ili drugom tiskanom mediju Saveza,\nkao i objavom informacija u sredstvima javnog priopcavanja.\n\n23\n+ ednice skupStine Saveza su otvorene za javnost i ¢lanice Saveza. Javnost se samo iznimno moze\ns«ijuciti sa sjednica SkupStine Saveza u slijedecim sluéajevima:\n\n* kada se raspravija o pitanjima koja predstavljaju poslovnu tajnu,\n\n¢ kada se to zbog osobito", " vaznih razloga odluéi na sjednici Skup&tine Saveza.\n\n> ednice Upravnog odbora Saveza su zatvorene za javnost i Glanice Saveza. Javnost i élanice Saveza\ns= samo iznimno mogu ukljuciti u rad sjednica Upravnog odbora Saveza u slijedecim slucajevima:\n\n* po pozivu predsjednika Saveza,\n\n* po unaprijed predlozenoj temi za raspravu, odobrenoj od strane predsjednika Saveza,\n\n¢ kada se za to zbog osobito vaznih razloga odlu¢i Upravni odbor Saveza.\n\nsednic", "e Nadzornog odbora Saveza su zatvorene za javnost i élanstvo. Javnost i ¢lanice Saveza se\n\nsamo iznimno mogu ukljuciti u rad sjednica Nadzornog odbora Saveza i to u slijedecim slucajevima:\n\n* po pozivu predsjednika Nadzornog odbora Saveza,\n\n* po unaprijed predlozenoj temi za raspravu, odobrenoj od strane predsjednika Nadzornog\nodbora Saveza,\n\n¢ kada se za to zbog osobito vaznih razloga odluéi Nadzorni odbor Saveza.\n\nsjednice Stegovne komisije Sav", "eza su zatvorene za javnost i élanstvo. Javnost i élanice Saveza se\nsamo iznimno mogu ukljuciti u rad sjednica Stegovne komisije Saveza u slijedecim slucajevima:\n\n* po pozivu predsjednika Stegovne komisije Saveza,\n\n* kada se za to zbog postupka koji se vodi, odlu¢i Stegovna komisija Saveza.\n\nSjednice ostalih tijela Saveza su zatvorene za javnost i élanstvo. Javnost i élanice Saveza se samo\nznimno mogu ukljuCciti u rad ostalih tijela Saveza. U sli", "jedecim sluéajevima:\n\n* po pozivu predsjednika tijela Saveza,\n\n* po unaprijed predlozenoj temi za raspravu, odobrenoj od strane predsjednika tijela Saveza.\n\nObavjestavanje javnosti vrsi se i objavijivanjem Statuta Saveza, popisa lanica Saveza, odluka, opcih\n'drugih akata iz Clanka 37. stavak 5. Zakona o sportu, te informacija na mreznim stranicama Saveza,\nobjavom informacija putem glasila Saveza, objavom informacija u drugim sredstvima priopcavan", "ja.\n\nNastavno na odredbu prethodnog stavka Savez je duzan javno objaviti op¢e akte Saveza kojima se\n\nutvrduju:\n\n* sustav natjecanja u judo i to najmanje jednu godinu prije pocetka primjene tog sustava,\n\n* materijalni, tehnicki i strucni uvjeti za u¢lanjenje sportskih klubova u lanstvo Saveza,\n\n¢ nacin licenciranja stru¢nih kadrova judo sukladno Zakonu o sportu,\n\n¢ nacin registracije sportasa,\n\n* prava i obveze sportaSa i Clanova Saveza,\n\n* pravo ", "nastupa stranih sportasa za sportske klubove u judo sporta u Republici Hrvatskoj,\n\n¢ stegovna odgovornost osoba u sustavu judo sporta,\n\n¢ prava i obveze sudaca,\n\n¢ druga pitanja iz nadleznosti Saveza sukladno Zakonu o sportu te pravilima medunarodnog i\neuropskog Saveza judo sporta.\n\n24\n\nXl. UTVRBIVANJE | DODJEUIVANJE PRIZNANJA | NAGRADA\n\nClanak 61.\n<a sportska i stru€na postignu¢éa u judo sporta Savez moze dodjeljivati priznanja i nagrade.\n\n‘rite", "rije, vrste priznanja i nagrada, te nacin predlaganja i dodjeljivanja donosi Upravni odbor Saveza. .\n\nXll. | PRESTANAK RADA SAVEZA\n\nClanak 62.\nsavez prestaje s radom kada se ispune Zakonom propisane pretpostavke ili odlukom SkupStine\nSaveza.\nJdluka o prestanku rada Saveza donosi se vecinom glasova ukupnog broja Clanova SkupStine Saveza.\nJ slucaju prestanka rada Saveza nekretnine, pokretna imovina i prava Saveza prelaze u viasnistvo\nsportske udrug", "e koja ¢e nastaviti djelatnosti radi promicanja i razvitka judo sporta na podruéju\n\nRepublike Hrvatske.\n\nNovcana sredstva ¢e se upotrijebiti za podmirenje dospjelih obveza Saveza, a preostali iznos ce se\nraspodijeliti na jednake dijelove élanicama Saveza\n\nAko je Savez primio financijska sredstva iz proraéuna ili iz drugih javnih izvora, u slucaju prestanka\npostojanja, ostatak sredstava vratit ce se u proracun iz kojeg su financijska sredstva dodi", "jeljena.\nXIll. LIKVIDATOR SAVEZA\n\nClanak 63.\nLikvidator je fizicka ili pravna osoba koju imenuje i opoziva Upravni odbor Saveza.\n\nPokretanjem postupka likvidacije Saveza prestaju ovlastenja tijela i osoba ovlagtenih za zastupanje\nSaveza.\n\nLikvidator zastupa Savez u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u\nRegistar udruga kao osoba ovlaStena za zastupanje Saveza do okonéanja postupka likvidacije i\nbrisanja Saveza iz ", "Registra udruga.\n\nPostupak likvidacije saveza provodi likvidator sukladno odredbama Zakona o udrugama.\n\nLikvidator ne moze biti osoba za koju postoji zapreka iz Zakona o udrugama za obavijanje duznosti\nlikvidatora udruge.\n\n25\n\nOV. PRIJELAZNE | ZAVRSNE ODREDBE\n\nClanak 64.\n-vaj Statut, kao i njegove izmjene i dopune, donosi Skuptina Saveza, nakon prethodno pribavijenog\n~ sljenja Hrvatskog olimpijskog odbora na Statut, odnosno njegove izmjene i dopu", "ne.\n\nClanak 65.\n\"umacenje odredbi Statuta daje Skup8tina Saveza.\n\nClanak 66.\nsve Clanice Saveza u Republici Hrvatskoj duzne su uskladiti svoje statute s ovim Statutom u roku do\n>),dana od dana njegovog stupanja na snagu.\n\nClanak 67.\n-tatut stupa na snagu danom usvajanja, kada prestaje vaznost Statuta Saveza usvojenog na sjednici\n»drzanoj 29. oZujka 2015. godine.\n\nsvi opci akti Saveza uskladit ée se s ovim Statutom u roku od 10 mjeseci od njegovog", " usvajanja, o\n“emu brine Ured Saveza.\n\non JUDO SAVEZ\n\nnn i. &, *  Predsjednica\nRY bg © “sdr.sc. Sanda Corak, v.r.\n\nule A) v | oh\n\n4\n\nnae\n\nees\n\nm | 5 is\n\ni\n\n26\n\nee), eee\nREPUBLIKA HRVATSKA\n\nGRAD ZAGREB\n\nGRADSKI URED ZA OPCU\n\nUPRAVU | IMOVINSKO-PRAVNE POSLOVE\n\nOvjerava se da je tekst Statuta u skladu sa Zakonom o udrugama temeljem\nrjesenja ovog Gradskog ureda KLASA:UP/I-230-01/23-04/2486, URBROJ: 251-04-12-24-2, od\n22. sijecnja 2024.\n\n_ VODITELJICA", " ODJELA ZA\nVA REGISTRACIJU UDRUGA\n\nNataSa Bramberger, ee\n\n"]