{"Clone": {"Tools for developing, debugging and troubleshooting": "As .NET developers and architects, we are spoiled with the incredible tooling of Visual Studio. This extends into the world of Azure, which includes many tools that can make developing and troubleshooting in Azure easier and fun. Let's explore these tools.", "Visual Studio and Azure": "We all love Visual Studio and Azure does too! If you run any version of Visual Studio 2019 or 2017 and enable the Azure workload , you'll be able to seamlessly work with Azure. And if you can't upgrade, that's OK, we have you covered there , too. If you are using Visual Studio 2015, you can download the Visual Studio 2015 Tools for Azure .", "Project templates": "Out of the box, you get lots of project templates to work with. You can create web applications for the cloud, Azure Cloud Services applications , Azure Functions , Azure WebJobs , and much more.\n\n<!-- image -->\n\nGet started by managing your Azure resources with Cloud Explorer\n\n<!-- image -->\n\nFigure 2: Azure project templates in Visual Studio 2019 with Azure workload installed\n\n<!-- image -->", "Cloud Explorer": "As part of the Azure workload in Visual Studio, you get Cloud Explorer. You can use this to navigate through all your Azure subscriptions and resources and take action, as in Figure 3, where you can attach a debugger to an App Service Web App.\n\nFrom Cloud Explorer, you can also do things like open an Azure SQL Database in the Visual Studio Server Explorer and upload files to Azure Storage.\n\nYou can even connect to services to see their streaming logs and change application settings and connection strings in App Service.\n\n<!-- image -->\n\nG e et started by managing your Azure resources with Cloud Explorer. e.\n\nX\n\nCloud Explorer\n\nGet started by using the Visual Studio Publish Azure Application wizard\n\nFigure 3: Cloud Explorer in Visual Studio\n\nCollapse All\n\n• Bo\n\nPublish to Azure\n\n<!-- image -->", "Publish to Azure": "Once you have the Azure workload enabled in Visual Studio, you can easily publish to Azure from various project types. The publish wizard has an option to publish to Azure App Service (for example, host a web site) . Or you can directly publish to specific services like Azure Cloud Services . All with a few clicks.\n\n<!-- image -->\n\nGet started by using the Visual Studio Publish Azure Application wizard. rd.\n\n4 ×\n\n<!-- image -->\n\nPick a publish target\n\n<!-- image -->\n\n<!-- image -->\n\nFor a more repeatable process you can set up an Azure DevOps pipeline from inside Visual Studio 2019 which will build, test , and deploy your application to Azure. The Pipeline will be kicked off every time there is a check-in to your source control ensuring your application is always up to date.\n\nX\n\nFigure 5: Configure a DevOps Pipeline\n\nMicrosoft account\n\n<!-- image -->\n\n<!-- image -->", "Snapshot Debugger": "The Snapshot Debugger allows you to debug your application while it is running live in production, without affecting its performance. This is great, because now you can debug production without pausing the app when you hit a breakpoint. Debugging provides a lot more information than diagnostic logs typically do.\n\nGet started with Storage Explorer\n\nGet started by debugging snapshots on exceptions in NET apps\n\nNote that you do need Visual Studio Enterprise to use the Snapshot Debugger. Here's how it works:\n\n['Attach the snapshot debugger to your application process in Azure.', 'Add a snappoint (different from a breakpoint).', 'When the snappoint is hit, a snapshot is taken.']\n\n['The debugger quickly gathers all the information it needs about the call stack and variables and lets the app continue to run.']\n\n['You can now view the snapshot and inspect everything that you normally would when debugging, without holding up the application.']\n\n<!-- image -->\n\nGet started by debugging snapshots on exceptions in .NET apps. p.", "Azure Storage Explorer": "The Azure Storage Explorer is a tool for managing your Azure Storage accounts. It's a free, standalone application from Microsoft that you can download here . You can use it to create new blob containers, upload files, query through Table storage , and more. You can even use it to manage your Cosmos DB storage and create databases and collections.\n\n<!-- image -->\n\nGet started with Storage Explorer. r.\n\n<!-- image -->\n\nMicrosoft Azure Storage Explorer\n\nFile Edit View Help\n\nGet started by configuring and using the storage emulator\n\nFigure 6: Storage Explorer\n\n<!-- image -->", "Azure Storage Emulator": "In the Visual Studio Azure workload or in the Azure SDK , you'll find the Azure storage emulator, which you can use to develop locally against Azure Storage. You can access it through Cloud Explorer just like you can access it in the Azure portal or through other tools such as Storage Explorer .\n\nThe Azure storage emulator works the same as Azure Storage in the cloud, including how you authenticate to it. There are some obvious differences, like file size limitations and the lack of geo-redundant scaling. And the emulator doesn't support Azure Files .\n\nOnce you are done developing and testing locally, you can publish your application to the cloud and use Azure Storage there.\n\n<!-- image -->\n\nGet started by configuring and using the storage emulator o with Visual Studio. o.", "Azure Command -Line Interface": "You can do everything you need to do in Azure from Visual Studio and the Azure portal. But sometimes you want to run scripts to perform command-level operations, like when you are working with containers. You can do that using the Azure CommandLine Interface , or CLI. You can install the Azure CLI on your local development cdn x\n\n<!-- image -->\n\nBash\n\nV\n\n?\n\nLit computer, use a pre -built Docker container , or use it from within the Azure portal, where it is a part of Azure Cloud Shell .\n\nUsing the CLI in the Azure portal through Cloud Shell is very easy. You don't have to install anything and you don't have to log in to your Azure Subscription because you've already done that to get into the portal.\n\nFigure 7: Azure Cloud Shell in the Azure portal\n\n<!-- image -->\n\nAzure Cloud Shell supports Bash and PowerShell as scripting languages. These might not be things that you use daily as a .NET developer, but they are worth diving into because they are powerful tools.\n\nOnce you are in the CLI, you can do anything from listing all the Azure resources you have to provisioning new resources.\n\nYou can also access Cloud Shell directly in the browser at https://shell.azure.com or via mobile devices such as iOS and Android.\n\n<!-- image -->\n\nGet started by creating your first function using Visual Studio and\n\nAzure Cosmos DB Emulator", "Azure Functions Core Tools": "Azure Functions run inside Azure App Service Function Apps and are powerful. You can use them to run small pieces of code that get triggered by outside sources and bind to things like Azure Blob storage or Azure Cosmos DB .\n\nThe Azure Functions Core Tools enable you to develop Azure Functions locally. You can run the local version of Azure Functions runtime on your development computer. Documents\n\nWith the Azure Functions Core Tools, you can develop and test your Azure Functions locally. And when you're done, you can publish them to Azure or use continuous integration and continuous delivery to check your Azure Functions code and publish it automatically to Azure.\n\n<!-- image -->\n\nGet started by creating your first function using Visual Studio an d d test it locally. y.", "Cosmos DB Emulator": "When you are using Azure Cosmos DB, you can use the Azure Cosmos DB Emulator to develop locally. The emulator acts just like Cosmos DB would and even provides the same interface as Cosmos DB does in the Azure portal.\n\n<!-- image -->\n\nFigure 8: Cosmos DB Emulator local interface\n\n<!-- image -->\n\nThe Cosmos DB Emulator also shows up in the Cloud Explorer in Visual Studio, so that you can easily manage it from there.\n\nBy developing locally against the Cosmos DB emulator, you can develop without incurring costs from a Cosmos DB in Azure. And when you are ready, you can deploy your application to Azure and run it against Cosmos DB there, just by changing your connection string.\n\n<!-- image -->\n\nGet started by using the Azure Cosmos DB Emulator g.\n\nfor local development and testing.", "Azure DevOps for build and deployment": "Once you are working on your application, it is vital to integrate your work with the work of other developers (continuous integration).\n\nIt is vital to deploy that work to a central location, like an Azure Web App, so that you can see that it works, and so that it can be tested and promoted through the different environments and can be deployed to production (continuous delivery).\n\nTo make this work, you need to automatically integrate everybody's work and deploy it. Ideally, you would do these things continuously, whenever somebody commits new work.\n\nAzure DevOps, can help with that. It is an application lifecycle management system that manages your work items and sprints, stores and manages your source code, builds your code, and deploys it to wherever you want. The best part is, it is very easy to set up.\n\nYou can put your source code in DevOps and manage it using the TFS or Git protocols. Once you start committing changes, you can have those built by a simple build pipeline that executes something like a Visual Studio build, just like you would on your local development computer. You can create such a pipeline by just adding tasks in the DevOps portal, like in Figure 9 .\n\n<!-- image -->\n\nOverview\n\nBoards\n\nRepos\n\nPipelines da Builds\n\n['Releases']\n\nOI% Library\n\n• Task groups\n\n** Deployment groups\n\nTest Plans\n\nArtifacts\n\nProject settings\n\n<!-- image -->\n\nYou can set your build up to compile your code and run your unit tests every time somebody commits. This is continuous integration.\n\nAnd once the build is done, it can kick off a release pipeline that deploys your code to environments including development, test, staging, and production. You can deploy your code to anywhere: to on-premises resources or to the cloud. You can even have permissions gates that require somebody like a product owner to approve the deployment to production, putting them in control.\n\nYou create a release pipeline in the same way as you create a build pipeline—by adding tasks in the Azure DevOps portal, like in Figure 10 .\n\nDownload and read the free e-book about DevOps for a\n\nAzure DevOps\n\nAzureCamp2019 / Pipelines\n\nGet started with Azure DevOps\n\nFigure 10: Azure DevOps Release Pipeline\n\nAzureCamp2019\n\nA\n\n99\n\n• Builds\n\nIS Library\n\n<!-- image -->\n\n<!-- image -->\n\nAzure DevOps is a powerful tool that every .NET developer should have in their arsenal. Now you no longer have an excuse to not do continuous integration and continuous deployment.\n\n<!-- image -->\n\nDownload and install language-specific SKs and tools at:", "Summary and how to get started for free": "In this guide, we've introduced the power that Azure can bring to your applications. Using Azure, you can do incredible things with your applications—facial and speech recognition, manage your devices on the Internet of Things in the cloud, scale as much as you want, and pay for what you use.\n\nYou've seen that Azure is a great place for .NET developers and architects and it provides tools that have the same world-class quality and depth that you are used to working with today. The days of having to write complicated \"plumbing\" yourself are over. Now you can take advantage of a wealth of prebuilt solutions. Free yourself up to work on the things that matter, and let Azure take care of the solved problems.", "Keep learning with an Azure free account": "Do you have a Visual Studio Subscription? Activate your monthly Azure credit .\n\nSign up for an Azure free account and receive:\n\n['A $200 credit to use on any Azure product for 30 days', 'Free access to our most popular products for 12 months, including compute, storage, networking, and database', 'More than 25 products that are always free, including Text Translator, Functions and Active Directory B2C']\n\n<!-- image -->\n\nDownload and install language-specific SDKs and tools at: https://azure.microsoft.com/downloads/\n\n<!-- image -->\n\n<!-- image -->", "About the team": "Cesar, Michael, Beth and Barry are passionate about Microsoft Azure and would encourage you to reach out to them on Twitter for questions regarding this book.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nCesar de la Torre works for Microsoft Corp in Redmond, Seattle, in the .NET product team, focusing on .NET, Azure, Containers &amp; Microservice-based architectures and creating .NET Application Architecture guidance .\n\nYou can reach him on Twitter @cesardelatorre or by following his blog at https://blogs.msdn.microsoft.com/cesardelatorre/ .\n\nMichael Crump works at Microsoft on the Azure platform and is a coder, blogger, and international speaker on various cloud development topics. He's passionate about helping developers understand the benefits of the cloud in a no-nonsense way.\n\nYou can reach him on Twitter @mbcrump or by following his blog at https://www.michaelcrump.net .\n\nBarry Luijbregts is an independent architect and software developer focused on preparing business applications and solutions for the cloud. A Microsoft Azure MVP, Barry is a skilled educator and active member of the community providing Pluralsight cloud and developer-focused courses and on-site private training sessions for corporate groups. He records podcasts, founded an active .NET User\n\nGroup, and leads technology bootcamps. Barry has a lifelong passion for technology and for IT in particular. Technology drives his curiosity as he stays current and gains unique access to new technology through Microsoft early adoption programs. Understanding that software is an investment, Barry uses his knowledge of cloud direction to advise clients on forward-looking and sustainable long-term solutions. You can reach Barry on Twitter @AzureBarry and through his website at https://www.azurebarry.com .\n\n<!-- image -->\n\nBeth Massi is the Product Marketing Manager for the .NET Platform and Languages at Microsoft. She's a long-time community champion for .NET developers and on the Board of Directors for the .NET Foundation. You can reach her on Twitter @BethMassi .\n\n<!-- image -->"}}