"[\" \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\n \\nEDITION v7.0  \\nRefer changelog  for the book updates and community contributions.  \\nPUBLISHED BY Microsoft Press and Microsoft DevDiv Divisions of Microsoft Corporation One \\nMicrosoft Way Redmond, Washington 98052 -6399  \\nCopyright \\u00a9 2023 by Microsoft Corporation  \\nAll rights reserved. No part of the contents of this book may be reproduced in any form or by any \\nmeans without the written permission of the publisher.  \\nThis book is available for free in the form of an electronic book (e -book) available through multiple \\nchannels at Microsoft such as https://dot.net/architecture . \\nIf you have questions related to this book, email at dotnet -architecture -ebooks -\\nfeedback@service.microsoft.com . \\nThis book is provided \\u201cas -is\\u201d and expresses the author\\u2019s views and opinions. The views, opinions, and \\ninformation expressed in this book, including URL and other Internet website references, may change \\nwithout notice.  \\nSome exampl\", \"es depicted herein are provided for illustration only and are fictitious. No real association \\nor connection is intended or should be inferred.  \\nMicrosoft and the trademarks listed at https://www.microsoft.com  on the \\u201cTrademarks\\u201d webpage are \\ntrademarks of the Microsoft group of companies. All other marks are property of their respective \\nowners.  \\nAuthor: > Cesar de la Torre , Sr. PM, .NET Product Team, Microsoft Corp.  \\nParticipants and reviewers: > Scott Hunter , Partner Director PM, .NET team, Microsoft > Paul \\nYuknewicz , Principal PM Manager, Visual Studio Tools team, Microsoft > Lisa Guthrie , Sr. PM, Visual \\nStudio Tools team, Microsoft > Ankit Asthana , Principal PM Manager, .NET team, Microsoft > Unai \\nZorrilla , Developer Lead, Plain Concepts > Javier Valero , Chief Operating Officer at Grupo Solutio > \\nSteve Smith , Architect, NimblePros  \\nIntroduction  \\nWhen you decide to modernize your web applications or services and move them to the cloud, you \\ndon\\u2019t necessarily have \", \"to fully rearchitect your apps. Rearchitecting an application by using an \\nadvanced approach like microservices isn\\u2019t always an option because of cost and time restraints. \\nDepending on the type of application, rearchitecting an app also might not be necessary. To optimize \\nthe cost -effecti veness of your organization\\u2019s cloud migration strategy, it\\u2019s important to consider the \\nneeds of your business and the requirements of your apps. You\\u2019ll need to determine:  \\n\\u2022 Which apps require a transformation or rearchitecting.  \\n\\u2022 Which apps need to be only partially modernized.  \\n\\u2022 Which apps you can \\u201clift and shift\\u201d directly to the cloud.   \\nAbout this guide  \\nThis guide focuses primarily on the initial modernization of existing Microsoft .NET Framework web or \\nservice -oriented applications, meaning the action of moving a workload to a newer or more modern \\nenvironment without significantly altering the applicatio n\\u2019s code and basic architecture.  \\nThis guide also highlights the benefits of \", \"moving your apps to the cloud and partially modernizing \\napps by using a specific set of new technologies and approaches, like Windows Containers and \\nrelated compute -platforms in Azure supporting Windows Containers . \\nPath to the cloud for existing .NET applications  \\nOrganizations typically choose to move to the cloud for the agility and speed they can get for their \\napplications. You can set up thousands of servers (VMs) in the cloud in minutes, compared to the \\nweeks it typically takes to set up on -premises servers.  \\nThere isn\\u2019t a single, one -size-fits-all strategy for migrating applications to the cloud. The right \\nmigration strategy for you will depend on your organization\\u2019s needs and priorities, and the kind of \\napplications you are migrating. Not all applications war rant the investment of moving to a platform as \\na service ( PaaS ) model or developing a cloud -native  application model. In many cases, you can take a \\nphased or incremental approach to invest in moving your \", \"assets to the cloud, based on your business \\nneeds.  \\nFor modern applications with the best long -term agility and value for the organization, you might \\nbenefit from investing in cloud -native  application architectures. However, for applications that are \\nexisting or legacy assets, the key is to spend minimal time and money (no rearchitecting or code \\nchanges) while moving them to the cloud, to realize significant benefits.  \\nFigure 1 -1 shows the possible paths you can take when you move existing .NET applications to the \\ncloud in incremental phases.   \\n \\n \\nFigure 1 -1. Modernization paths for existing .NET applications and services  \\nEach migration approach has different benefits and reasons for using it. You can choose a single \\napproach when you migrate apps to the cloud, or choose certain components from multiple \\napproaches. Individual applications aren\\u2019t limited to a single approach  or maturity state. For instance, \\na common hybrid approach would have certain on -premises com\", \"ponents plus other components in \\nthe cloud.  \\nThe definition and short explanation for each application maturity level are the following:  \\nLevel 1: Cloud Infrastructure -Ready  applications: In this migration approach, you just migrate or \\nrehost your current on -premises applications to an infrastructure as a service ( IaaS) platform. Your \\napps have almost the same composition as before, but now you deploy them to VMs in the cloud. \\nThis simple type of migration is typically known in the industry as \\u201cLift & Shift.\\u201d  \\nLevel 2: Cloud Optimized  applications: At this level and still without rearchitecting or altering \\nsignificant code, you can gain additional benefits from running your app in the cloud with modern \\ntechnologies like containers and additional cloud -managed services. You improve the agility of your \\napplications to ship faster by refining your enterprise development operations (DevOps) processes. \\nYou achieve this functionality by using technologies like Windows Contai\", \"ners, which is based on \\nDocker Engine. Contai ners remove the friction that\\u2019s caused by application dependencies when you \\ndeploy in multiple stages. In this maturity model, you can deploy containers on IaaS or PaaS while \\nusing additional cloud -managed services related to databases, cache as a service,  monitoring, and \\ncontinuous integration/continuous deployment (CI/CD) pipelines.  \\nThe third level of maturity is the ultimate goal in the cloud, but it\\u2019s optional for many apps and not the \\nmain focus of this guide:  \\n \\nLevel 3: Cloud -Native  applications: This migration approach typically is driven by business need and \\ntargets modernizing your mission -critical applications. At this level, you use PaaS services to move \\nyour apps to PaaS computing platforms. You implement cloud -native  applications and microservices \\narchitecture to evolve applications with long -term agility, and to scale to new limits. This type of \\nmodernization usually requires architecting specifically for \", \"the cloud. New code often must be written, \\nespecially when you  move to cloud -native application and microservice -based models. This approach \\ncan help you gain benefits that are difficult to achieve in your monolithic and on -premises application \\nenvironment.  \\nTable 1 -1 describes the main benefits of and reasons for choosing each migration or modernization \\napproach.  \\nCloud Infrastructure -Ready  \\nLift and shift  Cloud -Optimized  \\nModernize  Cloud -Native  \\nModernize, rearchitect, and \\nrewrite  \\nApplication\\u2019s compute target    \\nApplications deployed to VMs \\nin Azure  Monolithic or N -Tier apps \\ndeployed to Azure App Service, \\nAzure Container Instance (ACI), \\nVMs with containers, or AKS \\n(Azure Kubernetes Service)  Containerized microservices on \\nAzure Kubernetes Service (AKS) \\nand/or serverless microservices \\nbased on Azure Functions.  \\nData target    \\nSQL or any relational database \\non a VM  Azure SQL Database Managed \\nInstance or another managed \\ndatabase in the cloud.  Fine\", \"d -grain databases per \\nmicroservice, based on Azure \\nSQL Database, Azure Cosmos \\nDB, or another managed \\ndatabase in the cloud  \\nAdvantages    \\n   \\nChallenges    \\n   \\nTable 1 -1. Benefits and challenges of modernization paths for existing .NET applications and services  \\nKey technologies and architectures by maturity level  \\n.NET Framework applications initially started with .NET Framework version 1.0, which was released in \\nlate 2001. Then, companies moved towards newer versions (such as 2.0, 3.5 and .NET Framework 4.x). \\nMost of those applications ran on Windows Server and Int ernet Information Server (IIS), and used a \\nrelational database, like SQL Server, Oracle, MySQL, or any other RDBMS.  \\nMost existing .NET applications might nowadays be based on .NET Framework 4.x, or even on .NET \\nFramework 3.5, and use web frameworks like ASP.NET MVC, ASP.NET Web Forms, ASP.NET Web API, \\nWindows Communication Foundation (WCF), ASP.NET SignalR, and ASP.NET Web Pages. These \\nestablished .NET F\", \"ramework technologies depend on Windows. That dependency is important to  \\nconsider if you are simply migrating legacy apps and you want to make minimal changes to your \\napplication infrastructure.  \\nFigure 1 -2 shows the primary technologies and architecture styles used at each of the three cloud \\nmaturity levels:  \\n \\nFigure 1 -2. Primary technologies for each maturity level for modernizing existing .NET web applications  \\nFigure 1 -2 highlights the most common scenarios, but many hybrid and mixed variations are possible \\nwhen it comes to architecture. For example, the maturity models apply not only to monolithic \\narchitectures in existing web apps, but also to service orientat ion, N -Tier, and other architecture style \\nvariations. The higher focus or percentage on one or another architecture type and related \\ntechnologies determines the overall maturity level of your applications.  \\nEach maturity level in the modernization process is associated with the following key technologies an\", \"d \\napproaches:  \\n\\u2022 Cloud Infrastructure -Ready  (rehost or basic lift & shift): As a first step, many organizations \\nwant only to quickly execute a cloud -migration strategy. In this case, applications are \\nrehosted. Most rehosting can be automated by using Azure Migrate , a service that provides \\nthe guidance, insights, and mechanisms needed to assist you in migrating to Azure based on \\ncloud tools like Azure Site Recovery  and Azure Database Migration Service . You can also set \\nup rehosting manually, so that you can learn infrastructure details about your assets when \\nyou move legacy apps to the cloud. For example, you can move your applications to VMs in \\nAzure with little modification -probably with only minor c onfiguration changes. The \\nnetworking in this case is similar to an on -premises environment, especially if you create \\nvirtual networks in Azure.  \\n\\u2022 Cloud -Optimized  (Managed Services and Windows Containers): This model is about making \\na few important deployment optimi\", \"zations to gain some significant benefits from the cloud, \\n \\nwithout changing the core architecture of the application. The fundamental step here is to \\nadd Windows Containers  support to your existing .NET Framework applications. This \\nimportant step (containerization) doesn\\u2019t require touching the code, so the overall lift and \\nshift effort is light. You can use tools like Image2Docker  or Visual Studio, with its tools for \\nDocker . Visual Studio automatically chooses smart defaults for ASP.NET applications and \\nWindows Containers images. These tools offer both a rapid inner loop, and a fast path to get \\nthe containers to Azure. Your agility is improved when you deploy to multiple env ironments. \\nThen, moving to production, you can deploy your Windows Containers to Azure Web App for \\nContainers , Azure Container Instances (ACI) , and Azure VMs with Windows Server 2016 and \\ncontainers if you prefer an IaaS approach. For more complex multi -container applications, \\nconsider using orches\", \"trators like Azure Kubernetes Service (AKS/ACS) . \\nDuring this initial modernization, you can also add assets from the cloud, such as monitoring with \\ntools like Azure Application Insights ; CI/CD pipelines for your app lifecycles with Azure DevOps \\nServices ; and many more data resource services that are available in Azure. For instance, you can \\nmodify a monolithic web app that was originally developed by using traditional ASP.NET Web Forms  \\nor ASP.NET MVC , but now you deploy it by using Windows Containers. When you use Windows \\nContainers, you should also migrate your data to a database in Azure SQL Database Managed \\nInstance , all without changing the core architecture of your application.  \\n\\u2022 Cloud -Native : As introduced, you should think about architecting cloud -native  applications \\nwhen you are targeting large and complex applications with multiple independent \\ndevelopment teams working on different microservices that can be developed and deployed \\nautonomously. Also, due t\", \"o granularized and independent scalability per mi croservice. These \\narchitectural approaches face very important challenges and complexities but can be greatly \\nsimplified by using cloud PaaS and orchestrators like Azure Kubernetes Service (AKS/ACS)  \\n(managed Kubernetes), and Azure Functions  for a serverless approach. All these approaches \\n(like microservices and Serverless) typically require you to architect for the cloud and write \\nnew code \\u2014code that is adapted to specific PaaS platforms, or code that aligns with specific \\narchitectures, like microservices.  \\nFigure 1 -3 shows the internal technologies that you can use for each maturity level:   \\n \\nFigure 1 -3. Internal technologies for each modernization maturity level  \\nLift and shift scenario  \\nFor lift and shift migrations, keep in mind that you can use many different variations of lift and shift in \\nyour application scenarios. If you only rehost your application, you might have a scenario like the one \\nshown in Figure 1 -4, \", \"where you use VMs in the cloud only for your application and for your da tabase \\nserver.  \\n \\n \\nFigure 1 -4. Example of a pure IaaS scenario in the cloud  \\nModernization scenarios  \\nFor modernization scenarios, you might have a pure Cloud -Optimized application that uses elements \\nonly from that maturity level. Or, you might have an intermediate -state application with some \\nelements from Cloud Infrastructure -Ready and other elements from  Cloud -Optimized (a \\u201cpick and \\nchoose\\u201d or mixed model), like in Figure 1 -5. \\n \\n \\nFigure 1 -5. Example \\u201cpick and choose\\u201d scenario, with database on IaaS, DevOps, and containerization assets  \\nNext, as the ideal scenario for many existing .NET Framework applications to migrate, you could \\nmigrate to a Cloud -Optimized application, to get significant benefits from little work. This approach \\nalso sets you up for Cloud -Native as a possible future evo lution. Figure 1 -6 shows an example.  \\n \\n \\nFigure 1 -6. Example Cloud -Optimized apps scenario, with W\", \"indows Containers and managed services  \\nGoing even further, you could extend your existing Cloud -Optimized application by adding a few \\nmicroservices for specific scenarios. This approach would move you partially to the level of Cloud -\\nNative model, which is not the main focus of the present guidance.  \\nWhat this guide does not cover  \\nThis guide covers a specific subset of the example scenarios, as shown in Figure 1 -7. This guide \\nfocuses only on the lift and shift scenarios, and ultimately, on the Cloud -Optimized model. In the \\nCloud -Optimized model, a .NET Framework application is moder nized by using Windows Containers, \\nplus additional components like monitoring and CI/CD pipelines. Each component is fundamental to \\ndeploying applications to the cloud, faster, and with agility.  \\n \\n \\nFigure 1 -7. Cloud -Native is not covered in this guide  \\nThe focus of this guide is specific. It shows you the path you can take to achieve a lift and shift of your \\nexisting .NET applications,\", \" without rearchitecting, and with no code changes. Ultimately, it shows you \\nhow to make your application Cloud -Optimized.  \\nThis guide doesn\\u2019t show you how to create Cloud -Native applications, such as how to evolve to a \\nmicroservices architecture. To rearchitect your applications or to create brand -new applications that \\nare based on microservices, see the e -book .NET Microservices: Architecture for containerized .NET \\napplications . \\nAdditional resources  \\n\\u2022 Containerized Docker application lifecycle with Microsoft platform and tools  \\n(downloadable e -book)  \\nhttps://aka.ms/dockerlifecycleebook  \\n\\u2022 .NET Microservices: Architecture for containerized .NET applications  (downloadable e -\\nbook)  \\nhttps://aka.ms/microservicesebook  \\n\\u2022 Architecting modern web applications with ASP.NET Core and Azure  (downloadable e -\\nbook)  \\nhttps://aka.ms/webappebook  \\nWho should use this guide  \\n \\nThis guide was written for developers and solution architects who want to modernize existing \\nASP.NET\", \" web applications or WCF services that are based on .NET Framework, for improved agility in \\nshipping and releasing applications.  \\nYou also might find this guide useful if you are a technical decision maker, such as an enterprise \\narchitect or a development lead/director who just wants an overview of the benefits that you can get \\nby using Windows Containers, and by deploying to the clo ud when using Microsoft Azure.  \\nHow to use this guide  \\nThis guide addresses the \\u201cwhy\\u201d -why you might want to modernize your existing applications, and the \\nspecific benefits you get from using Windows Containers when you move your apps to the cloud. The \\ncontent in the first few chapters of the guide is designed for architects and technical decision makers \\nwho want an overview, but who don\\u2019t need to focus on implementation and technical, step -by-step \\ndetails.  \\nThe last chapter of this guide introduces multiple walkthroughs that focus on specific deployment \\nscenarios. This guide offers shorter ve\", \"rsions of the walkthroughs, to summarize the scenarios and \\nhighlight their benefits. The full walkthroughs drill down i nto setup and implementation details, and \\nare published as a set of wiki posts  in the same public GitHub repo  where related sample apps reside \\n(discussed in the next section). The last chapter and the step -by-step wiki walkthroughs on GitHub will \\nbe of more interest to developers and architects who want to focus on implementation details.  \\nSample apps for modernizing legacy apps: \\neShopModernizing  \\nThe eShopModernizing  repo on GitHub offers two sample applications that simulate legacy \\nmonolithic web applications. One web app is developed by using ASP.NET MVC; the second web app \\nis developed by using ASP.NET Web Forms and the third app is an N -Tier app with a WinForms cl ient \\ndesktop app consuming a WCF service backend. All these apps are based on the traditional .NET \\nFramework. These sample apps don\\u2019t use .NET Core/.NET 7 or ASP.NET Core as they are sup\", \"posed to \\nbe existing/legacy .NET Framework applications to be moderniz ed. \\nThese sample apps have a second version, with modernized code, and which are fairly straightforward. \\nThe most important difference between the app versions is that the second versions use Windows \\nContainers as the deployment choice. There also are a few ad ditions to the second versions, like Azure \\nStorage Blobs for managing images, Azure Active Directory for managing security, and Azure \\nApplication Insights for monitoring and auditing the applications.   \\ni Contents   \\nContents  \\nLift and shift existing .NET apps to Azure IaaS (Cloud Infrastructure -Ready)  .................  1 \\nWhy migrate existing .NET web applications to Azure IaaS  ................................ ................................ ...................  2 \\nWhen to migrate to IaaS instead of to PaaS  ................................ ................................ ................................ .................  2 \\nUse Azure Migrate t\", \"o analyze and migrate your existing applications to Azure  ................................ ...........  2 \\nUse Azure Site Recovery to migrate your existing VMs to Azure VMs  ................................ ..............................  3 \\nAdditional resources  ................................ ................................ ................................ ................................ ..........................  4 \\nMigrate your relational databases to Azure  ................................ ................................ .........  6 \\nWhen to migrate to Azure SQL Database Managed Instance  ................................ ................................ ...............  7 \\nWhen to migrate to Azure SQL Database  ................................ ................................ ................................ ......................  8 \\nWhen to move your original RDBMS to a VM (IaaS)  ................................ ................................ ..........................\", \"...... . 8 \\nWhen to migrate to SQL Server as a VM (IaaS)  ................................ ................................ ................................ ...........  9 \\nUse Azure Database Migration Service to migrate your relational databases to Azure  .............................  9 \\nAdditional resources  ................................ ................................ ................................ ................................ ............................  10 \\nModernize existing .NET apps to Cloud -Optimized applications  ................................ .... 11 \\nReasons to modernize existing .NET apps to Cloud -Optimized applications  ................................ ..............  12 \\nCloud -Optimized application principles and tenets  ................................ ................................ ..........................  12 \\nBenefits of a Cloud -Optimized application  ................................ ................................ .............................\", \"... ...........  14 \\nMicrosoft technologies in cloud -optimized applications  ................................ ................................ .....................  14 \\nMonolithic applications can be Cloud -Optimized  ................................ ................................ ..............................  15 \\nWhat about Cloud -Native applications?  ................................ ................................ ................................ .....................  16 \\nCloud -native applications details  ................................ ................................ ................................ ..............................  17 \\nWhat about microservices?  ................................ ................................ ................................ ................................ ..........  18 \\nDeploy existing .NET apps as Windows containers  ................................ ................................ ................................ . 19 \\nWhat are con\", \"tainers? (Linux or Windows) ................................ ................................ ................................ ..............  19 \\nBenefits of containers (Docker Engine on Linux or Windows)  ................................ ................................ ....... 19 \\nWhat is Docker?  ................................ ................................ ................................ ................................ ................................  20 \\nBenefits of Windows Containers for your existing .NET applications  ................................ .........................  21 \\nChoose an OS to target with .NET -based containers  ................................ ................................ ........................  22  \\nii Contents  Windows container types  ................................ ................................ ................................ ................................ .............  23 \\nThe container ecosystem in Azure  ........................\", \"........ ................................ ................................ ............................  24 \\nWhen not to deploy to Windows Containers  ................................ ................................ ................................ ............  26 \\nWhen to deploy Windows Containers in your on -premises IaaS VM infrastructure  ................................ . 26 \\nWhen to deploy Windows Containers to Azure VMs (IaaS cloud)  ................................ ................................ .... 26 \\nWhen to deploy Windows Containers to Azure Container Instances (ACI)  ................................ ...................  27 \\nWhen to deploy Windows Containers to Azure Kubernetes Service (AKS)  ................................ ...................  28 \\nChoosing Azure compute platforms for container -based applications  ................................ ..........................  28 \\nBuild resilient services ready for the cloud: Embrace transient failures in the cloud ....\", \"............................ . 29 \\nHandling partial failure  ................................ ................................ ................................ ................................ ..................  29 \\nModernize your apps with monitoring and telemetry  ................................ ................................ ...........................  31 \\nMonitor your application with Application Insights  ................................ ................................ ...........................  31 \\nMonitor your Docker infrastructure with Log Analytics and its Container Monitoring solution ...... 32 \\nModernize your app\\u2019s lifecycle with CI/CD pipelines and DevOps tools in the cloud  ..............................  34 \\nMigrate to hybrid cloud scenarios  ................................ ................................ ................................ ................................ . 35 \\nAzure Stack  ................................ ................................ ........\", \"........................ ................................ ................................ ......... 35 \\nWalkthroughs and technical get started overview  ................................ ............................  38 \\nTechnical walkthrough list  ................................ ................................ ................................ ................................ .................  38 \\nWalkthrough 1: Tour of eShop legacy apps  ................................ ................................ ................................ ...............  39 \\nTechnical walkthrough availability  ................................ ................................ ................................ ............................  39 \\nOverview  ................................ ................................ ................................ ................................ ................................ ..............  39 \\nGoals  ................................ ..............................\", \".. ................................ ................................ ................................ ......................  39 \\nScenario 1: ASP.NET Web apps  ................................ ................................ ................................ ................................ .. 39 \\nScenario 2: WCF service and WinForms client app (3 -Tier app)  ................................ ................................ .... 40 \\nBenefits  ................................ ................................ ................................ ................................ ................................ .................  41 \\nNext steps  ................................ ................................ ................................ ................................ ................................ ...........  41 \\nWalkthrough 2: Containerize your existing .NET applications with Windows Containers  .......................  41 \\nOverview  ................................ ..............\", \".................. ................................ ................................ ................................ ..............  41 \\nGoals  ................................ ................................ ................................ ................................ ................................ ......................  41 \\nScenario 1: Containerized ASP.NET web apps  ................................ ................................ ................................ ...... 42 \\nScenario 2: Containerized WCF service  ................................ ................................ ................................ ...................  42 \\nBenefits  ................................ ................................ ................................ ................................ ................................ .................  43  \\niii Contents  Next steps  ................................ ................................ ................................ .....................\", \"........... ................................ ...........  43 \\nWalkthrough 3: Deploy your Windows Containers -based app to Azure VMs  ................................ .............  44 \\nTechnical walkthrough availability  ................................ ................................ ................................ ............................  44 \\nOverview  ................................ ................................ ................................ ................................ ................................ ..............  44 \\nGoals  ................................ ................................ ................................ ................................ ................................ ......................  44 \\nScenarios ................................ ................................ ................................ ................................ ................................ ..............  44 \\nAzure VMs for Windows Containers  ......................\", \".......... ................................ ................................ .........................  46 \\nBenefits  ................................ ................................ ................................ ................................ ................................ .................  46 \\nNext steps  ................................ ................................ ................................ ................................ ................................ ...........  46 \\nWalkthrough 4: Deploy your Windows Containers -based apps to Azure Container Instances (ACI)  . 47 \\nTechnical walkthrough availability  ................................ ................................ ................................ ............................  47 \\nOverview  ................................ ................................ ................................ ................................ ................................ ..............  47 \\nGoals  .............................\", \"... ................................ ................................ ................................ ................................ ......................  47 \\nScenarios ................................ ................................ ................................ ................................ ................................ ..............  47 \\nBenefits  ................................ ................................ ................................ ................................ ................................ .................  47 \\nConsiderations ................................ ................................ ................................ ................................ ................................ ... 48 \\nNext steps  ................................ ................................ ................................ ................................ ................................ ...........  48 \\nWalkthrough 5: Deploy your Windows Containers -based apps to \", \"Kubernetes in Azure Container \\nService  ................................ ................................ ................................ ................................ ................................ .......................  48 \\nTechnical walkthrough availability  ................................ ................................ ................................ ............................  48 \\nOverview  ................................ ................................ ................................ ................................ ................................ ..............  48 \\nGoals  ................................ ................................ ................................ ................................ ................................ ......................  49 \\nScenarios ................................ ................................ ................................ ................................ ................................ ..............  49 \\nBenefit\", \"s  ................................ ................................ ................................ ................................ ................................ .................  50 \\nNext steps  ................................ ................................ ................................ ................................ ................................ ...........  51 \\nWalkthrough 6: Deploy your Windows Containers -based apps to Azure App Service for Containers\\n ................................ ................................ ................................ ................................ ................................ ................................ ...... 51 \\nTechnical walkthrough availability  ................................ ................................ ................................ ............................  51 \\nOverview  ................................ ................................ ................................ ................................ \", \"................................ ..............  51 \\nGoals  ................................ ................................ ................................ ................................ ................................ ......................  51 \\nScenario  ................................ ................................ ................................ ................................ ................................ ...............  52 \\nBenefits  ................................ ................................ ................................ ................................ ................................ .................  52  \\niv Contents  Next steps  ................................ ................................ ................................ ................................ ................................ ...........  52 \\nConclusions  ................................ ................................ ................................ ............................  53 \", \" \\n1 CHAPTER 1 | Lift and shift existing .NET apps to Azure IaaS (Cloud Infrastructure -Ready)  \\n CHAPTER  1 \\nLift and shift existing .NET \\napps to Azure IaaS (Cloud \\nInfrastructure -Ready)  \\nVision: As a first step, to reduce your on -premises investment and total cost of hardware and \\nnetworking maintenance, simply rehost your existing applications in the cloud.  \\nBefore getting into how to migrate your existing applications to the Azure infrastructure as a service \\n(IaaS) platform, it\\u2019s important to analyze the reasons why you\\u2019d want to migrate directly to IaaS in \\nAzure. The scenario at this modernization maturity level essentially is to start using VMs in the cloud, \\ninstead of continuing to use your current, on -premises infrastructure.  \\nAnother point to analyze is why you might want to migrate to pure IaaS cloud instead of just adding \\nmore advanced managed services in Azure. Determine what cases might require IaaS in the first place.  \\nFigure 2 -1 positions Cloud Infrastructure\", \" -Ready applications in the modernization maturity levels:  \\n \\nFigure 2 -1. Positioning Cloud Infrastructure -Ready applications  \\n \\n2 CHAPTER 1 | Lift and shift existing .NET apps to Azure IaaS (Cloud Infrastructure -Ready)  \\n Why migrate existing .NET web applications to \\nAzure IaaS  \\nThe main reason to migrate to the cloud, even at an initial IaaS level, is to achieve cost reductions. By \\nusing more managed infrastructure services, your organization can lower its investment in hardware \\nmaintenance, server or VM provisioning and deployme nt, and infrastructure management.  \\nAfter you make the decision to move your apps to the cloud, the main reason why you might choose \\nIaaS instead of more advanced options like PaaS is simply that the IaaS environment will be more \\nfamiliar. Moving to an environment that\\u2019s similar to your current, on -premises environment offers a \\nlower learning curve, which makes it the quickest path to the cloud.  \\nHowever, taking the quickest path to the cloud \", \"doesn\\u2019t mean that you will gain the most benefit from \\nhaving your applications running in the cloud. Any organization will gain the most significant benefits \\nfrom a cloud migration at the already introduced Cloud -Optimized and Cloud -Native maturity levels.  \\nIt also has become evident that applications are easier to modernize and rearchitect in the future \\nwhen they are already running in the cloud, even on IaaS. Application data migration has already been \\nachieved. Also, your organization will have gained the skills required for working in the cloud and \\nmade the shift to operating in a \\u201ccloud culture.\\u201d  \\nWhen to migrate to IaaS instead of to PaaS  \\nThe next sections discuss Cloud -Optimized applications that are mostly based on PaaS platforms and \\nservices. These apps give you the most benefits from migrating to the cloud.  \\nIf your goal is simply to move existing applications to the cloud, first, identify existing applications that \\nwould not require substantial modification to\", \" run in Azure App Service. These apps should be the first \\ncandidates for Cloud -Optimized.  \\nThen, for the apps that still cannot move to Windows Containers and PaaS such as App Service or \\norchestrators like Azure Kubernetes Service, migrate those apps to simple plain VMs (IaaS).  \\nBut, keep in mind that correctly configuring, securing, and maintaining VMs requires much more time \\nand IT expertise compared to using PaaS services in Azure. If you are considering Azure Virtual \\nMachines, make sure that you take into account the ongoing m aintenance effort required to patch, \\nupdate, and manage your VM environment. Azure Virtual Machines is IaaS.  \\nUse Azure Migrate to analyze and migrate your \\nexisting applications to Azure  \\nMigrating to the cloud doesn\\u2019t have to be difficult. But many organizations struggle to get started - to \\nget deep visibility into the environment and the tight interdependencies between applications, \\nworkloads, and data. Without that visibility, it can be diffic\", \"ult to plan the path forward. Without \\ndetailed information on what\\u2019s required for a successful migration, you can\\u2019t have the right  \\n3 CHAPTER 1 | Lift and shift existing .NET apps to Azure IaaS (Cloud Infrastructure -Ready)  \\n conversations within your organization. You don\\u2019t know enough about the potential cost benefits, or \\nwhether workloads could just lift -and-shift or would require significant rework to migrate successfully. \\nNo wonder many organizations hesitate.  \\nAzure Migrate  is a new service that provides the guidance, insights, and mechanisms needed to assist \\nyou in migrating to Azure. Azure Migrate provides:  \\n\\u2022 Discovery and assessment for on -premises virtual machines  \\n\\u2022 Inbuilt dependency mapping for high -confidence discovery of multi -tier applications  \\n\\u2022 Intelligent right sizing to Azure virtual machines  \\n\\u2022 Compatibility reporting with guidelines for remediating potential issues  \\n\\u2022 Integration with Azure Database Management Service for database discovery and m\", \"igration  \\nAzure Migrate gives you confidence that your workloads can migrate with minimal impact to the \\nbusiness and run as expected in Azure. With the right tools and guidance, you can achieve maximum \\nreturn on investment while assuring that critical performance an d reliability needs are met.  \\nFigure 2 -2 shows you the built -in dependency mapping for all server and application connections \\nperformed by Azure Migrate.  \\n \\nFigure 2 -2. Positioning Cloud Infrastructure -Ready applications  \\nUse Azure Site Recovery to migrate your existing \\nVMs to Azure VMs  \\nAs part of the end -to-end Azure Migrate , Azure Site Recovery  is a tool that you can use to easily \\nmigrate your web apps to VMs in Azure. You can use Site Recovery to replicate on -premises VMs and \\nphysical servers to Azure, or to replicate them to a secondary on -premises location. You can even \\nreplicate a workload t hat\\u2019s running on a supported Azure VM, on an on -premises Hyper -V VM, on a \\nVMware  VM, or on a Windows o\", \"r Linux physical server. Replication to Azure eliminates the cost and \\ncomplexity of maintaining a secondary datacenter.  \\n \\n4 CHAPTER 1 | Lift and shift existing .NET apps to Azure IaaS (Cloud Infrastructure -Ready)  \\n Site Recovery is also made specifically for hybrid environments that are partly on -premises and partly \\non Azure. Site Recovery helps ensure business continuity by keeping your apps that are running on \\nVMs and on -premises physical servers available if a sit e goes down. It replicates workloads that are \\nrunning on VMs and physical servers so that they remain available in a secondary location if the \\nprimary site isn\\u2019t available. It recovers workloads to the primary site when it\\u2019s up and running again.  \\nFigure 2 -3 shows the execution of multiple VM migrations by using Azure Site Recovery.  \\n \\nFigure 2 -3. Positioning Cloud Infrastructure -Ready applications  \\nAdditional resources  \\n\\u2022 Azure Migrate Datasheet  \\n  https://aka.ms/azuremigration \\\\_datasheet  \\n\\u2022 Azure Mig\", \"rate  \\n  https://aka.ms/azuremigrate  \\n\\u2022 Azure migration and modernization center  \\n  https://azure.microsoft.com/migration/  \\n\\u2022 Migrate to Azure with Site Recovery  \\n  https://learn.microsoft.com/azure/site -recovery/site -recovery -migrate -to-azure  \\n\\u2022 Azure Site Recovery service overview  \\n \\n5 CHAPTER 1 | Lift and shift existing .NET apps to Azure IaaS (Cloud Infrastructure -Ready)  \\n   https://learn.microsoft.com/azure/site -recovery/site -recovery -overview  \\n\\u2022 Migrating VMs in AWS to Azure VMs  \\n  https://learn.microsoft.com/azure/site -recovery/site -recovery -migrate -aws-to-azure   \\n6 CHAPTER 2 | Migrate your relational databases to Azure  \\n CHAPTER  2 \\nMigrate your relational \\ndatabases to Azure  \\nVision: Azure offers the most comprehensive database migration.  \\nIn Azure, you can migrate your database servers directly to IaaS VMs (pure lift and shift), or you can \\nmigrate to Azure SQL Database, for additional benefits. Azure SQL Database offers the managed \\ninstance and full\", \" database -as-a-service (DBaaS) options. Fi gure 3 -1 shows the multiple relational \\ndatabase migration paths available in Azure.  \\n \\nFigure 3 -1. Database migration paths in Azure  \\n \\n7 CHAPTER 2 | Migrate your relational databases to Azure  \\n When to migrate to Azure SQL Database Managed \\nInstance  \\nIn most cases, Azure SQL Database Managed Instance will be your best option to consider when you \\nmigrate your data to Azure. If you are migrating SQL Server databases and need nearly 100% \\nassurance that you won\\u2019t need to rearchitect your application or mak e changes to your data or data \\naccess code, choose the Managed Instance feature of Azure SQL Database.  \\nAzure SQL Database Managed Instance is the best option if you have additional requirements for SQL \\nServer instance -level functionality, or isolation requirements beyond the features provided in a \\nstandard Azure SQL Database (single database model). This la st one is the most PaaS -oriented choice, \\nbut it doesn\\u2019t offer the same\", \" features as that of a traditional SQL server. Migration might surface \\nfrictions.  \\nFor example, an organization that has made deep investments in instance -level SQL Server capabilities \\nwould benefit from migrating to SQL Managed Instance. Examples of instance -level SQL Server \\ncapabilities include SQL common language runtime (CLR) integra tion, SQL Server Agent, and cross -\\ndatabase querying. Support for these features is not available in standard Azure SQL Database (a \\nsingle -database model).  \\nAn organization that operates in a highly regulated industry, and which needs to maintain isolation for \\nsecurity purposes, also might benefit from choosing the SQL Managed Instance model.  \\nManaged Instance in Azure SQL Database has the following characteristics:  \\n\\u2022 Security isolation through Azure Virtual Network  \\n\\u2022 Application surface compatibility, with these features:  \\n\\u2013 SQL Server Agent and SQL Server Profiler  \\n\\u2013 Cross -database references and queries, SQL CLR, replication, chan\", \"ge data capture \\n(CDC), and Service Broker  \\n\\u2022 Database sizes up to 35 TB  \\n\\u2022 Minimum -downtime migration, with these features:  \\n\\u2013 Azure Database Migration Service  \\n\\u2013 Native backup and restore, and log shipping  \\nWith these capabilities, when you migrate existing application databases to Azure SQL Database, the \\nManaged Instance model offers nearly 100% of the benefits of PaaS for SQL Server. Managed Instance \\nis a SQL Server environment where you continue using inst ance -level capabilities without changing \\nyour application design.  \\nManaged Instance is probably the best fit for enterprises that currently are using SQL Server, and \\nwhich require flexibility in their network security in the cloud. It\\u2019s like having a private virtual network \\nfor your SQL databases.   \\n8 CHAPTER 2 | Migrate your relational databases to Azure  \\n When to migrate to Azure SQL Database  \\nAs mentioned, the standard Azure SQL Database is a fully managed, relational DBaaS. SQL Database \\ncurrently manages mil\", \"lions of production databases, across 38 datacenters, around the world. It \\nsupports a broad range of applications and workloads, from managing straightforward transactional \\ndata, to driving the most data -intensive, mission -critical applications that require advanced data \\nprocessing at a global scale.  \\nBecause of its full PaaS features, better pricing -and ultimately lower cost -you should move to the \\nstandard Azure SQL Database as your \\u201cby -default choice\\u201d if you have an application that uses basic, \\nstandard SQL databases, and no additional instance featur es. SQL Server features like SQL CLR \\nintegration, SQL Server Agent, and cross -database querying are not supported in the standard Azure \\nSQL Database. Those features are available only in the Azure SQL Database Managed Instance model.  \\nAzure SQL Database is the only intelligent cloud database service that\\u2019s built for app developers. It\\u2019s \\nalso the only cloud database service that scales on -the-fly, without downtime, to he\", \"lp you efficiently \\ndeliver multitenant apps. Ultimately, Azure SQL D atabase leaves you more time to innovate, and it \\naccelerates your time to market. You can build secure apps and connect to your SQL database by \\nusing the languages and platforms that you prefer.  \\nAzure SQL Database offers the following benefits:  \\n\\u2022 Built-in intelligence (machine learning) that learns and adapts to your app  \\n\\u2022 On-demand database provisioning  \\n\\u2022 A range of offers, for all workloads  \\n\\u2022 99.99% availability SLA, zero maintenance  \\n\\u2022 Geo-replication and restore services for data protection  \\n\\u2022 Azure SQL Database Point in Time Restore feature  \\n\\u2022 Compatibility with SQL Server 2016, including hybrid and migration  \\nThe standard Azure SQL Database is closer to PaaS than Azure SQL Database Managed Instance. \\nPrefer the standard Azure SQL Database because you\\u2019ll get more benefits from a managed cloud. \\nHowever, Azure SQL Database has some key differences from regular and on-premises SQL Server \\ninstances\", \". Depending on your existing application\\u2019s database requirements, and your enterprise \\nrequirements and policies, it might not be the best choice when you are planning your migration to \\nthe cloud.  \\nWhen to move your original RDBMS to a VM (IaaS)  \\nOne of your migration options is to move your original relational database management system \\n(RDBMS), including Oracle, IBM DB2, MySQL, PostgreSQL, or SQL Server, to a similar server that\\u2019s \\nrunning on an Azure VM. If you have existing applications that req uire the fastest migration to the \\ncloud with minimal changes, or no changes at all, a direct migration to IaaS in the cloud might be a  \\n9 CHAPTER 2 | Migrate your relational databases to Azure  \\n fair option. It might not be the best way to take advantage of all the cloud\\u2019s benefits, but it\\u2019s probably \\nthe fastest initial path.  \\nCurrently, Microsoft Azure supports up to 331 different database servers  deployed as IaaS VMs. These \\ninclude popular RDBMS like SQL Server, Oracle, MySQL, \", \"PostgreSQL, and IBM DB2, and many other \\nNoSQL databases like MongoDB, Cassandra, DataStax, MariaDB, and Cloudera.  \\nNote  \\nAlthough moving your RDBMS to an Azure VM might be the fastest way to migrate your data to the \\ncloud (because it is IaaS), this approach requires a significant investment in your IT teams (database \\nadministrators and IT pros). Enterprise teams need to be a ble to set up and manage high availability, \\ndisaster recovery, and patching for SQL Server. This context also needs a customized environment, \\nwith full administrative rights.  \\nWhen to migrate to SQL Server as a VM (IaaS)  \\nThere might be a few cases where you still need to migrate to SQL Server as a regular VM. An \\nexample scenario is if you need to use SQL Server Reporting Services. In most cases, though, Azure \\nSQL Database Managed Instance can provide everything you need to  migrate from on -premises SQL \\nservers, so migration to a SQL Server VM should be your last resort to try.  \\nUse Azure Database Mig\", \"ration Service to migrate \\nyour relational databases to Azure  \\nYou can use Azure Database Migration Service to migrate relational databases like SQL Server, and \\nMySQL to Azure, whether your target database is Azure SQL Database, Azure SQL Database Managed \\nInstance, or SQL Server on an Azure VM.  \\nThe automated workflow, with assessment reporting, guides you through the changes you need to \\nmake before you migrate the database. When you are ready, the service migrates the source database \\nto Azure.  \\nWhenever you change an original RDBMS, you might need to retest. You also might need to change \\nthe SQL sentences or Object -Relational Mapping (ORM) code in your application, depending on \\ntesting results.  \\nIf you have any other database (for example, IBM DB2) and you opt for a lift and shift approach, you \\nmight want to continue using those databases as IaaS VMs in Azure, unless you are willing to perform \\na more complex data migration. A more complex data mig ration will require addi\", \"tional effort because \\nyou\\u2019d be migrating to a different database type with the new schema and different programming \\nlibraries.   \\n10 CHAPTER 2 | Migrate your relational databases to Azure  \\n Additional resources  \\n\\u2022 Choose a cloud SQL Server option: Azure SQL Database (PaaS) or SQL Server on Azure \\nVM (IaaS)  \\n  https://learn.microsoft.com/azure/sql -database/sql -database -paas-vs-sql-server -iaas \\n\\u2022 SQL Server database migration to SQL Database in the cloud  \\n  https://learn.microsoft.com/azure/sql -database/sql -database -cloud -migrate  \\n\\u2022 Azure SQL Database  \\n  https://azure.microsoft.com/services/sql -database/?v=16.50  \\n\\u2022 SQL Server on virtual machines  \\n  https://azure.microsoft.com/services/virtual -machines/sql -server/   \\n11 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n CHAPTER  3 \\nModernize existing .NET \\napps to Cloud -Optimized \\napplications  \\nVision: Modernize your existing .NET Framework applications to Cloud -Optimized applications to \\n\", \"drastically improve your deployment agility, so you can ship faster and lower application\\u2019s delivery \\ncosts.  \\nTo take advantage of the benefits of the cloud and new technologies like containers, you should at \\nleast partially modernize your existing .NET applications. Ultimately, modernizing your enterprise \\napplications will lower your total cost of ownership.  \\nPartially modernizing an app doesn\\u2019t necessarily mean a full migration and rearchitecture. You can \\ninitially modernize your existing applications with important but easy to do modernization. You can \\nmaintain your current code base, written in existing .NET  Framework versions, with any Windows and \\nIIS dependencies. Figure 4 -1 highlights how Cloud -Optimized apps are positioned in Azure \\napplication modernization maturity models.  \\n \\nFigure 4 -1. Positioning Cloud -Optimized applications  \\n \\n12 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n Reasons to modernize existing .NET apps to Cloud -\\nOp\", \"timized applications  \\nWith a Cloud -Optimized application, you can rapidly and repeatedly deliver reliable applications to \\nyour customers. You gain essential agility and reliability by deferring much of the operational \\ncomplexity of your app to the platform.  \\nIf you can\\u2019t get your applications to market quickly, by the time you ship your app, the market you \\nwere targeting will have evolved. You might be too late, no matter how well the application was \\narchitected or engineered. You might be failing or not reach ing your full potential because you can\\u2019t \\nsync app delivery with the needs of the market.  \\nThe need for continuous business innovation pushes development and operations teams to the limit. \\nThe only way to achieve the agility you need in continuous business innovation is by modernizing \\nyour applications with technologies like containers and speci fic Cloud -Optimized application \\nprinciples.  \\nThe bottom line is that when an organization builds and manages applications \", \"that are Cloud -\\nOptimized, it can put solutions in the hands of customers sooner and bring new ideas to market when \\nthey are relevant.  \\nCloud -Optimized application principles and tenets  \\nImprovements in the cloud are mostly focused on meeting two goals: Reduce costs and improve \\nbusiness growth by improving agility. These goals are achieved by simplifying processes and reducing \\nfriction when you release and ship applications.  \\nYour application is Cloud -Optimized if you can -in an agile manner -develop your app autonomously \\nfrom other on -premises apps, and then release, deploy, autoscale, monitor, and troubleshoot your \\napp in the cloud.  \\nThe key is agility . You can\\u2019t ship with agility unless you reduce to an absolute minimum any \\ndeployment -to-production issues and dev/test environment issues. Containers (specifically, Docker, as \\na de facto standard) and managed services were designed specifically for this p urpose.  \\nTo achieve agility, you also need automated DevOps pro\", \"cesses that are based on CI/CD pipelines that \\nrelease to scalable platforms in the cloud. CI/CD platforms (like Azure DevOps Services or Jenkins) that \\ndeploy to a scalable and resilient cloud platform ( like Azure App Service or Azure Kubernetes Service) \\nare key technologies for achieving agility in the cloud.  \\nThe following list describes the main tenets or practices for Cloud -Optimized applications. Note that \\nyou can adopt all or only some of these principles, in a progressive or incremental approach:  \\n\\u2022 Containers . Containers give you the ability to include application dependencies with the \\napplication itself. Containerization significantly reduces the number of issues you might \\nencounter when you deploy to production environments or test in staging environments. \\nUltimately, containers improve the agility of application delivery.   \\n13 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n \\u2022 Resilient and scalable cloud . The cloud provides a platfor\", \"m that is managed, elastic, \\nscalable, and resilient. These characteristics are fundamental to gain cost improvements and \\nship highly available and reliable applications in a continuous delivery. Managed services like \\nmanaged d atabases, managed cache as a service (CaaS), and managed storage are \\nfundamental pieces in alleviating the maintenance costs of your application.  \\n\\u2022 Monitoring . You can\\u2019t have a reliable application without having a good way to detect and \\ndiagnose exceptions and application performance issues. You need to get actionable insights \\nthrough application performance management and instant analytics.  \\n\\u2022 DevOps culture and continuous delivery . Adopting DevOps practices requires a cultural \\nchange in which teams no longer work in independent silos. CI/CD pipelines are possible only \\nwhen there is an increased collaboration between development and IT operations teams, \\nsupported by containers and C I/CD tools.  \\nFigure 4 -2 shows the main optional pillars of a Cl\", \"oud -Optimized application. The more pillars you \\nimplement, the readier your application will be to succeed in meeting your customers\\u2019 expectations.  \\n \\nFigure 4 -2. Main pillars of a Cloud -Optimized application  \\nTo summarize, a Cloud -Optimized application is an approach to building and managing applications \\nthat takes advantage of the cloud computing model, while using a combination of containers, \\nmanaged cloud infrastructure, resilient application techniques, mon itoring, continuous delivery, and \\nDevOps, all without the need to rearchitect and recode your existing applications.  \\nYour organization can adopt these technologies and approaches gradually. You don\\u2019t have to \\nembrace all of them, all at once. You can adopt them incrementally, depending on enterprise priorities \\nand user needs.  \\n \\n14 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n Benefits of a Cloud -Optimized application  \\nYou can get the following benefits by converting an existing ap\", \"plication to a Cloud -Optimized \\napplication (without rearchitecting or coding):  \\n\\u2022 Lower costs, because the managed infrastructure is handled by the cloud provider . \\nCloud -Optimized applications get the benefits of the cloud by using the cloud\\u2019s out -of-the-\\nbox elasticity, autoscale, and high availability. Benefits are related not only to the compute \\nfeatures (VMs and containers), but also depend on the resources in t he cloud, like DBaaS, \\nCaaS, and any infrastructure an application might needed.  \\n\\u2022 Resilient application and infrastructure . When you migrate to the cloud, you need to \\nembrace transient failures; failures will occur in the cloud. Also, cloud infrastructure and \\nhardware are \\u201creplaceable,\\u201d which increases opportunities for transient downtime. At the \\nsame time, inner cloud capabi lities and certain application development techniques that \\nimplement resiliency and automate recovery make it much easier to recover from unexpected \\nfailures in the cloud.  \\n\\u2022 Deeper i\", \"nsights into application performance . Cloud monitoring tools like Azure \\nApplication Insights provide visualization for health management, logging, and notifications. \\nAudit logs make applications easy to debug and audit, fundamental for a reliable cloud \\napplication.  \\n\\u2022 Application portability, with agile deployments . Containers (either Linux or Windows \\ncontainers based on Docker Engine) offer the best solution to avoiding a cloud -locked \\napplication. By using containers, Docker hosts, and multi -cloud orchestrators, you can easily \\nmove from one environment or cloud to another. Containers eliminate the friction that \\ntypically occurs in deployments to any environment (stage/test/production).  \\nAll of these benefits ultimately provide key cost reductions for your end -to-end application lifecycle.  \\nIn the following sections, these benefits are explained in more detail, and are linked to specific \\ntechnologies.  \\nMicrosoft technologies in cloud -optimized \\napplications  \\nThe foll\", \"owing list describes the tools, technologies, and solutions that are recognized as requirements \\nfor Cloud -Optimized apps. You can adopt Cloud -Optimized elements selectively or gradually, \\ndepending on your priorities.  \\n\\u2022 Cloud infrastructure : The infrastructure that provides the compute platform, operating \\nsystem, network, and storage. Microsoft Azure is positioned at this level.  \\n\\u2022 Runtime : This layer provides the environment for the application to run. If you are using \\ncontainers, this layer usually is based on Docker Engine , running either on Linux hosts or on \\nWindows hosts. ( Windows Containers  are supported beginning with Windows Server 2016.  \\n15 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n Windows Containers is the best choice for existing .NET Framework applications that run on \\nWindows.)  \\n\\u2022 Managed cloud : When you choose a managed cloud option, you can avoid the expense and \\ncomplexity of managing and supporting the underlying infr\", \"astructure, VMs, OS patches, and \\nnetworking configuration. If you choose to migrate by using IaaS, you are responsible for all \\nof these tasks, and for associated costs. In a managed cloud option, you manage only the \\napplications and services that you develop. The cloud service provider typically manages \\neverything else. Examples of managed cloud services in Azure incl ude Azure SQL Database , \\nAzure Redis Cache , Azure Cosmos DB , Azure Storage , Azure Database for MySQL , Azure \\nDatabase for PostgreSQL , Azure Active Directory , and managed compute services like VM \\nscale sets , Azure App Service , and Azure Kubernetes Service . \\n\\u2022 Application development : You can choose from many languages when you build \\napplications that run in containers. This guide focuses on .NET, but, you can develop \\ncontainer -based apps by using other languages, like Node.js, Python, Spring/Java, or Go.  \\n\\u2022 Monitoring, telemetry, logging, and auditing : The ability to monitor and audit applications \\nand\", \" containers that are running in the cloud is critical for any Cloud -Optimized application. \\nAzure Application Insights  and Microsoft Operations Management Suite  are the main \\nMicrosoft tools that provide monitoring and auditing for Cloud -Optimized apps.  \\n\\u2022 Provisioning : Automation tools help you provision the infrastructure and deploy an \\napplication to multiple environments (production, testing, staging). You can use tools like \\nChef and Puppet to manage an application\\u2019s configuration and environment. This layer also \\ncan be implemented by using simpler and more direct approaches. For example, you can \\ndeploy directly by using Azure command -line interface (Azure CLI) tooling, and then use the \\ncontinuous deployment and release management pipelines in Azure DevOps Services . \\n\\u2022 Application lifecycle : Azure DevOps Services  and other tools, like Jenkins, are built \\nautomation servers that help you implement CI/CD pipelines, including release management.  \\nThe next sections of th\", \"is chapter, and the related walkthroughs, focus specifically on details about the \\nruntime layer (Windows Containers). The guidance describes the ways you can deploy Windows \\nContainers on Windows Server 2016 (and later versions) VMs a nd Azure Container Instances. It also \\ncovers more advanced PaaS platforms like Azure App Service and orchestrator like Azure Kubernetes \\nService.  \\nMonolithic applications can be Cloud -Optimized  \\nIt\\u2019s important to highlight that monolithic applications (applications that are not based on \\nmicroservices) can be Cloud -Optimized applications. You can build and operate monolithic \\napplications that take advantage of the cloud computing model by using a combination of containers, \\ncontinuous delivery, and DevOps. If an existing monolithic application is right for y our business goals, \\nyou can modernize it and make it Cloud -Optimized.  \\nSimilarly, if monolithic applications can be Cloud -Optimized applications, other, more complex \\narchitectures like N -\", \"Tier applications can also be modernized as Cloud -Optimized applications.   \\n16 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n What about Cloud -Native applications?  \\nAlthough Cloud -Native  applications are not the main focus of this guide, it\\u2019s helpful to have an \\nunderstanding of this modernization maturity level, and to distinguish it from Cloud -Optimized \\napplications.  \\nFigure 4 -3 positions Cloud -Native apps in the application modernization maturity levels:  \\n \\nFigure 4 -3. Positioning Cloud -Native applications  \\nThe Cloud -Native modernization maturity level usually requires new development investments. \\nMoving to the Cloud -Native level typically is driven by business need to modernize applications as \\nmuch as possible to drastically improve scale in large applicatio ns by creating autonomous \\nsubsystems (microservices) that can be deployed and scale independently from other areas of the \\napplication while lowering costs in the long term and \", \"increase evolution agility of those autonomous \\napp\\u2019s parts that provide signific ant compete advantages.  \\nThe main pillars of Cloud -Native applications are based on microservices architecture approaches, \\nwhich can evolve with agility and scale to limits that would be difficult to achieve in a monolithic \\narchitecture, deployed to either on -premises or cloud env ironment.  \\nFigure 4 -4 shows the main characteristics of the Cloud -Native model.  \\n \\n17 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n  \\nFigure 4 -4. Cloud -Native characteristics  \\nIn addition, you can extend basic modern web apps and cloud -native apps by adding other services, \\nlike artificial intelligence (AI), machine learning (ML), and IoT. You might use any of these services to \\nextend any of the possible Cloud -Optimized approaches.  \\nThe fundamental difference in applications at the Cloud -Native level is in the application architecture. \\nCloud -native applications are, by definition\", \", apps that are based on microservices. Cloud -native apps \\nrequire special architectures, technologies, and platforms, compared to a monolithic web application \\nor traditional N -Tier application.  \\nCloud -native applications details  \\nCloud -Native is a more advanced or mature state for large and mission -critical applications. Cloud -\\nNative applications usually require architecture and design that are created from scratch instead of by \\nmodernizing existing applications. The key difference  between a Cloud -Native application and a \\nsimpler Cloud -Optimized web app is the recommendation to use microservices architectures in a \\ncloud -native approach. Cloud -Optimized apps can also be monolithic web apps or N -Tier apps.  \\nThe Twelve -Factor App  (a collection of patterns that are closely related to microservices approaches) \\nis also considered a requirement for cloud -native application architectures.  \\nThe Cloud Native Computing Foundation (CNCF)  is a primary promoter of cloud -n\", \"ative principles. \\nMicrosoft is a member of the CNCF . \\nFor detailed guidance on how to design and develop cloud -native applications, read the following \\nfree e -books:  \\n \\n18 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n \\u2022 Architecting Cloud -Native .NET Applications for Azure  \\n\\u2022 .NET Microservices: Architecture for containerized .NET applications . \\nThe most important factor to consider if you migrate a full application to the cloud -native model is \\nthat you must rearchitect to a microservices -based architecture. This approach clearly requires a \\nsignificant investment in development because of the larg e refactoring process involved. This option \\nusually is chosen for mission -critical applications that need new levels of scalability and long -term \\nagility. But, you could start moving toward cloud -native by adding microservices for just a few new \\nscenarios,  and eventually refactor the application fully as microservices. This step is an incremen\", \"tal \\napproach that is the best option for some scenarios.  \\nWhat about microservices?  \\nUnderstanding microservices and how they work is important when you are considering cloud -native \\napplications for your organization.  \\nThe microservices architecture is an advanced approach that you can use for applications that are \\ncreated from scratch or when you evolve existing applications toward cloud -native applications. You \\ncan start by adding a few microservices to existing applic ations to learn about the new microservices \\nparadigms. But clearly, you need to architect and code, especially for this type of architectural \\napproach.  \\nHowever, microservices are not mandatory for any new or modern application. Microservices are not a \\n\\u201cmagic bullet,\\u201d and they aren\\u2019t the single, best way to create every application. How and when you use \\nmicroservices depends on the type of application that  you need to build.  \\nThe microservices architecture is becoming the preferred approach for distribu\", \"ted and large or \\ncomplex mission -critical applications that are based on multiple, independent subsystems in the form \\nof autonomous services. In a microservices -based architectur e, an application is built as a collection of \\nservices that can be independently developed, tested, versioned, deployed, and scaled. This approach \\ncan include any related, autonomous database per microservice.  \\nFor a detailed look at a microservices architecture that you can implement by using .NET, see the \\ndownloadable PDF e -book .NET microservices: Architecture for containerized .NET applications . The \\nguide also is available online . \\nBut even in scenarios in which microservices offer powerful capabilities -independent deployment, \\nstrong subsystem boundaries, and technology diversity -they also raise many new challenges. The \\nchallenges are related to distributed application development, s uch as fragmented and independent \\ndata models; achieving resilient communication between microservices; the\", \" need for eventual \\nconsistency; and operational complexity. Microservices introduce a higher level of complexity \\ncompared to traditional monolithic a pplications.  \\nBecause of the complexity of a microservices architecture, only specific scenarios and certain \\napplication types are suitable for microservice -based applications. These include large and complex \\napplications that have multiple, evolving subsystems. In thes e cases, it\\u2019s worth investing in a more \\ncomplex software architecture, for increased long -term agility and more efficient application \\nmaintenance. But for less complex scenarios, it might be better to continue with a monolithic \\napplication approach or simp ler N -Tier approaches.   \\n19 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n As a final note, even at the risk of being repetitive about this concept, you shouldn\\u2019t look at using \\nmicroservices in your applications as \\u201call -in or nothing at all.\\u201d You can extend and evolve existing \", \"\\nmonolithic applications by adding new, small scenario s based on microservices. You don\\u2019t need to \\nstart from scratch to start working with a microservices architecture approach. In fact, we recommend \\nthat you evolve from using an existing monolithic or N -Tier application by adding new scenarios. \\nEventually, y ou can break down the application into autonomous components or microservices. You \\ncan start evolving your monolithic applications in a microservices direction, step by step.  \\nIn any case, the rest of this present guidance focuses most of all on \\u201cno microservices -based apps\\u201d \\nbecause this guidance is mainly targeting the modernization of existing apps that usually have \\nmonolithic or N -Tier architectures.  \\nDeploy existing .NET apps as Windows containers  \\nDeployments that are based on Windows Containers are applicable to Cloud -Optimized applications \\nand Cloud -Native applications.  \\nHowever, in this guide and especially in the following sections, it mostly focuses on u\", \"sing Windows \\nContainers for Cloud -Optimized  applications where you don\\u2019t need to rearchitect your application.  \\nWhat are containers? (Linux or Windows)  \\nContainers are a way to wrap up an application into its own isolated package. In its container, the \\napplication is not affected by applications or processes that exist outside of the container. Everything \\nthe application depends on to run successfully as a  process is inside the container. Wherever the \\ncontainer might move, the requirements of the application will always be met, in terms of direct \\ndependencies, because it is bundled with everything that it needs to run (library dependencies, \\nruntimes, and so  on). \\nThe main characteristic of a container is that it makes the environment the same across different \\ndeployments because the container itself comes with all the dependencies it needs. You can debug \\nthe application on your machine, and then deploy it to another machine , with the same environment \\nguaranteed.  \\nA con\", \"tainer is an instance of a container image. A container image is a way to package an app or \\nservice (like a snapshot), and then deploy it in a reliable and reproducible way. You could say that \\nDocker is not only a technology -it\\u2019s also a philosophy and  a process.  \\nAs containers daily become more common, they are becoming an industry -wide \\u201cunit of deployment.\\u201d  \\nBenefits of containers (Docker Engine on Linux or Windows)  \\nBuilding applications by using containers -which also might be defined as lightweight building blocks -\\noffers a significant increase in agility for building, shipping, and running any application, across any \\ninfrastructure.  \\nWith containers, you can take any app from development to production with little or no code change, \\nthanks to Docker integration across Microsoft developer tools, operating systems, and the cloud.   \\n20 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n When you deploy to plain VMs, you probably already have a met\", \"hod in place for deploying ASP.NET \\napps to your VMs. It\\u2019s likely, though, that your method involves multiple manual steps or complex \\nautomated processes by using a deployment tool like Puppet, or  a similar tool. You might need to \\nperform tasks like modifying configuration items, copying application content between servers, and \\nrunning interactive setup programs based on .msi setups, followed by testing. All those steps in the \\ndeployment add time a nd risk to deployments. You will get failures whenever a dependency is not \\npresent in the target environment.  \\nIn Windows Containers, the process of packaging applications is fully automated. Windows Containers \\nis based on the Docker platform, which offers automatic updates and rollbacks for container \\ndeployments. The main improvement you get from using the Docker engine is that you create images, \\nwhich are like snapshots of your application, with all its dependencies. The images are Docker images \\n(a Windows container image, in th\", \"is case). The images run ASP.NET apps in containers, without going \\nback to source code.  The container snapshot becomes the unit of deployment.  \\nMany organizations are containerizing existing monolithic applications for the following reasons:  \\n\\u2022 Release agility through improved deployment . Containers offer a consistent deployment \\ncontract between development and operations. When you use containers, you won\\u2019t hear \\ndevelopers say, \\u201cIt works on my machine, why not in production?\\u201d They can say, \\u201cIt runs as a \\ncontainer, so it will run in produc tion.\\u201d The packaged application, with all its dependencies, \\ncan be executed in any supported container -based environment. It will run the way it was \\nintended to run in all deployment targets (dev, QA, staging, pro duction). Containers eliminate \\nmost frictions when they move from one stage to the next, which greatly improves \\ndeployment, and you can ship faster.  \\n\\u2022 Cost reductions . Containers lead to lower costs, either by the consolidati\", \"on and removal of \\nexisting hardware, or from running applications at a higher density per unit of hardware.  \\n\\u2022 Portability . Containers are modular and portable. Docker containers are supported on any \\nserver operating system (Linux and Windows), in any major public cloud (Microsoft Azure, \\nAmazon AWS, Google, IBM), and in on -premises and private or hybrid cloud environments.  \\n\\u2022 Control . Containers offer a flexible and secure environment that\\u2019s controlled at the container \\nlevel. A container can be secured, isolated, and even limited by setting execution constraint \\npolicies on the container. As detailed in the section about Windows Containers, Windows \\nServer 2016 and Hype r-V containers offer additional enterprise support options.  \\nSignificant improvements in agility, portability, and control ultimately lead to significant cost \\nreductions when you use containers to develop and maintain applications.  \\nWhat is Docker?  \\nDocker  is an open -source project  that automates the dep\", \"loyment of applications as portable, self -\\nsufficient containers that can run in the cloud or on -premises. Docker is also a company  that \\npromotes and evolves this technology. The company works in collaboration with cloud, Linux, and \\nWindows vendors, including Microsoft.   \\n21 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n  \\nFigure 4 -6. Docker deploys containers at all layers of the hybrid cloud  \\nTo someone familiar with virtual machines, containers might appear to be remarkably similar. A \\ncontainer runs an operating system, has a file system, and can be accessed over a network, just like a \\nphysical or virtual computer system. However, the technolo gy and concepts behind containers are \\nvastly different from virtual machines. From a developer point of view, a container must be treated \\nmore like a single process. In fact, a container has a single entry point for one process.  \\nDocker containers (for simplicity, containers ) can run natively on Linu\", \"x and Windows. When running \\nregular containers, Windows containers can run only on Windows hosts (a host server or a VM), and \\nLinux containers can run only on Linux hosts. However, in recent versions of Windows Server and \\nHyper -V containers, a Linux container can also run natively on Windows Server by using the Hyper -V \\nisolation technology that currently is available only in Windows Server Containers.  \\nIn the near future, mixed environments that have both Linux and Windows containers will be possible \\nand even common.  \\nBenefits of Windows Containers for your existing .NET applications  \\nThe benefits of using Windows Containers are fundamentally the same benefits you get from \\ncontainers in general. Using Windows Containers is about greatly improving agility, portability, and \\ncontrol.  \\nExisting .NET applications refer to those applications that were created using the .NET Framework. For \\nexample, they might be traditional ASP.NET web applications -they don\\u2019t use .NET Core or .\", \"NET 5+, \\nwhich is newer and runs cross -platform on Linux, Windows , and MacOS.  \\nThe main dependency in the .NET Framework is Windows. It also has secondary dependencies, like IIS, \\nand System.Web in traditional ASP.NET.  \\nA .NET Framework application must run on Windows, period. If you want to containerize existing .NET \\nFramework applications and you can\\u2019t or don\\u2019t want to invest in a migration to .NET Core or later(\\u201cIf it \\n \\n22 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n works properly, don\\u2019t migrate it\\u201d), the only choice you have for containers is to use Windows \\nContainers.  \\nSo, one of the main benefits of Windows Containers is that they offer you a way to modernize your \\nexisting .NET Framework applications that are running on Windows -through containerization. \\nUltimately, Windows Containers gets you the benefits that you are l ooking for by using containers -\\nagility, portability, and better control.  \\nChoose an OS to target with .NET -based c\", \"ontainers  \\nGiven the diversity of operating systems that are supported by Docker, as well as the differences \\nbetween .NET Framework and .NET Core, you should target a specific OS and specific versions based \\non the framework you are using.  \\nFor Windows, you can use Windows Server Core or Windows Nano Server. These Windows versions \\nprovide different characteristics (like IIS versus a self -hosted web server like Kestrel) that might be \\nneeded by .NET Framework or .NET applications.  \\nFor Linux, multiple distros are available and supported in official .NET Docker images (like Debian).  \\nFigure 4 -7 shows OS versions that you can target, depending on the app\\u2019s version of the .NET \\nFramework.  \\n \\nFigure 4 -7. Operating systems to target based on .NET Framework version  \\nIn migration scenarios for existing or legacy applications that are based on .NET Framework \\napplications, the main dependencies are on Windows and IIS. Your only option is to use Docker \\nimages based on Windows Server \", \"Core and the .NET Framework.  \\nWhen you add the image name to your Dockerfile file, you can select the operating system and \\nversion by using a tag, as in the following examples for .NET Framework -based Windows container \\nimages:  \\n \\n23 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n Tag System and version  \\nmcr.microsoft.com/dotnet/framework/runti\\nme:4.x -windowsservercore -20H2  .NET Framework 4.x on Windows Server Core  \\nmcr.microsoft.com/dotnet/framework/aspne\\nt:4.x -windowsservercore -20H2  .NET Framework 4.x with additional ASP.NET \\ncustomization, on Windows Server Core  \\nFor .NET (cross -platform for Linux and Windows), the tags would look like the following:  \\nTag System and version  \\nmcr.microsoft.com/dotnet/runtime:7.0  .NET runtime -only on Linux  \\nmcr.microsoft.com/dotnet/runtime:7.0 -\\nnanoserver -ltsc2022  .NET runtime -only on Windows Nano Server  \\nMulti -arch images  \\nSince 2017, Docker has had a feature called multi -arch images. .NET Docke\", \"r images can use multi -arch \\ntags. Your Dockerfile files no longer need to define the operating system that you are targeting. The \\nmulti -arch feature allows a single tag to be used across multiple machine configurations. For instance, \\nwith multi -arch, you can use one common tag: mcr.microsoft.com/dotnet/runtime:7.0 . If you pull \\nthat tag from a Linux container environment, you get the Debian -based image. If you pull that tag \\nfrom a Windows container environment, you get the Nano Server -based image.  \\nFor .NET Framework images, because the traditional .NET Framework supports only Windows, you \\ncannot use the multi -arch feature.  \\nWindows container types  \\nLike Linux containers, Windows Server containers are managed by using Docker Engine. Unlike Linux \\ncontainers, Windows containers include two different container types, or run times -Windows Server \\ncontainers and Hyper -V isolation.  \\nWindows Server containers : Provides application isolation through process and namespace is\", \"olation \\ntechnology. A Windows Server container shares a kernel with the container host and all containers \\nthat are running on the host. These containers do not provide a hostile security boun dary and should \\nnot be used to isolate untrusted code. Because of the shared kernel space, these containers require \\nthe same kernel version and configuration.  \\nHyper -V isolation : Expands on the isolation provided by Windows Server Containers by running each \\ncontainer on a highly optimized VM. In this configuration, the kernel of the container host is not \\nshared with other containers on the same host. These containers are designed  for hostile multitenant \\nhosting, with the same security assurances of a VM. Because these containers don\\u2019t share the kernel \\nwith the host or other containers on the host, they can run kernels with different versions and \\nconfigurations (wi th supported versions). For example, all Windows containers on Windows 10 use \\nHyper -V isolation to utilize the Windows S\", \"erver kernel version and configuration.   \\n24 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n Running a container on Windows with or without Hyper -V isolation is a run -time decision. You might \\nchoose to create the container with Hyper -V isolation initially, and at run time, choose to run it as a \\nWindows Server container instead.  \\nAdditional resources  \\n\\u2022 Windows Containers documentation  \\n  https://learn.microsoft.com/virtualization/windowscontainers/  \\n\\u2022 Windows Containers fundamentals  \\n  https://learn.microsoft.com/virtualization/windowscontainers/about/  \\n\\u2022 Infographic: Microsoft and containers  \\n  https://info.microsoft.com/rs/157 -GQE-382/images/Container%20infographic%201.4.17.pdf  \\nThe container ecosystem in Azure  \\nIn previous sections, it\\u2019s been explained what the benefits of Docker containers are as well as details \\non the specific container images for .NET applications. All that generic information is fundamental in \\norder to develop or co\", \"ntainerize an application. However, when thinking about the production \\ndeployment environment or even QA and Dev/Test environments, Microsoft Azure provides an open \\nand broad variety of choices, a full container ecosystem in the cloud (shown in the diagram below). \\nDepending on your specific application\\u2019s needs, you should choose one or another Azure product.   \\n25 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n  \\nFigure 4 -7.5. The container ecosystem in Azure  \\nFrom the container ecosystem in Azure, the following products supporting containers that are \\nconsidered infrastructure:  \\n\\u2022 Azure Container Instances (ACI)  \\n\\u2022 Azure Virtual Machines  (With container\\u2019s support)  \\n\\u2022 Azure Virtual Machine Scale Sets  (With container\\u2019s support)  \\nFrom those three, ACI provides a great benefit, which is the fact that you don\\u2019t need to maintain the \\nunderlying OS, no need for you to upgrade/patch, etc. but ACI still is positioned in the infrastructure \\nlevel, as bett\", \"er explained in the upcoming section s of this book.  \\nThe products in Azure supporting containers that are at the same time positioned more in the PaaS \\n(Platform as a Service) level are:  \\n\\u2022 Azure App Service  \\n\\u2022 Azure Kubernetes Service (AKS and ACS)  \\n\\u2022 Azure Batch  \\nThen, Azure Container Registry is a high scalable container registry hosted in Azure that you can use \\nfrom all the previous products when registering and deploying your custom container images.  \\nIn addition, from your containers, you can consume other managed services in Azure like Azure SQL \\nDatabase, Azure Redis cache, Azure Cosmos DB, etc. plus there are third -party solutions/platforms \\n \\n26 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n available in Azure Marketplace like Cloud Foundry and OpenShift where you can also use containers \\nwithin Azure.  \\nIn the next sections, you can explore Microsoft\\u2019s recommendations on when to use each of those \\nAzure products and solutions specifical\", \"ly when targeting Windows Containers.  \\nWhen not to deploy to Windows Containers  \\nSome Windows technologies are not supported by Windows Containers. In those cases, you still need \\nto migrate to the standards VMs, usually with just Windows and IIS.  \\nFor more information, see the list of Applications not supported by Windows containers . \\nAdditional resources  \\n\\u2022 Virtual machines and containers in Azure  \\n  https://azure.microsoft.com/overview/containers/  \\nWhen to deploy Windows Containers in your on -\\npremises IaaS VM infrastructure  \\n\\u2022 Your organization might not be ready to move to the cloud, or it might not be able to move \\nto the cloud for a business reason. But, you can still get the benefits of using Windows \\nContainers in your own datacenters.  \\n\\u2022 You might have other artifacts that are being used on -premises, and which might slow you \\ndown when you try to move to the cloud. For example, security or authentication \\ndependencies with on -premises Windows Server Active Directo\", \"ry, or any other on -premises  \\nasset.  \\n\\u2022 If you start using Windows Containers today, you can make a phased migration to the cloud \\ntomorrow from a much better position. Windows Containers is becoming a unit of \\ndeployment for any cloud, with no lock -in. \\nWhen to deploy Windows Containers to Azure VMs \\n(IaaS cloud)  \\nIf your organization is using Azure VMs, even if you are also using Windows Containers, you are still \\ndealing with IaaS. That means that dealing with infrastructure operations, VM OS patches, and \\ninfrastructure complexity for highly scalable applications when you need to deploy to multiple VMs in  \\na load -balanced infrastructure. The main scenarios for using Windows Containers in an Azure VM are:  \\n\\u2022 Dev/test environment : A VM in the cloud is perfect for development and testing in the \\ncloud. You can rapidly create or stop the environment depending on your needs.   \\n27 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n \\u2022 Small and medium sc\", \"alability needs : In scenarios where you might need just a couple of \\nVMs for your production environment, managing a few VMs might be affordable until you \\ncan move to more advanced PaaS environments, like orchestrators.  \\n\\u2022 Production environment with existing deployment tools : You might be moving from an \\non-premises environment in which you have invested in tools to make complex deployments \\nto VMs or bare -metal servers (like Puppet or similar tools). To move to the cloud with minimal \\nchanges to production environment deploymen t procedures, you might continue to use \\nthose tools to deploy to Azure VMs. However, you\\u2019ll want to use Windows Containers as the \\nunit of deployment to improve the deployment experience.  \\nWhen to deploy Windows Containers to Azure \\nContainer Instances (ACI)  \\nThe main value proposition of Azure Container Instances is that you can right away deploy containers \\nto it and you don\\u2019t need to maintain that environment, you don\\u2019t need to upgrade/patch the \\nun\", \"derlying operating system or VMs, all that is transparent and you just deploy containers into a \\nready -to-use environment.  \\nThe reasons and scenarios when you would want to use ACI are similar to the main scenarios when \\nyou use Azure VMs with containers, so basically, the main scenarios for using Azure Container \\nInstances are:  \\n\\u2022 Dev/Test scenarios  \\n\\u2022 Task automation  \\n\\u2022 CI/CD agents  \\n\\u2022 Small/scale batch processing  \\n\\u2022 Simple web apps  \\nThe simple web apps scenario is a fair scenario for ACI but take into account that since in ACI you can \\nonly have a single container instance per container image, you won\\u2019t have high availability and only \\nhave limited scalability.  \\nHowever, even when ACI is considered infrastructure because it just provides single container \\ninstances, there is a huge benefit compared to regular Azure VMs with Windows Server. With ACI, you \\njust deploy the containers into a self -maintained environment and you just pay for those containers. \\nYou don\\u2019t need to \", \"maintain/update/patch VMs, so it is a much better platform for most scenarios \\nwhere you might be using VMs with containers. Using ACI is straight forward, you just deploy a \\ncontainer, there\\u2019s no need  to create a VM environment you just deploy containers.  \\nThe main benefits of Azure Container Instances (ACI) are:  \\n\\u2022 Run containers without managing servers  \\n\\u2022 Increase agility with containers on demand  \\n\\u2022 Deploy containers to the cloud with unprecedented simplicity and speed \\u2014with a single \\ncommand.   \\n28 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n \\u2022 Secure applications with hypervisor isolation  \\nIn short, with ACI you can develop apps fast without managing virtual machines or having to learn \\nnew tools. It\\u2019s just your application, in a container, running in the cloud.  \\nWhen to deploy Windows Containers to Azure \\nKubernetes Service (AKS)  \\nAzure Kubernetes Service (AKS) simplifies deploying a managed Kubernetes cluster in Azure by \\noffloading the \", \"operational overhead to Azure. You get an open solution that offers portability both for \\nyour containers and for your application configuration. You  select the size, the number of hosts, and \\nthe orchestrator tools. Azure Kubernetes Service handles the infrastructure for you. It also supports \\nWindows Server containers alongside Linux containers. For more details on Windows OS support and \\nthe feature di fferences between Windows and Linux, read the FAQ. \\nThe main benefits of Azure Kubernetes Service (AKS) are:  \\n\\u2022 Identity and security management  \\n\\u2022 Integrated logging and monitoring  \\n\\u2022 Cluster node and pod scaling.  \\n\\u2022 Ingress with HTTP application routing  \\n\\u2022 AKS supports the Docker image format. For private storage of your Docker images, you can \\nintegrate AKS with Azure Container Registry (ACR).  \\nIf you are already working with open -source orchestrators like Kubernetes, Docker Swarm, or DC/OS, \\nyou don\\u2019t need to change your existing management practices to move container work\", \"loads to the \\ncloud. Use the application management tools that you\\u2019re already familiar with and connect via the \\nstandard API endpoints for the orchestrator of your choice.  \\nChoosing Azure compute platforms for container -\\nbased applications  \\nAs you have noticed after reading the previous sections, Azure is an open cloud that offers multiple \\nchoices. You can use the best fit for your needs, however, it also surfaces questions about what \\nproduct/technology you should use for your containerized a pplications.  \\nAs a by-default  recommendation, the following is the main criteria recommended in this guidance:  \\n\\u2022 Single monolithic app:  Choose Azure App Service  \\n\\u2022 N-Tier app:  Choose orchestrators such as Azure Kubernetes Service (AKS) or App Service if \\nyou have a single or a few back -end services  \\n\\u2022 Microservices:  Choose AKS or Azure Web Apps for Containers  \\n\\u2022 Serverless functions & event handlers:  Choose Azure Functions  \\n\\u2022 Large -scale Batch:  Choose Azure Batch   \\n29 CHAPTER\", \" 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n However, this recommendation should be taken with a pinch of salt, as the product\\u2019s selection will \\ndepend on your specific application\\u2019s needs and characteristics. Not all applications are the same even \\nwhen initially they might look similar types.  \\nAfter a deeper analysis of the application\\u2019s needs, the product selected could be different. But, as a \\nstarting point, it is good to have initial guidance from where you can start evaluating and testing \\nbased on certain priority.  \\nAdditional resources  \\n\\u2022 Choose an Azure compute service for your application  \\n  https://learn.microsoft.com/azure/architecture/guide/technology -choices/compute -decision -\\ntree \\nBuild resilient services ready for the cloud: Embrace \\ntransient failures in the cloud  \\nResiliency is the ability to recover from failures and continue to function. Resiliency is not about \\navoiding failures, but accepting the fact that failures will occur, and\", \" then responding to them in a way \\nthat avoids downtime or data loss. The goal of res iliency is to return the application to a fully \\nfunctioning state after a failure.  \\nYour application is ready for the cloud when, at a minimum, it implements a software -based model of \\nresiliency, rather than a hardware -based model. Your cloud application must embrace the partial \\nfailures that will certainly occur. Design or partially refa ctor your application to achieve resiliency with \\nexpected partial failures. It should be designed to cope with partial failures, like transient network \\noutages and nodes, or VMs crashing in the cloud. Even containers being moved to a different node \\nwithin an orchestrator cluster can cause intermittent short failures within the application.  \\nHandling partial failure  \\nIn a cloud -based application, there\\u2019s an ever -present risk of partial failure. For instance, a single \\nwebsite instance or a container might fail, or it might be unavailable or unresponsive f\", \"or a short time. \\nOr, a single VM or server might crash.  \\nBecause clients and services are separate processes, a service might not be able to respond in a timely \\nmanner to a client\\u2019s request. The service might be overloaded and respond slowly to requests, or it \\nmight not be accessible for a short time because of network issues.  \\nFor example, consider a monolithic .NET application that accesses a database in Azure SQL Database. \\nIf the Azure SQL database or any other third -party service is unresponsive for a brief time (an Azure \\nSQL database might be moved to a different node or ser ver, and be unresponsive for a few seconds), \\nwhen the user tries to do any action, the application might crash and show an exception at the same \\nmoment.   \\n30 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n A similar scenario might occur in an app that consumes HTTP services. The network or the service \\nitself might not be available in the cloud during a short, transient \", \"failure.  \\nA resilient application like the one shown in Figure 4 -9 should implement techniques like \\u201cretries with \\nexponential backoff\\u201d to give the application an opportunity to handle transient failures in resources. \\nYou also should use \\u201ccircuit breakers\\u201d in your ap plications. A circuit breaker stops an application from \\ntrying to access a resource when it\\u2019s actually a long -term failure. By using a circuit breaker, the \\napplication avoids provoking a denial of service to itself.  \\n \\nFigure 4 -9. Partial failures handled by retries with exponential backoff  \\nYou can use these techniques both in HTTP resources and in database resources. In Figure 4 -9, the \\napplication is based on a 3 -tier architecture, so you need these techniques at the services level (HTTP) \\nand at the data tier level (TCP). In a monolithic app lication that uses only a single app tier in addition \\nto the database (no additional services or microservices), handling transient failures at the database \\nconnection\", \" level might be enough. In that scenario, just a particular configuration of the database  \\nconnection is required.  \\nWhen implementing resilient communications that access the database, depending on the version of \\n.NET you are using, it can be straightforward (for example, with Entity Framework 6 or later . It\\u2019s just a \\nmatter of configuring the database connection). Or, you might need to use additional libraries like the \\nTransient Fault Handling Application Block  (for earlier versions of .NET), or even implement your own \\nlibrary.  \\nWhen implementing HTTP retries and circuit breakers, the recommendation for .NET is to use the \\nPolly  library, which targets .NET Standard 1.1 (coverage: .NET Core 1.0, Mono, Xamarin, UWP, WP8.1+) \\nand .NET Standard 2.0+ (coverage: .NET Core 2.0+, .NET Core 3.0 and later, Mono, Xamarin and UWP \\ntargets). The nuget package also includes direct targets for .N ET Framework 4.6.1 and 4.7.2.  \\nTo learn how to implement strategies for handling partial failu\", \"res in the cloud, see the following \\nreferences.  \\nAdditional resources  \\n\\u2022 Implementing resilient communication to handle partial failure  \\n \\n31 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n   https://learn.microsoft.com/dotnet/architecture/microservices/implement -resilient -\\napplications/partial -failure -strategies  \\n\\u2022 Entity Framework connection resiliency and retry logic (version 6 and later)  \\n  https://learn.microsoft.com/ef/ef6/fundamentals/connection -resiliency/retry -logic  \\n\\u2022 The Transient Fault Handling Application Block  \\n\\u2022 https://learn.microsoft.com/previous -versions/msp -n-p/hh680934(v=pandp.50)  \\n\\u2022 Polly library for resilient HTTP communication  \\n  https://github.com/App -vNext/Polly  \\nModernize your apps with monitoring and telemetry  \\nWhen you run an application in production, it\\u2019s critical that you have insights about how your \\napplication is performing. Is it performing at a high level? Are users getting errors, or is the applicati\", \"on \\nstable and reliable? You need rich performance monit oring, powerful alerting, and dashboards to help \\nensure that your application is available and performing as expected. You also need to be able to see \\nquickly if there\\u2019s a problem, determine how many customers are affected, and perform a root -cause \\nanalysi s to find and fix the issue.  \\nMonitor your application with Application Insights  \\nApplication Insights is an extensible Application Performance Management (APM) service for web \\ndevelopers who work on multiple platforms. Use it to monitor your live web application. Application \\nInsights automatically detects performance anomalies. It incl udes powerful analytics tools to help you \\ndiagnose issues, and to help you understand what users actually do with your app. Application \\nInsights is designed to help you continuously improve performance and usability. It works for apps on \\na wide variety of platforms, including .NET, Node.js, and J2EE, whether hosted on -premises or in \", \"the \\ncloud. Application Insights integrates with your DevOps processes, and has connection points to \\nvarious development tools.  \\nFigure 4 -10 shows an example of how Application Insights monitors your application and how it \\nsurfaces those insights to a dashboard.   \\n32 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n  \\nFigure 4 -10. Application Insights monitoring dashboard  \\nMonitor your Docker infrastructure with Log Analytics and its \\nContainer Monitoring solution  \\nAzure Log Analytics  is part of the Microsoft Azure overall monitoring solution . It\\u2019s also a service in \\nOperations Management Suite (OMS) . Log Analytics monitors cloud and on -premises environments \\n(OMS for on -premises) to help maintain availability and performance. It collects data generated by \\nresources in your cloud and on -premises environments and from other monitoring tools to provide \\nanalysis across multiple sources.  \\nIn relation to Azure infrastructure logs, Log Analytics, a\", \"s an Azure service, ingests log and metric data \\nfrom other Azure services (via Azure Monitor ), Azure VMs, Docker containers, and on -premises or \\nother cloud infrastructures. Log Analytics offers flexible log search and out -of-the box analytics on top \\nof this data. It provides rich tools that you can use to analyze data across sources, it allows co mplex \\nqueries across all logs, and it can proactively alert based on specified conditions. You can even collect \\ncustom data in the central Log Analytics repository, where you can query and visualize it. You can also \\ntake advantage of the Log Analytics buil t-in solutions to immediately gain insights into the security \\nand functionality of your infrastructure.  \\nYou can access Log Analytics through the OMS portal or the Azure portal, which run in any browser, \\nand provide you with access to configuration settings and multiple tools to analyze and act on \\ncollected data.  \\nThe Container Monitoring solution  in Log Analytics helps you vi\", \"ew and manage your Docker and \\nWindows Container hosts in a single location. The solution shows which containers are running, what \\n \\n33 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n container image they\\u2019re running, and where containers are running. You can view detailed audit \\ninformation, including commands that are being used with containers. You can also troubleshoot \\ncontainers by viewing and searching centralized logs, without need ing to remotely view Docker or \\nWindows hosts. You can find containers that might be noisy and consuming excess resources on a \\nhost. Additionally, you can view centralized CPU, memory, storage, and network usage, and \\nperformance information, for containers.  On computers running Windows, you can centralize and \\ncompare logs from Windows Server, Hyper -V, and Docker containers. The solution supports the \\nfollowing container orchestrators:  \\n\\u2022 Docker Swarm  \\n\\u2022 DC/OS  \\n\\u2022 Kubernetes  \\n\\u2022 Red Hat OpenShift  \\nFigure 4 -11 show\", \"s the relationships between various container hosts and agents and OMS.  \\n \\nFigure 4 -11. Log Analytics Container Monitoring solution  \\nYou can use the Log Analytics Container Monitoring solution to:  \\n\\u2022 See information about all container hosts in a single location.  \\n\\u2022 Know which containers are running, what image they\\u2019re running, and where they\\u2019re running.  \\n\\u2022 See an audit trail for actions on containers.  \\n\\u2022 Troubleshoot by viewing and searching centralized logs without remote login to the Docker \\nhosts.  \\n\\u2022 Find containers that might be \\u201cnoisy neighbors,\\u201d and be consuming excess resources on a \\nhost.  \\n \\n34 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n \\u2022 View centralized CPU, memory, storage, and network usage, and performance information, for \\ncontainers.  \\nAdditional resources  \\n\\u2022 Overview of monitoring in Microsoft Azure  \\nhttps://learn.microsoft.com/azure/azure -monitor/overview  \\n\\u2022 What is Application Insights?  \\nhttps://learn.microsoft.com/azur\", \"e/azure -monitor/app/app -insights -overview  \\n\\u2022 What is Log Analytics?  \\nhttps://learn.microsoft.com/azure/log -analytics/log -analytics -overview  \\n\\u2022 Container Monitoring solution in Azure Monitor  \\nhttps://learn.microsoft.com/azure/azure -monitor/insights/containers  \\n\\u2022 Overview of Azure Monitor  \\nhttps://learn.microsoft.com/azure/azure -monitor/overview  \\n\\u2022 What is Operations Management Suite (OMS)?  \\nhttps://learn.microsoft.com/azure/operations -management -suite/operations -management -suite -\\noverview  \\nModernize your app\\u2019s lifecycle with CI/CD pipelines \\nand DevOps tools in the cloud  \\nToday\\u2019s businesses need to innovate at a rapid pace to be competitive in the marketplace. Delivering \\nhigh-quality, modern applications requires DevOps tools and processes that are critical to implement \\nthis constant cycle of innovation. With the right DevO ps tools, developers can streamline continuous \\ndeployment and get innovative applications into the hands of users more quickly.  \\nAlthough \", \"continuous integration and deployment practices are well established, the introduction of \\ncontainers introduces new considerations, particularly when you are working with multi -container \\napplications.  \\nAzure DevOps Services supports continuous integration and deployment of multi -container \\napplications to various environments through the official Azure DevOps Services deployment tasks:  \\n\\u2022 Deploy to an Azure Web App for Containers  \\n\\u2022 Deploy to Azure Kubernetes Service  \\nBut you can also deploy to Docker Swarm  or DC/OS by using Azure DevOps Services script -based \\ntasks.   \\n35 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n To continue facilitating deployment agility, these tools provide excellent dev -to-test-to-production \\ndeployment experiences for container workloads, with a choice of development and CI/CD solutions.  \\nFigure 4 -12 shows a continuous deployment pipeline that deploys to a Kubernetes cluster in Azure \\nContainer Service.  \\n \\nFigure 4\", \" -12. Azure DevOps Services continuous deployment pipeline, deploying to a Kubernetes cluster  \\nMigrate to hybrid cloud scenarios  \\nSome organizations and enterprises can\\u2019t migrate some of their applications to public clouds like \\nMicrosoft Azure or any other public cloud due to regulations or their own policies. However, it\\u2019s likely \\nthat any organization might benefit from having some of their applications in the public cloud and \\nother applications on -premises. But a mixed environment can lead to excessive complexity in \\nenvironments due to different platforms and technologies used in public clouds versus on -premises \\nenvironments.  \\nMicrosoft provides the best hybrid cloud solution, one in which you can optimize your existing assets \\non-premises and in the public cloud, while you ensure consistency in an Azure hybrid cloud. You can \\nmaximize existing skills, and get a flexible, unified approach to building apps that can run in the cloud \\nor on -premises, thanks to Azure Stack (on\", \" -premises) and Azure (public cloud).  \\nWhen it comes to security, you can centralize management and security across your hybrid cloud. You \\ncan get control over all assets, from your datacenter to the cloud, by providing single sign -on to on -\\npremises and cloud apps. You accomplish this functiona lity by extending Active Directory to a hybrid \\ncloud, and by using identity management.  \\nFinally, you can distribute and analyze data seamlessly, use the same query languages for cloud and \\non-premises assets, and apply analytics and deep learning in Azure to enrich your data, regardless of \\nits source.  \\nAzure Stack  \\nAzure Stack is a hybrid cloud platform that lets you deliver Azure services from your organization\\u2019s \\ndatacenter. Azure Stack is designed to support new options for your modern applications in key \\n \\n36 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n scenarios, like edge and unconnected environments, or meeting specific security and compliance \\n\", \"requirements.  \\nFigure 4 -13 shows an overview of the true hybrid cloud platform that Microsoft offers.  \\n \\nFigure 4 -13. Microsoft hybrid cloud platform with Azure Stack and Azure  \\nAzure Stack is offered in two deployment options, to meet your needs:  \\n\\u2022 Azure Stack integrated systems  \\n\\u2022 Azure Stack Development Kit  \\nAzure Stack integrated systems  \\nAzure Stack integrated systems are offered through a partnership of Microsoft and hardware partners. \\nThe partnership creates a solution that offers cloud -paced innovation that is balanced with simplicity \\nin management. Because Azure Stack is offered as an integrated system of hardware and software, \\nyou get the right amount of flexibility and control, while still adopting innovatio n from the cloud. \\nAzure Stack integrated systems range in size from 4 to 12 nodes, and are jointly supported by the \\nhardware partner and Microsoft. Use Azure Stack integrated systems to implement new scenarios for \\nyour production workloads.  \\nAzure Stack\", \" Development Kit  \\nMicrosoft Azure Stack Development Kit is a single -node deployment of Azure Stack, which you can \\nuse to evaluate and learn about Azure Stack. You can also use Azure Stack Development Kit as a \\n \\n37 CHAPTER 3 | Modernize existing .NET apps to Cloud -Optimized applications  \\n developer environment, where you can develop using APIs and tooling that are consistent with Azure. \\nAzure Stack Development Kit is not intended to be used as a production environment.  \\nAdditional resources  \\n\\u2022 Azure hybrid cloud  \\n  https://azure.microsoft.com/overview/hybrid -cloud/  \\n\\u2022 Azure Stack  \\n  https://azure.microsoft.com/overview/azure -stack/  \\n\\u2022 Active Directory Service Accounts for Windows Containers  \\n  https://learn.microsoft.com/virtualization/windowscontainers/manage -containers/manage -\\nserviceaccounts  \\n\\u2022 Create a container with Active Directory support  \\n  https://learn.microsoft.com/archive/blogs/containerstuff/create -a-container -with-active -\\ndirectory -support  \\n\\u2022 Azure\", \" Hybrid Benefit licensing  \\n  https://azure.microsoft.com/pricing/hybrid -benefit/   \\n38 CHAPTER 4 | Walkthroughs and technical get started overview  \\n CHAPTER  4 \\nWalkthroughs and \\ntechnical get started \\noverview  \\nTo limit the size of this e -book, additional technical documentation and the full walkthroughs were \\nmade available in a GitHub repository. The online series of walkthroughs that is described in this \\nchapter covers the step -by-step setup of the multiple env ironments that are based on Windows \\nContainers, and deployment to Azure.  \\nThe following sections explain what each walkthrough is about, its objectives and high -level vision, \\nand provides a diagram of the tasks that are involved. You can get the walkthroughs themselves in the \\neShopModernizing  apps GitHub repo wiki at https://github.com/dotnet -\\narchitecture/eShopModernizing/wiki . \\nTechnical walkthrough list  \\nThe following get -started walkthroughs provide consistent and comprehensive technical guidance for \\nsa\", \"mple apps that you can lift and shift by using containers, and then move by using multiple \\ndeployment choices in Azure.  \\nEach of the following walkthroughs uses the new sample eShopLegacy and eShopModernizing apps, \\nwhich are available on GitHub at https://github.com/dotnet -architecture/eShopModernizing . \\n\\u2022 Tour of eShop legacy apps (baseline apps to modernize)  \\n\\u2022 Containerize your existing ASP.NET web apps (WebForms & MVC) with Windows \\nContainers  \\n\\u2022 Containerize your existing WCF services (N -Tier apps) with Windows Containers  \\n\\u2022 Deploy your Windows Containers -based app to Azure VMs  \\n\\u2022 Deploy your Windows Containers -based apps to Kubernetes in Azure Container Service   \\n39 CHAPTER 4 | Walkthroughs and technical get started overview  \\n Walkthrough 1: Tour of eShop legacy apps  \\nTechnical walkthrough availability  \\nThe full technical walkthrough is available in the eShopModernizing GitHub repo wiki:  \\neShopModernizing wiki walkthroughs  \\nOverview  \\nIn this walkthrough, you ca\", \"n explore the initial implementation of three sample legacy applications. \\nThe first two sample web apps have a monolithic architecture, and were created by using classic \\nASP.NET. One application is based on ASP.NET 4.x MVC; the s econd application is based on ASP.NET \\n4.x Web Forms. The third app is a 3 -Tier app composed by a client WinForms app and a server -side \\nWindows Communication Foundation (WCF)  service.  \\nAll these applications are available at the eShopModernizing GitHub repo . \\nGoals  \\nThe main goal of this walkthrough is simply to get familiar with these apps, and with their code and \\nconfiguration. You can configure the apps so that they generate and use mock data, without using the \\nSQL database, for testing purposes. This optional conf ig is based on dependency injection, in a \\ndecoupled way.  \\nScenario 1: ASP.NET Web apps  \\nThe figure below shows the simple scenario of the original legacy ASP.NET web applications.   \\n40 CHAPTER 4 | Walkthroughs and technical get sta\", \"rted overview  \\n  \\nFrom a business domain perspective, both apps offer the same catalog management features. \\nMembers of the eShop enterprise team would use the app to view and edit the product catalog.  \\nThe next figure shows the initial app screenshots.  \\n \\nDependencies in ASP.NET 4.x or earlier versions (either for MVC or for Web Forms) means that these \\napplications won\\u2019t run on .NET Core unless the code is fully rewritten by using ASP.NET Core MVC.  \\nScenario 2: WCF service and WinForms client app (3 -Tier app)  \\nThe figure below shows the simple scenario of the original 3 -Tier legacy application.  \\n \\n41 CHAPTER 4 | Walkthroughs and technical get started overview  \\n  \\nBenefits  \\nThe benefits of this walkthrough are simple: Just get familiar with the code and initial apps.  \\nNext steps  \\nExplore this content more in -depth on the GitHub wiki:  \\n\\u2022 Tour on the baseline ASP.NET MVC and Web Forms \\u201clegacy\\u201d apps  \\n\\u2022 Tour on the baseline WCF service and WinForms (3 -Tier) \\u201clegacy\\u201d app  \\n\", \"Walkthrough 2: Containerize your existing .NET \\napplications with Windows Containers  \\nOverview  \\nUse Windows Containers to improve deployment of existing .NET applications, like those based on \\nMVC, Web Forms, or WCF, to production, development, and test environments.  \\nGoals  \\nThe goal of this walkthrough is to show you several options for containerizing an existing .NET \\nFramework application. You can:  \\n\\u2022 Containerize your application by using Visual Studio 2022 Tools for Docker  (Visual Studio \\n2017 or later versions).  \\n\\u2022 Containerize your application by manually adding a Dockerfile , and then using the Docker CLI . \\n\\u2022 Containerize your application by using the Img2Docker  tool (an open -source tool from \\nDocker).  \\n \\n42 CHAPTER 4 | Walkthroughs and technical get started overview  \\n This walkthrough focuses on the Visual Studio 2022 Tools for Docker approach, but the other two \\napproaches are fairly similar in regard to using Dockerfiles.  \\nScenario 1: Containerized ASP.NET web a\", \"pps  \\nFigure below shows the scenario for containerized eShop legacy web apps applications.  \\n \\nScenario 2: Containerized WCF service  \\nFigure below shows the scenario for a 3 -Tier app with a containerized WCF service.  \\n \\n43 CHAPTER 4 | Walkthroughs and technical get started overview  \\n  \\nBenefits  \\nThere are advantages to running your monolithic application in a container. First, you create an image \\nfor the application. From that point on, every deployment runs in the same environment. Every \\ncontainer uses the same OS version, has the same version of  dependencies installed, uses the same \\n.NET framework version, and is built by using the same process. Basically, you control the \\ndependencies of your application by using a Docker image. The dependencies travel with the \\napplication when you deploy the con tainers.  \\nAn additional benefit is that developers can run the application in the consistent environment that\\u2019s \\nprovided by Windows Containers. Issues that appear only with cer\", \"tain versions can be spotted \\nimmediately, instead of surfacing in a staging or production environment. Differences in development \\nenvironments used by members of the development team matter less when applications run in \\ncontainers.  \\nContainerized applications also have a flatter scale -out curve. Containerized apps enable you to have \\nmore application and service instances (based on containers) in a VM or physical machine compared \\nto regular application deployments per machine. This app roach translates to higher density and fewer \\nrequired resources, especially when you use orchestrators like Kubernetes.  \\nContainerization, in ideal situations, does not require making any changes to the application code \\n(C#). In most scenarios, you just need the Docker deployment metadata files (Dockerfiles and Docker \\nCompose files).  \\nNext steps  \\nExplore this content more in -depth on the GitHub wiki:  \\n\\u2022 How to containerize the .NET Framework web apps with Windows Containers and Docker  \\n\\u2022 A\", \"dding Docker Support to a WCF service  \\n \\n44 CHAPTER 4 | Walkthroughs and technical get started overview  \\n Walkthrough 3: Deploy your Windows Containers -\\nbased app to Azure VMs  \\nTechnical walkthrough availability  \\nThe full technical walkthrough is available in the eShopModernizing GitHub repo wiki: \\nhttps://github.com/dotnet -architecture/eShopModernizing/wiki/06. -Deploying -your-Windows -\\nContainers -based -app-into-Azure -VMs-(Including -CI-CD) \\nOverview  \\nDeploying to a Docker host on a Windows Server 2016 Virtual Machine (VM) in Azure lets you quickly \\nset up development/test/staging environments. It also gives you a common place for testers or \\nbusiness users to validate the app. VMs also can be valid Infra structure as a Service (IaaS) production \\nenvironments.  \\nGoals  \\nThe goal of this walkthrough is to show you the multiple alternatives you have when you deploy \\nWindows Containers to Azure VMs that are based on Windows Server 2016 or later versions.  \\nScenarios  \\nSeveral \", \"scenarios are covered in this walkthrough.   \\n45 CHAPTER 4 | Walkthroughs and technical get started overview  \\n Scenario A: Deploy to an Azure VM from a dev PC through Docker Engine \\nconnection  \\n \\nFigure 5 -4. Deploy to an Azure VM from a dev PC through a Docker Engine connection  \\nScenario B: Deploy to an Azure VM through a Docker Registry  \\n \\nFigure 5 -5. Deploy to an Azure VM through a Docker Registry  \\n \\n46 CHAPTER 4 | Walkthroughs and technical get started overview  \\n Scenario C: Deploy to an Azure VM from CI/CD pipelines in Azure DevOps Services  \\n \\nFigure 5 -6. Deploy to an Azure VM from CI/CD pipelines in Azure DevOps Services  \\nAzure VMs for Windows Containers  \\nAzure VMs for Windows Containers are VMs based on Windows Server 2016, Windows 10, or later \\nversions, both with Docker Engine set up. In most cases, Windows Server 2016 is used in the Azure \\nVMs.  \\nAzure currently provides a VM named Windows Server 2016 with Containers . You can use this VM \\nto try the new Windows Se\", \"rver Container feature, with either Windows Server Core or Windows Nano \\nServer. Container OS images are installed, and then the VM is ready to use with Docker.  \\nBenefits  \\nAlthough Windows Containers can be deployed to on -premises Windows Server 2016 VMs, when you \\ndeploy to Azure, you get an easier way to get started, with ready -to-use Windows Server Container \\nVMs. You also get a common online location that\\u2019s accessible to t esters, and automatic scalability \\nthrough Azure virtual machine scale sets.  \\nNext steps  \\nExplore this content more in -depth on the GitHub wiki:  \\nhttps://github.com/dotnet -architecture/eShopModernizing/wiki/06. -Deploying -your-Windows -\\nContainers -based -app-into-Azure -VMs-(Including -CI-CD) \\n \\n47 CHAPTER 4 | Walkthroughs and technical get started overview  \\n Walkthrough 4: Deploy your Windows Containers -\\nbased apps to Azure Container Instances (ACI)  \\nTechnical walkthrough availability  \\nThe full technical walkthrough is available in the eShopModern\", \"izing GitHub repo wiki:  \\nDeploying the Apps to ACI (Azure Container Instances)  \\nOverview  \\nAzure Container Instances (ACI)  is the quickest way to have a Containers dev/test/staging \\nenvironment where you can deploy single instances of containers.  \\nGoals  \\nThis walkthrough shows you the main scenarios when deploying Windows Containers to Azure \\nContainer Instances (ACI) and how you can deploy eShopModernizing Apps into ACI.  \\nScenarios  \\nThere can be variations about deploying the eShopModernizing apps into ACI such as deploying just \\none or all of the apps (MVC app, WebForms app or WCF service). In the following scenario shown \\nbelow, you can see the ASP.NET MVC app plus the SQL Server cont ainer both of them deployed as \\ncontainers into ACI (Azure Container Instances).  \\n \\nBenefits  \\nAzure Container Instances makes it easy to create and manage Docker containers in Azure, without \\nhaving to provision virtual machines or adopt a higher -level service. With ACI, you can directly depl\", \"oy \\na Windows container in Azure and expose it to the inter net with a fully qualified domain name (FQDN) \\n \\n48 CHAPTER 4 | Walkthroughs and technical get started overview  \\n in a matter of seconds (Provided that you have the Windows Container image ready in a Docker \\nregistry like Docker Hub or Azure Container Registry).  \\nConsiderations  \\nDeploying Windows Containers with either full .NET Framework / ASP.NET or SQL Server into Azure \\nContainer Instances (ACI) is not quite as fast as deploying to a regular Docker Host (like a Windows \\nServer 2016 with Windows Containers) because the Docker ima ge has to be downloaded (pulled from \\nthe Docker registry) every time and the sizes of the SQL container image (15.1 GB) and the ASP.NET \\ncontainer image (13.9 GB) are significantly large, however it is much cheaper than maintaining your \\nown docker host (per manently on -line Windows Server 2016 with Windows Containers VM in Azure) \\nnot to mention a whole orchestrator like Kubernetes in Azure (\", \"AKS) which is, on the other hand, a \\ngreat choice for production deployments.  \\nAs the main conclusion, using Azure Container Instances is a very compelling option for Dev/Test \\nscenarios and for CI/CD pipelines.  \\nNext steps  \\nExplore this content more in -depth on the GitHub wiki:  \\nhttps://github.com/dotnet -architecture/eShopModernizing/wiki/05. -Deploying -the-Apps -to-ACI-\\n(Azure -Container -Instances)  \\nWalkthrough 5: Deploy your Windows Containers -\\nbased apps to Kubernetes in Azure Container \\nService  \\nTechnical walkthrough availability  \\nThe full technical walkthrough is available in the eShopModernizing GitHub repo wiki:  \\nhttps://github.com/dotnet -architecture/eShopModernizing/wiki/04. -How-to-deploy -your-Windows -\\nContainers -based -apps -into-Kubernetes -in-Azure -Container -Service -(Including -CI-CD) \\nOverview  \\nAn application that\\u2019s based on Windows Containers will quickly need to use platforms, moving even \\nfurther away from IaaS VMs. This approach is needed to easi\", \"ly achieve high scalability and better \\nautomated scalability, and for a significant improvement in automated deployments and versioning. \\nYou can achieve these goals by using the orchestrator Kubernetes , available in Azure Container \\nServices .  \\n49 CHAPTER 4 | Walkthroughs and technical get started overview  \\n Goals  \\nThe goal of this walkthrough is to learn how to deploy a Windows Container \\u2013based application to \\nKubernetes (also called K8s) in Azure Container Service. Deploying to Kubernetes from scratch is a \\ntwo-step process:  \\n1. Deploy a Kubernetes cluster to Azure Container Service.  \\n2. Deploy the application and related resources to the Kubernetes cluster.  \\nScenarios  \\nScenario A: Deploy directly to a Kubernetes cluster from a dev environment  \\n \\nFigure 5 -7. Deploy directly to a Kubernetes cluster from a development environment  \\n \\n50 CHAPTER 4 | Walkthroughs and technical get started overview  \\n Scenario B: Deploy to a Kubernetes cluster from CI/CD pipelines in Azure Dev\", \"Ops \\nServices  \\n \\nFigure 5 -8. Deploy to a Kubernetes cluster from CI/CD pipelines in Azure DevOps Services  \\nBenefits  \\nThere are many benefits to deploying to a cluster in Kubernetes. The biggest benefit is that you get a \\nproduction -ready environment in which you can scale out the application based on the number of \\ncontainer instances you want to use (inner -scalability in the existing nodes), and based on the number \\nof nodes or VMs in the cluster (global scalability of the cluster).  \\nAzure Container Service optimizes popular open -source tools and technologies specifically for Azure. \\nYou get an open solution that offers portability, both for your containers and for your application \\nconfiguration. You select the size, the number of hosts , and the orchestrator tools -Container Service \\nhandles everything else.  \\nWith Kubernetes, developers can progress from thinking about physical and virtual machines, to \\nplanning a container -centric infrastructure that facilitates the follo\", \"wing capabilities, among others:  \\n\\u2022 Applications based on multiple containers  \\n\\u2022 Replicating container instances and horizontal autoscaling  \\n\\u2022 Naming and discovering (for example, internal DNS)  \\n\\u2022 Balancing loads  \\n \\n51 CHAPTER 4 | Walkthroughs and technical get started overview  \\n \\u2022 Rolling updates  \\n\\u2022 Distributing secrets  \\n\\u2022 Application health checks  \\nNext steps  \\nExplore this content more in -depth on the GitHub wiki: https://github.com/dotnet -\\narchitecture/eShopModernizing/wiki/04. -How-to-deploy -your-Windows -Containers -based -apps -into-\\nKubernetes -in-Azure -Container -Service -(Including -CI-CD) \\nWalkthrough 6: Deploy your Windows Containers -\\nbased apps to Azure App Service for Containers  \\nTechnical walkthrough availability  \\nThe full technical walkthrough is available in the eShopModernizing GitHub repo wiki:  \\nhttps://github.com/dotnet -architecture/eShopModernizing/wiki/Deploy -Windows -Container -to-\\nAzure -App-Service  \\nOverview  \\nA simple containerized applicat\", \"ion using Windows Containers can easily be deployed to Azure App \\nService for Containers. This approach is the recommended approach for most Windows Container -\\nbased applications.  \\nGoals  \\nThe goal of this walkthrough is to learn how to deploy a Windows Container \\u2013based application to \\nAzure App Service for Containers from a registry (Docker Hub or Azure Container Registry).   \\n52 CHAPTER 4 | Walkthroughs and technical get started overview  \\n Scenario  \\n \\nBenefits  \\nDeploying to Azure App Service for Containers offers the benefits of containers paired with the PaaS \\nbenefits of Azure App Service. The app service can easily be scaled both vertically and horizontally, \\nand can be configured to autoscale to meet changing d emands. Updates can be performed with zero \\ndowntime and the configuration of continuous deployment from a registry is easily configured as well.  \\nNext steps  \\nExplore this content more in -depth on the GitHub wiki: https://github.com/dotnet -\\narchitecture/eShopModer\", \"nizing/wiki/Deploy -Windows -Container -to-Azure -App-Service  \\n \\n53 CHAPTER 5 | Conclusions  \\n CHAPTER  5 \\nConclusions  \\n\\u2022 Container -based solutions ultimately provide cost savings benefits. Containers are  a solution \\nto deployment problems because they remove the friction caused by an absence of \\ndependencies in production environments. By removing those issues, it improves Dev/Test, \\nDevOps, and production operations significantly.  \\n\\u2022 A Docker container is becoming the standard unit of deployment for any server -based \\napplication or service.  \\n\\u2022 For production environments, you should use an orchestrator (like Kubernetes) to host \\nscalable containers \\u2013based applications.  \\n\\u2022 Azure VMs hosting containers are a fast and simple way to create small Dev/Test \\nenvironments in the cloud.  \\n\\u2022 Azure SQL Database Managed Instance is recommended by default when migrating your \\nrelational databases from existing applications to Azure.  \\n\\u2022 Visual Studio 2022 and Image2Docker are basic tools \", \"for you to start modernizing your \\nexisting .NET applications with Windows Containers by accelerating the getting started \\nlearning curve.  \\n\\u2022 When placing containerized applications in production you will always create or adopt a \\nDevOps culture and DevOps tools for CI/CD pipelines, like Azure DevOps Services or Jenkins.  \\n\\u2022 Microsoft Azure provides the most comprehensive and complete environment to modernize \\nyour existing .NET Framework applications with Windows Containers, cloud infrastructure and \\nPaaS services.  \"]"