["NAJVAZNIUJE TOCKE NOVOG STATUTA\n\n1. Demokratski statut\nSvi Clanovi Skupstine biraju se na izborima od strane svih Clanova Kluba cime se trajno napusta\npraksa da Izvrsni ili Nadzorni odbor imenuju Clanove Skupstine, a osigurava se i obvezna\nprisutnost u Skupstini i drugih glasova osim vladajucih. Ovo je prvi istinski demokratski Statut\nu povijesti GNK Dinama.\n\n2. Neposredna volja Clanova\nStatut omogucuje Clanovima da izravno i neposredno izaberu osobu koja Ce voditi Klub i biti\nodgovorna za postignute rezultate prema izbornom programu koji je dobio povjerenje Clanova.\nZa razliku od dosadasnjeg Statuta izborni legitimitet je spojen sa stvarnim utjecajem.\n\n3. Jasna moc i jasna odgovornost\nNakon izborne pobjede, Predsjednik Kluba preuzima i veliku moc i veliku odgovornost. U\nnjegovim su rukama svi alati potrebni za vodenje Kluba onako kako smatra da je najbolje.\nIstodobno, jasno preuzima odgovornost za svoje odluke i rezultate koje Klub pod njegovim\nvodstvom postigne.\n\n4. Upravijacka stabi", "lnost\nKada Predsjednik vodi Klub na temelju izbornog legitimiteta i programa kojeg se obvezao\nprovesti, uz suradnju i nadzor iskljucivo onih koji su taj program stvarali is njim bili na istoj listi\n— dakle, koji dijele istu ideju — te kada imaju podrsku Skupstine, upravijanje Klubom je stabilno.\nOdluka da tijela sluze, dok imaju demokratski legitimitet, provodenju jednog cilja, temeljena je\nna izbornim praksama i Sire u drustvu i drugim nogometnim Klubovima sa slicnim nacinom\nupravijanja. Nadzor nad takvim upravijanjem i programom koji su odabrali Clanovi ne mogu\nprovoditi oni koji su na izborima bili u manjini ili nisu stvorili i zastupali istu ideju.\n\n5. Jednostavnost - manje tijela i razlicitih funkcija\nNadzorni odbor i Izvrsni odbor spajaju se u jedinstveno tijelo, a funkcije Predsjednika Kluba i\nglavnog i odgovornog za rad Uprave preuzima ista osoba. Takoder, jedna osoba istodobno\nobnasa duznost predsjednika Nadzornog odbora i predsjedavajuceg u Skupstini, ne predvida\nse osnivanje", " npr. Etickog povjerenstva. Ove odluke pojednostavijuju i ujedinjuju tijela i funkcije\ns ciliem jednostavnijeg, jasnijeg i ucinkovitijeg upravljanja Klubom sto smatramo primjerenim\nza trenutnu fazu demokratskog i upravijackog razvoja Kluba. To, medutim, ne znaci da se isto\nu buducnosti nece mijenjati, a izborni proces, tijela i funkcije na slozeniji nacin razvijati.\n\n6. ZaStita Clanstva i izborne manjine\nNajjaca zastita Clanova od loseg upravijanja Klubom su izbori koji uvijek pruzaju priliku za\npromjenom vodstva. U najozbiljnijim scenarijima, za kljucna pitanja identiteta Kluba i rada\ntrenutne viasti u Klubu, Clanovi mogu pokrenuti referendum i njime Cak i inicirati prijevremene\nizbore. U Skupstini je manjini zajamceno najmanje 10% zastupnickih mjesta, bez obzira na\nizborni rezultat. Svaki Clan Skupstine — ukljucujuci i predstavnike manjine — ima pravo\nzatraziti i dobiti sve podatke o poslovanju Kluba koji nisu poslovna tajna. Time se osigurava\nmogucnost aktivnog sudjelovanja u radu K", "luba, zastupanja alternativnih stavova i\npropitkivanja donesenih odluka.\nNAJVAZNIJE KRITIKE NOVOG STATUTA\n\nZasto ulaze samo dvije liste?\n\nZbog Zakona o udrugama koji nalaze da Predsjednik Kluba kao osoba koja ga zastupa mora biti izglasan\nu Skupstini, a istovremeno Zeleci postovati izravnu i neposrednu volju Clanova, jedini nacin je da\nPredsjednik dolazi s liste koja je osvojila vecinu u Skupstini i da ga upravo ta veCcina u Skupstini potvrdi.\nKako bi se to osiguralo, kao i da se mogu izabrati druga nuZna tijela i odlucivati o vaznim pitanjima u\nSkupstinu ulaze samo dvije liste, pri Cemu Cclanovi jednoj daju vecinu glasova. Na taj nacin izbjegava se\nborba za glasove unutar Skupstine i preglasavanja, dok se istovremeno postuje volja Clanova. Jedan od\nkljucnih amandmana koje smo usvojili predvida da se, ako nijedna lista ne osvoji vecinu u prvom krugu,\norganizira drugi krug izbora s dvije liste koje su dobile najveci broj glasova, Cime se osigurava da jedna\nlista dobije vise od 50% glaso", "va i formira vlast u Skup$Stini. Pri izradi ovog prijedloga analizirali smo i\nstatut Boca Juniorsa, jednog od najvecih clanskih klubova u svijetu. U skupstini Boce pobjednicka lista\nautomatski dobiva 70% mijesta, c€ak i ako na izborima osvoji manje od 50% glasova i to zato Sto izbori\nprvenstveno sluze da se temeljem volje clanova formira ¢vrsta vlast koja zbog takvih odredbi zatim ima\nstabilnost u upravljanju, uz stalnu odgovornost prema Clanovima. Slican princip Zeljeli smo primijeniti\ni u Statutu GNK Dinama.\n\nZasto je Nadzorni odbor na istoj listi kao i Predsjednik i zaSto nema oporbe u Nadzornom odboru?\n\nClanovi na izborima demokratski biraju jedan program upravijanja na jedan mandat. Program stvaraju\nsvi Clanovi liste, a Predsjednik se nakon izbora za Skupstinu izdvaja iz SkupStine i njoj, ti. Nadzornom\nodboru kao njezinoj produzenoj ruci, odgovara za provodenje tog programa. Time se osigurava da oni\nkoji su dobili povjerenje Clanova i koji dijele istu izbornu ideju imaju ovliasti ", "i odgovornost nadzirati\nnjezino provodenje. Kada bi se Clanovi NO-a birali odvojeno od izbora Cclanova Skupstine, moglo bi se\ndogoditi da NO saCinjavaju Ijudi koji ne podrzavaju izabranog predsjednika niti njegov program s kojim\nje pobijedio na izborima, Sto je put u permanentnu nestabilnost upravljanja klubom. Predlozeni sustav\nusmjeren je na ucinkovitost i stabilnost zbog Cega brojni Clanski klubovi Clanove NO-a biraju na temelju\ncjelovitih lista, a ne pojedinacnih kandidatura. Ako viast ne ispunjava ocekivanja, oporba je moze\nprozvati u SkupSstini, Clanovi je mogu smijeniti referendumom ili se odluciti na davanje prilike drugoj\nopciji na sljedecim izborima. U Skupstini se zadrzava pluralizam kroz proporcionalno sudjelovanje\norganizirane oporbe, no ona ne bi trebala biti kao parlament koji se bavi bezbrojnim temama, nego\nkao tijelo koje podrzava stabilnu, demokratski izabranu vilast usmjerenu prema glavnom cilju — sto\nuspjesnijem sportskom rezultatu Kluba. Dodatno, javna revizija pos", "lovanja obvezno se prezentira svim\nClanovima. Takav sustav gdje s iste liste dolazi i Predsjednik te Nadzorni odbor, kakav primjerice koristi\ni Benfica, u praksi se pokazao uspjesnim i pruza ravnotezu izmedu stabilnosti viasti i demokratskog\nnadzora.\n\nZasto na izborima moze sudjelovati netko tko je Clan samo ove i prosle godine?\n\nNikada nece biti idealnog omjera kada se radi o kalendarskim godinama, ali volja nekog Clana da, makar\ni unutar kratkog vremena dva puta obnovi Clanstvo i uredi tako svoj status znaci prije svega i volju da\non participira u radu Kluba i to treba vrednovati. Prosla su vremena nepovjerenja prema Clanovima i\ntrazenja losih namjera. Od 56.000 clanova Kluba, manje od polovice cine punoljetni i poslovno\nsposobni Clanovi koji su to bili i prosle godine, odnosno Clanovi s pravom glasa. U pocecima izgradnje\ndemokratske kulture i Clanskog identiteta Kluba Zeljeli smo ukljuciti Sto veci broj clanova u demokratske\nprocese. Zato smo odlucili da pravo glasa imaju svi koji s", "u bili Clanovi i u prethodnoj godini, umjesto da\nse uvjetuje visegodisnje Cclanstvo, sto bi znacajno smanjilo broj onih koji mogu sudjelovati. Ova ce se\nodredba u buducnosti sigurno razmatrati, s mogucnoscu da se pravo glasa veze uz vise uzastopnih\ngodina Clanstva. Takoder, vrijedi istaknuti da u mnogim europskim Clanskim klubovima pravo glasa\nstjecu oni koji su Clanovi samo godinu dana.\n\nZaSto su Predsjednik SkupStine i Predsjednik Nadzornog odbora ista osoba?\n\nU Statutu ne postoji funkcija Predsjednika SkupStine, a skupStinskom sjednicom u pravilu predsjeda\nPredsjednik NO kojemu je to tek jedna od duznosti. Osoba koja predsjeda sjednicom Skupstine obavlja\ntek tehnicku funkciju i ne mora uvijek biti predsjednik NO. Predsjednik NO svoje stvarne nadleznosti\nisounjava u NO. Ne treba nam inflacija razlicitih Predsjednika u Klubu bez jasnih duznosti. Nadzorni\nodbor neodvojivi je dio SkupStine i s time se izbjegava nepotrebno udvostrucavanje pozicija i jasno\nrazdvaja nadleznost: predsjednik", " NO-a utjece iskljucivo na rad tog tijela, dok na ostale procese u\nSkupStini ne djeluje izvan svoje nadzorne uloge. Logicno je i proceduralno ispravno da osoba koja vodi\nSkupStinu vodi i tijelo koje je njezina produzena ruka. Osim toga, unutar Skupstine postoji dovoljan broj\ndrugih clanova koji, ako procijene da predsjednik NO-a odstupa od svojih oviasti, mogu pokrenuti\ninicijativu za izvanrednu sjednicu ili izmijeniti dnevni red.\n\nUvodi li se verbalni delikt i zasto nema Etickog povjerenstva?\n\nPojam verbalni delikt tice se iskljucivo odnosa drzave i pojedinca i potpuno je pogresno i neprimjereno\nnjegovo koristenje u vezi pravila ponaSanja jednog privatnog udruzenja osoba s viastitim pravilima ili\nmjerama, u kojima je udruzivanje potpuno dobrovoljno. U privatnim organizacijama, poput sportskih\nklubova, uobicajeno je postojanje internih pravila ponasanja te stegovnih postupaka i sankcija. Svaka\norganizacija ima pravo odrediti svoja pravila i svatko ima pravo ne biti dio te organizacije.", " Bitno je\nnaglasiti da, u slucaju izricanja bilo koje stegovne mjere — posebno one najteze, poput iskljucenja —\nclan ima pravo, nakon Sto iscrpi sve klupske instance, potraziti zastitu i kod nadleznog suda. U zadnje\ndvije godine nije se desio niti jedan slucaj koji je zahtijevao pokretanje stegovnog postupka i zbog toga\nnema niti smisla uspostavljanje dodatnog tijela koje bi se zvalo Eticko povjerenstvo i koje bi se samo\ntime bavilo. | najvaznije, raspisivanjem doticnih prekrsaja u Statutu nije bio cilj postavljanje temelja za\nsankcioniranje i iskljucivanje Clanova vec gradenje kulture Cclanskog Kluba na nacin da se jasnije\nkomunicira da Clan Kluba ima drugacija prava, ali i obaveze od navijaca Kluba.\n"]