["NAJVAZNIUJE TOCKE NOVOG STATUTA 1. Demokratski statut Svi Clanovi Skupstine biraju se na izborima od strane svih Clanova Kluba cime se trajno napusta praksa da Izvrsni ili Nadzorni odbor imenuju Clanove Skupstine, a osigurava se i obvezna prisutnost u Skupstini i drugih glasova osim vladajucih. Ovo je prvi istinski demokratski Statut u povijesti GNK Dinama. 2. Neposredna volja Clanova Statut omogucuje Clanovima da izravno i neposredno izaberu osobu koja Ce voditi Klub i biti odgovorna za postignute rezultate prema izbornom programu koji je dobio povjerenje Clanova. Za razliku od dosadasnjeg Statuta izborni legitimitet je spojen sa stvarnim utjecajem. 3. Jasna moc i jasna odgovornost Nakon izborne pobjede, Predsjednik Kluba preuzima i veliku moc i veliku odgovornost. U njegovim su rukama svi alati potrebni za vodenje Kluba onako kako smatra da je najbolje. Istodobno, jasno preuzima odgovornost za svoje odluke i rezultate koje Klub pod njegovim vodstvom postigne. 4. Upravijacka stabilnost Kada Predsjednik vodi Klub na temelju izbornog legitimiteta i programa kojeg se obvezao provesti, uz suradnju i nadzor iskljucivo onih koji su taj program stvarali is njim bili na istoj listi — dakle, koji dijele istu ideju — te kada imaju podrsku Skupstine, upravijanje Klubom je stabilno. Odluka da tijela sluze, dok imaju demokratski legitimitet, provodenju jednog cilja, temeljena je na izbornim praksama i Sire u drustvu i drugim nogometnim Klubovima sa slicnim nacinom upravijanja. Nadzor nad takvim upravijanjem i programom koji su odabrali Clanovi ne mogu provoditi oni koji su na izborima bili u manjini ili nisu stvorili i zastupali istu ideju. 5. Jednostavnost - manje tijela i razlicitih funkcija Nadzorni odbor i Izvrsni odbor spajaju se u jedinstveno tijelo, a funkcije Predsjednika Kluba i glavnog i odgovornog za rad Uprave preuzima ista osoba. Takoder, jedna osoba istodobno obnasa duznost predsjednika Nadzornog odbora i predsjedavajuceg u Skupstini, ne predvida se osnivanje npr. Etickog povjerenstva. Ove odluke pojednostavijuju i ujedinjuju tijela i funkcije s ciliem jednostavnijeg, jasnijeg i ucinkovitijeg upravljanja Klubom sto smatramo primjerenim za trenutnu fazu demokratskog i upravijackog razvoja Kluba. To, medutim, ne znaci da se isto u buducnosti nece mijenjati, a izborni proces, tijela i funkcije na slozeniji nacin razvijati. 6. ZaStita Clanstva i izborne manjine Najjaca zastita Clanova od loseg upravijanja Klubom su izbori koji uvijek pruzaju priliku za promjenom vodstva. U najozbiljnijim scenarijima, za kljucna pitanja identiteta Kluba i rada trenutne viasti u Klubu, Clanovi mogu pokrenuti referendum i njime Cak i inicirati prijevremene izbore. U Skupstini je manjini zajamceno najmanje 10% zastupnickih mjesta, bez obzira na izborni rezultat. Svaki Clan Skupstine — ukljucujuci i predstavnike manjine — ima pravo zatraziti i dobiti sve podatke o poslovanju Kluba koji nisu poslovna tajna. Time se osigurava mogucnost aktivnog sudjelovanja u radu Kluba, zastupanja alternativnih stavova i propitkivanja donesenih odluka. NAJVAZNIJE KRITIKE NOVOG STATUTA Zasto ulaze samo dvije liste? Zbog Zakona o udrugama koji nalaze da Predsjednik Kluba kao osoba koja ga zastupa mora biti izglasan u Skupstini, a istovremeno Zeleci postovati izravnu i neposrednu volju Clanova, jedini nacin je da Predsjednik dolazi s liste koja je", "osvojila vecinu u Skupstini i da ga upravo ta veCcina u Skupstini potvrdi. Kako bi se to osiguralo, kao i da se mogu izabrati druga nuZna tijela i odlucivati o vaznim pitanjima u Skupstinu ulaze samo dvije liste, pri Cemu Cclanovi jednoj daju vecinu glasova. Na taj nacin izbjegava se borba za glasove unutar Skupstine i preglasavanja, dok se istovremeno postuje volja Clanova. Jedan od kljucnih amandmana koje smo usvojili predvida da se, ako nijedna lista ne osvoji vecinu u prvom krugu, organizira drugi krug izbora s dvije liste koje su dobile najveci broj glasova, Cime se osigurava da jedna lista dobije vise od 50% glasova i formira vlast u Skup$Stini. Pri izradi ovog prijedloga analizirali smo i statut Boca Juniorsa, jednog od najvecih clanskih klubova u svijetu. U skupstini Boce pobjednicka lista automatski dobiva 70% mijesta, c€ak i ako na izborima osvoji manje od 50% glasova i to zato Sto izbori prvenstveno sluze da se temeljem volje clanova formira ¢vrsta vlast koja zbog takvih odredbi zatim ima stabilnost u upravljanju, uz stalnu odgovornost prema Clanovima. Slican princip Zeljeli smo primijeniti i u Statutu GNK Dinama. Zasto je Nadzorni odbor na istoj listi kao i Predsjednik i zaSto nema oporbe u Nadzornom odboru? Clanovi na izborima demokratski biraju jedan program upravijanja na jedan mandat. Program stvaraju svi Clanovi liste, a Predsjednik se nakon izbora za Skupstinu izdvaja iz SkupStine i njoj, ti. Nadzornom odboru kao njezinoj produzenoj ruci, odgovara za provodenje tog programa. Time se osigurava da oni koji su dobili povjerenje Clanova i koji dijele istu izbornu ideju imaju ovliasti i odgovornost nadzirati njezino provodenje. Kada bi se Clanovi NO-a birali odvojeno od izbora Cclanova Skupstine, moglo bi se dogoditi da NO saCinjavaju Ijudi koji ne podrzavaju izabranog predsjednika niti njegov program s kojim je pobijedio na izborima, Sto je put u permanentnu nestabilnost upravljanja klubom. Predlozeni sustav usmjeren je na ucinkovitost i stabilnost zbog Cega brojni Clanski klubovi Clanove NO-a biraju na temelju cjelovitih lista, a ne pojedinacnih kandidatura. Ako viast ne ispunjava ocekivanja, oporba je moze prozvati u SkupSstini, Clanovi je mogu smijeniti referendumom ili se odluciti na davanje prilike drugoj opciji na sljedecim izborima. U Skupstini se zadrzava pluralizam kroz proporcionalno sudjelovanje organizirane oporbe, no ona ne bi trebala biti kao parlament koji se bavi bezbrojnim temama, nego kao tijelo koje podrzava stabilnu, demokratski izabranu vilast usmjerenu prema glavnom cilju — sto uspjesnijem sportskom rezultatu Kluba. Dodatno, javna revizija poslovanja obvezno se prezentira svim Clanovima. Takav sustav gdje s iste liste dolazi i Predsjednik te Nadzorni odbor, kakav primjerice koristi i Benfica, u praksi se pokazao uspjesnim i pruza ravnotezu izmedu stabilnosti viasti i demokratskog nadzora. Zasto na izborima moze sudjelovati netko tko je Clan samo ove i prosle godine? Nikada nece biti idealnog omjera kada se radi o kalendarskim godinama, ali volja nekog Clana da, makar i unutar kratkog vremena dva puta obnovi Clanstvo i uredi tako svoj status znaci prije svega i volju da on participira u radu Kluba i to treba vrednovati. Prosla", "su vremena nepovjerenja prema Clanovima i trazenja losih namjera. Od 56.000 clanova Kluba, manje od polovice cine punoljetni i poslovno sposobni Clanovi koji su to bili i prosle godine, odnosno Clanovi s pravom glasa. U pocecima izgradnje demokratske kulture i Clanskog identiteta Kluba Zeljeli smo ukljuciti Sto veci broj clanova u demokratske procese. Zato smo odlucili da pravo glasa imaju svi koji su bili Clanovi i u prethodnoj godini, umjesto da se uvjetuje visegodisnje Cclanstvo, sto bi znacajno smanjilo broj onih koji mogu sudjelovati. Ova ce se odredba u buducnosti sigurno razmatrati, s mogucnoscu da se pravo glasa veze uz vise uzastopnih godina Clanstva. Takoder, vrijedi istaknuti da u mnogim europskim Clanskim klubovima pravo glasa stjecu oni koji su Clanovi samo godinu dana. ZaSto su Predsjednik SkupStine i Predsjednik Nadzornog odbora ista osoba? U Statutu ne postoji funkcija Predsjednika SkupStine, a skupStinskom sjednicom u pravilu predsjeda Predsjednik NO kojemu je to tek jedna od duznosti. Osoba koja predsjeda sjednicom Skupstine obavlja tek tehnicku funkciju i ne mora uvijek biti predsjednik NO. Predsjednik NO svoje stvarne nadleznosti isounjava u NO. Ne treba nam inflacija razlicitih Predsjednika u Klubu bez jasnih duznosti. Nadzorni odbor neodvojivi je dio SkupStine i s time se izbjegava nepotrebno udvostrucavanje pozicija i jasno razdvaja nadleznost: predsjednik NO-a utjece iskljucivo na rad tog tijela, dok na ostale procese u SkupStini ne djeluje izvan svoje nadzorne uloge. Logicno je i proceduralno ispravno da osoba koja vodi SkupStinu vodi i tijelo koje je njezina produzena ruka. Osim toga, unutar Skupstine postoji dovoljan broj drugih clanova koji, ako procijene da predsjednik NO-a odstupa od svojih oviasti, mogu pokrenuti inicijativu za izvanrednu sjednicu ili izmijeniti dnevni red. Uvodi li se verbalni delikt i zasto nema Etickog povjerenstva? Pojam verbalni delikt tice se iskljucivo odnosa drzave i pojedinca i potpuno je pogresno i neprimjereno njegovo koristenje u vezi pravila ponaSanja jednog privatnog udruzenja osoba s viastitim pravilima ili mjerama, u kojima je udruzivanje potpuno dobrovoljno. U privatnim organizacijama, poput sportskih klubova, uobicajeno je postojanje internih pravila ponasanja te stegovnih postupaka i sankcija. Svaka organizacija ima pravo odrediti svoja pravila i svatko ima pravo ne biti dio te organizacije. Bitno je naglasiti da, u slucaju izricanja bilo koje stegovne mjere — posebno one najteze, poput iskljucenja — clan ima pravo, nakon Sto iscrpi sve klupske instance, potraziti zastitu i kod nadleznog suda. U zadnje dvije godine nije se desio niti jedan slucaj koji je zahtijevao pokretanje stegovnog postupka i zbog toga nema niti smisla uspostavljanje dodatnog tijela koje bi se zvalo Eticko povjerenstvo i koje bi se samo time bavilo. | najvaznije, raspisivanjem doticnih prekrsaja u Statutu nije bio cilj postavljanje temelja za sankcioniranje i iskljucivanje Clanova vec gradenje kulture Cclanskog Kluba na nacin da se jasnije komunicira da Clan Kluba ima drugacija prava, ali i obaveze od navijaca Kluba."]