["Na temelju clanka 13. Zakona o udrugama (Narodne novine, br. 74/14, 70/17, 98/19 i\n151/22) i Clanka 30. Zakona o sportu (Narodne novine, br. 141/22) na_ sjednici\nSkupstine Gradanskog nogometnog kluba ,Dinamo“ odrzanoj 21.12.2023. donesen je:\n\nSTATUT\nGRADANSKOG NOGOMETNOG KLUBA ,,DINAMO“*\n\nOSNOVNE ODREDBE\n\nClanak 1.\n\nOvim Statutom ureduju se: naziv i sjediSte udruge; podrugje i ciljevi djelovanja;\nzastupanje; djelatnost; gospodarska djelatnost; nacin osiguranja javnosti djelovanja\nudruge; uvjeti | nacin uclanjivanja; prestanak Clanstva; prava, obveze i odgovornosti\nClanova; popis Clanova; tijela udruge, njihov sastav i nacin sazivanja sjednica; izbor,\nopoziv, ovlasti, odgovornost, nacin odlucivanja i trajanje mandata; nacin rjeSavanja\nsporova | sukoba interesa unutar udruge; nacin sazivanja SkupStine u slucaju isteka\nmandata; izbor i opoziv likvidatora; prestanak postojanja udruge; imovina, nacin\nstjecanja | raspolaganja imovinom; postupak s imovinom u_ sluéaju prestanka\npostojanja udru", "ge te ostala pitanja od znaéaja za udrugu.\n\nClanak 2.\n(1) Naziv Udruge je: Gradanski nogometni klub ,.Dinamo*.\n(2) Skraceni naziv Udruge je: GNK ,Dinamo“.\n(3) Gradanski nogometni klub ,Dinamo*“ profesionalni sportski nogometni klub.\n(4) SjediSte kluba je u Zagrebu, Maksimirska cesta 128.\nClanak 3.\n(1) Gradanski nogometni klub ,Dinamo* (u daljnjem tekstu: Klub) je udruga registrirana\nu Registru udruga Republike Hrvatske i Evidenciji pravnih osoba u sportu .\n(2) Klub je neprofitna pravna osoba.\n\nClanak 4,\n\n(1) Klub ima peat.\n(2) Pecat je okruglog oblika, promjera 35 mm, sa ispisanim nazivom i mjestom sjedista\nKluba po obodu pecéata i znakom u sredini.\n\nClanak 5.\n\n(1) Obiljezja Kluba su znak/amblem/grb i plava boja, a koja slijede izgled obiljezja i\nsportsku tradiciju Prvog hrvatskog gradanskog Sportskog kluba Zagreb, odnosno\n1. HSK Gradanskog.\n\n(2) Znak/amblem/grb Kluba je kruZnog oblika i simbolizira oblik nogometne lopte, a Sto\nukazuje na osnovnu djelatnost Kluba.\n\n(3) Osnova znaka/amb", "lema/grba sastaviiena je od dva polukruga: povijesnog\nhrvatskog grba s naizmjenicnim crvenim i bijelim poljima i tradicionalnog u plavoj\nboji Grada Zagreba s bijelim slovom ‘d' koje predstavlja poéetno slovo naziva Kluba\n,INAMO”.\n\n(4) Sve linije unutar znaka/amblema/grba i rub znaka/amblema/grba su u boji zlata.\n\n(5) Klub ba&tini sportsku povijest i rezultate nastale pod imenima 1. HSK Gradanski,\nNK ,Dinamo“, NK HASK-Gradanski i NK Croatia.\n\nClanak 6.\n\n(1) O promjeni imena, grba, boje, lokacije stadiona, preoblikovanja, pripajanja,\nspajanja ili podjele Kluba i dobrovoljnog prestanka rada Kluba saziva se obvezujuGéi\nreferendum svih punoljetnih i poslovno sposobnih Clanova Kluba, tako da na njemu\nmora sudjelovati najmanje 70 % Clanova Kluba s pravom glasa, a odlucuje se\nobicnom vecinom.\n\n(2) Referendum svih Clanova Kluba mora sazvati Predsjednik Kluba u sluéajevima iz\nst. 1. ovog Clanka.\n\nClanak 7.\nKlub zastupaju Predsjednik, Dopredsjednik i Uprava, sukladno odredbama ovog\nStatuta.\nClana", "k 8.\n(1) Klub:\na. postupa sukladno Pravilima nogometne igre koje je donio Medunarodni\n\nnogometni savez BOARD (IFAB);\n\nb. postuje nacela privrzenosti, integriteta i sportskog ponaSanja kao izraza fair-\nplaya;\n\nc. postuje statut, pravilnike i odluke FIFA-e i UEFA-e i Hrvatskog nogometnog\nsaveza (HNS) u svako vrijeme;\n\nd. priznaje nadleznost Arbitraznog suda za sport (CAS) u_ Lausanni\n(Svicarska), kao Sto je utvrdeno relevantnim odredbama Statuta FIFA-e,\nUEFA-e;\ne.\n\npriznaje nadleznost Arbitraznog suda HNS-a i sukladno tome podnosit ée\nsve sporove nacionalnih razmjera, koji su nastali iz ili u vezi s primjenom\nStatuta ili pravilnika HNS-a, u posljednjoj instanci samo tim arbitrazama, koje\nrleSavaju svoje sporove, iskljucujuci svaki redovni sud, osim ukoliko je to\nizricito zabranjeno vazecim zakonodavstvom u Republici Hrvatskoj.\n\n(2) U slucaju sporova za koje su nadlezna pravosudna tijela FIFA-e, UEFA-e, CAS-a,\nArbitrazZnog suda Saveza ili pravnih tijela Saveza, Klub se obvezuje da spor ne", "ce\niznositi pred redovne sudove.\n\n(3) Klub postuje sve odluke nadleZnih tijela HNS-a, FIFA-e i UEFA-e i CAS-a.\n\nCILJEVI, PODRUCJE DJELOVANJA SUKLADNO CILJEVIMA,\n\nDJELATNOST | GOSPODARSKE DJELATNOSTI\n\nClanak 9.\n\n(1) Ciljevi Kluba su:\n\noAaoom\n\nokupljanje gradana, djece i mladezi kroz Skole nogometa:\n\nrazvoj i unapredenje nogometa te postizanje vrhunskih sportskih rezultata;\nsudjelovanje u nogometnim natjecanjima u zemlji i inozemstvu;\n\nstrucno i profesionalno osposobljavanje i usavrSavanje sportskih djelatnika;\nstvaranje potrebnih uvjeta za bavijenje nogometom, trening, organizaciju\nstrucnog rada | natjecanje svih ekipa Kluba.\n\n(2) Klub moze podrzavati muSku, Zensku i veteransku nogometnu ekipu, futsal ekipu\nte ostale varijacije s ciljem razvoja i popularizacije nogometnog sporta.\n(3) Klub sukladno ciljevima djeluje na podruéju sporta.\n\nClanak 10.\n\nDjelatnosti Kluba su:\n\na.\n\n20\n\nsudjelovanje u profesionalnim ili amaterskim natjecanjima na lokalnoj,\ndrzavnoj | medunarodnoj razini unogomet", "nom sportu za sve uzraste;\nstrucno-pedagoski rad sa svim uzrastima sportaSa, osobito kroz nogometne\nSkole; organizirano vodenje treninga i sportskih priprema;\n\nosposobljavanje | usavrSavanje viastitog struénog i pedagoskog kadra:\nstvaranje materijalnin, tehnickih infrastrukturnih i drugih uvjeta za bavijenje\nnogometnim sportom; upravlijanje, odrzavanje i skrb o daljnjoj izgradnji\nsportskih objekata kojima Klub raspolaze;\n\nosiguravanje svih potrebnih uvjeta za sudjelovanje u natjecanju prema\nuvjetima za licenciranje HNS-a i UEFE (struéno-pedagoSski trenerski kadrovi,\nadministrativni kriteriji, sportski kriteriji, infrastrukturni kriteriji i financijski\nkriteriji);\n\nSuradnja sa _ sudackim, trenerskim i drugim  struénim_ sportskim\norganizacijama na lokalnoj, drzZavnoj i medunarodnoj razini:\n\nsuradnja s drugim nogometnim i sportskim klubovima;\nh. suradnja s tijelima drzavne te lokalne i regionalne vlasti, pravnim i fiziékim\nosobama u ispunjavanju sportskih interesa i ciljeva;\n\nI. Organizir", "ano okupljanje Glanstva Kluba svih uzrasta;\n\nJ. Izdavanje biltena, glasila, monografija, priruénika i drugih tiskovina vezano\nUZ nogometni sport i Klub:\n\nk. poticanje i promicanje nogometa kao sporta u skladu s aktima strateSkog\nplaniranja razvoja sporta na nacionalnoj razini, odnosno nacionalnom\nstrategijom razvoja sporta i nacionalnim planom razvoja sporta te strateSkim\ndokumentima donesenim na podruénoj (regionalnoj) razini, a osobito sporta\ndjece i mladezi, te zdravstveno usmjerenog tjelesnog vjezbanja i\nzdravstveno usmjerene tjelesne aktivnosti sportaga:\n\n|. sudjelovanje u ostvarivanju uvjeta za provodenje zdravstvene skrbi sportaSa\nte sudjeluje u edukaciji sportaSa o antidopingu:\n\nm. provodenje edukaciju, informiranje i savjetovanje sportaga, sportskih\ndjelatnika, gradana i ostalih sudionika u sportu o pitanjima bitnim za\nbavijenje sportskim aktivnostima i djelatnostima:\n\nn. poduzimanje aktivnosti za sprjeéavanje negativnih pojava u sportu, posebno\nZa sprjecavanje nasilja u sport", "u i krSenja prava djece;\n\n0. promicanje strucnog rada u sportu, te sudjelovanje u unapredenju stru€nog\nrada i skrbi o osposobljavanju struénih djelatnika:\n\np. unos ij azuriranje podataka za koje je nadlezan Klub u Nacionalni\ninformacijski sustav u sportu;\n\nq. obavlja i druge poslove, djelatnosti i zadaée odredene zakonom i ovim\nstatutom.\n\nClanak 11.\n\n(1) Gospodarske djelatnosti koje Klub obavlja su:\na. izdavacka djelatnost:\nb. prodaja vlastitih proizvoda na malo izvan prodavaonica, sukladno Zakonu o\ntrgovini;\nc. promidzbene djelatnosti:\nd. davanje u zakup i podzakup viastitih poslovnih prostora ji mjesta za\noglaSavanje;\n(2) Djelatnosti iz st. 1. ovog élanka Klub obavlja u skladu s posebnim propisima koji\nureduju gospodarsko poslovanje udruga kao pravnih osoba.\n(3) Djelatnosti iz st. 1. ovog Elanka ne mogu se obavijati radi stjecanja dobiti za svoje\nClanove ili tre¢e osobe.\n(4) Ako u obavijanju gospodarskih djelatnosti Klub ostvari dobit ona se mora koristiti\niskljucivo za obavljanje i ", "unapredenje djelatnosti Kluba kojima se ostvaruju ciljevi\nKluba, utvrdeni ovim Statutom, sukladno zakonu.\n\nClanak 12.\n\nKlub moze osnivati trgovacka drugtva prema odredbama Zakona o trgovackim\ndrustvima, kao i druge oblike pravnih osoba u skladu s posebnim propisima, ako je to\nu cilju osiguranja materijalnih uvjeta rada i razvoja Kluba.\nClanak 13.\n\n(1) Djelovanje Kluba je javno, a ostvaruje se putem:\n\na. internetskih stranica Kluba, aplikacija i druStvenih mreza,\nb. javnih medija,\n\nCc. povjerenika Kluba,\n\nd. ostalih nacina informiranja sukladno odluci Uprave Kluba.\n\n(2) Clanove Kluba pravodobno se obavjestava o radu Kluba, aktima i odlukama\nnjegovih tijela posebnim izvjeScima te skupovima za Glanove koji se organiziraju\nnajmanje jednom godiSnje Sto je definirano Pravilnikom o élanstvu.\n\n(3) O nacinu javnosti rada Kluba i obavjeStavanja Glanova, Uprava Kluba donosi\nodluku.\n\nClanak 14.\n\n(1) Klub se moZe udruZziti u saveze udruga, zajednice, mreZe i u medunarodne udruge.\n(2) Odluku o udruz", "ivanju donosi Skupstina.\n\nCLANSTVO\n\nClanak 15.\n\n(1) Clanom Kluba moze postati svaka fizitka osoba Koja ispunjavanjem pristupnice\nprinvaca nacela, Statut i druge akte Kluba.\n\n(2) Clanom Kluba se postaje upisom u jedinstveni Popis ¢lanova koji vodi struéna\nsluzba po odluci Uprave Kluba.\n\n(3) Primitak u Clanstvo odobrava Uprava Kluba i osobe koje Uprava zaduzZi za élanstvo,\nako ne postoje prepreke iz ovog Statuta ili zakona, a na temelju ispunjene\npristupnice. Odbijanje mora biti obraziozeno u roku od 30 dana i osoba koja je\npodnijela zahtjev moze podnijeti Zalbu Nadzornom odboru u roku od 15 dana od\nprimitka odbijanja.\n\n(4) Osobe mlade od 18 godina, kao i osobe liSene poslovne sposobnosti mogu postati\nClanom Kluba. Za osobu mladu od 14 godina pisanu izjavu o uélanjivanju u udrugu\ndaje zakonski zastupnik ili skronik, a za maloljetnu osobu s navrSenih 14 godina\nzakonski zastupnik ili skrbnik daje pisanu suglasnost.\n\n(5) Maloljetnici te osobe liSene poslovne sposobnosti ne mogu biti Glanovi", " klupskih\ntijela.\n\n(6) Svaki Clan moze dobiti Clansku iskaznicu Giji izgled definira Uprava Kluba.\n\n(7) Jedinstveni popis Clanova vodi se elektroni¢ki i obavezno sadrzi podatke o\nosobnom imenu, osobnom identifikacijskom broju (OIB), datumu rodenja, datumu\npristupanja Klubu te datumu prestanka Clanstva u Klubu.\n\n(8) U arhivi se Cuvaju privole o koriStenju osobnih podataka u skladu s propisima o\nzastiti podataka, adrese stanovanja, brojeve telefona i mobilnih telefona, adrese e-\nposte i ostali podaci iz pristupnice koju ispunjavaju Glanovi pri uélanjenju.\n(9) Jedinstveni popis élanova uvijek je dostupan na uvid svim élanovima i nadleznim\ntiielima na njihov zahtjev u skladu sa zakonima i drugim propisima o za&gtiti\npodataka.\n\nClanak 16.\n\n(1) Visinu Clanarine odreduje IzvrSni odbor.\n\n(2) Clan je duzan uplatiti Glanarinu u roku od 15 dana od dana potpisivanja pristupnice\nu Clanstvo Kluba.\n\n(3) Clanstvo poéinje datumom upisa u jedinstveni Popis élanova i zavrSava istekom\n\nte kalendarske godi", "ne. Po isteku kalendarske godine, Glanstvo se obnavija za iducu\n\nkalendarsku godinu novom uplatom godiSnje élanarine, a prava i obveze prema ovom\n\nStatutu teku od trenutka obnove.\n\nClanak 17.\n\n(1) Klub je neutralan po pitanjima politike i vjere.\n\n(2) Diskriminacija bilo koje vrste prema drZavama, osobama ili rodnim skupinama\nosoba temeljena na njihovoj rasi, nacionalnosti, vjeri, spolu, jeziku, politicékom\nopredjeljenju ili bilo Cemu drugome zabranjena je i predstavija razlog za iskljuéenje\niz Kluba u stegovnom postupku.\n\n(3) Clan ne moze biti osoba koja svojim ponaSanjem i radnjama nanosi materijalnu ili\nnematerijalnu stetu Klubu te koja nasilniékim, diskriminatornim i rasistiékim\nponasanjem radnjama onemoguéava ostvarenje ciljeva i obavijanje djelatnosti,\nte steti ugledu Kluba.\n\nClanak 18.\n\nPrava Clanova su:\n\na. birati i biti biran u tijela Kluba te pravo glasa na referendumu, sto vrijedi za\npunoljetne i poslovno sposobne Glanove Kluba koji su bili Glanovi u\nprethodnoj kalendarskoj g", "odini, osim u sluéaju imenovanja Glanova Uprave:\n\nb. pridonositi afirmaciji i ugledu Kluba u zemiji i inozemstvu;\n\nc. sudjelovati u radu i upravijanju Klubom putem izabranih predstavnika u\nSkupstini i drugim tijelima Kluba; |\n\nd. biti pravodobno obavjeStavani o radu Kluba i aktima i odlukama njegovih\ntijela na nacin propisan Statutom, posebnim aktima i odlukama Uprave;\n\ne. komunicirati pisano te putem javne tribine jednom godignje s tijelima Kluba\nu okviru njihove nadleZnosti i dobiti pravodobne odgovore;\n\nf. predlagati to¢ke dnevnog reda Skup&tine izabranim predstavnicima u\nSkupstinu;\n\ng. biti nagraden pocasnim odlikovanjima za doprinos ili za dugotrajno élanstvo:\n\nh. prednost u kupnji ulaznica na naéin koji odredi Uprava.\nClanak 19.\n\nDuznosti | odgovornosti Glanova su:\na. placanje Clanarine te poStivanje Statuta i drugih akata Kluba:\nb. podupiranje Kluba i aktivno sudjelovanje u ostvarenju ciljeva Kluba;\nc. suzdrzavanje od ponaganja i radnji koje Stete Klubu i njegovu ugledu.\n\nClanak", " 20.\n\nNogometasi koji su Clanovi Kluba pored prava i obveza iz él. 18. i 19. ovog Statuta\nimaju i druga prava, obveze i odgovornosti utvrdene ugovorima te odlukama klupskih\ntijela.\n\nClanak 21.\n\n(1) Clanstvo u Klubu i njegovim tijelima prestaje:\na. dragovoljnim istupom,\nb. neplacanjem élanarine,\nc. iskljucenjem u stegovnom postupku,\nd. smrcu,\ne€. postojanjem zapreka propisanih u pravnim propisima.\n(2) Clanstvo prestaje i élan se brige iz Jedinstvenog popisa Clanova bez posebne\nodluke ako ne plati Clanarinu unutar kalendarske godine.\n\nClanak 22.\n\n(1) Stegovne mjere prema Clanovima Kluba su opomena, suspenzija i iskljucenje, koje\nmoze biti trajno ili na odredeni vremenski rok.\n\n(2) Opomena i suspenzija izriée se Clanu koji svojim djelovanjem naruSava ugled\nKluba.\n\n(3) Clan moze biti iskljuéen iz Kluba ako djeluje protivno ciljevima Kluba te zbog\nnepostivanja Statuta, drugih op¢cih akata i odluka klupskih tijela.\n\n(4) Stegovni postupak pokrece se na zahtjev bilo kojeg Glana klupskih tijela", ".\n\n(5) Odluku o stegovnim mjerama donosi Uprava.\n\n(6) Iskljuceni Clan ima pravo u roku od 15 dana, ra¢unajuci od dana dostave odluke,\npodnijeti Zzalbu Nadzornom odboru.\n\n(7) Nadzorni odbor je duzan rijesiti Zalbu u roku od 30 dana, raéunajuéi od dana\ndostave zalbe.\n\n(8) Odluka Nadzornog odbora o iskljuéenju je konaéna.\n\nClanak 23.\n(1) Povjerenik moze biti svaki Clan Kluba koji je podnio zamolbu i koji ispunjava\n\nsljedece uvjete:\na. osoba je s potpunom poslovnom sposobnoSséu;\nb. da je prije podnoSenja zamolbe, na njyegovu preporuku u Klub uélanjeno\nnajmanje 20 novih Glanova Kluba:\n\nc. da je najmanje 5 (pet) godina neprekidno Clan kluba prije podnoSsenja\nzamolbe ili da je najmanje 2 (dvije) godine neprekidno Clan kluba i na Giji se\npriyjediog uclani najmanje 50 élanova kluba:\n\nd. dane postoje zapreke iz ovog Statuta.\n\n(2) Odluku 0 imenovanju povjerenika donosi Uprava Kluba.\n\n(3) Povjerenik je duzZan animirati i poticati uClanjivanje novih Glanova Kluba te\nizvjestavati svoje Elanove drugi", "m vaznim temama koje se odnose na ostvarivanje\nciljeva Kluba i obavijanje njegove djelatnosti.\n\n(4) Uprava Kluba moze s imenovanim povjerenikom zakljuciti ugovor o medusobnim\npravima i obvezama.\n\nTIJELA KLUBA\n\nClanak 24.\n\n(1) Klupska tijela su:\n\na. Skup$stina,\n\nb. IzvrSni odbor,\n\nc. Predsjednik i Dopredsjednik Kluba,\n\nd. Nadzorni odbor,\n\ne. Uprava Kluba.\n(2) U klupska tijela mogu biti izabrani samo punoljetni i poslovno sposobni élanovi\nKluba.\n\nClanak 25.\n\n(1) Clanovi klupskih tiiela ne mogu biti osobe za koje postoji zapreka iz Gl. 111. i 112.\nZakona o sportu i iz €l. 19. st. 2. i 3. Zakona o udrugama.\n(2) Clanovi klupskih tiiela uz razloge iz st. 1. ne mogu biti osobe:\n\na. koje su aktivni nogometni sudac, ili osoba koja je to bila u posljednje 3 (tri)\ngodine;\n\nb. koje ne mogu biti Glanovi Uprave odnosno nadzornog odbora dioniékog\ndrustva prema odredbama Zakona o trgovaékim drustvima i Zakona o\nsprjecavanju sukoba interesa u obnaSanju javnih duznosti:\n\nc. koji su dionicari ili Clanovi", " drugog nogometnog kluba:\n\nd. koje svojim djelovanjem mogu neposredno utjecati na sustav natjecanja u\nodgovarajucem sportu, a osobito sportasi koji su profesionalni prema\nZakona o sportu, menadzZeri i posrednici u sportu, kao i osobe koje su to bile\nu razdoblju od posljednjih godinu dana:\n\ne. koje su posljednjih godinu dana bile Clanovi ili Glanovi tijela pravne osobe\nkoja obavija djelatnost organiziranja sportske kladionice:\n\nf. koje s menadZzerima i posrednicima u istome sportu i élanovima pravnih\nosoba te clanovima tijela pravnih osoba koje Obavijaju djelatnost\norganiziranja sportskih kladionica djeluju zajedniéki:\ng. koje imaju ili su posljednjih godinu dana imale sklopljen ugovor sa\nnogometasem ili nogometnim trenerom na temelju kojega ostvaruje pravo\nna dio prihoda koji proizlaze iz Obavijanja djelatnosti nogometaéga ili\nnogometnog trenera:\n\nh. koje su ovlaStene za zastupanije u pravnoj osobi koja sukladno Zakonu o\nsportu ima sklopljene ugovore o ulaganju u fizicke osobe u nogome", "tu:\n\nI. koje su u posljednje tri godine pravomocno kaznjene za kaznena djela ili\nprekrsaje u sportu i u vezi sa sportom i sportskim natjecanjima;\n\nJ. koje su pravomoéno osudene na kaznu zatvora u trajanju od najmanje 6\n(Sest) mjeseci za neko od kaznenih djela pocinjena s namjerom, a nije\nprimijenjena uvjetna osuda godinu dana od odsluzenja kazne;\n\nk. koje ne ispunjavaju druge uvjete propisane Zakonom o sportu | drugim\nzakonima.\n\n|. koje su aktivni igraé, trener ili zaposlenik Kluba, a ako to postanu tijekom\nmandata u tijelima Kluba, prestaje im mandat i élanstvo u tijelu, osim\nClanovima Uprave Kluba.\n\n(3) Svaki Clan Kluba koji ulazi u bilo koja tijela Kluba mora potpisati izjavu kojom\nizjavijuje da za njega ne vrijede gore navedeni uvjeti te da ce u slucaju nastupa\ngore navedenih uvjete odmah obavijestiti Upravu Kluba.\n\nClanak 26.\n\n(1) Mandat Clanovima klupskih tijela prestaje i prije isteka roka u slucaju:\na. pisane ostavke ili zapisnikom konstatirane ostavke - danom Zaprimanja\nostavk", "e odnosno ovjerom zapisnika;\n. izbora novog saziva klupskog tijela;\npotpunog ili djelomi¢nog gubitka poslovne sposobnosti;\nnastupa okolnosti iz Clanka 21. i 25. ovog Statuta:\n€. nastupa druge okolnosti zbog koje vise ne moze biti Glanom klupskog tijela.\n(2) Na mjesto Clana SkupStine koji je prestao biti Glan SkupStine prije isteka mandata\nna koji je izabran imenuje se novi élan s popisa zamjenskih Glanova Skupstine u\nobje izborne jedinice. U sluéaju da se iscrpi broj zamjena, Skupstina nastavlja\nfunkcionirati s brojem preostalih Glanova SkupStine.\n(3) Novoimenovanom Clanu SkupStine prema st. 2. ovog élanka, mandat traje do isteka\nmandata SkupStine.\n(4) Novoizabranom €lanu IzvrSnog odbora mandat traje do isteka mandata Izvrsnog\nodbora.\n(5) Novoizabranom ¢élanu Nadzornog odbora mandat traje do isteka mandata\nNadzornog odbora.\n\na9\n\nSKUPSTINA\n\nClanak 27.\n\n(1) SkupStina je najvise tijelo upravijanja Klubom.\n(2) Skupstinu saCinjava 60 predstavnika Glanova Kluba, na naéin da:\n- 29 Clanova Sku", "p$&tine biraju svi Glanovi Kluba na izborima te lista s najvise\nglasova ulazi u cijelosti u Skup&tinu\n\n- 35 Clanova SkupStine bira IzvrSni odbor iz redova prijavijenih kandidata\ntajnim glasovanjem\n\nClanak 28.\n\n(1) Izbori za SkupStinu Kluba odrZavaju se u dvije izborne jedinice:\n\n- izbori u prvoj izbornoj jedinici na kojima sudjeluju punoljetni i poslovno\nsposobni Clanovi koji imaju vazece élanstvo u trenutku izbora i u prethodnoj\nkalendarskoj godini, koji glasuju za izborne liste koje uz nositelja liste, sadrze\n| popis kandidata za svih 25 mjesta u Skup§&tini i najmanje pet zamjenskih\nkandidata za Clanove SkupStine. Lista koja dobije najveci broj glasova\npopunjava sva mjesta za prvu izbornu jedinicu:\n\n- druga izborna jedinica za koju punoljetni i poslovno sposobni Clanovi s\nvazecim Clanstvom u trenutku izbora i u prethodnoj kalendarskoj godini,\nmogu poslati kandidature Izbornom povjerenstvu, a iz koje Ge 35 élanova\nSkupstine kao cjelovitu listu izabrati Izvr&ni odbor uz pet zamjenskih\n", "Kandidata.\n\n(2) Liste iz obje izborne jedinice imaju nositelje koji su i kandidati za Predsjednika.\nNositel} liste koja je pobijedila u prvoj izbornoj jedinici je jedan kandidat za\nPredsjednika, a izmedu 35 élanova Skup$tine iz druge izborne jedinice Predsjednik\nKluba imenuje nositelja liste koji je kandidat za Predsjednika druge izborne jedinice.\nIZmedu dva kandidata za Predsjednika SkupStina glasa za Predsjednika Kluba.\nNositelji lista kao kandidati za Predsjednika moraju imati plan upravijanja Klubom\nu svom mandatu dostupan Clanovima Kluba prije izbora, koji dostavijaju Izbornom\npovjerenstvu. Liste u prvoj izbornoj jedinici moraju imati potpise podrske najmanje\n100 punoljetnih i poslovno sposobnih Glanova Kluba s vazeéim élanstvom u\ntrenutku potpisivanja i u kalendarskoj godini koja prethodi izbornim procesima.\n\n(3) Izborna SkupStina se mora odrzati najkasnije 30 dana od dana izbora.\n\n(4) Detalje izbornih postupaka i referenduma ureduje Pravilnik o izborima u Klubu.\n\nClanak 29.\n\n(1)", " Skupstina zapoCinje utvrdivanjem Glanova Skup8tine i prisutnog broja Glanova od\nstrane Predsjednika Kluba na temelju dostavljenih verificiranih listi kod Izborne\nSkupstine te popisa promjena Glanova Skup&tine od strane IzvrSnog odbora.\n\n(2) Izvrsni odbor ée najkasnije 2 mjeseca prije izbora izabrati Izborno povjerenstvo u\nSastavu od 9 prijavijenih Clanova Kluba. U sluéaju da nema dovoljno prijavljenih\nClanova Kluba za Izborno povjerenstvo IzvrSni odbor ée obavijati funkciju Izbornog\npovjerenstva.\n\n(3) Na Izbornoj Skup$stini, nakon izbora Predsjednika Kluba, Predsjednik Kluba\nautomatski postaje Predsjednik IzvrSnog odbora i imenuje jo$ 10 Glanova IzvrSnog\nodbora po svom odabiru iz redova Glanova Skup&tine, a 2 élana imenuje nositelj\ndruge liste koja sacinjava Skup&tinu, Sto se verificira na Skup8tini citanjem imena\nClanova IzvrSnog odbora.\n\n(4) SkupStina donosi Pravilnik 0 izborima u Klubu u kojem su detaljnije odredeni izborni\npostupci | rad Izbornog povjerenstva.\n(5) Skupstina sve ve", "rifikacije u njezinoj nadleZnosti obavlja javnim Citanjem u zapisnik,\ndok ostala tijela, posebno Izborno povjerenstvo, verifikacije obavijaju glasovanjem.\n\nClanak 30.\n\nClanovi Skup&tine biraju se na mandat od 4 (Cetiri) godine te isti Clanovi mogu biti birani\nna novo mandatno razdoblije.\n\nClanak 31.\n\n(1) Skupstina moZe biti redovita i izvanredna.\n\n(2) SkupStina redovito zasjeda najmanje jednom godignje, dok se izvanredne\nodrzavaju prema potrebi.\n\n(3) Sjednice SkupStine saziva Predsjednik Kluba.\n\n(4) Predsjednik Kluba mora sazvati izvanrednu sjednicu ako to zatrazi IzvrSni odbor ili\n31 Clan Skupstine koji su duZni predloziti dnevni red izvanredne sjednice\nSkupstine.\n\n(5) U slucaju iz st. 4. ovog Clanka Predsjednik Kluba je duzan sazvati izvanrednu\nsjednicu Skupstine u roku od 15 dana od dana zaprimanja zahtjeva predlagatelja\nZa sazivanje SkupStine koja se mora odrzati najkasnije u roku od 30 dana od dana\nzaprimanja zahtjeva za njezinim sazivanjem.\n\n(6) Ako Predsjednik Kluba ne sazove iz", "vanrednu sjednicu Skupstine Kluba u roku 30\ndana od dana zaprimanja zahtjeva predlagatelja, izvanrednu sjednicu SkupStine\nmogu sazvati sami predlagatelji.\n\n(7) Nakon sazivanja izvanredne sjednice SkupStine mora proteci najmanje 3 (tri)\nmjeseca prije podnosenja novog zahtjeva za sazivanjem nove izvanredne sjednice\nSkupstine.\n\nClanak 32.\n\n(1) 15 dana prije donoSenja odluke o sazivanju SkupStine IzvrSni odbor formira popis\nsvih Clanova Skupstine te u sluéaju nastupa uvjeta navedenih u él. 25. i él. 26.,\ndodaje nove Clanove s liste zamjenskih Glanova.\n\n(2) U odluci o sazivanju Skupstine koja se mora poslati Clanovima SkupStine najkasnije\n8 dana prije odrzavanja SkupStine, Predsjednik Kluba utvrduje dnevni red te dan i\nmjesto odrzavanja sjednice. IzvrSni odbor moze dopuniti dnevni red pisanim\npriiedlogom.\n\n(3) Nakon primitka odluke o utvrdivanju dnevnog reda najmanje 25 Glanova SkupSstine\nmoze dopuniti dnevni red pisanim prijedlogom IzvrSnom odboru bilo koje toéke koja\nje u nadleznosti Skup", "Stine, najkasnije 7 dana prije SkupStine.\n\n(4) Najkasnije 3 dana prije SkupStine Predsjednik Salje konaéni dnevni red i sve\nmaterijale potrebne za donoSenje odluka prema dnevnom redu.\nClanak 33.\n\n(1) U slucaju isteka mandata svim tijelima Kluba, svi punoljetni i poslovno sposobni\nClanovi Kluba postaju opéa Skup§&tina koja ée izabrati tijela Kluba.\n\n(2) U slucaju iz st 1. ovog Glanka opéu Skupstinu saziva jedna od zadnjih osoba\novilastenih za zastupanje u registar udruga Republike Hrvatske.\n\nClanak 34.\n\n(1) Predsjednik Kluba imenuje radno predsjednitvo od 3 élana, koje rukovodi radom\nSkupstine.\n\n(2) Dopredsjednik kojeg imenuje Predsjednik Kluba je predsjedavajuci Skupstine.\n\n(3) Na Izbornoj Skupstini, nakon odabira IzvrS8nog odbora i Dopredsjednika,\ndosadasnjeg Dopredsjednika na mijestu predsjedavajuceg, zamienjuje\nnovoizabrani.\n\n(4) O radu sjednice vodi se zapisnik koji se trajno Guva u arhivi Kluba, a kojeg potpisuju\npredsjedavajuci tom sjednicom i zapisniéar.\n\n(5) Jedan od Clanova Up", "rave, oviaSten za zastupanje Kluba dostavlja zapisnik sa\nsjednica Skupstine nadleznom uredu koji vodi registar udruga.\n\nClanak 35.\n\n(1) Skupstina odlucuje pravovaljano ako je nazoéan najmanje 31 élan Skup$Stine, a\nodluke donosi vecinom glasova, osim ako Statutom nije propisano drukéije.\n\n(2) Za donosenje, dopune i izmjene Statuta i za razrjeSenje Predsjednika ili Glanova\nIzvrsnog odbora potrebna je odluka najmanje 40 Glanova Skup§&tine.\n\n(3) Za izbor novog Predsjednika potrebna je odluka najmanje 31 élana Skupstine. Ako\nse na sjednici Skupstine ne odabere Predsjednik ili vecina IzvrSnog odbora,\nSkupSstina saziva izbore u roku od 60 dana.\n\nClanak 36.\n\nSkupstina Kluba:\n\na. utvrduje politiku i smjernice rada Kluba predlozene od strane IzvrSnog\nodbora;\n\nb. usvaja Statut Kluba te predlaze i utvrduje njegove izmjene i dopune na naéin\npropisan u Cl. 31 st.4. i él. 32 st.3. ovog Statuta:\n\nc. usvaja plan rada i financijski plan za sljedecu kalendarsku godinu;\n\nd. usvaja godisnje financijsko izv", "jeSée i izvjeSGe o radu za prethodnu\nkalendarsku godinu:\n\ne. donosi Poslovnik o radu Skup$stine Kluba, Pravilnik o dodjeli nagrade ‘Ponos\nDinama’, Pravilnik o izborima u Klubu, te druge akte i odluke vazne za rad\nKluba prema ovom Statutu;\n\nf. odlucuje o promjeni ciljeva i djelatnosti te obavijanju gospodarskih\ndjelatnosti;\n\ng. odlucuje o udruzivanju u saveze, zajednice, mreze i druge oblike\npovezivanja udruga;\nh. bira i razrjeSava Predsjednika Kluba, verificira i razrjesava IzvrSni odbor i\n\nNadzorni odbor, razrjeSava lzborno povjerenstvo, kao i pojedine Glanove tih\ntijela;\n\nimenuje i opoziva likvidatora Kluba:\n\ndonosi odluku o prestanku rada Kluba, raspodjeli preostale imovine Kluba i\no statusnim promjenama (pripajaniju, Spajanju i podjeli Kluba) u skladu s\nrezultatima provedenog referenduma:\n\nk. tumaci Statut i op¢e akte koje donosi, odlucuje i o drugim pitanjima za koje\n\novim Statutom nije utvrdena nadlezZnost drugih klupskih tijela.\n\nIZVRSNI ODBOR\n\nClanak 37.\n\n(1) Izvrsni odbor Klub", "a je izvrSno tijelo SkupStine kojoj odgovara za svoj rad.\n(2) IzvrSni odbor zalaze se za naéela:\n\nzakonitosti,\n\ntransparentnosti i javnosti poslovanja,\nsprjecavanje sukoba interesa,\nucinkovit unutarnji nadzor,\n\njacanje osobne odgovornosii,\ndrustveno odgovorno poslovanje.\n\n(3) IzvrSni odbor se sastoji od 13 Glanova iz redova élanova Skupstine.\n\n(4) Iz redova Clanova Skup&tine, Predsjednik Kluba imenuje 10 élanova IzvrSnog\nodbora po svom odabiru, a 2 élana imenuje nositelj druge liste koja sacinjava\nSkupstinu.\n\n(5) Mandat Clanova IzvrSnog odbora i Predsjednika je 4 (éetiri) godine.\n\n(6) U slucaju prestanka Glanstva u IzvrSnom odboru iz bilo kojeg razloga prema ovom\nStatutu, Predsjednik ili nositelj druge liste, ovisno s éije liste su élanovi IzvrSnog\nodbora kojima je prestalo élanstvo, imenuje druge élanove IzvrSnog odbora iz\nSkupstine.\n\nClanak 38.\n\nIzvrSni odbor Kluba:\n\na.\nb.\nC.\n\nd.\ne.\n\nprovodi odluke, zakljucke i preporuke SkupStine:\n\npredlaze izmjene i dopune Statuta, osim u sluéajevi", "ma iz él. 36. ovog Statuta\npredilaze i usvaja opce akte Kluba, ako ovim Statutom nije drugaéije\nodredeno;\n\npredilaze Skupstini program razvoja, politiku i smjernice rada Kluba:\nimenuje, sklapa ugovor, kao i razrjeSava predsjednika Uprave i élanove\nUprave Kluba; |\n\nnadzire rad Uprave i daje joj suglasnost za pravne poslove iznad ukupnog\niznosa 3 milijuna eura;\ng. osniva po potrebi savjetodavne pododbore ji povjerenstva sastavijene od\nClanova Kluba, zaposlenika Kluba ji strucnjaka koji nisu Glanovi Kluba, za\npotrebe kvalitetnije kontrole rada Kluba (Odbor za internu reviziju i kontrolu,\nOdbor za korporativna i strate&ka pitanja, Odbor za imenovanja zasluznih\nigraca i trenera i sl.) te se obvezuje u odluci o osnivanju pododbora i/ili\npovjerenstva navesti njihov sastav, zadacu, vrijeme za koje se osnivaju i\nodgovornost za obavijanje poslova:\n\nh. odluéuje i o drugim pitanjima koje mu odredi Skup§8tina.\n\nClanak 39.\n\n(1) IzvrSni odbor svoje poslove obavija na sjednicama koje saziva Predsjedni", "k ili Glan\nIzvrsnog odbora kojeg odredi Predsjednik prema potrebi, a najmanje jednom\nmjesecno.\n\n(2) IZvrSni odbor odluéuje veéinom glasova nazoénih élanova pod uvjetom da je na\nsjednici prisutna natpoloviéna veéina svih élanova.\n\nClanak 40.\n\nNacin i uvjete svog rada IzvrSni odbor ureduje Poslovnikom.\n\nPREDSJEDNIK KLUBA\n\nClanak 41.\n\n(1) Predsjednik Kluba:\na. Saziva sjednice Skupstine Kluba i Izvrsnog odbora te predlaze dnevni red,\nosim u slucajevima odredenih ovim Statutom:\nb. brine se o upoznavanju javnosti s radom Skup&tine Kluba:\nc. Uusuradnjis lzvrSnim odborom, utvrduje prijedlog Statuta i drugih opcih akata\nkoje usvaja SkupStina Kluba, osim u sluéajevima iz él. 36.\nd. imenuje Clanove IzvrSnog odbora sukladno él. 37. st. 4. ovog Statuta i\npredlaze Skupstini Kluba njihovo razrjeSavanje:\n@. saziva izbore u Klubu;\nf. obavija i druge poslove u skladu sa zakonima, ovim Statutom i aktima Kluba.\n(2) U bilo kojim slucéajevima istovremene sprijecenosti Predsjednika i Dopredsjednika\nduljim od", " 6 mjeseci, IzvrSni odbor mora sazvati SkupStinu koja Ce izabrati novog\nPredsjednika u roku od 3 mjeseca nakon proteka tog roka.\n\nClanak 42.\n(1) Predsjednik Kluba po svojoj funkciji je Glan i predsjednik IzvrSnog odbora.\n\n(2) Mandat Predsjednika Kluba je 4 (Getiri) godine i za svoj rad je odgovoran Skup8&stini\nKluba.\n(3) Predsjednik Kluba predstavija i zastupa Klub u zemlji | inozemstvu.\n\n(4) Predsjednik Kluba iz redova Izvr8nog odbora imenuje Dopredsjednika, koji\nrukovodi sjednicama Skup8tine i koji ga zamjenjuje u svim ovlastima u slucaju\nnjegove sprijecenosti.\n\nClanak 43.\n\n(1) SkupStina Kluba na redovnoj sjednici vecinom prisutnih Clanova Skupstine moze\nimenovati po€asnog predsjednika Dinama na temelju poslovnih i sportskih zasluga\ni rezultata.\n\n(2) Mandat pocasnog predsjednika je neograniéen. U izuzetnim slucajevima moze ga\nrazrijesiti Skupstina.\n\n(3) Pocasni predsjednik Kluba ima pravo sudjelovati na sjednicama Skup§&tine, ali\nnema pravo glasa.\n\nNADZORNI ODBOR\n\nClanak 44.\n\n(1) Nad", "zorni odbor:\n\na.\nb.\n\nC.\n\nroy\n\nskrbi o financijskom poslovanju Kluba te raspolaganju njegovom imovinom:\nskrbi 0 provodenju odredbi Statuta, opcih akata Kluba i pravnom poslovanju\nKluba o Cemu moZe traZiti izvjeSéa tijela Kluba:\n\nstegovno je tijelo u drugom stupnju vezano uz Glanska prava i obveze te\ndonosi konaénu odluku o stegovnoj meri;\n\n. Obavija i druge poslove u skladu sa zakonima, ovim Statutom i Pravilnikom\n\noO izborima;\n\n. tjeSava sukobe interesa i sporove unutar Kluba;\n\nobavjestava klupska tijela o neusuglaSenosti rada ili akata sa Statutom i\ndrugim aktima Kluba, o Gemu, ako se ne isprave, obavjestava SkupStinu koja\ndonosi obvezujucu odluku o uskladivanju rada i akata.\n\n(2) Clanovi klupskih tiiela koja odluéuju u stegovnom postupku ne sudjeluju u njemu\nkada su predmet stegovnih postupaka.\n\nClanak 45.\n\n(1) Nadzorni odbor se sastoji se od 3 élana, koji izmedu sebe biraju predsjednika.\n(2) Predsjednik Nadzornog odbora saziva sjednice i predlaze dnevni red.\n\n(3) Nadzorni odbor dono", "si odluke vecinom glasova svih élanova.\n\n(4) Mandat Clanova Nadzornog odbora je 4 (éetiri) godine.\n\nClanak 46.\n\n(1) Clanovi Nadzornog odbora ne mogu biti Glanovi drugih klupskih tijela.\n(2) Nadzorni odbor podnosi Skup8stini Kluba redovito godisnje izvjeSce.\n(3) SkupStina Kluba moZe zahtijevati od Nadzornog odbora podnogenje izvanrednog\nizvjeSéa.\n\nClanak 47.\n\nNacine i uvjete svog rada Nadzorni odbor ureduje Poslovnikom.\n\nClanak 48.\n\n(1) Clanove Nadzornog odbora na temelju samostalnih kandidatura poslanih Izbornom\npovjerenstvu bira IzvrSni odbor na naéin propisan u Pravilniku o izborima. § liste\nprijavijenih kandidata prvo jednog élana Nadzornog odbora bira 10 Glanova\nIzvrsnog odbora koje je izabrao Predsjednik, a zatim ostala dva élana Nadzornog\nodbora bira dva Clana IzvrSnog odbora s druge liste koja sacinjava SkupStinu. U\nslucaju da se ne prijavi dovoljno kandidata, Predsjednik Kluba predlaze kandidate\nSkupstini.\n\n(2) SkupStina razrjeSava éGlanove Nadzornog odbora ako ne prihvati izvj", "eSce\nNadzornog odbora.\n\n(3) Odluku o neprihvaéanju izvjeSGa Nadzornog odbora, okupstina donosi vecinom\nglasova prisutnih Clanova Skup§&tine.\n\nUPRAVA KLUBA\n\nClanak 49.\n\n(1) Uprava Kluba vodi poslovanje Kluba i upravlja radom struénih sluzbi Kluba u skladu\nS ovim Statutom, opcim aktima Kluba te odlukama Skup§tine i IzvrSnog odbora.\n(2) Upravu Kluba Cine predsjednik Uprave Kluba i 2 do 4 élana koje bira IzvrSni odbor\n\nKluba.\n\nClanak 50.\n\n(1) Clanovi Uprave Kluba Zastupaju Klub u pravnom prometu bez ograniéenja.\n\n(2) Clanovi Uprave Kluba zastupaju Klub u pravnom prometu na naéin da najmanje 2\nClana uprave potpisuju i zastupaju prema trecim osobama o svakom pitanju iz\ndjelokruga Uprave, a prema Poslovniku o radu Uprave.\n\n(3) Mandat Clanova Uprave Kluba je 4 (éetiri) godine.\nClanak 51.\n\nUprava Kluba:\n\na.\n\nb,\n\nTaD a\n\nprediaze IzvrSnom odboru Pravilnik o djelokrugu i unutarnjem ustrojstvu\nKluba;\n\norganizira obavljanje struénih, tehniékih j pomocnih poslova Kluba i vodi\nposlovnu, sportsku i str", "uénu politiku Kluba, za koje odgovara Izvr&nom\nodboru;\n\nSamostalno sklapa pravne poslove do ukupnog iznosa 3 milijuna eura, a za\nvece ukupne iznose mora ishoditi prethodnu suglasnost Izvr$nog odbora, te\npoduzima druge pravne radnje u ime i za raéun Kluba;\n\nrukovodi i nadzire rad zaposlenika Kluba:\n\nbrine se o provodenju odluka Skupstine i IzvrSnog odbora:\n\npodnosi financijska godiSnja i druga izvjeS¢a Skup$stini Kluba:\n\ndonosi akte sukladno Statutu i odlukama klupskih tijela:\n\nosigurava redovito obavjeStavanje Glanova Kluba o radu i rezultatima Kluba;\nupravija imovinom Kluba;\n\nsklapa ugovore i poduzima pravne radnje u ime i za raéun Kluba;\n\nutvrduje uvjete za sklapanje i raskid ugovora s igracima;\n\ndonosi odluke o organiziranju turnira, odigravanju prijateljskih utakmica te o\nmjestu i vremenu odrzavanja priprema igraéa;\n\n. donosi odiuke o izvanrednom nagradivanju igraéa i ostalih zaposlenika\n\nKluba za postignute rezultate:\n\nprediaze IzvrS8nom odboru godi&njji financijski i poslovni pla", "n te podnosi\nkvartalna izvjeSéa o provedbi tog plana:\n\nobavija i druge poslove sukladno ovom Statutu i odlukama klupskih tijela;\n\nClanak 52.\n\n(1) Za svoj rad i rad struénih sluzbi élanovi Uprave Kluba odgovorni su Izvrsnom\nodboru.\n(2) Clanovi Uprave Kluba ne mogu biti Clanovi drugih klupskih tijela.\n\nClanak 53.\n\nNacine i uvjete svog rada Uprava Kluba ureduje Poslovnikom uz suglasnost IzvrSnog\n\nodbora.\n\nRJESAVANJE SPOROVA I SUKOBA INTERESA\n\nClanak 54.\n\n(1) Postupak pred Nadzornim odborom za rjeSavanje statutarnih i ostalih sporova te\nsukoba interesa moze zahtjevom pokrenuti svako klupsko tijelo, odnosno svaki élan\nKluba ako smatra da postoji spor ili sukob interesa u Klubu.\n(2) Nadzorni odbor o zahtjevu odlucuje u roku od 60 dana od dana podnoSsenja\nzahtjeva.\n\n(3) Nadzorni odbor u svom radu na odgovarajuci naéin primjenjuje odredbe Zakona o\nmirenju.\n\n(4) Odluka Nadzornog odbora o sukobu interesa je konaéna.\n\n(5) Ako pronade da postoji sukob interesa, Nadzorni odbor odreduje i naéin\nrazr", "jeSavanja utvrdenog sukoba interesa.\n\n(6) Sva klupska tijela mogu se obratiti Skup$stini za tumacenje odredbi Statuta i akata\nkoje ona donosi.\n\nIMOVINA, NACIN STJECANJA I RASPOLAGANJE IMOVINOM\n\nClanak 55.\n\n(1) Imovinu Kluba éine:\n\na. novcana sredstva koja je Klub stekao uplatom Clanarina, dobrovoljnim\nprilozima i darovima;\n\nb. novéana sredstva koja Klub stekne obavijanjem djelatnosti kojima se\nostvaruju ciljevi, obavljanjem dijelatnosti_ i gospodarske _ djelatnosti,\nfinanciranjem programa i projekata Kluba iz drZavnog proracuna i proraéuna\njedinica lokalne i podruéne (regionalne) Samouprave te fondova i/ili iz\nInozemnih izvora;\n\nc. nekretnine i pokretne stvari Kluba:\n\nd. druga prava ustanovijena u korist Kluba.\n\n(2) Klub moze raspolagati svojom imovinom samo za ostvarivanje ciljeva i obavijanjem\ndjelatnosti odredenih Statutom Kluba, u skladu sa zakonom.\n\n(3) Visak prihoda nad rashodima koje Klub ostvari koristi se za ostvarivanje ciljeva\nutvrdenih ovim Statutom.\n\nClanak 56.\n\n(1) Odluke", " o stjecanju ili otudivanju pokretnina i nekretnina donosi Uprava Kluba.\n\n(2) Poslovne odluke u vezi kori&tenja financijskih sredstava tijekom kalendarske\ngodine provodi Uprava Kluba koja 0 tome izvjeScuje IzvrSni odbor.\n\n(3) Uprava Kluba odgovorna je za zakonitost koristenja i raspolaganja imovinom, a\nposebice financijskih sredstava Kluba.\n\n(4) Sva dokumentacija o materijalno-financijskom poslovanju Kluba Guva se u\nzakonskim rokovima sa posebnom paznjom u arhivi Kluba.\nPRESTANAK POSTOJANJA KLUBA\n\nClanak 57.\n\n(1) Klub prestaje postojati odlukom Skupstine u skladu s rezultatima provedenog\nreferenduma, ili u drugim sluéajevima predvidenim zakonom.\n\n(2) U sluéaju prestanka postojanja Kluba preostala imovina pripada udruzi, ustanovi,\nZakladi ili drugoj pravnoj osobi koja ima iste ili sligne statutarne ciljeve, a prema\nodluci SkupStine u skladu s rezultatima referenduma.\n\nClanak 58.\n\n(1) Likvidatora Kluba imenuje i opoziva SkupSstina Kluba.\n\n(2) Likvidator zastupa Klub u postupku likvidacij", "e te se otvaranjem likvidacijskog\npostupka upisuje u registar udruga kao osoba ovilagtena za zastupanje Kluba do\nokonCanja postupka likvidacije i brisanja Kluba iz registra udruga.\n\n(3) Osoba koja se bira za likvidatora treba imati potrebnu struénost i iskustvo, s\nobzirom na nadleZnost likvidatora te ne smije imati zapreke iz él. 112. Zakona o\nsportu | cl. 19. st. 2. i 3. Zakona o udrugama.\n\n(4) Pokretanjem postupka likvidacije Kluba prestaju ovlastenja tijela i osoba ovlastenih\nZa zastupanje Kluba.\n\n(5) Postupak likvidacije Kluba provodi likvidator sukladno odredbama Zakona o\nudrugama.\n\nPRIJELAZNE I ZAVRSNE ODREDBE\n\nClanak 59.\n\n(1) Statut stupa na snagu danom donoSenja.\n\n(2) Op¢i akti i ostali potrebni akti Kluba vezani za izbore u Klubu moraju se usuglasiti\nS odredbama ovog Statuta, kao i ustrojiti Izborno povjerenstvo od strane IzvrSnog\nodbora saCcinjene prema prethodnom Statutu, prije datuma prvih izbora koji ée\nustrojiti tijela Kluba prema ovom Statutu. Tijela Kluba ustrojena po p", "rethodnom\nStatutu djeluju do ustroja novih tijela Kluba prema ovom Statutu nakon prvih izbora\nu Klubu.\n\nU Zagrebu, 21.12.2023.\n\n——\n"]