"[\"* hd cae al de Nea * a . \\u2018 . , hd s 5 ae i, . - ioe, bts \\u201c7 ae) - 7 . Ww Bry \\u201c,\\u00b0 \\u00b0 e. . ee eg tal! ~. 5 Me a \\\"2 ; hess Lan , a. \\u20182 i: \\u00b0 as _ . : \\u00bb ark ts \\u201c a3 o) a e Y/ @ Na temelju Clanka 23. stavka 6. tocka 1. i to\\u00a2ka 5. Zakona o pravu na pristup informacijama (NN 25/13, 85/15 i 69/22), (u daljnjem tekstu: Zakon), povodom zahtjeva korisnika prava na pristup informacijama MILJENKA CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb, sluzbenik za informiranje Hrvatskog judo saveza (u daljnjem tekstu: HJS), Ul. lvana Cankara 13, 10 000 Zagreb, O1B:67894852113, donosi dana 18. kolovoza 2025.godine RJESENJE Odbijaju se svi zahtjevi MIJJENKA CVJETKO, Ulica Sv. Mateja 38, 10 000 Zagreb, OIB:34665061509 za pristup informacijama, podneseni dana 11. kolovoza 2025.g., u kojima podnositelj zahtjeva trazi od HRVATSKOG JUDO SAVEZA dostavu informacija o realizaciji judaSa (judoka) Dominika Druzeta, Ane Viktorije Puljiz, Zlatka Kumri\\u00a2 i Barbare Mati\\u00a2 za kalendarske godine: 2020., 2021., 2022., 2023. i 2024.godinu, zahtjev za dostavu informacija o realizaciji judasice (judoke) Nine Simic za kalendarske godine: 2022., 2023. i 2024.godinu, te zahtjev za dostavu informacija o realizaciji judasice (judoke) Lare Cvjetko za 2024.godinu. Obrazlozenje Korisnik prava na pristup informacijama, MILJIENKO CVJETKO, Ulica Sv. Mateja 38, 10 O00 Zagreb, OIB:34665061509 podnio je dana 11.08.2025.g. ukupno 25 zahtjeva za pristup informacijama u kojem trazi od HRVATSKOG JUDO SAVEZA dostavu informacija o realizaciji judaSa (judoka) Dominika Druzeta, Ane Viktorije Puljiz, Zlatka Kumri\\u00a2 i Barbare Matic za kalendarske godine: 2020., 2021., 2022., 2023. i 2024.godinu, zahtjev za dostavu informacija o realizaciji judasice (judoke) Nine Simic za kalendarske godine: 2022., 2023. i 2024.godinu, te zahtjev za dostavu informacija o realizaciji judasice (judoke) Lare Cvjetko za 2024.godinu. Korisnik prava na pristup informacijama poslao je e-mail dana 11.08.2025.g. koji je uputio na sljedece e - mail adrese: office@judo.hr , sluzbenik-informiranje@judo.hr , dean.bogic@judo.hr,ivan.segedi@kif.unizg.hr,ivan.segedi@kif.hr,tadija.orlovic@odata.com.hrr,d.viasta @stucos.hr,ivan.jelencic1946@gmail.com,gkovacic23 @gmail.com,fernando.kirigin@ opatija.hr,kirigin@ hotmail.com,ppi@pristupinfo.hr,pisarnica@pristupinfo.hr,marija.picek@pristupinfo.hr, tajnistvo@uskok.dorh.hr, Subject: Zahtjevi za pristup dokumentaciji za istrage i sudske postupke. Korisnik prava na pristup informacijama je dana 17. veljace 2025.g. podnio gotovo identicne zahtjeve - njih 21., za sve osobe koje i u ovim zahtjevima pobrojava, s tim da je sada ukljucio dodatno i judasicu (judoku) Ninu Simi\\u00a2, te trazi istu dokumentaciju \\u2014 realizaciju po kalendarskim godinama. Dana 03.03.2025.g. tijelo javne vlasti \\u2014 Hrvatski judo savez- donio je Rjesenje kojim odbija podnositelja u odnosu na sve podnesene zahtjeve. Nije poznato da li je podnositelj zahtjeva na to Rjesenje kojim se kumulativno rjeSavalo od 21. zahtjevu podnio zalbu Povjereniku za informiranje. 7 . . . RK \\u2018 . a - ' - . .. . . . .? . os . Poh oe ar re Aen ve o . a e . wad al. \\u2018 Lt o eres 4 See Soe : MQ. tee 2 Nie: *. tached .; yy <> pha by gt + . \\\".e. A yt A TE - _- S GAs see \\u00ab=A 4 a 5\", \"ahs, . + ae ea fs \\u201ceS ghz: mi HRVATSKI JUDO SAVEZ \\u00bb CROATIAN JUDO FEDERATION 10000 ZAGREB = Ulica lvana Cankara 13 \\u00ab tel: +385 1 301 23 49 + OIB: 67894852113 + e-mail: office@judo.hr \\u00bb web: www.judo.hr . ts Aw oo a e . ar, Se 5 * * we, \\u201c cat, oy vere - . ve . te \\u2018 \\u2018 \\u00a9 oe TR - mo ~ \\u20182 \\u2014 P \\u2014 kel ene a % + CRON JUDO/Y @ Tekst e-maila od 11.08.2025.g. koji prati sada 25. podnesena zahtjeva nejasan je i konfuzan u smislu razloga trazenja pristupa informacijama, pa se tijelo javne viasti nece u ovom Rjesenju posebno referirati na taj tekst. Obzirom je u odnosu na podnositelja zahtjeva pravno situacija nepromijenjena, odnosno sve okolnosti su identi\\u20acne onima u oZujku 2025.godine (trajanje sudskog postupka), to je tijelo javne vlasti odlucilo kako se u dispozitivu navodi. Odredbom Clanka 23. stavkom 6., tocka 1. Zakona o pravu na pristup informacijama propisano je da ce tijelo javne viasti rjesenjem odbiti zahtjev ako se ispune uvjeti propisani u clanku 15. stavku 1. citiranog Zakona. Obzirom je situacija nepromijenjena, odnosno i dalje se pred Opcinskim kaznenim sudom u Zagrebu vodi kazneni postupak, poslovni broj: K-240/2022, privatni tuZitelj HJS, optuzenik Miljenko Cvjetko, datum pokretanja postupka 18.02.2022.g., radi kaznenog djela iz cl.147 st.2. Kaznenog zakona \\u2014 Uvreda \\u2014 kaznena djela protiv Casti i ugleda, to za vrijeme trajanja postupka tijelo javne viasti ima zakonsku obvezu ogranicavanja pristupa informacijama. Zatrazene informacije referiraju se i na citirani kazneni postupak. Nadalje, odredbom Clanka 23. stavkom 6. tockom 5. Zakona 0 pravu na pristup informacijama, propisano je da Ce tijelo javne viasti rjesenjem odbiti zahtjev ako jedan ili vise medusobno povezanih podnositelja putem jednog ili vise funkcionalno povezanih zahtjeva ocito zloupotrebljava pravo na_ pristup informacijama, a osobito kada zbog ucestalih zahtjeva za dostavu istih ili istovrsnih informacija ili zahtjeva kojima se trazi velik broj informacija dolazi do opterecivanja rada i redovitog funkcioniranja tijela javne viasti. Podnositelj je podnio istog dana 11.08.2025.g. ukupno 25 zahtjeva, koji zahtjevi su sadrzajno identicni u smislu dokumenta koji se trazi - realizacija, te U odnosu na veci broj osoba i za dugi vremenski period ( 2020\\u20142024.g.), gdje bi sve i da nema sudskog kaznenog postupka kao zapreke udovoljavanja tolikom broju zahtjeva, bilo evidentno opterecivanje rada i redovnog funkcioniranja tijela javne vlasti. PonaSsanje podnositelja u smislu podnosenja tolikog broja zahtjeva potvrduje da isti koristi pravo na pristup informacijama suprotno njegovoj svrsi, odnosno zbog razloga koji se ne mogu povezati s javnim interesom, te da isti ne postupa s ciljem pribavljanja informacija od javnog znacaja. S obzirom na prethodno navedeno, odluceno je kao u izreci ovoga rjesenja. UPUTA O PRAVNOM LUIJEKU: Protiv ovog rjegenja moze se izjaviti Zalba Povjereniku za informiranje u Zagrebu, Trg Zrtava fasizma 3, u roku od 15 dana od dana dostave RjeSenja. Zalba se izjavijuje putem tijela javne vlasti. Sluzbenik za informiranje HRVATSKOG JUDO SAVEZA pen Bogie ral c. EID inal Dostaviti: Postom na adresu MIUJENKO CVJETKO, Ulica Sv. Mateja 38,\", \"10 000 Zagreb e-mailom : miljenko.cvjetko@gmail.com a . . + a Rot eo? J Ps sb og: + * . a *, _* \\u00bb C . \\u00bb a re ry 7 Sony aro : . wel\\u201d ~s eo ae ora \\u20ac 7 * 5 Ree BSN ee | HRVATSKI JUDO SAVEZ \\u00bb- CROATIAN JUDO FEDERATION 10000 ZAGREB = Ulica lvana Cankara 13 - tel: +385 1301 23 49 - OIB: 67894852113 + e-mail: office@judo.hr \\u00bb web: www.judo.hr 7* om : > #: wt . Sa\"]"