"[\"Na temelju clanka 13. Zakona o udrugama (Narodne novine, br. 74/14, 70/17, 98/19 i 151/22) i \\u010dlanka 30. Zakona o sportu (Narodne novine, br. 141/22) na sjednici Skup\\u0161tine Gradanskog nogometnog kluba \\u201eDinamo\\\" odr\\u017eanoj 21.12.2023. donesen je:\\n\\n## STATUT GRADANSKOG NOGOMETNOG KLUBA \\u201eDINAMO\\\"\\n\\n## OSNOVNE ODREDBE\\n\\n## Clanak 1.\\n\\nOvim Statutom ureduju se: naziv i sjediste udruge; podru\\u010dje i ciljevi djelovanja; zastupanje; djelatnost; gospodarska djelatnost; na\\u010din osiguranja javnosti djelovanja udruge; uvjeti i na\\u010din u\\u010dlanjivanja; prestanak \\u010dlanstva; prava, obveze i odgovornosti \\u010dlanova; popis \\u010dlanova; tijela udruge, njihov sastav i na\\u010din sazivanja sjednica; izbor, opoziv, ovlasti, odgovornost, na\\u010din odlu\\u010divanja i trajanje mandata; na\\u010din rje\\u0161avanja sporova i sukoba interesa unutar udruge; na\\u010din sazivanja Skup\\u0161tine u slu\\u010daju isteka mandata; izbor i opoziv likvidatora; prestanak postojanja udruge; imovina, na\\u010din stjecanja i raspolaganja imovinom; postupak s imovinom u slu\\u010daju prestanka postojanja\", \" udruge te ostala pitanja od znacaja za udrugu.\\n\\n## Clanak 2.\\n\\n- (1) Naziv Udruge je: Gradanski nogometni klub \\u201eDinamo\\\".\\n- (3) Gradanski nogometni klub \\u201eDinamo\\\" profesionalni sportski nogometni klub.\\n- (2) Skraceni naziv Udruge je: GNK \\u201eDinamo\\\"\\n- (4) Sjedi\\u0161te kluba je u Zagrebu, Maksimirska cesta 128.\\n\\n## \\u010clanak 3.\\n\\n- 1) Gradanski nogometni klub \\u201eDinamo\\\" (u dalinjem tekstu: Klub) je udruga registrirana 1 Registru udruga Republike Hrvatske i Evidenciji pravnih osoba u sportu\\n- (2) Klub je neprofitna pravna osoba.\\n- (1) Klub ima pe\\u010dat.\\n\\n## \\u010clanak 4.\\n\\n- (2) Pecat je okruglog oblika, promjera 35 mm, sa ispisanim nazivom i mjestom sjedi\\u0161ta Kluba po obodu pe\\u010data i znakom u sredini.\\n\\n## Clanak 5.\\n\\n- (1) Obilje\\u017eja Kluba su znak/amblem/grb i plava boja, a koja slijede izgled obilje\\u017eja i sportsku tradiciju Prvog hrvatskog gradanskog sportskog kluba Zagreb, odnosno 1. HSK Gradanskog.\\n- (2) Znak/amblem/grb Kluba je kru\\u017enog oblika i simbolizira oblik nogometne lopte, a \\u0161to ukazuje na osnovnu djelat\", \"nost Kluba.\\n- (3) Osnova znaka/amblema/grba sastavljena je od dva polukruga: povijesnog hrvatskog grba s naizmjenichim crvenim i bijelim poljima i tradicionalnog u plavoj boji Grada Zagreba s bijelim slovom 'd' koje predstavlja po\\u010detno slovo naziva Kluba \\u201eDinamo\\\".\\n- (4) Sve linije unutar znaka/amblema/grba i rub znaka/amblema/grba su u boji zlata.\\n- (5) Klub ba\\u0161tini sportsku povijest i rezultate nastale pod imenima 1. HSK Gradanski, NK \\u201eDinamo\\\", NK HASK-Gradanski i NK Croatia.\\n\\n## Clanak 6.\\n\\n- (1) O promjeni imena, grba, boje, lokacije stadiona, preoblikovanja, pripajanja, spajanja ili podjele Kluba i dobrovoljnog prestanka rada Kluba saziva se obvezuju\\u0107i referendum svih punoljetnih i poslovno sposobnih \\u010dlanova Kluba, tako da na njemu mora sudjelovati najmanje 70 % \\u010dlanova Kluba s pravom glasa, a odlu\\u010duje se obi\\u010dnom vecinom.\\n- (2) Referendum svih \\u010dlanova Kluba mora sazvati Predsjednik Kluba u slu\\u010dajevima iz st. 1. ovog \\u010dlanka.\\n\\n## \\u010clanak 7.\\n\\nKlub zastupaju Predsjednik, Dopredsjednik i \", \"Uprava, sukladno odredbama ovog Statuta.\\n\\n## \\u010clanak 8.\\n\\n## (1) Klub:\\n\\n- a. postupa sukladno Pravilima nogometne igre koje je donio Medunarodni nogometni savez BOARD (IFAB);\\n- b. po\\u0161tuje na\\u010dela privr\\u017eenosti, integriteta i sportskog pona\\u0161anja kao izraza fairplaya;\\n- c. postuje statut, pravilnike i odluke FIFA-e i UEFA-e i Hrvatskog nogometnog saveza (HNS) u svako vrijeme;\\n- d. priznaje nadle\\u017enost Arbitra\\u017enog suda za sport (CAS) u Lausanni (Svicarska), kao \\u0161to je utvrdeno relevantnim odredbama Statuta FIFA-e, UEFA-e;\\n- e. priznaje nadle\\u017enost Arbitra\\u017enog suda HNS-a i sukladno tome podnosit ce sve sporove nacionalnih razmjera, koji su nastali iz ili u vezi s primjenom Statuta ili pravilnika HNS-a, u posljednjoj instanci samo tim arbitra\\u017eama, koje rje\\u0161avaju svoje sporove, iskljucujuci svaki redovni sud, osim ukoliko je to izri\\u010dito zabranjeno va\\u017ee\\u0107im zakonodavstvom u Republici Hrvatskoj.\\n- (3) Klub po\\u0161tuje sve odluke nadle\\u017enih tijela HNS-a, FIFA-e i UEFA-e i CAS-a.\\n- (2) U slu\\u010daju sporova za \", \"koje su nadle\\u017ena pravosudna tijela FIFA-e, UEFA-e, CAS-a, Arbitraznog suda Saveza ili pravnih tijela Saveza, Klub se obvezuje da spor nece iznositi pred redovne sudove.\\n\\n## CILJEVI, PODRUCJE DJELOVANJA SUKLADNO CILJEVIMA, DJELATNOST I GOSPODARSKE DJELATNOSTI\\n\\n## \\u010clanak 9.\\n\\n## (1) Ciljevi Kluba su:\\n\\n- a. okupljanje gradana, djece i mlade\\u017ei kroz \\u0161kole nogometa;\\n- b. razvoj i unapredenje nogometa te postizanje vrhunskih sportskih rezultata;\\n- c. sudjelovanje u nogometnim natjecanjima u zemlji i inozemstvu;\\n- d. stru\\u010dno i profesionalno osposobljavanje i usavr\\u0161avanje sportskih djelatnika;\\n- (2) Klub mo\\u017ee podr\\u017eavati mu\\u0161ku, \\u017eensku i veteransku nogometnu ekipu, futsal ekipu te ostale varijacije s cijem razvoja i popularizacije nogometnog sporta.\\n- e. stvaranje potrebnih uvjeta za bavljenje nogometom, trening, organizaciju stru\\u010dnog rada i natjecanje svih ekipa Kluba.\\n- (3) Klub sukladno ciljevima djeluje na podru\\u010dju sporta.\\n\\n## Clanak 10.\\n\\n- a. sudjelovanje u profesionalnim ili amaterskim natje\", \"canjima na lokalnoj, dr\\u017eavnoj i medunarodnoj razini u nogometnom sportu za sve uzraste;\\n\\n## Djelatnosti Kluba su:\\n\\n- b. strucno-pedagoski rad sa svim uzrastima sporta\\u0161a, osobito kroz nogometne skole; organizirano vodenje treninga i sportskih priprema;\\n- d. stvaranje materijalnih, tehni\\u010dkih infrastrukturnih i drugih uvjeta za bavljenje nogometnim sportom; upravljanje, odrzavanje i skrb o daljnjoj izgradnji sportskih objekata kojima Klub raspola\\u017ee;\\n- c. osposobljavanje i usavr\\u0161avanje vlastitog stru\\u010dnog i pedago\\u0161kog kadra;\\n- e. osiguravanje svih potrebnih uvjeta za sudjelovanje u natjecanju prema uvjetima za licenciranje HNS-a i UEFE (stru\\u010dno-pedago\\u0161ki trenerski kadrovi, administrativni kriteriji, sportski kriteriji, infrastrukturni kriteriji i financijski kriteriji);\\n- f. suradnja \\u2026sa suda\\u010dkim, trenerskim drugim stru\\u010dnim sportskim organizacijama na lokalnoj, drzavnoj i medunarodnoj razini;\\n- g. suradnja s drugim nogometnim i sportskim klubovima;\\n- h. suradnja s tijelima dr\\u017eavne te lokaln\", \"e i regionalne vlasti, pravnim i fizi\\u010dkim osobama u ispunjavanju sportskih interesa i ciljeva;\\n- j. izdavanje biltena, glasila, monografija, priru\\u010dnika i drugih tiskovina vezano uz nogometni sport i Klub;\\n- i. organizirano okupljanje \\u010dlanstva Kluba svih uzrasta;\\n- k. poticanje i promicanje nogometa kao sporta u skladu s aktima strate\\u0161kog planiranja razvoja sporta na nacionalnoj razini, odnosno nacionalnom strategijom razvoja sporta i nacionalnim planom razvoja sporta te strate\\u0161kim dokumentima donesenim na podru\\u010dnoj (regionalnoj) razini, a osobito sporta djece i mlade\\u017ei, te zdravstveno usmjerenog tjelesnog vje\\u017ebanja i zdravstveno usmjerene tjelesne aktivnosti sporta\\u0161a;\\n- m. provodenje edukaciju, informiranje i savjetovanje sporta\\u0161a, sportskih djelatnika, gradana i ostalih sudionika u sportu o pitanjima bitnim za bavljenje sportskim aktivnostima i djelatnostima;\\n- I. sudjelovanje u ostvarivanju uvjeta za provodenje zdravstvene skrbi sporta\\u0161a te sudjeluje u edukaciji sporta\\u0161a o antidoping\", \"u;\\n- n. poduzimanje aktivnosti za sprje\\u010davanje negativnih pojava u sportu, posebno za sprje\\u010davanje nasilja u sportu i kr\\u0161enja prava djece;\\n- p. unos i azuriranje podataka za koje je nadle\\u017ean Klub u Nacionalni informacijski sustav u sportu;\\n- o. promicanje stru\\u010dnog rada u sportu, te sudjelovanje u unapredenju stru\\u010dnog rada i skrbi o osposobljavanju stru\\u010dnih djelatnika;\\n9. obavlja i druge poslove, djelatnosti i zada\\u0107e odredene zakonom i ovim Statutom.\\n\\n## Clanak 11.\\n\\n- (1) Gospodarske djelatnosti koje Klub obavlja su:\\n- a. izdava\\u010dka djelatnost;\\n- b. prodaja vlastitih proizvoda na malo izvan prodavaonica, sukladno Zakonu o trgovini;\\n- c. promid\\u017ebene djelatnosti;\\n- d. davanje u zakup i podzakup vlastitih poslovnih prostora i mjesta za ogla\\u0161avanje;\\n- (3) Djelatnosti iz st. 1. ovog \\u010dlanka ne mogu se obavljati radi stjecanja dobiti za svoje \\u010dlanove ili tre\\u0107e osobe.\\n- (2) Djelatnosti iz st. 1. ovog \\u010dlanka Klub obavlja u skladu s posebnim propisima koji ureduju gospodarsko poslovanje udruga kao\", \" pravnih osoba.\\n- (4) Ako u obavijanju gospodarskih djelatnosti Klub ostvari dobit ona se mora koristiti isklju\\u010divo za obavljanje i unapredenje djelatnosti Kluba kojima se ostvaruju ciljevi Kluba, utvrdeni ovim Statutom, sukladno zakonu.\\n\\n## \\u010clanak 12.\\n\\nKlub mo\\u017ee osnivati trgova\\u010dka dru\\u0161tva prema odredbama Zakona o trgova\\u010dkim dru\\u0161tvima, kao i druge oblike pravnih osoba u skladu s posebnim propisima, ako je to u cilju osiguranja materijalnih uvjeta rada i razvoja Kluba.\\n\\n## Clanak 13.\\n\\n- (1) Djelovanje Kluba je javno, a ostvaruje se putem:\\n- a. internetskih stranica Kluba, aplikacija i dru\\u0161tvenih mre\\u017ea,\\n- c. povjerenika Kluba,\\n- b. javnih medija,\\n- d. ostalih na\\u010dina informiranja sukladno odluci Uprave Kluba.\\n- (3) O nacinu javnosti rada Kluba i obavje\\u0161tavanja \\u010dlanova, Uprava Kluba donosi odluku.\\n- (2) Clanove Kluba pravodobno se obavje\\u0161tava o radu Kluba, aktima i odlukama njegovih tijela posebnim izvje\\u0161\\u0107ima te skupovima za \\u010dlanove koji se organiziraju najmanje jednom godi\\u0161nje \\u0161to je defi\", \"nirano Pravilnikom o \\u010dlanstvu.\\n\\n## Clanak 14.\\n\\n- (1) Klub se mo\\u017ee udru\\u017eiti u saveze udruga, zajednice, mre\\u017ee i u medunarodne udruge.\\n- (2) Odluku o udruzivanju donosi Skup\\u0161tina.\\n\\n## \\u010cLANSTVO\\n\\n## Clanak 15.\\n\\n- (1) Clanom Kluba mo\\u017ee postati svaka fizi\\u010dka osoba koja ispunjavanjem pristupnice prihva\\u0107a na\\u010dela, Statut i druge akte Kluba.\\n- (3) Primitak u \\u010dlanstvo odobrava Uprava Kluba i osobe koje Uprava zadu\\u017ei za \\u010dlanstvo, ako ne postoje prepreke iz ovog Statuta ili zakona, a na temelju ispunjene pristupnice. Odbijanje mora biti obrazlo\\u017eeno u roku od 30 dana i osoba koja je podnijela zahtjev mo\\u017ee podnijeti \\u017ealbu Nadzornom odboru u roku od 15 dana od primitka odbijanja.\\n- (2) \\u010clanom Kluba se postaje upisom u jedinstveni Popis \\u010dlanova koji vodi stru\\u010dna sluzba po odluci Uprave Kluba.\\n- (4) Osobe mlade od 18 godina, kao i osobe li\\u0161ene poslovne sposobnosti mogu postati \\u010dlanom Kluba. Za osobu mladu od 14 godina pisanu izjavu o u\\u010dlanjivanju u udrugu daje zakonski zastupnik ili skrbnik, a za malolj\", \"etnu osobu s navrsenih 14 godina zakonski zastupnik ili skrbnik daje pisanu suglasnost.\\n- (5) Maloljetnici te osobe li\\u0161ene poslovne sposobnosti ne mogu biti \\u010dlanovi klupskih\\n- (6) Svaki clan moze dobiti clansku iskaznicu \\u010diji izgled definira Uprava Kluba.\\n- (8) U arhivi se \\u010duvaju privole o kori\\u0161tenju osobnih podataka u skladu s propisima o zastiti podataka, adrese stanovanja, brojeve telefona i mobilnih telefona, adrese epo\\u0161te i ostali podaci iz pristupnice koju ispunjavaju \\u010dlanovi pri u\\u010dlanjenju.\\n- (7) Jedinstveni popis \\u010dlanova vodi se elektroni\\u010dki i obavezno sadr\\u017ei podatke o osobnom imenu, osobnom identifikacijskom broju (OIB), datumu rodenja, datumu pristupanja Klubu te datumu prestanka \\u010dlanstva u Klubu.\\n- (9) Jedinstveni popis \\u010dlanova uvijek je dostupan na uvid svim \\u010dlanovima i nadle\\u017enim tijelima na njihov zahtjev u skladu sa zakonima i drugim propisima o za\\u0161titi podataka.\\n\\n## Clanak 16.\\n\\n- (1) Visinu \\u010dlanarine odreduje Izvr\\u0161ni odbor.\\n- (2) \\u010clan je du\\u017ean uplatiti \\u010dlanarinu u roku o\", \"d 15 dana od dana potpisivanja pristupnice u \\u010dlanstvo Kluba.\\n- (3) Clanstvo po\\u010dinje datumom upisa u jedinstveni Popis \\u010dlanova i zavr\\u0161ava istekom te kalendarske godine. Po isteku kalendarske godine, \\u010dlanstvo se obnavlja za iducu kalendarsku godinu novom uplatom godi\\u0161nje \\u010dlanarine, a prava i obveze prema ovom Statutu teku od trenutka obnove.\\n\\n## Clanak 17.\\n\\n- (1) Klub je neutralan po pitanjima politike i vjere.\\n- (3) \\u010clan ne mo\\u017ee biti osoba koja svojim pona\\u0161anjem i radnjama nanosi materijalnu ili nematerijalnu stetu Klubu te koja nasilni\\u010dkim, diskriminatornim i rasisti\\u010dkim ponasanjem radnjama onemogucava ostvarenje ciljeva i obavljanje djelatnosti, te \\u0161teti ugledu Kluba.\\n- (2) Diskriminacija bilo koje vrste prema dr\\u017eavama, osobama ili rodnim skupinama osoba temeljena na njihovoj rasi, nacionalnosti, vjeri, spolu, jeziku, politi\\u010dkom opredjeljenju ili bilo \\u010demu drugome zabranjena je i predstavlja razlog za isklju\\u010denje iz Kluba u stegovnom postupku.\\n\\n## \\u010clanak 18.\\n\\n## Prava \\u010dlanova su:\\n\\n- a\", \". birati i biti biran u tijela Kluba te pravo glasa na referendumu, \\u0161to vrijedi za punoljetne i poslovno sposobne \\u010dlanove Kluba koji su bili \\u010dlanovi u prethodnoj kalendarskoj godini, osim u slu\\u010daju imenovanja \\u010dlanova Uprave;\\n- c. sudjelovati u radu i upravljanju Klubom putem izabranih predstavnika u Skupstini i drugim tijelima Kluba;\\n- b. pridonositi afirmaciji i ugledu Kluba u zemlji i inozemstvu;\\n- d. biti pravodobno obavje\\u0161tavani o radu Kluba i aktima i odlukama njegovih tijela na na\\u010din propisan Statutom, posebnim aktima i odlukama Uprave;\\n- f. predlagati to\\u010dke dnevnog reda Skup\\u0161tine izabranim predstavnicima u Skup\\u0161tinu;\\n- e. Komunicirati pisano te putem javne tribine jednom godi\\u0161nje s tijelima Kluba u okviru njihove nadle\\u017enosti i dobiti pravodobne odgovore;\\n9. biti nagraden pocasnim odlikovanjima za doprinos ili za dugotrajno \\u010dlanstvo;\\n- h. prednost u kupnji ulaznica na na\\u010din koji odredi Uprava.\\n\\nDu\\u017enosti i odgovornosti \\u010dlanova su:\\n\\n- a. pla\\u0107anje \\u010dlanarine te po\\u0161tivanje Statuta i d\", \"rugih akata Kluba;\\n- c. suzdr\\u017eavanje od pona\\u0161anja i radnji koje \\u0161tete Klubu i njegovu ugledu.\\n- b. podupiranje Kluba i aktivno sudjelovanje u ostvarenju ciljeva Kluba;\\n\\n## \\u010clanak 20.\\n\\nNogometa\\u0161i koji su \\u010dlanovi Kluba pored prava i obveza iz \\u010dl. 18. i 19. ovog Statuta imaju i druga prava, obveze i odgovornosti utvrdene ugovorima te odlukama klupskih tijela.\\n\\n## Clanak 21.\\n\\n- (1) \\u010clanstvo u Klubu i njegovim tijelima prestaje:\\n- a. dragovoljnim istupom,\\n- b. nepla\\u0107anjem \\u010dlanarine,\\n- d. smr\\u0107u,\\n- c. isklju\\u010denjem u stegovnom postupku,\\n- e. postojanjem zapreka propisanih u pravnim propisima.\\n- (2) \\u010clanstvo prestaje i \\u010dlan se bri\\u0161e iz Jedinstvenog popisa \\u010dlanova bez posebne odluke ako ne plati clanarinu unutar kalendarske godine.\\n\\n## Clanak 22.\\n\\n- (1) Stegovne mjere prema clanovima Kluba su opomena, suspenzija i isklju\\u010denje, koje mo\\u017ee biti trajno ili na odredeni vremenski rok.\\n- (2) Opomena i suspenzija izri\\u010de se \\u010dlanu koji svojim djelovanjem naru\\u0161ava ugled Kluba.\\n- (4) Stegovni postupak pokre\", \"\\u0107e se na zahtjev bilo kojeg \\u010dlana klupskih tijela.\\n- (3) \\u010clan mo\\u017ee biti isklju\\u010den iz Kluba ako djeluje protivno ciljevima Kluba te zbog nepostivanja Statuta, drugih opcih akata i odluka klupskih tijela.\\n- (5) Odluku o stegovnim mjerama donosi Uprava.\\n- (7) Nadzorni odbor je du\\u017ean rije\\u0161iti \\u017ealbu u roku od 30 dana, ra\\u010dunaju\\u0107i od dana dostave zalbe.\\n- (6) Isklju\\u010deni \\u010dlan ima pravo u roku od 15 dana, ra\\u010dunaju\\u0107i od dana dostave odluke, podnijeti \\u017ealbu Nadzornom odboru.\\n- (8) Odluka Nadzornog odbora o isklju\\u010denju je kona\\u010dna.\\n\\n## \\u010clanak 23.\\n\\n- (1) Povjerenik mo\\u017ee biti svaki \\u010dlan Kluba koji je podnio zamolbu i koji ispunjava sljedece uvjete:\\n- a. osoba je s potpunom poslovnom sposobno\\u0161\\u0107u;\\n\\n## Clanak 19.\\n\\n- b. da je prije podno\\u0161enja zamolbe, na njegovu preporuku u Klub u\\u010dlanjeno najmanje 20 novih \\u010dlanova Kluba;\\n- d. da ne postoje zapreke iz ovog Statuta.\\n- c. da je najmanje 5 (pet) godina neprekidno \\u010dlan kluba prije podno\\u0161enja zamolbe ili da je najmanje 2 (dvije) godine neprekidno \\u010dlan kluba i \", \"na \\u010diji se prijedlog u\\u010dlani najmanje 50 \\u010dlanova kluba;\\n- (2) Odluku o imenovanju povjerenika donosi Uprava Kluba.\\n- (4) Uprava Kluba mo\\u017ee s imenovanim povjerenikom zaklju\\u010diti ugovor o medusobnim pravima i obvezama.\\n- (3) Povjerenik je du\\u017ean animirati i poticati u\\u010dlanjivanje novih \\u010dlanova Kluba te izvje\\u0161tavati svoje \\u010dlanove drugim va\\u017enim temama koje se odnose na ostvarivanje ciljeva Kluba i obavijanje njegove djelatnosti.\\n\\n## TIJELA KLUBA\\n\\n## Clanak 24.\\n\\n- (1) Klupska tijela su:\\n- a. Skupstina,\\n- c. Predsjednik i Dopredsjednik Kluba,\\n- b. Izvr\\u0161ni odbor,\\n- a. Nadzorni odbor,\\n- e. Uprava Kluba.\\n- (2) U klupska tijela mogu biti izabrani samo punoljetni i poslovno sposobni \\u010dlanovi Kluba.\\n\\n## \\u010clanak 25.\\n\\n- (1) \\u010clanovi klupskih tijela ne mogu biti osobe za koje postoji zapreka iz \\u010dl. 111. i 112. Zakona o sportu i iz \\u010dl. 19. st. 2. i 3. Zakona o udrugama.\\n- a. koje su aktivni nogometni sudac, ili osoba koja je to bila u posljednje 3 (tri) godine;\\n- (2) \\u010clanovi klupskih tijela uz razloge iz st.\", \" 1. ne mogu biti osobe:\\n- b. koje ne mogu biti \\u010dlanovi Uprave odnosno nadzornog odbora dionickog dru\\u0161tva prema odredbama Zakona o trgova\\u010dkim dru\\u0161tvima i Zakona o sprje\\u010davanju sukoba interesa u obna\\u0161anju javnih du\\u017enosti;\\n- d. koje svojim djelovanjem mogu neposredno utjecati na sustav natjecanja u odgovaraju\\u0107em sportu, a osobito sporta\\u0161i koji su profesionalni prema Zakona o sportu, menad\\u017eeri i posrednici u sportu, kao i osobe koje su to bile u razdoblju od posljednjih godinu dana;\\n- c. koji su dioni\\u010dari ili \\u010dlanovi drugog nogometnog kluba;\\n- e. koje su posljednjih godinu dana bile \\u010dlanovi ili \\u010dlanovi tijela pravne osobe koja obavlja djelatnost organiziranja sportske kladionice;\\n- f. koje s menad\\u017eerima i posrednicima u istome sportu i \\u010dlanovima pravnih osoba te clanovima tijela pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica djeluju zajedni\\u010dki;\\n- g. koje imaju ili su pos|jednjih godinu dana imale sklopljen ugovor sa nogometa\\u0161em ili nogometnim trenerom na temelju\", \" kojega ostvaruje pravo na dio prihoda koji proizlaze iz obavljanja djelatnosti nogometa\\u0161a ili nogometnog trenera;\\n10. prekr\\u0161aje u sportu i u vezi sa sportom i sportskim natjecanjima;\\n- k. koje ne ispunjavaju druge uvjete propisane Zakonom o sportu i drugim zakonima.\\n- J. koje su pravomo\\u0107no osudene na kaznu zatvora u trajanju od najmanje 6 (\\u0161est) mjeseci za neko od kaznenih djela po\\u010dinjena s namjerom, a nije primijenjena uvjetna osuda godinu dana od odslu\\u017eenja kazne;\\n- I. koje su aktivni igra\\u010d, trener ili zaposlenik Kluba, a ako to postanu tijekom mandata u tijelima Kluba, prestaje im mandat i clanstvo u tijelu, osim \\u010dlanovima Uprave Kluba.\\n- (3) Svaki \\u010dlan Kluba koji ulazi u bilo koja tijela Kluba mora potpisati izjavu kojom izjavljuje da za njega ne vrijede gore navedeni uvjeti te da ce u slu\\u010daju nastupa gore navedenih uvjete odmah obavijestiti Upravu Kluba.\\n\\n## Clanak 26.\\n\\n- (1) Mandat \\u010dlanovima klupskih tijela prestaje i prije isteka roka u slu\\u010daju:\\n- a. pisane ostavke ili zapisnik\", \"om konstatirane ostavke - danom zaprimanja ostavke odnosno ovjerom zapisnika;\\n- b. izbora novog saziva klupskog tijela;\\n- d. nastupa okolnosti iz \\u010dlanka 21. i 25. ovog Statuta;\\n- C. potpunog ili djelomicnog gubitka poslovne sposobnosti;\\n- e. nastupa druge okolnosti zbog koje vi\\u0161e ne mo\\u017ee biti \\u010dlanom klupskog tijela. (2) Na mjesto \\u010dlana Skup\\u0161tine koji je prestao biti \\u010dlan Skup\\u0161tine prije isteka mandata na koji je izabran imenuje se novi \\u010dlan s popisa zamjenskih \\u010dlanova Skup\\u0161tine u obje izborne jedinice. U slu\\u010daju da se iscrpi broj zamjena, Skup\\u0161tina nastavlja funkcionirati s brojem preostalih \\u010dlanova Skup\\u0161tine.\\n- (4) Novoizabranom \\u010dlanu Izvr\\u0161nog odbora mandat traje do isteka mandata Izvr\\u0161nog odbora.\\n- (3) Novoimenovanom \\u010dlanu Skup\\u0161tine prema st. 2. ovog \\u010dlanka, mandat traje do isteka mandata Skup\\u0161tine.\\n- (5) Novoizabranom \\u010dlanu Nadzornog odbora mandat traje do isteka mandata Nadzornog odbora.\\n\\n## SKUP\\u0160TINA\\n\\n## Clanak 27.\\n\\n- (1) Skup\\u0161tina je najvi\\u0161e tijelo upravljanja Klubom.\\n- (2) Skups\", \"tinu sa\\u010dinjava 60 predstavnika \\u010clanova Kluba, na na\\u010din da:\\n- 25 \\u010dlanova Skup\\u0161tine biraju svi \\u010dlanovi Kluba na izborima te lista s najvi\\u0161e glasova ulazi u cijelosti u Skup\\u0161tinu\\n- 35 \\u010dlanova Skup\\u0161tine bira Izvr\\u0161ni odbor iz redova prijavljenih kandidata tajnim glasovanjem\\n\\n## Clanak 28.\\n\\n- (1) Izbori za Skup\\u0161tinu Kluba odr\\u017eavaju se u dvije izborne jedinice:\\n2. Izbor\\u0131 u prvoj izbornoj jedinici na kojima sudjeluju punoljetni i poslovno sposobni clanovi koji imaju va\\u017ee\\u0107e \\u010dlanstvo u trenutku izbora i u prethodnoj kalendarskoj godini, koji glasuju za izborne liste koje uz nositelja liste, sadrze i popis kandidata za svih 25 mjesta u Skup\\u0161tini i najmanje pet zamjenskih kandidata za \\u010dlanove Skup\\u0161tine. Lista koja dobije najve\\u0107i broj glasova popunjava sva mjesta za prvu izbornu jedinicu;\\n- druga izborna jedinica za koju punoljetni i poslovno sposobni \\u010dlanovi s va\\u017ee\\u0107im \\u010dlanstvom u trenutku izbora i u prethodnoj kalendarskoj godini, mogu poslat\\u0131 kandidature Izbornom povjerenstvu, a iz koje ce 35 \\u010dla\", \"nova Skup\\u0161tine kao cjelovitu listu izabrati Izvr\\u0161ni odbor uz pet zamjenskih kandidata.\\n- (2) Liste iz obje izborne jedinice imaju nositelje koji su i kandidati za Predsjednika. Nositelj liste koja je pobijedila u prvoj izbornoj jedinici je jedan kandidat za Predsjednika, a izmedu 35 \\u010dlanova Skup\\u0161tine iz druge izborne jedinice Predsjednik Kluba imenuje nositelja liste koji je kandidat za Predsjednika druge izborne jedinice. Izmedu dva kandidata za Predsjednika Skup\\u0161tina glasa za Predsjednika Kluba. Nositelji lista kao kandidati za Predsjednika moraju imati plan upravljanja Klubom u svom mandatu dostupan clanovima Kluba prije izbora, koji dostavljaju Izbornom povjerenstvu. Liste u prvoj izbornoj jedinici moraju imati potpise podr\\u0161ke najmanje 100 punoljetnih i poslovno sposobnih \\u010dlanova Kluba s va\\u017ee\\u0107im \\u010dlanstvom u trenutku potpisivanja i u kalendarskoj godini koja prethodi izbornim procesima.\\n- (4) Detalje izbornih postupaka i referenduma ureduje Pravilnik o izborima u Klubu.\\n- (3) Izborn\", \"a Skup\\u0161tina se mora odr\\u017eati najkasnije 30 dana od dana izbora.\\n\\n## Clanak 29.\\n\\n- (1) Skupstina zapo\\u010dinje utvrdivanjem \\u010dlanova Skup\\u0161tine i prisutnog broja \\u010dlanova od strane Predsjednika Kluba na temelju dostavljenih verificiranih listi kod Izborne Skup\\u0161tine te popisa promjena \\u010dlanova Skup\\u0161tine od strane Izvr\\u0161nog odbora.\\n- (3) Na Izbornoj Skup\\u0161tini, nakon izbora Predsjednika Kluba, Predsjednik Kluba automatski postaje Predsjednik Izvr\\u0161nog odbora i imenuje jo\\u0161 10 \\u010dlanova Izvr\\u0161nog odbora po svom odabiru iz redova \\u010dlanova Skup\\u0161tine, a 2 \\u010dlana imenuje nositelj druge liste koja sacinjava Skup\\u0161tinu, \\u0161to se verificira na Skup\\u0161tini \\u010ditanjem imena clanova Izvrsnog odbora.\\n- (2) Izvr\\u0161ni odbor \\u0107e najkasnije 2 mjeseca prije izbora izabrati Izborno povjerenstvo u sastavu od 5 prijavljenih clanova Kluba. U slu\\u010daju da nema dovoljno prijavljenih \\u010dlanova Kluba za Izborno povjerenstvo Izvr\\u0161ni odbor \\u0107e obavljati funkciju Izbornog povjerenstva.\\n- (4) Skupstina donosi Pravilnik o izborima u Klubu u kojem su \", \"detaljnije odredeni izborni postupci i rad Izbornog povjerenstva.\\n- (5) Skupstina sve verifikacije u njezinoj nadle\\u017enosti obavlja javnim \\u010ditanjem u zapisnik, dok ostala tijela, posebno Izborno povjerenstvo, verifikacije obavljaju glasovanjem.\\n\\n## \\u010clanak 30.\\n\\n\\u010clanovi Skup\\u0161tine biraju se na mandat od 4 (\\u010detiri) godine te isti \\u010dlanovi mogu biti birani na novo mandatno razdoblje.\\n\\n## \\u010clanak 31.\\n\\n- (1) Skup\\u0161tina mo\\u017ee biti redovita i izvanredna.\\n- (2) Skupstina redovito zasjeda najmanje jednom godi\\u0161nje, dok se izvanredne odr\\u017eavaju prema potrebi.\\n- (4) Predsjednik Kluba mora sazvati izvanrednu sjednicu ako to zatra\\u017ei Izvr\\u0161ni odbor ili \\u010dlan Skup\\u0161tine koji su du\\u017eni predlo\\u017eiti dnevni red izvanredne sjednice Skup\\u0161tine.\\n- (3) Sjednice Skup\\u0161tine saziva Predsjednik Kluba.\\n- (5) U slu\\u010daju iz st. 4. ovog \\u010dlanka Predsjednik Kluba je du\\u017ean sazvati izvanrednu sjednicu Skupstine u roku od 15 dana od dana zaprimanja zahtjeva predlagatelja za sazivanje Skup\\u0161tine koja se mora odr\\u017eati najkasnije u roku od 30 \", \"dana od dana zaprimanja zahtjeva za njezinim sazivanjem.\\n- (6) Ako Predsjednik Kluba ne sazove izvanrednu sjednicu Skup\\u0161tine Kluba u roku 30 dana od dana zaprimanja zahtjeva predlagatelja, izvanrednu sjednicu Skup\\u0161tine mogu sazvati sami predlagatelji.\\n- (7) Nakon sazivanja izvanredne sjednice Skup\\u0161tine mora prote\\u0107i najmanje 3 (tri) mjeseca prije podno\\u0161enja novog zahtjeva za sazivanjem nove izvanredne sjednice Skup\\u0161tine.\\n\\n## Clanak 32.\\n\\n- (1) 15 dana prije dono\\u0161enja odluke o sazivanju Skup\\u0161tine Izvr\\u0161ni odbor formira popis svih \\u010dlanova Skup\\u0161tine te u slu\\u010daju nastupa uvjeta navedenih u \\u010dl. 25. i cl. 26., dodaje nove clanove s liste zamjenskih \\u010dlanova.\\n- (2) U odluci o sazivanju Skup\\u0161tine koja se mora poslati \\u010dlanovima Skup\\u0161tine najkasnije 8 dana prije odr\\u017eavanja Skup\\u0161tine, Predsjednik Kluba utvrduje dnevni red te dan i mjesto odrzavanja sjednice. Izvrsni odbor mo\\u017ee dopuniti dnevni red pisanim prijedlogom.\\n- (3) Nakon primitka odluke o utvrdivanju dnevnog reda najmanje 25 \\u010dlanova Skup\\u0161tine\", \" mo\\u017ee dopuniti dnevni red pisanim prijedlogom Izvr\\u0161nom odboru bilo koje to\\u010dke koja je u nadle\\u017enosti Skup\\u0161tine, najkasnije 7 dana prije Skup\\u0161tine.\\n- (4) Najkasnije 3 dana prije Skup\\u0161tine Predsjednik \\u0161alje kona\\u010dni dnevni red i sve materijale potrebne za dono\\u0161enje odluka prema dnevnom redu.\\n\\n## Skup\\u0161tina Kluba:\\n\\n- b. usvaja Statut Kluba te predla\\u017ee i utvrduje njegove izmjene i dopune na na\\u010din propisan u cl. 31 st.4. i cl. 32 st.3. ovog Statuta;\\n\\n## Clanak 33.\\n\\n- (1) U slu\\u010daju isteka mandata svim tijelima Kluba, svi punoljetni i poslovno sposobni \\u010dlanovi Kluba postaju op\\u0107a Skup\\u0161tina koja \\u0107e izabrati tijela Kluba.\\n- (2) U slu\\u010daju iz st 1. ovog \\u010dlanka op\\u0107u Skup\\u0161tinu saziva jedna od zadnjih osoba ovla\\u0161tenih za zastupanje u registar udruga Republike Hrvatske.\\n\\n## Clanak 34.\\n\\n- (1) Predsjednik Kluba imenuje radno predsjedni\\u0161tvo od 3 \\u010dlana, koje rukovodi radom Skupstine.\\n- (2) Dopredsjednik kojeg imenuje Predsjednik Kluba je predsjedavaju\\u0107i Skup\\u0161tine.\\n- (3) Na Izbornoj Skup\\u0161tini, nakon odabira I\", \"zvrsnog odbora i Dopredsjednika, dosada\\u0161njeg Dopredsjednika na mjestu predsjedavajuceg, zamjenjuje novoizabrani.\\n- (4) O radu sjednice vodi se zapisnik koji se trajno \\u010duva u arhivi Kluba, a kojeg potpisuju predsjedavaju\\u0107i tom sjednicom i zapisni\\u010dar.\\n- (5) Jedan od \\u010dlanova Uprave, ovla\\u0161ten za zastupanje Kluba dostavlja zapisnik sa sjednica Skup\\u0161tine nadle\\u017enom uredu koji vodi registar udruga.\\n\\n## \\u010clanak 35.\\n\\n- (1) Skup\\u0161tina odlu\\u010duje pravovaljano ako je nazo\\u010dan najmanje 31 \\u010dlan Skup\\u0161tine, a odluke donosi vecinom glasova, osim ako Statutom nije propisano drukcije.\\n- (3) Za izbor novog Predsjednika potrebna je odluka najmanje 31 \\u010dlana Skup\\u0161tine. Ako se na sjednici Skup\\u0161tine ne odabere Predsjednik ili ve\\u0107ina Izvr\\u0161nog odbora, Skup\\u0161tina saziva izbore u roku od 60 dana.\\n- (2) Za dono\\u0161enje, dopune i izmjene Statuta i za razrje\\u0161enje Predsjednika ili \\u010dlanova Izvrsnog odbora potrebna je odluka najmanje 40 \\u010dlanova Skup\\u0161tine.\\n\\n## \\u010clanak 36.\\n\\n- a. utvrduje politiku i smjernice rada Kluba predlo\\u017eene od\", \" strane Izvr\\u0161nog odbora;\\n2. kalendarsku godinu;\\n- e. donosi Poslovnik o radu Skupstine Kluba, Pravilnik o dodjeli nagrade Ponos Dinama', Pravilnik o izborima u Klubu, te druge akte i odluke vazne za rao Kluba prema ovom Statutu;\\n- f. odlu\\u010duje o promjeni ciljeva i djelatnosti te obavljanju gospodarskih djelatnosti;\\n- g. odlucuje o udruzivanju u saveze, zajednice, mre\\u017ee i druge oblike povezivanja udruga;\\n- h. bira i razrje\\u0161ava Predsjednika Kluba, verificira i razrje\\u0161ava Izvr\\u0161ni odbor i Nadzorni odbor, razrje\\u0161ava Izborno povjerenstvo, kao i pojedine \\u010dlanove tih tijela;\\n- j. donosi odluku o prestanku rada Kluba, raspodjeli preostale imovine Kluba i \\u00b7 statusnim promjenama (pripajanju, spajanju i podjeli Kluba) u skladu s rezultatima provedenog referenduma;\\n- i. imenuje i opoziva likvidatora Kluba;\\n- k. tuma\\u010di Statut i op\\u00e9e akte koje donosi, odlu\\u010duje i o drugim pitanjima za koje ovim Statutom nije utvrdena nadle\\u017enost drugih klupskih tijela.\\n\\n## IZVR\\u015aNI ODBOR\\n\\n## Clanak 37.\\n\\n- (1) Izvr\\u0161ni odb\", \"or Kluba je izvr\\u0161no tijelo Skup\\u0161tine kojoj odgovara za svoj rad.\\n- zakonitosti,\\n- (2) Izvrsni odbor zala\\u017ee se za na\\u010dela:\\n- transparentnosti i javnosti poslovanja,\\n- u\\u010dinkovit unutarnji nadzor,\\n- sprjecavanje sukoba interesa,\\n- ja\\u010danje osobne odgovornosti,\\n- (3) Izvr\\u0161ni odbor se sastoji od 13 \\u010dlanova iz redova \\u010dlanova Skup\\u0161tine.\\n9. dru\\u0161tveno odgovorno poslovanje.\\n- (4) Iz redova \\u010dlanova Skup\\u0161tine, Predsjednik Kluba imenuje 10 \\u010dlanova Izvr\\u0161nog odbora po svom odabiru, a 2 \\u010dlana imenuje nositelj druge liste koja sa\\u010dinjava Skupstinu.\\n- (5) Mandat \\u010dlanova Izvr\\u0161nog odbora i Predsjednika je 4 (\\u010detiri) godine.\\n- (6) U slu\\u010daju prestanka \\u010dlanstva u Izvr\\u0161nom odboru iz bilo kojeg razloga prema ovom Statutu, Predsjednik ili nositelj druge liste, ovisno s \\u010dije liste su \\u010dlanovi Izvr\\u0161nog odbora kojima je prestalo \\u010dlanstvo, imenuje druge \\u010dlanove Izvr\\u0161nog odbora iz Skup\\u0161tine.\\n\\n## Clanak 38.\\n\\n## Izvr\\u0161ni odbor Kluba:\\n\\n- a. provodi odluke, zaklju\\u010dke i preporuke Skup\\u0161tine;\\n- c. predla\\u017ee i usvaja opce akte Kl\", \"uba, ako ovim Statutom nije druga\\u010dije odredeno;\\n- b. predla\\u017ee izmjene i dopune Statuta, osim u slu\\u010dajevima iz \\u010dl. 36. ovog Statuta\\n- d. predla\\u017ee Skup\\u0161tini program razvoja, politiku i smjernice rada Kluba;\\n- f. nadzire rad Uprave i daje joj suglasnost za pravne poslove iznad ukupnog iznosa 3 milijuna eura;\\n- e. imenuje, sklapa ugovor, kao i razrje\\u0161ava predsjednika Uprave i \\u010dlanove Uprave Kluba;\\n- g. osniva po potrebi savjetodavne pododbore i povjerenstva sastavljene od \\u010dlanova Kluba, zaposlenika Kluba i stru\\u010dnjaka koji nisu \\u010dlanovi Kluba, za potrebe kvalitetnije kontrole rada Kluba (Odbor za internu reviziju i kontrolu, Odbor za korporativna i strate\\u0161ka pitanja, Odbor za imenovanja zaslu\\u017enih igra\\u010da i trenera i sl.) te se obvezuje u odluci o osnivanju pododbora i/ili povjerenstva navesti njihov sastav, zada\\u0107u, vrijeme za koje se osnivaju i odgovornost za obavljanje poslova;\\n- h. odlu\\u010duje i o drugim pitanjima koje mu odredi Skup\\u0161tina.\\n\\n## \\u010clanak 39.\\n\\n- (1) Izvrsni odbor svoje poslove obav\", \"lja na sjednicama koje saziva Predsjednik ili \\u010dlan Izvr\\u0161nog odbora kojeg odredi Predsjednik prema potrebi, a najmanje jednom mjese\\u010dno.\\n- (2) Izvr\\u0161ni odbor odlu\\u010duje ve\\u0107inom glasova nazo\\u010dnih \\u010dlanova pod uvjetom da je na sjednici prisutna natpolovi\\u010dna ve\\u0107ina svih \\u010dlanova.\\n\\n## Clanak 40.\\n\\nNa\\u010din i uvjete svog rada Izvr\\u0161ni odbor ure\\u0111uje Poslovnikom.\\n\\n## PREDSJEDNIK KLUBA\\n\\n## \\u010clanak 41.\\n\\n- a. saziva sjednice Skup\\u0161tine Kluba i Izvr\\u0161nog odbora te predla\\u017ee dnevni red, sim u slu\\u010dajevima odredenih ovim Statutom\\n\\n## (1) Predsjednik Kluba:\\n\\n- . brine se o upoznavanju javnosti s radom Skup\\u0161tine Kluba\\n- d. imenuje \\u010dlanove Izvr\\u0161nog odbora sukladno \\u010dl. 37. st. 4. ovog Statuta i predla\\u017ee Skup\\u0161tini Kluba njihovo razrje\\u0161avanje;\\n- c. U suradnji s Izvr\\u0161nim odborom, utvrauje prijedlog Statuta i drugih op\\u0107ih akata koje usvaja Skup\\u0161tina Kluba, osim u slu\\u010dajevima iz \\u010dl. 36.\\n- e. saziva izbore u Klubu;\\n- f. obavlja i druge poslove u skladu sa zakonima, ovim Statutom i aktima Kluba.\\n- (2) U bilo kojim slu\\u010dajevima \", \"istovremene sprije\\u010denosti Predsjednika i Dopredsjednika duljim od 6 mjeseci, Izvr\\u0161ni odbor mora sazvati Skup\\u0161tinu koja \\u0107e izabrati novog Predsjednika u roku od 3 mjeseca nakon proteka tog roka.\\n\\n## Clanak 42.\\n\\n- (1) Predsjednik Kluba po svojoj funkciji je \\u010dlan i predsjednik Izvr\\u0161nog odbora.\\n- (2) Mandat Predsjednika Kluba je 4 (\\u010detiri) godine i za svoj rad je odgovoran Skup\\u0161tini Kluba.\\n- (3) Predsjednik Kluba predstavlja i zastupa Klub u zemlji i inozemstvu.\\n- (4) Predsjednik Kluba iz redova Izvr\\u0161nog odbora imenuje Dopredsjednika, koji rukovodi sjednicama Skup\\u0161tine i koji ga zamjenjuje u svim ovlastima u slu\\u010daju njegove sprijecenosti.\\n\\n## Clanak 43.\\n\\n- (1) Skup\\u0161tina Kluba na redovnoj sjednici ve\\u0107inom prisutnih \\u010dlanova Skup\\u0161tine mo\\u017ee imenovati po\\u010dasnog predsjednika Dinama na temelju poslovnih i sportskih zasluga i rezultata.\\n- (2) Mandat po\\u010dasnog predsjednika je neograni\\u010den. U izuzetnim slu\\u010dajevima mo\\u017ee ga razrijesiti Skupstina.\\n- (3) Po\\u010dasni predsjednik Kluba ima pravo sudjelovati na s\", \"jednicama Skup\\u0161tine, ali nema pravo glasa.\\n\\n## NADZORNI ODBOR\\n\\n## Clanak 44.\\n\\n- (1) Nadzorni odbor:\\n- a. skrbi o financijskom poslovanju Kluba te raspolaganju njegovom imovinom;\\n- c. stegovno je tijelo u drugom stupnju vezano uz \\u010dlanska prava i obveze te donosi kona\\u010dnu odluku o stegovnoj mjeri;\\n- b. skrbi o provodenju odredbi Statuta, op\\u0107ih akata Kluba i pravnom poslovanju Kluba o \\u010demu mo\\u017ee tra\\u017eiti izvje\\u0161\\u0107a tijela Kluba;\\n- d. obavlja i druge poslove u skladu sa zakonima, ovim Statutom i Pravilnikom o izborima;\\n- e. rjesava sukobe interesa i sporove unutar Kluba;\\n- (2) \\u010clanovi klupskih tijela koja odlu\\u010duju u stegovnom postupku ne sudjeluju u njemu kada su predmet stegovnih postupaka.\\n- f. obavje\\u0161tava klupska tijela o neusugla\\u0161enosti rada ili akata sa Statutom i drugim aktima Kluba, o \\u010demu, ako se ne isprave, obavje\\u0161tava Skup\\u0161tinu koja donosi obvezuju\\u0107u odluku o uskladivanju rada i akata.\\n\\n## \\u010clanak 45.\\n\\n- (1) Nadzorni odbor se sastoji se od 3 \\u010dlana, koji izmedu sebe biraju predsjednika.\", \"\\n- (3) Nadzorni odbor donosi odluke ve\\u0107inom glasova svih \\u010dlanova.\\n- (2) Predsjednik Nadzornog odbora saziva sjednice i predla\\u017ee dnevni red.\\n- (4) Mandat clanova Nadzornog odbora je 4 (\\u010detiri) godine.\\n\\n## Clanak 46.\\n\\n- (1) Clanovi Nadzornog odbora ne mogu biti \\u010dlanovi drugih klupskih tijela.\\n- (2) Nadzorni odbor podnosi Skup\\u0161tini Kluba redovito godi\\u0161nje izvje\\u0161\\u0107e.\\n- (3) Skup\\u0161tina Kluba mo\\u017ee zahtijevati od Nadzornog odbora podno\\u0161enje izvanrednog izvje\\u0161\\u0107a.\\n\\n## Clanak 47.\\n\\nNa\\u010dine i uvjete svog rada Nadzorni odbor ureduje Poslovnikom.\\n\\n## \\u010clanak 48.\\n\\n- (1) Clanove Nadzornog odbora na temelju samostalnih kandidatura poslanih Izbornom povjerenstvu bira Izvr\\u0161ni odbor na na\\u010din propisan u Pravilniku o izborima. S liste prijavljenih kandidata prvo jednog \\u010dlana Nadzornog odbora bira 10 \\u010dlanova Izvrsnog odbora koje je izabrao Predsjednik, a zatim ostala dva \\u010dlana Nadzornog abora bira dva clana Izvrsnog odbora s druge liste koja sacinjava Skupstinu. U slu\\u010daju da se ne prijavi dovoljno kandidata, Pred\", \"sjednik Kluba predla\\u017ee kandidate Skup\\u0161tini.\\n- (2) Skupstina razrje\\u0161ava \\u010dlanove Nadzornog odbora ako ne prihvati izvje\\u0161ce Nadzornog odbora.\\n- (3) Odluku o neprihva\\u0107anju izvje\\u0161\\u0107a Nadzornog odbora, Skup\\u0161tina donosi ve\\u0107inom glasova prisutnih clanova Skup\\u0161tine.\\n\\n## UPRAVA KLUBA\\n\\n## Clanak 49.\\n\\n- (1) Uprava Kluba vodi poslovanje Kluba i upravlja radom stru\\u010dnih slu\\u017ebi Kluba u skladu 5 ovim Statutom, opcim akt\\u0131ma Kluba te odlukama Skupstine i Izvr\\u0161nog odbora\\n- 2) Upravu Kluba \\u010dine predsiednik Uprave Kluba i 2 do 4 \\u010dlana koje bira Izvr\\u0161ni odbo\\n\\n## Clanak 50.\\n\\n- (1) Clanovi Uprave Kluba zastupaju Klub u pravnom prometu bez ograni\\u010denja.\\n- (3) Mandat clanova Uprave Kluba je 4 (\\u010detiri) godine.\\n- (2) \\u010clanovi Uprave Kluba zastupaju Klub u pravnom prometu na na\\u010din da najmanje 2 \\u010dlana uprave potpisuju i zastupaju prema tre\\u0107im osobama o svakom pitanju iz djelokruga Uprave, a prema Poslovniku o radu Uprave.\\n\\n## Uprava Kluba:\\n\\n- a. predla\\u017ee Izvr\\u0161nom odboru Pravilnik o djelokrugu i unutarnjem ustrojstvu Kl\", \"uba;\\n- b. organizira obavljanje stru\\u010dnih, tehni\\u010dkih i pomo\\u0107nih poslova Kluba i vodi poslovnu, sportsku i stru\\u010dnu politiku Kluba, za koje odgovara Izvr\\u0161nom odboru;\\n- c. samostalno sklapa pravne poslove do ukupnog iznosa 3 milijuna eura, a za ve\\u0107e ukupne iznose mora ishoditi prethodnu suglasnost Izvr\\u0161nog odbora, te poduzima druge pravne radnje u ime i za ra\\u010dun Kluba;\\n- e. brine se o provodenju odluka Skup\\u0161tine i Izvr\\u0161nog odbora;\\n- d. rukovodi i nadzire rad zaposlenika Kluba;\\n- f. podnosi financijska godi\\u0161nja i druga izvje\\u0161\\u0107a Skup\\u0161tini Kluba;\\n- h. osigurava redovito obavje\\u0161tavanje \\u010dlanova Kluba o radu i rezultatima Kluba;\\n- g. donosi akte sukladno Statutu i odlukama klupskih tijela;\\n- i. upravlja imovinom Kluba;\\n- k. utvrduje uvjete za sklapanje i raskid ugovora s igra\\u010dima;\\n- j. sklapa ugovore i poduzima pravne radnje u ime i za ra\\u010dun Kluba;\\n1. donosi odluke o organiziranju turnira, odigravanju prijateljskih utakmica te o mjestu i vremenu odr\\u017eavanja priprema igra\\u010da;\\n- n. predla\\u017ee Izvr\\u0161nom\", \" odboru godi\\u0161nji financijski i poslovni plan te podnosi kvartalna izvje\\u0161\\u0107a o provedbi tog plana;\\n- m. donosi odluke o izvanrednom nagradivanju igra\\u010da i ostalih zaposlenika Kluba za postignute rezultate;\\n- o. obavija i druge poslove sukladno ovom Statutu i odlukama klupskih tijela;\\n\\n## \\u010clanak 52.\\n\\n- (1) Za svoj rad i rad stru\\u010dnih slu\\u017ebi \\u010dlanovi Uprave Kluba odgovorni su Izvr\\u0161nom odboru.\\n- (2) \\u010clanovi Uprave Kluba ne mogu biti \\u010dlanovi drugih klupskih tijela.\\n\\n## \\u010clanak 53.\\n\\nNa\\u010dine i uvjete svog rada Uprava Kluba ureduje Poslovnikom uz suglasnost Izvr\\u0161nog odbora.\\n\\n## RJE\\u0160AVANJE SPOROVA I SUKOBA INTERESA\\n\\n## \\u010clanak 54.\\n\\n- (1) Postupak pred Nadzornim odborom za rje\\u0161avanje statutarnih i ostalih sporova te sukoba interesa mo\\u017ee zahtjevom pokrenuti svako klupsko tijelo, odnosno svaki \\u010dlan Kluba ako smatra da postoji spor ili sukob interesa u Klubu\\n\\n## Clanak 51.\\n\\n- (2) Nadzorni odbor o zahtjevu odlu\\u010duje u roku od 60 dana od dana podno\\u0161enja zahtjeva.\\n- (3) Nadzorni odbor u svom radu na odgovaraj\", \"u\\u0107i na\\u010din primjenjuje odredbe Zakona o mirenju.\\n- (5) Ako pronade da postoji sukob interesa, Nadzorni odbor odreduje i na\\u010din razrje\\u0161avanja utvrdenog sukoba interesa.\\n- (4) Odluka Nadzornog odbora o sukobu interesa je kona\\u010dna.\\n- (6) Sva klupska tijela mogu se obratiti Skup\\u0161tini za tuma\\u010denje odredbi Statuta i akata koje ona donosi.\\n\\n## IMOVINA, NACIN STJECANJA I RASPOLAGANJE IMOVINOM\\n\\n## Clanak 55.\\n\\n## (1) Imovinu Kluba cine:\\n\\n- a. nov\\u010dana sredstva koja je Klub stekao uplatom \\u010dlanarina, dobrovoljnim prilozima i darovima;\\n- b. nov\\u010dana sredstva koja Klub stekne obavljanjem djelatnosti kojima se ostvaruju ciljevi, obavljanjem djelatnosti i gospodarske djelatnosti, financiranjem programa i projekata Kluba iz dr\\u017eavnog prora\\u010duna i prora\\u010duna jedinica lokalne i podru\\u010dne (regionalne) samouprave te fondova i/ili iz inozemnih izvora;\\n- c. nekretnine i pokretne stvari Kluba;\\n- (2) Klub mo\\u017ee raspolagati svojom imovinom samo za ostvarivanje ciljeva i obavljanjem djelatnosti odredenih Statutom Kluba, u\", \" skladu sa zakonom.\\n- d. druga prava ustanovljena u korist Kluba.\\n- (3) Vi\\u0161ak prihoda nad rashodima koje Klub ostvari koristi se za ostvarivanje ciljeva utvrdenih ovim Statutom.\\n\\n## \\u010clanak 56.\\n\\n- (1) Odluke o stjecanju ili otudivanju pokretnina i nekretnina donosi Uprava Kluba.\\n- (3) Uprava Kluba odgovorna je za zakonitost koristenja i raspolaganja imovinom, a posebice financijskih sredstava Kluba.\\n- (2) Poslovne odluke u vezi kori\\u0161tenja financijskih sredstava tijekom kalendarske godine provodi Uprava Kluba koja o tome izvje\\u0161\\u0107uje Izvr\\u0161ni odbor.\\n- (4) Sva dokumentacija o materijalno-financijskom poslovanju Kluba \\u010duva se u zakonskim rokovima sa posebnom pa\\u017enjom u arhivi Kluba.\\n\\n## PRESTANAK POSTOJANJA KLUBA\\n\\n## \\u010clanak 57.\\n\\n- (1) Klub prestaje postojati odlukom Skupstine u skladu s rezultatima provedenog eterenduma, ill u drugim slucajevima predvidenim zakonom\\n- 2) U slu\\u010daju prestanka postojanja Kluba preostala imovina pripada udruzi, ustanov zakladi ili drugoj pravnoj osobi koja ima iste\", \" ili sli\\u010dne statutarne ciljeve, a prema odluci Skup\\u0161tine u skladu s rezultatima referenduma.\\n\\n## Clanak 58.\\n\\n- (1) Likvidatora Kluba imenuje i opoziva Skup\\u0161tina Kluba.\\n- (3) Osoba koja se bira za likvidatora treba imati potrebnu stru\\u010dnost i iskustvo, s obzirom na nadle\\u017enost likvidatora te ne smije imati zapreke iz \\u010dl. 112. Zakona c sportu i cl. 19. st. 2. i 3. Zakona o udrugama.\\n- (2) Likvidator zastupa Klub u postupku likvidacije te se otvaranjem likvidacijskog oSta pse d registar udruga kao osoba ovla\\u0161tena za zastupanje Kluba d kon\\u010danja postupka likvidacije i brisanja Kluba iz registra udrug\\n- (4) Pokretanjem postupka likvidacije Kluba prestaju ovla\\u0161tenja tijela i osoba ovla\\u0161tenih za zastupanje Kluba.\\n- (5) Postupak likvidacije Kluba provodi likvidator sukladno odredbama Zakona o udrugama.\\n\\n## PRIJELAZNE | ZAVR\\u0160NE ODREDBE\\n\\n## \\u010clanak 59.\\n\\n- (1) Statut stupa na snagu danom dono\\u0161enja.\\n- (2) Opci akti i ostali potrebni akti Kluba vezani za izbore u Klubu moraju se usuglasiti s odredbama \", \"ovog Statuta, kao i ustrojiti Izborno povjerenstvo od strane Izvr\\u0161nog odbora sa\\u010dinjene prema prethodnom Statutu, prije datuma prvih izbora koji ce ustrojiti tijela Kluba prema ovom Statutu. Tijela Kluba ustrojena po prethodnom Statutu djeluju do ustroja novih tijela Kluba prema ovom Statutu nakon prvih izbora u Klubu.\\n\\nU Zagrebu, 21.12.2023.\\n\\n<!-- image -->\"]"