"[\"Na temeljem \\u00e9lanka 13. Zakona o udrugama (Narodne novine 74/14, 70/17., 98/19. i 151/22, \\u00e9lanka 37. Zakona o sportu (Narodne novine 141/22), SkupStina Hrvatskog judo saveza, na sjedniciodrzanoj dana, 20. prosinca 2023. godine donosi STATUT HRVATSKOG JUDO SAVEZA 1. OPCE ODREDBE Elanak 1. Ovim Statutom utvrduju se odredbe o nazivu, sjediStu, o zastupanju, izgledu pe\\u00e9ata, o ciljevima i podrucju djelovanja Hrvatskog judo saveza, (u daljnjem tekstu: Savez) sukladno ciljevima, djelatnostima kojima se osiguravaju ciljevi, kao i gospodarske djelatnosti koje se obavljaju sukladno zakonu, nacin osiguranja javnosti rada, \\u00e9lanstvo Saveza, tijela Saveza, djelokrug i nacin rada, a u svrhu ostvarivanja potreba i interesa judo sporta, kao i na\\u00e9in predstavljanja Republike Hrvatske u pripadaju\\u00a2em medunarodnom sportskom udruzenju, prestanku postojanja Saveza, o imovini, nacinu stjecanja i raspolaganju imovinom, o postupku s imovinom u slu\\u00e9aju prestanka postojanja Saveza te drugim pitanjima vaznim za Savez. Savez je jedini nacionalni sportski savez koji poti\\u00e9e i promi\\u00e9e judo i vrijednosti judo sporta u Republici Hrvatskoj. Savez je osnovan 12. oZujka 1961. godine u Zagrebu pod nazivom Judo savez Hrvatske. Izraze koji se koriste u ovom statutu, a imaju rodno zna\\u00e9enje, odnose se jednako na Zenski i muSki rod. \\u20acElanak 2. Naziv Saveza je: HRVATSKI JUDO SAVEZ. Skraceni naziv Saveza je: HJS. Pored naziva na hrvatskom jeziku, Savez ce u medunarodnim odnosima koristiti naziv na engleskom jeziku: CROATIAN JUDO FEDERATION. Pored skracenog naziva na hrvatskom jeziku, Savez \\u20ace u medunarodnim odnosima koristiti skra\\u00e9eni naziv na engleskom jeziku: CRO JUDO. Clanak 3. Savez djeluje na teritoriju Republike Hrvatske. SjediSte Saveza je u gradu Zagrebu. Odluku o adresi Saveza kao i promjeni adrese Saveza, ureduje se Odlukom koju donosi Upravni odbor Saveza. Clanak 4. Savez je neprofitna pravna osoba, upisana u Registar udruga Republike Hrvatske pri nadleznom gradskom uredu Grada Zagreba, Registar neprofitnih organizacija pri Ministarstvu financija Republike Hrvatske i Evidenciju pravnih osoba u sportu. \\u20aclanak 5. Savez je samostalan u ostvarivanju svojih ciljeva utvrdenih ovim Statutom, a za svoje obveze odgovara cijelom svojom imovinom u skladu sa zakonom. Savez se ustrojava i djeluje sukladno odredbama Zakona o sportu i Zakona o udrugama. Clanak 6. Savez predstavljaju i zastupaju predsjednik Saveza i glavni tajnik Saveza. Iznimno, Upravni odbor Saveza na prijedlog predsjednika Saveza moZe i druge osobe ovlastiti za zastupanje. Elanak 7. Savez ima pe\\u20acat. Uporaba, izgled i Cuvanje pecata ureduju se odlukom koju donosi Upravni odbor Saveza. Elanak 8. Savez ima znak i zastavu. Opis znaka i zastave Saveza te uporaba i zastita, ureduju se odlukom koju donosi Upravni odbor Saveza. Clanak 9. Savez je osniva\\u00e9 i punopravni \\u00e9lan Hrvatskog olimpijskog odbora (HOO). Savez je Clan Medunarodne judo federacije (UF) i Europske judo unije (EJU). Savez se moze uClaniti ili udruziti i u druge domace i medunarodne organizacije i udruge kad je to od interesa za judo sport, a nije u suprotnosti s drugim zakonskim propisima kao i propisima medunarodnih organizacija kojih je \\u00e9lan. Clanak 10. U Savezu nije dozvoljen niti jedan vid diskriminacije (klupski, rasni, nacionalni, etnicki, spolni, vjerski, politicki i drugi), te sprjecavanje sloboda i prava \\u20acovjeka\", \"udruge kad je to od interesa za judo sport, a nije u suprotnosti s drugim zakonskim propisima kao i propisima medunarodnih organizacija kojih je \\u00e9lan. Clanak 10. U Savezu nije dozvoljen niti jedan vid diskriminacije (klupski, rasni, nacionalni, etnicki, spolni, vjerski, politicki i drugi), te sprjecavanje sloboda i prava \\u20acovjeka i gradanina. Nw CILJIEVI, PODRUCGJE DJELOVANJE SUKLADNO CILJEVIMA | DJELATNOST SAVEZA Svojim djelovanjem Savez ima za cilj brigu i ostvarenje programa javnih potreba u judo sportu, stvaranje i provedbu pozitivne politike promicanja i razvoja judo sporta u Republici Hrvatskoj i inozemstvu, sukladno Zakonu, te ostalim propisima i zakonima Republike Hrvatske. 1. CIUJEVI SAVEZA Elanak 11. Ciljevi Saveza su: razvitak i promicanje judo kao sporta i juda kao edukativne i inkluzivne metode, stvaranje uvjeta za postizanje vrhunskih dometa u judo sportu, Sirenje aktivnosti judo sporta osobito djece i mladeii, razvijanje i promicanje medusobne suradnje udruzenih \\u00e9lanica Saveza, promicanje i ostvarivanje nacionalne i medunarodnih sportskih veza i suradnje, ostvarivanje uvjeta za edukaciju sportasa, trenera i sudaca, sudjelovanje u borbi protiv dopinga, kori&tenja supstanci i zabranjenih postupaka u judo sportu, a u skladu sa svjetskim kodeksom protiv dopinga, Promicanje odgojnih zada\\u00a2\\u00e9a u judo sportu u duhu fair-play-a, razumijevanja, tolerancije i odgovornosti kroz bavljenje judom, sprje\\u00e9avanje svih oblika nasilja u sportu pogotovo prema djeci i mladima, promicanje olimpijskih ideala. DJELATNOST SAVEZA Elanak 12. Savez u ispunjavanju navedenih ciljeva svojim djelovanjem: sudjeluje, provodi i utvrduje politiku razvoja judo sporta u Republici Hrvatskoj, potice i promice judo sporta u skladu s aktima strateSkog planiranja razvoja sporta na nacionalnoj razini, odnosno nacionalnom strategijom razvoja sporta i nacionalnim planom razvoja sporta, utvrduje sustava, uvjete i organizaciju sportskih natjecanja u judu, u skladu s na\\u00e9elima i elementima sustava koje je opcim aktom utvrdio Hrvatski olimpijski odbor, a prema pravilima sporta i normama medunarodnih sportskih udruzenja, predstavija judo sport pred sportskim i drzavnim tijelima Republike Hrvatske, te odgovarajucim medunarodnim sportskim udruzenjima, suraduje s odgovarajucim krovnim medunarodnim udruzenjima, suraduje s Hrvatskim paraolimpijskim odborom, Hrvatskim savezom slijepih i slabovidnih, Hrvatskim Skolskim sportskim savezom i Hrvatskim akademskim sportskim savezom. sudjeluje u provedbi programa javnih potreba sporta u Republici Hrvatskoj i u provedbi nacionalnog programa sporta, sudjeluje u pripremanju godi8njih i visegodignjih planova i programa razvoja judo sporta na podru\\u00a2ju Republike Hrvatske, nadgleda ukupnu djelatnost u judo sportu, organizira nacionalna judo prvenstava, neposredno ili preko svojih Clanica, te medunarodna natjecanja i priredbi, w utvrduje i provodi sustav, uvjete i organizaciju judo natjecanja u Republici Hrvatskoj, organizira nastupanje hrvatske judo reprezentacije na odgovarajucim medunarodnim natjecanjima, promi\\u00e9e i provodi nacionalne projekte vezane uz odgoj i obrazovanje djece i mladih, temeljene na principima i vrijednostima juda kao olimpijskog sporta, te poti\\u00a2e i druge posebne projekte u cilju borbe protiv ovisnosti, smanjenja nasilja i promicanja zdravog naCina Zivota, uskladivanje aktivnosti svojih \\u00e9lanica i pruzZanje stru\\u00a2nu pomo\\u00e9 u radu, utvrduje djelovanje na pitanjima koja se odnose na registraciju, status i stegovnu odgovornost sportaga i drugih sportskih djelatnika i stru\\u00a2nih osoba u judo sportu, djeluje na unapredivanju i skrbi zdravstvene zaStite sportasa, brine za odrzivi razvoj judo sporta, skrb o\", \"uskladivanje aktivnosti svojih \\u00e9lanica i pruzZanje stru\\u00a2nu pomo\\u00e9 u radu, utvrduje djelovanje na pitanjima koja se odnose na registraciju, status i stegovnu odgovornost sportaga i drugih sportskih djelatnika i stru\\u00a2nih osoba u judo sportu, djeluje na unapredivanju i skrbi zdravstvene zaStite sportasa, brine za odrzivi razvoj judo sporta, skrb o sportsko - rekreativnim aktivnostima u judo sportu sudjeluje u prikupljanju i azuriranju informacija za Nacionalni informacijski sustav u sportu, na trazenje tijela drzavne uprave nadleznog za sport daje prethodno misljenje o postojanju interesa za prijam u hrvatsko drZavijanstvo fizicke osobe u sustavu sporta koja je strani drzavijanin, djeluje na stvaranju materijalnih, kadrovskih i drugih uvjeta u smislu unaprjedenja i postizanja vrhunskih judo dostignu\\u00a2a i rezultata, skrbi o vrhunskim sportasima i nacionalnim judo ekipama, utvrduje plan potreba stru\\u00e9nih kadrova u judo sportu, organizira i provodi osposobljavanje stru\\u00e9nih kadrova u judo sportu, provodi stru\\u00e9no usavr\\u00e9avanje i licenciranje stru\\u00e9nih kadrova, vodi stru\\u00e9ne i administrativne poslova vezano uz osobe koje obavijaju stru\\u00e9ne poslove u judo sportu, organizira i provodi promidzbenu, izdavacku i informativnu djelatnost u judo sportu, po potrebi izdaje stru\\u00e9ne knjige, Easopise i publikacije, te skuplja dokumentaciju i povijesne podatke vezane za judo sport, prati aktualna pitanja financiranja judo sporta, te nadleznim tijelima predlaze poduzimanje odredenih mjera, prati, razmatra i predlaze politiku kori8tenja, odrzavanja i izgradnje objekata za judo sport, organizira vodenje i upravijanje objektima koji su mu povjereni ili ih ima u viasnistvu, u znak priznanja za razvoj, promicanje i uspjeh u judo sportu daje priznanja, pohvale i nagrade, sudjeluje u borbi protiv dopinga, koriStenja supstanci i zabranjenih postupaka u judo sportu, auskladu sa svjetskim kodeksom protiv dopinga, ukljucujuci i postivanje pravila nacionalnog tijela nadleZnog za borbu protiv dopinga, a osobito vezano uz provedbu testiranja, potice provedbu eti\\u00e9kih i moralnih na\\u00e9ela, poSstivanje ljudskog dostojanstva, fair playa, tolerancije, zaStite djece u sportu, nenasilja i kulture sporta, poduzima miera protiv svih oblika diskriminacije i nasilja u sportu, zalaZe se za ravnopravnost spolova u sportu, obavlja i druge poslove koji su mu povjereni sukladno Zakonu o sportu, Zakonu o udrugama i ostalim propisima Republike Hrvatske. Clanak 13. Savez ima javnu ovlast za donoSenje opcih akata, kojima se ureduje: * sustav judo natjecanja i to najmanje jednu godinu prije pocetka primjene tog sustava, * materijalni, tehnicki i stru\\u00e9ni uvjeti za uclanjenje judo udruga u Clanstvo Saveza, * nacin licenciranja stru\\u00e9nih kadrova u judo sportu sukladno Zakonu o sportu, * nacin registracije sportasa, * prava i obveze sportaSa, trenera, sudaca i \\u00e9lanica Saveza, * pravo nastupa stranih sportaSa za sportske klubove u judo sportu u Republici Hrvatskoj, * stegovna odgovornost osoba u sustavu judo sporta, * druga pitanja iz nadleznosti Saveza sukladno Zakonu o sportu te pravilima svjetskog i europskog saveza judo sporta. Clanak 14. Radi uspjesnog izvrSavanja djelatnosti utvrdenih u ovom Statutu, Savez suraduje sa nadleznim tijelima drzavne vlasti i drugim odgojno-obrazovnim i stru\\u00e9nim ustanovama te drugim fizi\\u00a2kim i pravnim osobama. Savez moze obavijati i druge djelatnosti, osim djelatnosti iz oblasti judo sporta, sukladno propisima kojima je to uredeno. Savez, kao pravna osoba koja djeluju u\", \"izvrSavanja djelatnosti utvrdenih u ovom Statutu, Savez suraduje sa nadleznim tijelima drzavne vlasti i drugim odgojno-obrazovnim i stru\\u00e9nim ustanovama te drugim fizi\\u00a2kim i pravnim osobama. Savez moze obavijati i druge djelatnosti, osim djelatnosti iz oblasti judo sporta, sukladno propisima kojima je to uredeno. Savez, kao pravna osoba koja djeluju u sustavu sporta, duzan je poduzimati mjere za&tite djece u sportu, u svojim programima i postupanju kao i u djelovanju i postupanju \\u00a2lanica Saveza, te o svakom krSenju prava djece, posebice svim oblicima nasilja nad djecom, spolne zloporabe, zanemarivanja ili nehajnog postupanja, zlostavijanja ili izrabljivanja djece u sportu mora obavijestiti policiju, nadlezno tijelo za socijalnu skrb odnosno druga nadlezna tijela. 3. GOSPODARSKA DJELATNOST SAVEZA Clanak 15. Savez moze radi obavljanja gospodarskih djelatnosti osnovati trgovatko dru&tvo, zadrugu, druge gospodarske subjekte, a uzajamne odnose urediti ugovorom. Savez gospodarske djelatnost moze obavljati pored djelatnosti kojima se ostvaruju njegovi ciljevi utvrdeni statutom, ali ih ne moze obavijati radi stjecanja dobiti za svoje \\u00e9lanove ili tre\\u00e9e osobe. Ako u obavijanju gospodarskih djelatnosti Savez ostvari visak prihoda nad rashodima, on se moze upotrijebiti iskljucivo za ostvarenje ciljeva Saveza utvrdenih Statutom. lll. CLANSTVO, USTROJ | DJELOVANJE SAVEZA Clanak 16. Za primitak u Clanstvo Saveza potrebno je ispunjavati sljedece uvjete: * da je svrha njegova osnivanja i djelovanja razvoj i unapredenje, Sirenje i promicanje judo sporta na podru\\u00a2ju njegova djelovanja prema na\\u00a2elima juda i olimpizma, wi da je osnovan sukladno Zakonu, te uredno registriran kod nadleznog tijela drzZavne uprave i ostalim registrima sukladno Zakonu i Statutu. \\u00a2 daimapravo kori8tenja ili je vlasnik sportskog objekta koji udovoljava propisima judo sporta, koji udovoljava uvjetima za sigurnost i zdravlje sportasa i drugih osoba za bavijenje judo sportom, da ima ugovorene odnose s osobom koja ima propisanu stru\\u00e9nu spremu, odnosno koja je osposobljena za obavijanje stru\\u00e9nih poslova u judo sportu u skladu sa Zakonom o sportu, da prihva\\u00e9a Statut i druge opce akte Saveza, Statut i pravila Hrvatskog olimpijskog odbora kao i pripadajucih medunarodnih sportskih udruzenja, nac\\u00e9ela i pravila Olimpijske povelje, Etickog i Medicinskog kodeksa, te Svjetskog kodeksa protiv dopinga (WADA). \\u20aclanak 17. Elanice Saveza sukladno odredbama ovog Statuta su judo klubovi, Zupanijski judo savezi, gradski judo savezi i Zagrebacki judo savez. Elanice Saveza sukladno odredbama ovog Statuta mogu biti i strukovne sportske udruge u istome sportu, udruge sportskih klubova istog sporta i ranga natjecanja te udruge u koje se udruzuju sportaii i treneri istog sporta, sukladno odredbama ovog Statuta. Clanak 18. Clanstvo u savezu moze biti privremeno i punopravno. izmedu dvije sjednice Skup&tine Saveza, odluku o prijemu u privremeno \\u00e9lanstvo donosi Upravni odbor Saveza po ispunjavanju uvjeta iz Clanka 20. ovog Statuta. Privremeni \\u00e9lan Saveza ima sva prava i obaveze punopravnog Clana Saveza osim prava odlucivanja u tijelima saveza. Status punopravnih \\u00e9lanica Saveza stjecu se po donoSenju odluke Skup8tine o prijemu u Clanstvo. Elanak 19. Zahtjevu za u\\u00e9lanjenje potrebno je priloziti: odluku skup&tine o udruZivanju u Savez, presliku statuta kluba/saveza/udruge uskladenim s ovim Statutom, presliku rjeSenja o upisu u Registar udruga Republike Hrvatske, jzvadak iz Evidencije pravnih osoba u sportu, oresliku rjeSenja\", \"Saveza stjecu se po donoSenju odluke Skup8tine o prijemu u Clanstvo. Elanak 19. Zahtjevu za u\\u00e9lanjenje potrebno je priloziti: odluku skup&tine o udruZivanju u Savez, presliku statuta kluba/saveza/udruge uskladenim s ovim Statutom, presliku rjeSenja o upisu u Registar udruga Republike Hrvatske, jzvadak iz Evidencije pravnih osoba u sportu, oresliku rjeSenja o upisu u registar neprofitnih organizacija pri Ministarstvu financija Republike Hrvatske, presliku o obavijesti Drzavnog zavoda za statistiku o razvrstavanju prema NKD u, broj bankovnog ra\\u00a2una na obrascu banke, opis (ime, prezime, OIB, datum i godina rodenja) o klupskoj registraciji najmanje dvadeset 20) aktivnih Clanova, podatke o osobama ovlastenim za zastupanje (kontakt e mail, mobitel), potvrdu ili ugovor o pravu koristenja sportskog objekta, te udovoljava uvjetima za sigurnost i zdravije sportaga i drugih osoba za bavijenje judo sportom, presliku ugovorenih odnosa s osobom koja ima propisanu stru\\u00a2nu spremu odnosno koja je osposobljena za obavijanje strucnih poslova u judo sportu u skladu sa Zakonom o sportu, Izjava o prihvacanju Statuta Saveza i drugih opcih akata Saveza, i pravila pripadajucih medunarodnih sportskih udruzenja, nacela i pravila Olimpijske povelje, Etickog i Medicinskog kodeksa, te Svjetskog kodeksa protiv dopinga (WADA), potvrdu o uplati godiSnje clanarine Savezu. Elanak 20. Savez vodi popis svojih \\u00e9lanica. Glavni tajnik Saveza zaduZen je za azuriranje evidencije Clanica, te objavi na mreznoj stranici Saveza. Popis Elanica vodi se elektronicki, a za svaku Clanicu Saveza obvezno sadrii: naziv Clanice, adresu Clanice, datum primitka i prestanka u Clanstvo, kategoriju \\u00a2lanstva, kontakt telefon i elektronske adrese Clanice, OIB \\u20aclanice. Popis \\u00e9lanica Saveza dostupan je svim \\u00a2lanicama i nadleznim tijelima, na njihov zahtjev. Clanak 21. Clanice imaju pravo: imati svoje predstavnike u Skup$Stini Saveza, predlagati, birati i biti birani u tijela Saveza, sudjelovati u radu stru\\u00e9nih tijela Saveza, sudjelovati na natjecanjima u organizaciji Saveza sukladno vazecim opcim aktima Saveza, sudjelovati na stru\\u00a2nim seminarima, tecajevima i ostalim dogadanjima sukladno opcim aktima Saveza, biti informirane o svim relevantnim zbivanjima u podrucju judo sporta dostupnim Savezu. Obveze Clanica su: aktivno sudjelovati u realizaciji pojedinih dijelova godisnjeg plana rada Saveza prihvacajuci duznosti organizatora pojedinih natjecanja i ostalih aktivnosti predvidenih programom Saveza kao i opcim aktima, aktivo sudjelovati sa \\u00e9lanstvom na najmanje tri (3) natjecanja u tekucoj godini sukladno kalendaru Saveza (obaveza se odnosi na \\u00a2lanice iz Clanka 18., stavak 1. ), sudjelovati na stru\\u00e9nim seminarima, tecajevima i ostalim dogadanjima sukladno opcim aktima Saveza, podnositi trazena izvjes\\u00a2a, uredno pla\\u00a2ati Clanarinu te podmirivati druge financijske obveze utvrdene odlukama Upravnog odbora ili opcim aktima Saveza, na zahtjev Saveza, obavezne su omoguCiti svojim Clanovima sudjelovanje u aktivnostima Saveza, uskladiti svoj Statut i opce akte s ovim Statutom i drugim op\\u00a2im aktima Saveza, bt >= ew, druge obveze koje odredi Upravni odbor ili SkupStina Saveza. Elanak 22. Glanica Saveza, kao niti bilo tko drugi ne moze organizirati domaca ili medunarodna sportska natjecanja, priredbe i druge aktivnosti u judo sportu bez prethodne suglasnosti Saveza. Ukoliko \\u00e9lanica ne bude izvravala svoje obveze pokrenut ce se stegovni postupak sukladno Pravilniku o stegovnoj odgovornosti Saveza. Clanak 23. Clanstvo u Savezu privremene i punopravne Clanice prestaje: \\u00a2 na\", \"drugi ne moze organizirati domaca ili medunarodna sportska natjecanja, priredbe i druge aktivnosti u judo sportu bez prethodne suglasnosti Saveza. Ukoliko \\u00e9lanica ne bude izvravala svoje obveze pokrenut ce se stegovni postupak sukladno Pravilniku o stegovnoj odgovornosti Saveza. Clanak 23. Clanstvo u Savezu privremene i punopravne Clanice prestaje: \\u00a2 na vlastiti zahtjev uz obrazlozenje, e ako se utvrdi da je clan prestao djelovati sukladno Statutu, \\u00b0 ako nije odrZao skup&tinu najmanje dvije godine, e ako se broj \\u00e9lanova smanji ispod broja odredenog za primanje u \\u00e9lanstvo, \\u00a2 ako \\u00e9lan svojim djelovanjem znatno oteZava ostvarivanja ciljeva i djelatnosti Saveza, * prestankom postojanja Clana. Odluku o brisanju iz \\u00e9lanstva za privremene \\u00a2lanove donosi Upravni odbor Saveza, dok za punopravne \\u00e9lanove donosi SkupStina Saveza. Prestankom \\u00e9lanstva ne prestaju financijske obveze koje je dotada\\u00e9nji \\u00e9lan imao prema Savezu, a koje su nastale do trenutka prestanka Clanstva. IV. USTROJ | UPRAVUANJE U SAVEZU Elanak 24. U Savezu djeluju sljede\\u00e9a tijela: Skup$Stina Saveza, Predsjednik Saveza, \\u00a2 Upravni odbor Saveza, \\u00a2 Glavni tajnik Saveza, \\u00a2 Nadzorni odbor Saveza, Stegovna komisija Saveza, Stalnei ad hoc komisije. Kod izbora \\u00e9lanova tijela Saveza, potrebno je voditi brigu o: stru\\u00e9noj osposobljenosti, znanjima i drugim kvalitetama osoba u odnosu na ciljeve i nadlezZnosti Skupstine, Upravnog odbora, Nadzornog odbora, Stegovne komisije odnosno drugih tijela saveza, nepostojanje prepreka sukladno Zakonu 0 sportu i Zakonu 0 udrugama kao i ovim Statutom, postivanju sluzbene preporuke Medunarodnog olimpijskog odbora o potrebi zastupljenosti odredenog broja Zena u sastavu tijela Saveza, odnosno osigurati zastupljenost do 40% osoba podzastupljenog spola. oo 4.1. SkupStina Saveza Elanak 25. SkupStina Saveza je najvise tijelo upravijanja Savezom. SkupStinu sacinjavaju: po jedan predstavnik \\u00e9lanice Saveza, sukladno \\u00e9lanku 17. Ovog Statuta, a prema popisu Clanica Saveza, te ukoliko \\u00e9lanice na dan odrzavanja izborne sjednice Skupstine imaju urednu registraciju s vazecim mandatima tijela upravljanja i zastupanja i podmire materijalne i/ili financijske, te druge obveze prema Savezu, sedam (7) \\u00e9lanova Upravnog odbora Saveza. 4.1.1. Predstavnici u Skup8tini Saveza Clanak 26. Predstavnik u Skupstini Saveza moze biti osoba: koja je drzavijanin Republike Hrvatske, koja je navrSila 18 godina i potpuno je poslovno sposobna, koja se nije ogrijesila o eti\\u00a2ke norme i na\\u20acela olimpijskog pokreta, koja prihva\\u00e9a Statut Saveza, Statut Hrvatskog olimpijskog odbora, Statut i pravila pripadaju\\u00a2eg medunarodnog sportskog udruZzenja, na\\u00e9ela i pravila Olimpijske povelje, te Svjetskog kodeksa protiv dopinga (WADA), koja nema zapreke iz \\u00e9lanka 111. stavci 1.12. odnosno iz \\u00e9lanka 114. Zakona o sportu. Predstavnici u Skupstini Saveza za svoj rad odgovorni su Skup$tini i \\u20aclanici \\u00e9iji su predstavnici. Na Izbornoj sjednici Skupstine Clanovi Upravnog odbora ne mogu biti predstavnici u Skup8tini. 4.1.2. NadleZnosti Skuptine Clanak 27. Seupstina obavija slijede\\u00e9e poslove: utvrduje strategiju razvoja judo sporta u Republici Hrvatskoj, u skladu s aktima strateSkog planiranja razvoja sporta na nacionalnoj razini, bira predsjednika Saveza, dopredsjednika, \\u00e9lanove Upravnog odbora, \\u00e9lanove Nadzornog odbora i Clanove Stegovne komisije, te donosi odluku o njihovom razrjeSenju, bdira radna tijela SkupStine Saveza, usvaja godisnje i viSegodisnjeg programe judo sporta drzavne razine, odnosno programe rada Saveza, _usvaja financijski plan, usvaja financijsko izvjes\\u00e9e, donosi Pravilnik o stegovnoj\", \"nacionalnoj razini, bira predsjednika Saveza, dopredsjednika, \\u00e9lanove Upravnog odbora, \\u00e9lanove Nadzornog odbora i Clanove Stegovne komisije, te donosi odluku o njihovom razrjeSenju, bdira radna tijela SkupStine Saveza, usvaja godisnje i viSegodisnjeg programe judo sporta drzavne razine, odnosno programe rada Saveza, _usvaja financijski plan, usvaja financijsko izvjes\\u00e9e, donosi Pravilnik o stegovnoj odgovornosti, donosi odluku u prijem i prestanku punopravnog Clanstva u Savezu, utvrduje materijalne, tehnitke i stru\\u00e9ne uvjete za uclanjenje sportskih klubova u \\u00e9lanstwo Saveza, wo donosi Statut Saveza, kao i njegove izmjene i dopune, te druge opce akte za koje je ovim Statutom ili odlukom SkupStine utvrdena nadleZnost SkupStine odnosno koje pravilnike Upravni odbor Saveza predlozi SkupStini na donoSenje, pravilnik o sustavu uvjetima i organizaciji natjecanja u judo sportu na prijedlog Upravnog odbora Saveza, donosi odluku o udruzivanju u medunarodne i nacionalne sportske organizacije koje djeluju u judo sportu ili sus njim povezane, odlu\\u00e9uje o promjeni ciljeva i djelatnosti, gospodarskih djelatnosti, prestanku rada i raspodjeli preostale imovine Saveza u slucaju prestanka rada Saveza, donosi odluku o imenovanju i razrjesenju pocasnih odnosno zasluznih Clanova Saveza, donosi odluku o prestanku rada Saveza, obavljai druge poslove i zadace odredene zakonom, Statutom Hrvatskog olimpijskog odbora i ovim Statutom, te je nadleZna i za sva pitanja za koja eksplicitno nije utvrdena statutarna nadleznost drugih tijela Saveza, kada se radi o pitanjima koja po svom zna\\u00a2aju upucuju na nadleznost najviseg tijela upravijanja Savezom. 4.1.3. Sjednice SkupStine Elanak 28. SkupStina Saveza odluC\\u00a2uje o pitanjima iz svoje nadleznosti na sjednicama. Sjednice SkupStine saziva i predsjedava im predsjednik, a u slucaju njegove odsutnosti ili sprijecenosti, dopredsjednik. Sjednicama Skup&tine predsjedava troclano radno predsjednistvo (predsjedavajuci i dva \\u00a2clana radnog predsjednistva), koje predlaze predsjednik ili dopredsjednik Saveza, a bira ih SkupStina. Zapisnik sjednice SkupStine vodi zapisnicar, a potpisuju ga predsjednik Saveza, dva (2) ovjerovitelja zapisni\\u00a2ar. Zapisni\\u00e9ara i ovjerovitelje zapisnika bira SkupStina. Utvrdivanje pravovaljanosti mandata Clanova SkupStine provodi Verifikacijska komisija u sastavu oredsjednik i dva Elana Verifikacijske komisije, a bira ih SkupStina. Z2 provodenje izbora zaduzena je Izborna komisija u sastavu predsjednik i dva clana Izborne comisije, \\u20aclanovi Verifikacijske komisije mogu biti i Clanovi Izborne komisije, a bira ih SkupStina. Prije utvrdivanja dnevnog reda sjednice predsjednik Verifikacijske komisije konstatira na osnovu oredanih evidencijskih listi\\u00a2a, i izvjeS\\u00a2a Verifikacijske komisije, postojanje kvoruma, odnosno nazotnosti vise od polovice ukupnog broja \\u00a2Clanova Skupstine neophodnih za pravovaljano odlutivanje. Poslije usvajanja dnevnog reda prelazi se na raspravu o pojedinim tockama redoslijedom koji je utvrden. \\u2018) Skup$&tini se o svakoj to\\u00e9ci dnevnog reda otvara rasprava prije nego Sto se o njoj odlucuje. pojedinom se pitanju raspravlja sve dok ima prijavijenih govornika, a potom predsjedavajuci respravu zaklju\\u00e9uje tekstom akta ili odluke koja se stavlja na glasovanje. . ad rasprava o nekim pitanjima traje duze, predsjedavajuci moze ograniciti trajanje izlaganja. Sjednice SkupStine mogu biti redovne, elektroni\\u00a2ke, izvanredne, sve\\u00e9ane i izborne. Zahtjev za sazivanje sjednice SkupStine, uz pisani zahtjev, moze podnijeti Upravni odbor, Nadzorni odbor ili najmanje 1/2 lanica Saveza. Zahtjev mora sadrZavati prijedlog dnevnog reda i pisano obrazlozenje s potpisima clanova Upravnog ili Nadzornog odbora ili potpisima 1/2 \\u00e9lanica Saveza. Ako predsjednik\", \"mogu biti redovne, elektroni\\u00a2ke, izvanredne, sve\\u00e9ane i izborne. Zahtjev za sazivanje sjednice SkupStine, uz pisani zahtjev, moze podnijeti Upravni odbor, Nadzorni odbor ili najmanje 1/2 lanica Saveza. Zahtjev mora sadrZavati prijedlog dnevnog reda i pisano obrazlozenje s potpisima clanova Upravnog ili Nadzornog odbora ili potpisima 1/2 \\u00e9lanica Saveza. Ako predsjednik ne sazove sjednicu SkupStine u roku od 30 dana od dana prijema zahtjeva za sazivanje sjednice Skupstine Saveza postavijenog u skladu s odredbama ovog Statuta, predlagatelj moze sam sazvati trazenu sjednicu SkupStine u roku od 30 dana, po isteku roka od 30 dana. ecane sjednice SkupStine mogu se sazvati povodom obiljeZavanja odredenog povijesnog datuma 2 Savez, odnosno iz druge potrebe iste prirode. >V zborne sjednice SkupStine odrzavaju se svake \\u20acetiri (4) godine. zbornim sjednicama SkupStine predsjedava tro\\u00a2lano radno predsjednistvo koje se bira izmedu clanova Skup$Stine. U slucaju isteka mandata tijelima Saveza, Skup&tinu Saveza saziva zadnja osoba za zastupanje upisana u Registar udruga ili najmanje 1/3 \\u00e9lanica Saveza koje su upisane u popis Clanica Saveza prije steka mandata tijelima Saveza. zvanredna sjednica Skupstine Saveza je skupStina koja se saziva sukladno odredbama ovog Clanka, 2 odnosi se na sjednicu iz prethodnog stavka ovog \\u00e9lanka. Clanak 29. Poziv se objavijuje na mreznim stranicama Saveza najkasnije 10 dana prije odrzavanja sjednice SkupStine. Poziv s predlozenim dnevnim redom i materijalima, s oznakom dana, po\\u00e9etka i mjesta odrzavanja sjednice Skupstine Saveza, Salju se Clanicama Saveza najkasnije 10 dana prije odrzavanja sjednice SkupStine elektroni\\u00a2kom postom. Rok za dostavu materijala moze biti i kraci od 10 dana, a dio materijala se moze dostaviti ina samoj sjednici SkupStine saveza. \\u20aclanak 30. SkupStina moze pravovaljano odludivati ako je na sjednici nazo\\u00e9na natpolovi\\u00e9na vecina \\u00e9lanova SkupStine. J slucaju da u zakazano vrijeme po\\u00e9etka rada Skupstine ne bude prisutna natpolovicna vecina clanova Skup&tine prigekat \\u00a2e se jedan sat, ukoliko i nakon toga sjednici Skupstine ne prisustvuje natpolovicna vecina clanova SkupStine, ista se nece odriati. Oc'uke SkupStine se donose javnim glasovanjem. Oc uka SkupStine je donesena ako za nju glasuje vecina nazo\\u00e9nih \\u00e9lanova na sjednici Skup\\u00e9tine. u sjednice SkupStine vodi se zapisnik, kojeg potpisuje izabrani zapisni\\u00e9ar na sjednici Skupstine 2, te zapisnik ovjeravaju dva ovjerovitelja zapisnika, takoder izabranih na sjednici Skup&tine 22, koji se trajno Cuva u arhivi Saveza. Clanak 31. -pravni odbor moze donijeti odluku glasovanjem \\u00a2lanova Skupstine bez neposrednog dolaska = anova Skup$Stine na sjednicu, izjaSnjavanjem o prijedlogu odluka putem elektronicka poste ili video poziva, koji omogu\\u00e9ava identifikaciju \\u00a2lanova i evidenciju njihova prisustva te dvosmjernu \\u00abomunikaciju. <2 organizaciju navedene elektronicke sjednice dostavlja se prijedlog odluka \\u00e9lanovima Skup8tine s or jedlogom da se izjasne ,,Za\\u201c, ,,Protiv\\u201c ili ,Suzdrzan\\u201c o predlozenoj odluci. 7 2\\u00abve odluke zahtijevaju prihvacanje od strane vecine svih Clanova Skupstine Saveza s pravom glasa. elektronickoj sjednici sastaviti Ce se, a zatim i verificirati, zapisnik na slijede\\u00e9oj redovnoj sjednici \\u00abupStine Saveza. 4.1.4. Mandat SkupStine Elanak 32. Maendat SkupStine Saveza traje Cetiri (4) godine, a pocinje teci danom verifikacije mandata oredstavnika Clanice za clanove SkupStine Saveza. st2 osoba moze biti ponovno izabrana u SkupStinu za novo mandatno razdoblie. caju sprijecenosti predstavnika Clanice\", \"zatim i verificirati, zapisnik na slijede\\u00e9oj redovnoj sjednici \\u00abupStine Saveza. 4.1.4. Mandat SkupStine Elanak 32. Maendat SkupStine Saveza traje Cetiri (4) godine, a pocinje teci danom verifikacije mandata oredstavnika Clanice za clanove SkupStine Saveza. st2 osoba moze biti ponovno izabrana u SkupStinu za novo mandatno razdoblie. caju sprijecenosti predstavnika Clanice u Skup$tini Saveza, \\u00e9lanica Saveza vr\\u00e9i izbor zamjenskog Clanak 33. <2m_enskom predstavniku Clanice na sjednici SkupStine Saveza, oduzet \\u00a2e se pravo glasa u slu\\u00e9aju == = 2nica Saveza nema urednu registraciju o vazecim mandatima tijela upravijanja i zastupanja. Serica Saveza duzna je do po\\u00e9etka sjednice Skup&tine dostaviti Savezu dokaz, odnosno kopiju ~=Senja ili izvod iz Registra udruga Republike Hrvatske iz kojeg je mogu\\u00a2e utvrditi urednu registraciju im mandatima tijela upravljanja i zastupanja te Clanice. \\u20aclanak 34. movi Skuptine sudjeluju u radu i odlucivanju temeljeci se na: s aktivnom predlaganju prijedloga zaklju\\u00a2aka u cilju doprinosa unapredenju razvoja judo sporta u Republici Hrvatskoj, zahtjevima provodenja utvrdene politike i strategije razvoja judo sporta u Republici Hrvatskoj, provedbi zajedni\\u00a2kih obveza i odgovornosti pri ostvarivanje planova juda, a posebno za ostvarivanje programa javnih potreba sportu Republike Hrvatske, u dijelu judo sporta, teinjama k ostvarivanju sportskih vrijednosti koje pridonose razvoju, afirmaciji i ugledu hrvatskog juda i Republike Hrvatske, zajedni\\u00a2kim interesima svih udruZenih Clanica i obvezi izvrSenja ciljeva i zada\\u00a2a Saveza utvrdenih Zakonom i ovim Statutom. tavnik \\u00e9lanice \\u2014 \\u00e9lan Skup&tine Saveza ima prava i obveze: sudjelovati u radu Skup&tine i drugih tijela u koje je izabran, odlu\\u00e9ivati o pitanjima o kojima odlucuje SkupStina, izvjestavati \\u00e9lanice koje predstavija o radu SkupStine io svom radu u Skup8tini Saveza i drugih tijela Saveza, pokretati raspravu 0 pitanjima iz djelokruga Skup\\u00e9tine i predlagati odgovarajuce odluke, sudjelovati u izvr$avanju zada\\u00e9a utvrdenih odlukama SkupStine, traziti stru\\u00e9nu pomo\\u00e9 od tijela Saveza, olimpizam, te interese udruge koju predstavija. 4.2. Predsjednik Saveza \\u20aclanak 35. Mendat predsjednika traje Cetiri (4) godine i iste osobe mogu biti ponovno birane zanovo mandatno jednik obavlja sljedece zadace i poslove: oredstavija i zastupa Savez u zemiji i inozemstvu, saziva i predsjedava sjednicama Skupstine i Upravnog odbora Saveza, te potpisuje akte, odluke i zapisnike koje oni donose, odgovoran je za zakonitost rada Saveza i ispunjavanje zakonom, drugim propisima ili ugovorima utvrdenih obveza Saveza, skrbi o izvrgenju odluka i zaklju\\u00e9aka Skupstine i Upravnog odbora, oodnosi izvjes\\u00e9a o svom i radu Upravnog odbora SkupStini Saveza, odgovoran je za podnoSenje prijedloga godisnjeg financijskog plana i financijskog izvje5\\u00a2a SkupStini Saveza za prethodnu godinu, vodi poslove sukladno odlukama SkupStine i Upravnog odbora Saveza, ooti\\u00e9e aktivnosti razvoja i promocije judo sporta, \\u00ab oredlaie Skup&tini kandidate za dopredsjednika, Clanove Upravnog odbora, Nadzornog odbora i Stegovne komisije Saveza, ookre\\u00e9e rjeSavanje pitanja razrjeSenja Clanova Upravnog odbora Saveza, + sklapa ugovore i poduzima pravne radnje u ime i za racun Saveza, * obavijaidruge zadace po ovlasti Skupstine i Upravnog odbora Saveza utvrdene opcim aktima ovim Statutom, ili koje su u svezi s funkcijom predsjednika. Elanak 36. ~2dsjednik Saveza odgovoran je za svoj rad Skupstini i Upravnom odboru. Dooredsjednik Saveza zamjenjuje odsutnog ili sprijecenog predsjednika Saveza u obavijanju =<iova i zada\\u00e9a, utvrdenih\", \"* obavijaidruge zadace po ovlasti Skupstine i Upravnog odbora Saveza utvrdene opcim aktima ovim Statutom, ili koje su u svezi s funkcijom predsjednika. Elanak 36. ~2dsjednik Saveza odgovoran je za svoj rad Skupstini i Upravnom odboru. Dooredsjednik Saveza zamjenjuje odsutnog ili sprijecenog predsjednika Saveza u obavijanju =<iova i zada\\u00e9a, utvrdenih prethodnim \\u00e9lankom, kojeg za to ovlasti predsjednik ili Upravni odbor. Elanak 37. Zs oredsjednika moze biti izabrana osoba koja udovoljava sljedecim uvjetima i kriterijima: da je dr\\u00e9avijanin Republike Hrvatske, daje potpuno poslovno sposobna, da je ugledan sportski djelatnik, dase nije ogrijesila o etitke norme i na\\u00e9ela sporta i olimpijskog pokreta, da prihva\\u00e9a Statut Saveza, Statut Hrvatskog olimpijskog odbora, Statut i pravila pripadajucih medunarodnih sportskih udruzenja, na\\u00e9ela i pravila Olimpijske povelje, te Svjetskog kodeksa protiv dopinga (WADA), danema prepreke iz Zakona o sportu, koja nema zapreke iz Clanka 111. stavci 1.1 2. odnosno iz \\u00e9lanka 114. Zakona o sportu, da poznaje jedan svjetski jezik koji je u sluzbenoj uporabi medunarodnog sportskog udruzenja prema odredbama Statuta tih udruzenja. Clanak 38. edsjednika bira SkupStina, a na temelju pisanog prijedloga kandidata, koji imaju pravo podnijeti ce Pisani prijedlog kandidata treba podrZati 10 Clanica Saveza, s tim da ista \\u00e9lanica moze =odr\\u00e9ati istodobno samo jednog kandidata. mo D =/\\u00e9aju redovnog izbora predsjednika Saveza, kao i u slu\\u00e9aju izvanrednih izbora, Clanice Saveza \\u00a5 su Uredu Saveza dostaviti pisani prijedlog kandidata za predsjednika s obrazlozenjem >/2snije 60 dana prije odrzavanja sjednice Skupstine. elim prijedlozima kandidata za predsjednika Saveza, Ured Saveza duZno je obavijestiti sve snice u roku od 15 dana po isteku roka za dostavu pisanih prijedloga kandidata. Seo = 22 predsjednika istaknuto viSe kandidata, od kojih u prvom krugu glasovanja niti jedan ne = ootrebnu vecinu glasova \\u00a2lanova Skup\\u00e9tine, u drugom krugu glasovanja na izbornu se listu su ona dva kandidata koja su u prvom krugu dobili najveci broj glasova. Elanak 39. \\u00ab d2 predsjednik, kojeg je izabrala SkupStina ne izvr$ava svoje obveze sukladno odredbama DWE \\u201ctz, svojim radom tezZe povrijede zakon, odredbe Olimpijske povelje, odredbe Statuta ili =o/e es &ole je utvrdila SkupStina ili svojim djelovanjem sprjecavaju provodenje odluka Skup$tine, == eeu biti razrijeSeni sa svojih funkcija. za razrjeSenje predsjednika sliiedom odredbe iz stavka 1. ovog \\u00e9lanka mogu podnijeti aveza pisanim zahtjevom koji treba podrzati 1/2 Clanica Saveza, a predsjednika moze se tii na temelju njegovog osobnog zahtjeva. g S ten2 od nastupanja navedenih okolnosti. 43. Upravni odbor Clanak 40. ~ @r2vni odbor je upravno tijelo Saveza koje obavija slijede\\u00e9e poslove i zadace. awrouje: prijedlog strategije razvoja judo sporta u RH, prijedlog Statuta, odnosno njegovih izmjena i dopuna, koje donosi skup&tina Saveza, oprijedlog godisnjeg i visegodisnjeg plana judo sporta na drzavnoj razini, odnosno program rada Saveza, koje donosi skupStina Saveza, financijski plan, uvjete i nagin koristenja financijskog plana, koje donosi skupStina Saveza, financijsko izvjeS\\u00a2e, koje donosi skupStina saveza. godi&nji kalendar natjecanja i opce uvjete za sudjelovanje na tim natjecanjima, odluku o prijemu u privremeno \\u00e9lanstvo Saveza, opce akte koji reguliraju pitanja iz nadleznosti Upravnog odbora, te razmatra i odlu\\u00e9uje o pitanjima iz podrucja djelovanja Saveza,\", \"koristenja financijskog plana, koje donosi skupStina Saveza, financijsko izvjeS\\u00a2e, koje donosi skupStina saveza. godi&nji kalendar natjecanja i opce uvjete za sudjelovanje na tim natjecanjima, odluku o prijemu u privremeno \\u00e9lanstvo Saveza, opce akte koji reguliraju pitanja iz nadleznosti Upravnog odbora, te razmatra i odlu\\u00e9uje o pitanjima iz podrucja djelovanja Saveza, koja nisu u nadleznosti Skupstine ili kojeg drugog tijela Saveza u skladu s odredbama ovog Statuta, odluku o dodjeli nagrada i priznanja u judo sportu Republike Hrvatske, mjere i aktivnosti za unapredenje i stvaranje najpovoljnijih materijalnih i financijskih uvjeta za realizaciju planova Saveza, odluku o adresi Saveza kao i promjeni adrese Saveza, odluku 0 uporabi, izgledu i \\u20acuvanju pe\\u00e9ata Saveza, odluku 0 opisu znaka i zastave Saveza, te uporabi i njihovoj zastiti, Pravilnik o financijskom materijalnom poslovanju saveza, Pravilnik o licenciranju trenera, Pravilnik o stegovnoj odgovornosti, Sudactki pravilnik, odluku o sudjelovanju sportskih klubova i sportaSa iz Republike Hrvatske u viSedrzavnim ili inozemnim regionalnim sustavima natjecanja, Pravilnike za druga pitanja iz svoje nadleZnosti sukladno Zakonu o sportu te pravilima Medunarodne judo federacije i Europske judo unije, odluku o prijemu u privremeno \\u00e9lanstvo Saveza, ray uw op\\u00a2\\u00e9e akte koji reguliraju pitanja iz nadleznosti Upravnog odbora, te razmatra i odlu\\u00e9uje o pitanjima iz podrugja djelovanja Saveza, koja nisu u nadleZnosti Skup$Stine ili kojeg drugog tijela Saveza u skladu s odredbama ovog Statuta, mijere i aktivnosti za unapredenje i stvaranje najpovoljnijih materijalnih i financijskih uvjeta za realizaciju planova Saveza, menuje: glavnog tajnika Saveza na temelju provedenog javnog natjecaja i razrjeSava ga, ikvidatora Saveza i razrjeSava ga, predstavnika Saveza u SkupStini Hrvatskog olimpijskog odbora, te predstavnike u drugim organizacijama, institucijama i tijelima i razrjeSava ih, stru\\u20acno-trenersku komisiju, komisiju sportaSa, natjecateljsku komisiju, suda\\u00e9ku komisiju, xomisiju za kate i pojaseve, komisiju za Skolski sport, komisiju za Zene, komisiju za inkluzivni judo, te donosi odluku o djelokrugu njihova rada i ovlasti, ostala radna tijela Saveza, a moze imenovati i stalne ili povremene komisije, odnosno radne grupe za koje se ukaze potreba, te donosi odluku o djelokrugu njihova rada i ovlasti. Se: udruZzivanje u medunarodne i nacionalne sportske organizacije, program osnovne djelatnosti judo sporta kao i drugih djelatnosti Saveza sukladno propisima, pravilnik o sustavu uvjetima i organizaciji natjecanja u judo sportu, Skup$stini Saveza, osobe za proglasenje pocasnog i zasluznog Clana Saveza. Odlutuje o: organizaciji i nacinu obavijanja strucnih, administrativno-tehni\\u00e9kih i pomo\\u00e9nih poslova za potrebe Saveza i udruzenih Clanica, isticanju kandidature za organizaciju medunarodnih natjecanja u RH, davanju suglasnosti udruzenim Clanicama i Clanovima za sudjelovanje na medunarodnim natjecanjima. davanju inicijative za odrZavanje redovne, elektronicke, izborne, izvanredne ili svecane Sjednice SkupStine. Provodi i skrbi o: provodenju odluka i zakljuc\\u00e9aka SkupStine ako ovim Statutom, ili samim odlukama i zaklju\\u00e9cima to nije povjereno drugom tijelu Saveza, izvrSavanju financijskog plana Saveza, rasporedu i koristenju sredstava, organizaciji i realizaciji strategije i svih planova Saveza i odgovoran je za njihovo izvrSenje, upravlija pokretnom i nepokretnom imovinom Saveza, razmatra pitanja iz rada udruzZenih Clanica i poduzima odgovarajuce mjere za unapredenje njihova rada, kao i za otklanjanje nepravilnosti u radu, obavija i druge poslove i zadace odredene Statutom\", \"sredstava, organizaciji i realizaciji strategije i svih planova Saveza i odgovoran je za njihovo izvrSenje, upravlija pokretnom i nepokretnom imovinom Saveza, razmatra pitanja iz rada udruzZenih Clanica i poduzima odgovarajuce mjere za unapredenje njihova rada, kao i za otklanjanje nepravilnosti u radu, obavija i druge poslove i zadace odredene Statutom ili drugim op\\u00a2cim aktima Saveza, odnosno odlukom SkupStine Saveza. ~oravni odbor za svoj rad odgovara Skup$tini. be oO\\u201d \\u20aclanak 41. gree ocbor ima sedam (7) Clanova, medu kojima je po funkciji predsjednik Saveza. geet! egenju kendidata za \\u00a2lanove Upravnog odbora novoizabrani predsjednik ce voditi racuna o \\u2014 osposobljenostii i drugim kvalitetama i osobinama osoba u odnosu na nadleznosti Upravnog ~@ipere te G2 ne postoje prepreke sukladno Zakonu o sportu kao i da ispunjavaju uvjete utvrdene gavetbom Ganka 26. stavak 1. ovog Statuta ovim Statutom. a b _ \\u00a9 ote ca lista kandidata za Clanove Upravnog odbora, koju je predlozio predsjednik, ne bude gy ester od strane SkupStine, pojedinac\\u00e9no \\u00a2e se glasovati o svakom pojedinom kandidatu, a yet) eam \\u00a9 prediaze onoliko novih kandidata koliko ih ne bude prihvaceno s liste. \\u201ceee Uorevnog odbora izvrSavaju zada\\u00a2e utvrdene ovim Statutom, odnosno koje im nalozi same Upravni odbor ili predsjednik, u skladu s aktima saveza i zakonom. \\u2018eens \\u00a9 Sanova Upravnog odbora u svakoj prigodi zastupati i Stititi interese Saveza i judo sporta. Elanak 42. mova Upravnog odbora traje \\u00e9etiri (4) godine i ista osoba moze biti ponovno izabrana za qae2 \\u2122endatno razdoblje. _ \\u00a9 eS2 0 \\u00a22 Gan Upravnog odbora ne izvrsava svoje obveze sukladno odredbama Statuta, isti moze )o \\\"enn esen s funkcije Clana Upravnog odbora. Se] = Gana Upravnog odbora vrsi se na isti nacin kao i njegovo biranje. So @0 oe 2 rezrjeSenje Clana Upravnog odbora, slijedom odredbe stavka 2. ovog \\u00a2lanka, moze dati \\u2018ye ete \\u00a9 \\u00a9 dan Upravnog odbora, a Clan Upravnog odbora moze biti razrijeSen i na osobni =e \\u201cYs me rezrijeSenog Clana Upravnog odbora bira se novi Clan po istom postupku po kojem je Sen Uoravnog odbora koji je razrijeSen, odnosno koji je prestao s obavijanjem funkcije \\u00e9lana ae odbo bora, a mandat novoizabranog Clana Upravnog odbora traje do kraja mandata tog prewmog odbora Saveza. Clanak 43. \\u2122 o@@bor djeluje na sjednicama, a moze djelovati i izjaSnjavanjem telefonski ili putem se2 poSte Clanova Upravnog odbora. Seeel]e> = oravovaljanih odluka potrebna je nazocnost, odnosno telefonsko izjaSnjavanje ili @eem =e putem elektronske poSte vecine od ukupnog broja Clanova Upravnog odbora. | =@bor donosi odluke javnim glasovanjem, a odluka je donesena vecinom glasova prisutnih _@r2vnog odbora ili vecinom glasova telefonskog izjaSnjavanja ili izjasnjavanja putem = poste Clanova Upravnog odbora. 17 Sednicama Upravnog odbora predsjedava predsjednik, a u slu\\u00e9aju njegove odsutnosti ili sorjetenosti dopredsjednik. S dnice Upravnog odbora saziva predsjednik. 4.4. Glavni tajnik Clanak 44. S2vez ima glavnog tajnika kojeg svojom odlukom neposredno imenuje Upravni odbor Saveza, nakon -ovedenog javnog natjegaja, sukladno Zakonu, a imenuje se do opoziva. 2vni tajnik svoju funkciju obavlja profesionalno, a prava i obveze izmedu Saveza i glavnog tajnika sreduju se ugovorom o radu. \\u20aclanak\", \"predsjednik. 4.4. Glavni tajnik Clanak 44. S2vez ima glavnog tajnika kojeg svojom odlukom neposredno imenuje Upravni odbor Saveza, nakon -ovedenog javnog natjegaja, sukladno Zakonu, a imenuje se do opoziva. 2vni tajnik svoju funkciju obavlja profesionalno, a prava i obveze izmedu Saveza i glavnog tajnika sreduju se ugovorom o radu. \\u20aclanak 45. 2lavnog tajnika moze biti birana osoba koja ispunjava sljedece uvjete: da je drzavijanin Republike Hrvatske, daima visoku stru\\u00e9nu spremu dru&stvenog smjera prema vazecim propisima o akademskim i stru\\u00e9nim nazivima i akademskom stupnju, daima5 godina iskustva na upravijackim poslovima, da je dokazani sportski duznosnik ili djelatnik, da poznaje hrvatski i svjetski judo sport i funkcioniranje njihovih asocijacija, dapoznaje rad na osobnom racunalu, dase nije ogrijesio o eticke norme i moralna nacela sporta i olimpizma, = danema zapreke iz \\u00e9lanka 111. stavci 1. i 2. odnosno iz \\u00e9lanka 114. Zakona o sportu, * dase sluzijednim od sluzbenih jezika Medunarodne judo federacije. Clanak 46. > vei tajnik sudjeluje u radu Skup&tine, Upravnog odbora i svih drugih tijela Saveza. >i tajnik provodi i osigurava provodenje opcih akata i programa Saveza te odluka i zaklju\\u00e9aka ine Saveza, Upravnog odbora i predsjednika Saveza, te osobito obavlja sljedece poslove i zastupai predstavija Savez, odgovoran je za zakonitost rada Saveza i ispunjavanje zakonom, drugim propisima ili ugovorima utvrdenih obveza Saveza, odgovoran je za podnoSenje prijedloga godisnjeg financijskog plana i financijskog izvije5\\u00a2a Skup$Stini Saveza, nalogodavac je za izvrsenje financijskog plana Saveza, obavija stru\\u00e9ne i administrativne poslove, odgovara za pripremu materijala za sjednice tijela Saveza, vodi poslove sukladno odlukama Skup\\u00e9tine i Upravnog odbora Saveza, odgovoran je za podnogenje dokumenata nadleznim tijelima sukladno propisima, te za dostavljanje zapisnika s redovne sjednice SkupStine saveza nadleznom uredu, skrbi o suradnji Saveza s pripadajucim medunarodnim organizacijama judo sporta, te 18 savezima tog sporta drugih drzava, suraduje s ministarstvima i drugim drzavnim tijelima, Hrvatskim olimpijskim odborom i drugim organizacijama vaznim za judo sport, suraduje s Clanicama Saveza na razvoju i unapredenju judo sporta , vodi i azurira evidenciju lanica Saveza, te je odgovoran za omogu\\u00a2avanje svakodnevnog uvida i davanje podataka o aktualnom \\u00e9lanstvu u Savezu, \\u00a2 sklapa ugovore i poduzima pravne radnje u ime i za ragun Saveza, organizira pristup medijima, provodi usvojene planske dokumente Saveza, osigurava javnost rada Saveza, \\u00a2 organizira i rukovodi poslovima Ureda Saveza, obavija i druge poslove utvrdene Statutom, drugim opcim aktima ili odlukama Skupitine, Upravnog odbora i predsjednika Saveza. Glavni tajnik za svoj rad odgovara Upravnom odboru. Clanak 47. Glavni tajnik moze biti razrije\\u2019en duznosti ako svojim radom neopravdano ne izvrsava odnosno odbije izvrSavati odluke Upravnog odbora. Odluku 0 razrjeSenju donosi Upravni odbor Saveza. Inicijativu za razrjeSenje duznosti Glavnog tajnika mogu dati predsjednik Saveza, Upravni odbor i Nadzorni odbor Saveza. Do razrjeSenja moze do\\u00e9i i na viastiti zahtjev Glavnog tajnika Saveza. 4.5. Nadzorni odbor Clanak 48. Nadzorni odbor se sastoji od tri (3) \\u00a2lana, predsjednik i dva (2) Elana. Mandat Nadzornog odbora traje 4 godine. Kandidate za \\u00e9lanove Nadzornog odbora predlaze predsjednik Saveza, pri \\u20acemu kandidati trebaju ispunjavati uvjete utvrdene odredbom \\u00e9lanka 26. stavak 1. ovog Statuta. Clan Nadzornog\", \"tajnika Saveza. 4.5. Nadzorni odbor Clanak 48. Nadzorni odbor se sastoji od tri (3) \\u00a2lana, predsjednik i dva (2) Elana. Mandat Nadzornog odbora traje 4 godine. Kandidate za \\u00e9lanove Nadzornog odbora predlaze predsjednik Saveza, pri \\u20acemu kandidati trebaju ispunjavati uvjete utvrdene odredbom \\u00e9lanka 26. stavak 1. ovog Statuta. Clan Nadzornog odbora ne moie biti lan drugog radnog tijela Saveza. Elanak 49. Nadzorni odbor je ovlasten za: \\u00a2 kontrolu provodenja zakonitosti u radu i poslovanju Saveza, * nadzor materijalno-financijskog poslovanja Saveza, * nadzor izvrSavanja odluka i zaklju\\u00a2aka Skupstine i Upravnog odbora, * poduzimanje drugih mjera u svezi sa svojim poslovima, zada\\u00e9ama i djelokrugom rada. Ured Saveza, kao i druga tijela Saveza, duZni su Nadzornom odboru pruziti sve trazene i potrebne 19 podatke, omoguciti uvid u dokumentaciju i osigurati uvjete za rad. Nadzorni odbor je za svoj rad odgovoran Skupstini Saveza kojoj podnosi izvjes\\u00a2e o svom radu. O uo\\u00e9enim nepravilnostima Nadzorni odbor obavjestava Ured Saveza, Upravni odbor, odnosno SkupStinu Saveza kao i tijelo u cijem je radu nastala nepravilnost. Ako se utvrdena nepravilnost ne otkloni u roku od 30 dana od zaprimljenog zahtjeva, Nadzorni odbor je duzZan 0 tome obavijestiti ovlastena drzavna tijela. Nadzorni odbor djeluje na sjednicama, a odluke, zaklju\\u00a2ke i preporuke donosi natpolovicnom vecinom Clanova Nadzornog odbora. 4.6. Stegovna komisija \\u20aclanak 50. Stegovna komisija Saveza je tijelo koje odlu\\u00e9uje o stegovnoj odgovornosti \\u00e9lanova i osoba koje sudjeluju u programima Saveza, provodi stegovne postupke u prvom stupnju, a temeljem Pravilnika o stegovnoj odgovornosti koji donosi Skupstina Saveza. Elanak 51. Stegovna komisija se sastoji od tri (3) \\u00e9lana, predsjednik i dva (2) lana a bira ih Skupstina Saveza, na prijedlog predsjednika Saveza, na mandat od \\u00e9etiri godine. Kandidati za \\u00a2lanove Stegovne komisije trebaju ispunjavati uvjete utvrdene odredbom lanka 26. stavak 1. ovog Statuta. Stegovna komisija donosi odluke vecinom glasova. Stegovna komisija odlu\\u00a2uje o stegovnoj odgovornosti \\u00e9lanica Saveza, kao i fizi\\u00e9kih osoba koje sudjeluju u radu tijela ili programu Saveza, zbog po\\u00e9injenih povreda prava i obveza utvrdenih odredbama ovog Statuta, odredbama Pravilnika o stegovnoj odgovornosti te drugih akata Saveza, sa slijedecim djelokrugom: prima prijave za pokretanje stegovnog postupka koje ulazu Clanice i drugi sudionici Saveza, provodi stegovne postupke u |. stupnju inicirane po prijavi ili po sluzbenoj duznosti, provodi mjere utvrdene Pravilnikom o stegovnoj odgovornosti, \\u00a2 prati i predlaze izmjene i dopune Pravilnika o stegovnoj odgovornosti Saveza, \\u00a2 obavija i druge zada\\u00a2e, temeljem odluka SkupStine, koje su u djelokrugu njenog rada. Zalba na odluku Stegovne komisije se u roku od 15 dana od primitka odluke podnosi Upravnom odboru Saveza koji stegovni postupak rjeSava u Il. stupnju. Odluka Upravnog odbora saveza povodom Zalbe je kona\\u00e9na. 20 Elanak 52. Stegovna komisija za svoj rad i djelovanje odgovara Skup$tini. V. NAGIN RJESAVANJA SPOROVA I SUKOBA INTERESA UNUTAR SAVEZA Elanak 53. Sukladno odredbama Zakona o sportu, Zakonu o udrugama, te drugim pripadajucim propisima, kao i u odnosu na nadleznosti tijela Saveza i zaStitu op\\u00a2eg interesa u odnosu na pojedina\\u00e9ne interese \\u00e9lanova, Upravni odbor Savez samostalno odlucuje o na\\u00e9inu rjeSavanja sporova nastalih u vezi s obavijanjem sportske djelatnosti\", \"UNUTAR SAVEZA Elanak 53. Sukladno odredbama Zakona o sportu, Zakonu o udrugama, te drugim pripadajucim propisima, kao i u odnosu na nadleznosti tijela Saveza i zaStitu op\\u00a2eg interesa u odnosu na pojedina\\u00e9ne interese \\u00e9lanova, Upravni odbor Savez samostalno odlucuje o na\\u00e9inu rjeSavanja sporova nastalih u vezi s obavijanjem sportske djelatnosti judo sporta. Vi. | UNUTARNJI NADZOR Clanak 54. Clanovi Saveza sami nadziru rad Saveza. Ako \\u00e9lanica Saveza ili druga osoba koja sudjeluje u radu ili programu Saveza smatra da je odlukom ili postupanjem nekog tijela Saveza povrijeden Statut ili drugi op\\u00a2ci akt Saveza, ovlaStena je na to upozoriti Ured Saveza ili Upravni odbor Saveza, te zahtijevati da se nepravilnosti otklone. Ako se upozorenje ne razmotri u roku od 30 dana od dana dostavijenog pisanog zahtjeva, i po zahtjevu ne odgovori, odnosno ako se u tom roku ne otituje nadlezno tijelo Saveza i nepravilnosti ne otklone u daljnjem roku od 30 dana, Clanica, odnosno druga osoba koja sudjeluje u radu ili programu Saveza, a podnijela je zahtjev za otklanjanje nepravilnosti, moze podnijeti tuzbu nadleznom sudu prema sjedi8tu udruge radi zastite svojih prava propisanih statutom Saveza. VI. IMOVINA | MATERUALNO FINANCIUSKO POSLOVANJE \\u20aclanak 55. movinu Saveza \\u00e9ine nekretnine, pokretna imovina, prava i nov\\u00e9ana sredstva. Savez vodi poslovne knjige i sastavija financijska izvjesca prema propisima kojima se ureduje nacin financijskog poslovanja i vodenja ratunovodstva neprofitnih organizacija. Savez osigurava nov\\u00e9ana sredstva od gospodarske djelatnosti, dijela \\u00e9lanarine, kotizacije, sredstava ostvarenih od programskih sredstava Hrvatskog olimpijskog odbora, sredstava od sponzora, dotacija, donacija, fondova i drugih izvora sukladno zakonu. Clanak 56. Nov\\u00e9ana sredstva Saveza nalaze se na njegovim poslovnim racunima. Raspodjela ukupnih financijskih sredstava vr&i se financijskim planom u skladu s programom rada. 21 >rora\\u00e9unska sredstva strogo su namjenska i mogu se koristiti iskljucivo za poslove i zadace srihva\\u00e9ene godisnjim programom i financijskim planom i rashodima proracunskih sredstava. \\u201cMogu\\u00e9om razlikom prihoda i rashoda ostvarenom obavljanjem gospodarskih djelatnosti, sukladno odredbama ovog Statuta i pripadajucih propisa, raspolagati Ce Upravni odbor, sukladno programu i Snancijskom planu Saveza, a ona moze biti koristena iskljucivo u svrhu ostvarivanja ciljeva Saveza. =ventualno ostvareni viSak prihoda nad rashodima u poslovanju rasporeduje se financijskim olanom na slijede\\u00a2u godinu u svrhu unapredenja judo sporta. =inancijski plan Saveza donosi, mijenja i dopunjuje Skupstina Saveza. Naredbodavac za izvrSenje financijskog plana je glavni tajnik Saveza, a Upravni odbor moze svojom odlukom utvrditi i druge osobe s ovlastenjima u materijalno-financijskom poslovanju. Materijalno-financijsko poslovanje Saveza organizira se i vodi u skladu sa zakonom i op\\u00a2cim aktima Saveza. GodiSnji financijski izvjeStaj Saveza usvaja SkupStina i predaje se Ministarstvu financija, odnosno drugoj instituciji koju Ministarstvo financija ovlasti za zaprimanje i obradu financijskih izvjeStaja, a javno se objavljuje putem Registra neprofitnih organizacija sukladno zakonskim propisima. Elanak 57. Savez moze stjecati nekretnine, pokretnu imovinu i prava. Savez moze raspolagati svojom imovinom samo za ostvarivanje ciljeva i obavijanje djelatnosti odredenih ovim Statutom, u skladu sa zakonom. Za svoje obveze Savez odgovara cjelokupnom imovinom. Clanice Saveza i lanovi njegovih tijela ne odgovaraju za obveze Saveza. Nad Savezom se moze provesti ste\\u00a2aj, sukladno zakonu. VII. \\u2014 SIGURNOST, ZASTITA\", \"prava. Savez moze raspolagati svojom imovinom samo za ostvarivanje ciljeva i obavijanje djelatnosti odredenih ovim Statutom, u skladu sa zakonom. Za svoje obveze Savez odgovara cjelokupnom imovinom. Clanice Saveza i lanovi njegovih tijela ne odgovaraju za obveze Saveza. Nad Savezom se moze provesti ste\\u00a2aj, sukladno zakonu. VII. \\u2014 SIGURNOST, ZASTITA | RED NA SPORTSKIM NATJECANJIMA Clanak 58. Sportaii i treneri, suci i druge sluzbene osobe na natjecanju, te Clanovi upravljackih tijela Clanica Saveza i Saveza, duzZni su svojim javnim nastupima popularizirati sportske ideje i ponaSanje, koji isklju\\u00e9uju eventualno izbijanje sukoba ili nereda na sportskim natjecanjima. Clanice Saveza i Savez, organizatori sportskih natjecanja, duZni su u pripremama za organizaciju kao i usamom odrZavanju natjecanja poduzeti sve mjere kako bi se na natjecanju osigurala sigurnost natjecatelja i gledatelja i otklonila mogu\\u00e9nost eventualnih sukoba ili nereda na sportskom natjecanju. 22 Za primjenu ove odredbe odgovorna je osoba ovlaStena za zastupanje organizatora natjecan 2 ukoliko Savez ili nadlezZno tijelo organizatora u tu svrhu izricito ne ovlaste drugo tijelo, odgowerajucu sluzbu ili osobu, odgovornu za pripremu i provedbu mjera sigurnosti, zaStite sudionika natjecanja te reda na sportskom natjecanju. Organizatori iz prethodne to\\u00a2ke duZni su za vrijeme natjecanja osigurati medicinsku pomo\\u00a2 za sve sudionike, odnosno nazo\\u00e9nost osobe osposobljene i ovlastene za pruzanje medicinske pomoci. Ponaganja \\u00e9lanova Saveza, suprotno odredbama stavka 1. ovog \\u00a2lanka predstavijaju stegovni prijestup u skladu s Pravilnikom o stegovnoj i materijalnoj odgovornosti Saveza. IX. | STRUCNI | ADMINISTRATIVNI POSLOVI Elanak 59. Za obavijanje stru\\u00a2nih, tehni\\u00a2kih, administrativnih i drugih poslova Saveza moze se angazirati potreban broj djelatnika koji poslove mogu obavijati volonterski, honorarno ili profesionalno, angaziranjem odredenog broja vanjskih suradnika ili izvrsitelja koji poslove mogu obavijati volonterski, honorarno ili profesionalno, a obavijanje odredenog posla moze se povjeriti i odgovarajucoj vanjskoj pravnoj osobi, temeljem odluke Upravnog odbora, Predsjednika ili Glavnog tajnika Saveza, a sukladno zakonskim propisima. Stru\\u00e9ne poslove izbornika i trenera u Savezu mogu obavijati osobe koje imaju odgovarajucu stru\\u00a2nu spremu za obavijanje stru\\u00e9nih poslova u judo sportu, odnosno osobe koje su osposobljene i usavr$ene za obavijanje stru\\u00e9nih poslova u sportu sukladno Zakonu o sportu i pripadajucim propisima. Sredstva za place i rad djelatnika u Savezu osiguravaju se financijskim planom u skladu s financijskim planom Saveza i Hrvatskog olimpijskog odbora. Uredom Saveza rukovodi glavni tajnik Saveza. Na Ured Saveza se ne mogu prenositi poslovi i zadace o kojima odlucuju tijela Saveza. xX. JAVNOST RADA Clanak 60. Javnost rada ostvaruje se upoznavanjem svojih \\u00e9lanica i drugih zainteresiranih tijela i organizacija odnosno javnosti o projektima, odlukama, smjernicama i zaklju\\u00e9cima tijela Saveza. Obavjestavanje javnosti i \\u00e9lanstva vr8i se objavijivanjem opcih i drugih akata Saveza, na mreznim i dru&tvenim stranicama Saveza, a moze biti i u \\u00e9asopisu, biltenu ili drugom tiskanom mediju Saveza, kao i objavom informacija u sredstvima javnog priopcavanja. 23 + ednice skupStine Saveza su otvorene za javnost i \\u00a2lanice Saveza. Javnost se samo iznimno moze s\\u00abijuciti sa sjednica Skupstine Saveza u slijedecim slu\\u00e9ajevima: kada se raspravlja o pitanjima koja predstavljaju poslovnu tajnu, \\u00b0 kada se to zbog osobito vaznih razloga odlu\\u00e9i na sjednici Skupstine Saveza. >\", \"javnog priopcavanja. 23 + ednice skupStine Saveza su otvorene za javnost i \\u00a2lanice Saveza. Javnost se samo iznimno moze s\\u00abijuciti sa sjednica Skupstine Saveza u slijedecim slu\\u00e9ajevima: kada se raspravlja o pitanjima koja predstavljaju poslovnu tajnu, \\u00b0 kada se to zbog osobito vaznih razloga odlu\\u00e9i na sjednici Skupstine Saveza. > ednice Upravnog odbora Saveza su zatvorene za javnost i \\u00e9lanice Saveza. Javnost i \\u00e9lanice Saveza s= samo iznimno mogu ukljuciti u rad sjednica Upravnog odbora Saveza u slijedecim slu\\u00e9ajevima: po pozivu predsjednika Saveza, po unaprijed predlozenoj temi za raspravu, odobrenoj od strane predsjednika Saveza, kada se za to zbog osobito vaznih razloga odlu\\u00e9i Upravni odbor Saveza. sjednice Nadzornog odbora Saveza su zatvorene za javnost i \\u00e9lanstvo. Javnost i \\u00e9lanice Saveza se samo iznimno mogu ukljuciti u rad sjednica Nadzornog odbora Saveza i to u slijedecim slu\\u00e9ajevima: * po pozivu predsjednika Nadzornog odbora Saveza, * po unaprijed predlozenoj temi za raspravu, odobrenoj od strane predsjednika Nadzornog odbora Saveza, \\u00a2 kada se za to zbog osobito vaznih razloga odluci Nadzorni odbor Saveza. sjednice Stegovne komisije Saveza su zatvorene za javnost i \\u00e9lanstvo. Javnost i \\u00e9lanice Saveza se samo iznimno mogu ukljugiti u rad sjednica Stegovne komisije Saveza u slijedecim slu\\u00e9ajevima: po pozivu predsjednika Stegovne komisije Saveza, \\u00b0 _kada se za to zbog postupka koji se vodi, odlu\\u00e9i Stegovna komisija Saveza. Sjednice ostalih tijela Saveza su zatvorene za javnost i \\u00a2lanstvo. Javnost i \\u00e9lanice Saveza se samo znimno mogu ukljuciti u rad ostalih tijela Saveza. U slijedecim slucajevima: po pozivu predsjednika tijela Saveza, \\u00ae po unaprijed predlozenoj temi za raspravu, odobrenoj od strane predsjednika tijela Saveza. ObavjeStavanje javnosti vrsi se i objavijivanjem Statuta Saveza, popisa \\u00e9lanica Saveza, odluka, opcih i drugih akata iz Clanka 37. stavak 5. Zakona o sportu, te informacija na mrezZnim stranicama Saveza, objavom informacija putem glasila Saveza, objavom informacija u drugim sredstvima priop\\u00e9avanja. Nastavno na odredbu prethodnog stavka Savez je duzan javno objaviti op\\u00e9e akte Saveza kojima se utvrduju: sustav natjecanja u judo i to najmanje jednu godinu prije po\\u00e9etka primjene tog sustava, materijalni, tehnicki i stru\\u00e9ni uvjeti za u\\u00e9lanjenje sportskih klubova u \\u00e9lanstvo Saveza, nacin licenciranja stru\\u00e9nih kadrova judo sukladno Zakonu o sportu, \\u00a2 natin registracije sportasa, prava i obveze sportasa i Glanova Saveza, pravo nastupa stranih sportaSa za sportske klubove u judo sporta u Republici Hrvatskoj, stegovna odgovornost osoba u sustavu judo sporta, \\u00a2 prava i obveze sudaca, \\u00a2 druga pitanja iz nadlezZnosti Saveza sukladno Zakonu o sportu te pravilima medunarodnog i europskog saveza judo sporta. 24 re Xl. UTVRBIVANJE | DODJELJIVANJE PRIZNANJA | NAGRADA \\u20aclanak 61. Za sportska i stru\\u00e9na postignu\\u00a2a u judo sporta Savez moze dodjeljivati priznanja i nagrade. <riterije, vrste priznanja i nagrada, te nacin predlaganja i dodjeljivanja donosi Upravni odbor Saveza. Xll. | PRESTANAK RADA SAVEZA Elanak 62. Savez prestaje s radom kada se ispune Zakonom propisane pretpostavke ili odlukom SkupStine Saveza. Odluka o prestanku rada Saveza donosi se vecinom glasova ukupnog broja \\u00e9lanova Skup&tine Saveza. J slu\\u00e9aju prestanka rada Saveza nekretnine, pokretna imovina i prava Saveza prelaze u viasnistvo sportske udruge koja\", \"PRESTANAK RADA SAVEZA Elanak 62. Savez prestaje s radom kada se ispune Zakonom propisane pretpostavke ili odlukom SkupStine Saveza. Odluka o prestanku rada Saveza donosi se vecinom glasova ukupnog broja \\u00e9lanova Skup&tine Saveza. J slu\\u00e9aju prestanka rada Saveza nekretnine, pokretna imovina i prava Saveza prelaze u viasnistvo sportske udruge koja Ce nastaviti djelatnosti radi promicanja i razvitka judo sporta na podru\\u00e9ju Republike Hrvatske. Nov\\u00e9ana sredstva \\u00a2e se upotrijebiti za podmirenje dospjelih obveza Saveza, a preostali iznos ce se raspodijeliti na jednake dijelove \\u00e9lanicama Saveza Ako je Savez primio financijska sredstva iz prora\\u00e9una ili iz drugih javnih izvora, u slucaju prestanka postojanja, ostatak sredstava vratit ce se u proracun iz kojeg su financijska sredstva dodijeljena. Xl. LIKVIDATOR SAVEZA Clanak 63. Likvidator je fizicka ili pravna osoba koju imenuje i opoziva Upravni odbor Saveza. Pokretanjem postupka likvidacije Saveza prestaju ovlastenja tijela i osoba ovlagtenih za zastupanje Saveza. Likvidator zastupa Savez u postupku likvidacije te se otvaranjem likvidacijskog postupka upisuje u Registar udruga kao osoba ovlastena za zastupanje Saveza do okon\\u00e9anja postupka likvidacije i brisanja Saveza iz Registra udruga. Postupak likvidacije saveza provodi likvidator sukladno odredbama Zakona o udrugama. Likvidator ne moze biti osoba za koju postoji zapreka iz Zakona o udrugama za obavijanje duznosti likvidatora udruge. a. mV. PRIJELAZNE | ZAVRSNE ODREDBE Clanak 64. ~vaj Statut, kao injegove izmjene i dopune, donosi SkupStina Saveza, nakon prethodno pribavijenog sljenja Hrvatskog olimpijskog odbora na Statut, odnosno njegove izmjene i dopune. Clanak 65. \\u201cumacenje odredbi Statuta daje SkupStina Saveza. Clanak 66. sve Clanice Saveza u Republici Hrvatskoj duzne su uskladiti svoje statute s ovim Statutom u roku do 30,dana od dana njegovog stupanja na snagu. Clanak 67. statut stupa na snagu danom usvajanja, kada prestaje vaznost Statuta Saveza usvojenog na sjednici sdrzanoj 29. ozujka 2015. godine. svi op\\u00a2i akti Saveza uskladit Ge se s ovim Statutom u roku od 10 mjeseci od njegovog usvajanja, o <emu brine Ured Saveza. eK 2 HRVATSKI JUDO SAVEZ Le Predsjednica \\\" 1 \\\\ eee r.sc. Sanda Corak, v.r. te 2 J 1 yay 8 WOME L Nek 26 REPUBLIKA HRVATSKA GRAD ZAGREB GRADSKI URED ZA OPCGU UPRAVU | IMOVINSKO PRAVNE POSLOVE Ovjerava se da je tekst Statuta u skladu sa Zakonom o udrugama temeljem rjeSenja ovog Gradskog ureda KLASA:UP/I-230-01/23-04/2486, URBROJ: 251-04-12-24-2, od 22. sije\\u00e9nja 2024. _ VODITELJICA ODJELA ZA / REGISTRACIJU UDRUGA He. Fe a\\u2014_ ___\\u2014\\u2014S\"]"