"[\"NN 141/2022 (6.12.2022.), Zakon o sportu HRVATSKI SABOR 2135 Na temelju clanka 89. Ustava Republike Hrvatske, donosim ODLUKU O PROGLASENJU ZAKONA O SPORTU Proglasavam Zakon o sportu, koji je Hrvatski sabor donio na sjednici 29. studenoga 2022. Klasa: 011-02/22-02/152 Urbroj: 71-10-01/1-22-2 Zagreb, 2. prosinca 2022. Predsjednik Republike Hrvatske Zoran Milanovi\\u00a2, v. r. ZAKON O SPORTU DIO PRVI OPCE ODREDBE Predmet Zakona Clanak 1. (1) Ovim se Zakonom ureduje sustav sporta: sportske djelatnosti, osobe u sustavu sporta, financiranje sporta, nadzor i ostala pitanja od znacaja za sport. (2) Sportske djelatnosti su djelatnosti od posebnog interesa za Republiku Hrvatsku. (3) Sport mora biti jednako dostupan svima bez obzira na dob, rasu, spol, spolnu orijentaciju, vjeru, nacionalnost, drustveni polozaj, politicko ili drugo uvjerenje. (4) Odredbe ovoga Zakona jednako se primjenjuju na sustav sporta, parasporta i sporta gluhih, osim kada je druk\\u00a2ije propisano ovim Zakonom. Rodno znacenje izraza Clanak 2. Izrazi koji se koriste u ovome Zakonu, a imaju rodno znacenje odnose se jednako na muski i zenski spol. DIO DRUGI SPORTSKE DJELATNOSTI, STRUCNI POSLOVI U SPORTU I KATEGORIZACIJA SPORTOVA Sportske djelatnosti Clanak 3. (1) Sportske djelatnosti su aktivnosti koje obavljaju fizicke i pravne osobe prema odredbama ovoga Zakona. (2) Sportske djelatnosti su: sudjelovanje u sportskom natjecanju, sportska priprema, sportska poduka, zdravstveno usmjereno tjelesno vjezbanje, organiziranje i vodenje sportskog natjecanja i posredovanje u sportu. (3) Sportske djelatnosti iz stavka 2. ovoga Clanka u smislu ovoga Zakona jesu: a) sudjelovanje u sportskom natjecanju je nastupanje sportasa pojedinaca ili sportskih ekipa na natjecanjima koje organiziraju fizicke i pravne osobe u sustavu sporta registrirane za obavljanje sportske djelatnosti organiziranja i vodenja sportskog natjecanja b) sportska priprema je provedba svih oblika trenaznih procesa sportaSa i trenera s ciljem razvoja antropoloskih karakteristika, a posebno motorickih i funkcionalnih sposobnosti te stjecanja motorickih znanja vaznih za pojedini sport ili sportsku granu c) sportska poduka je poducavanje izvodenja tehnike pojedinoga sporta s iskljucivim ciljem svladavanja tehnike bez planiranja, programiranja, provedbe i kontrole programa sportske pripreme ili sportske rekreacije d) zdravstveno usmjereno tjelesno vjezbanje je: i. planirana i programirana sportska rekreacija poput programa fitnesa, aerobike, pilatesa te programa koji mogu sadrzavati elemente jednog ili vise sportova i/ili sportskih grana s ciljem unaprjedenja psihofizickih sposobnosti i zdravlja bez sudjelovanja u sustavu sluzbenih natjecanja u sportovima prepoznatim u nomenklaturama sportova Hrvatskog olimpijskog odbora, Hrvatskog paraolimpijskog odbora i Hrvatskog sportskog saveza gluhih, koje organizira nadlezni nacionalni sportski savez i/ili njegove Cclanice ii. kineziterapijski program koji se odnosi na prevenciju i rehabilitaciju ozljeda lokomotornog sustava e) organiziranje i vodenje sportskog natjecanja su aktivnosti koje provode nacionalni sportski savezi, clanice nacionalnih sportskih saveza ili druge pravne ili fizicke osobe registrirane za obavljanje te sportske djelatnosti, a cilj im je provedba sportskih natjecanja f) posredovanje u sportu je obavljanje poslova posredovanja i zastupanja sportaSa i trenera pri zapoSljavanju, kao i poslova posredovanja i zastupanja klubova. (4) Sportskom djelatnoScu smatra se i: \\u2014 organizirana izvannastavna Skolska sportska aktivnost i akademska sportska aktivnost \\u2014 upravljanje sportskom gradevinom \\u2014 upravljacki i administrativni poslovi u pravnim osobama u sustavu sporta. (5) Osim sportskih\", \"poslova posredovanja i zastupanja sportaSa i trenera pri zapoSljavanju, kao i poslova posredovanja i zastupanja klubova. (4) Sportskom djelatnoScu smatra se i: \\u2014 organizirana izvannastavna Skolska sportska aktivnost i akademska sportska aktivnost \\u2014 upravljanje sportskom gradevinom \\u2014 upravljacki i administrativni poslovi u pravnim osobama u sustavu sporta. (5) Osim sportskih djelatnosti iz stavka 2. ovoga clanka, za ocuvanje i unaprjedenje zdravlja te prevenciju kronicnih nezaraznih bolesti, sportskom djelatnoScu u Sirem smislu smatra se i zdravstveno usmjerena tjelesna aktivnost koja podrazumijeva bilo koji oblik tjelesne aktivnosti koja ima pozitivan ucinak na zdravlje i funkcionalne sposobnosti bez nepotrebne Stete ili rizika, koja nije usmjerena na ostvarivanje rezultata nego vise individualnih ciljeva, a koja se moze provoditi u sustavu sporta i u suradnji s drugim dionicima iz sustava zdravstva te odgoja i obrazovanja. (6) Tijelo drzavne uprave nadlezno za sport u slucaju dvojbe utvrduje je li neka djelatnost sportska djelatnost. Strucni poslovi Clanak 4. (1) U obavljanju sportske pripreme, sportske poduke i zdravstveno usmjerenog tjelesnog vjezbanja fizicke osobe u sustavu sporta obavljaju strucne poslove u sportu. (2) Strucni poslovi u sportu su: planiranje i programiranje sportske pripreme; provedba sportske pripreme; kontrola sportske pripreme; vodenje sportasa na sportskom natjecanju; planiranje i programiranje sportske rekreacije; provedba sportske rekreacije; kontrola sportske rekreacije; planiranje, programiranje, provedba i kontrola kineziterapijskih postupaka; planiranje, programiranje, provedba i kontrola izvannastavnih Skolskih sportskih aktivnosti; poducavanje osnovnoj tehnici pojedinog sporta; provedba sportskodijagnostickih postupaka te interpretiranje rezultata sportskodijagnostickih postupaka. (3) Strucni poslovi iz stavka 2. ovoga clanka u smislu ovoga Zakona jesu: a) planiranje i programiranje sportske pripreme je izrada planova i programa trenaznog procesa sporta\\u00e9sa ili sportske ekipe s ciljem sudjelovanja u sustavu sluzbenih natjecanja u sportovima prepoznatim u nomenklaturi sportova i sportskih grana Hrvatskog olimpijskog odbora, Hrvatskog paraolimpijskog odbora i Hrvatskog sportskog saveza gluhih, koje organiziraju nadlezni nacionalni sportski savezi i njihove Clanice ili krovna sportska udruzenja b) provedba sportske pripreme je provedba trenaznog procesa sportaSa ili sportske ekipe na temelju plana i programa sportske pripreme c) kontrola sportske pripreme je evaluacija ucinaka provedene sportske pripreme na temelju plana i programa sportske pripreme d) vodenje sportasa koji sudjeluju na sportskom natjecanju je neposredno strucno usmjeravanje sportasa pojedinca ili ekipe na postupanje u okolnostima sportskog natjecanja s ciljem ostvarenja Sto boljeg sportskog rezultata i/ili plasmana sukladno provedenom trenaznom procesu, a prema specificnosti svakog sporta i pripadajuceg sportskog natjecanja e) planiranje i programiranje sportske rekreacije je izrada planova i programa sportskorekreativnog vjezbanja f) provedba sportske rekreacije je provedba trenaznog procesa na temelju plana i programa sportskorekreativnog vjezbanja g) kontrola sportske rekreacije je provjera ucinaka provedenog programa sportskorekreativnog vjezbanja na temelju plana i programa sportskorekreativnog vjezbanja h) planiranje, programiranje, provedba i kontrola kineziterapijskih postupaka je izrada planova i programa te provedba i kontrola programa vjezbanja koji se odnose na rehabilitaciju ozljeda i oStecenja lokomotornog sustava i) planiranje, programiranje, provedba i kontrola izvannastavnih skolskih sportskih aktivnosti je izrada planova i programa te provedba i kontrola svih oblika sportskih aktivnosti koje se provode u sklopu Skolskih sportskih drustava odnosno u sklopu izvannastavnih Skolskih sportskih aktivnosti j) poducavanje\", \"koji se odnose na rehabilitaciju ozljeda i oStecenja lokomotornog sustava i) planiranje, programiranje, provedba i kontrola izvannastavnih skolskih sportskih aktivnosti je izrada planova i programa te provedba i kontrola svih oblika sportskih aktivnosti koje se provode u sklopu Skolskih sportskih drustava odnosno u sklopu izvannastavnih Skolskih sportskih aktivnosti j) poducavanje osnovnoj tehnici pojedinog sporta je provedba sportske poduke s iskljucivim ciljem svladavanja tehnike pojedinog sporta k) provodenje sportskodijagnostickih postupaka i interpretiranje rezultata sportskodijagnostickih postupaka je provodenje postupaka dijagnosticiranja i procjene antropoloskog i sportskog statusa sportasa i drugih osoba te interpretiranje rezultata provedenih sportskodijagnostickih postupaka u dijagnosti\\u00a2kim centrima. Kategorizacija sportova Clanak 5. (1) Sportske djelatnosti mogu se provoditi u svim sportovima prema nomenklaturi koju opcim aktom utvrduje Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih. (2) Kategorizacija sportova je proces evaluacije sportova koji rezultira donoSenjem odluke o rangiranju sportova i njihovu razvrstavanju u kategorije. (3) Kategorizaciju sportova, na temelju evaluacije kljucnih pokazatelja prethodna dva olimpijska ciklusa, a sukladno kriterijima iz Clanka 6. stavka 1. ovoga Zakona provodi Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih nakon odrzanih ljetnih olimpijskih igara / paraolimpijskih igara / olimpijskih igara gluhih za sljedece Cetiri godine, a najkasnije do 1. listopada godine u kojoj su olimpijske igre / paraolimpijske igre / olimpijske igre gluhih odrzane. (4) Rezultati kategorizacije primjenjuju se na sljedeci olimpijski ciklus, odnosno od 1. sije\\u00a2nja godine nakon godine u kojoj su igre odrzane do 31. prosinca godine u kojoj se odrzavaju sljedece olimpijske igre / paraolimpijske igre / olimpijske igre gluhih. (5) Odluka o rangiranju sportova i razvrstavanju u kategorije donosi se za svaki sport uvrsten u nomenklaturu sportova pojedinog krovnog sportskog udruzenja uz podjelu na ekipne i pojedinacne, i to za sportove u nomenklaturi sportova Hrvatskog olimpijskog odbora u Cetiri kategorije, u nomenklaturi sportova Hrvatskog paraolimpijskog odbora u dvije kategorije te u nomenklaturi sportova Hrvatskog sportskog saveza gluhih bez podjele u kategorije. (6) Postupak kategorizacije provode i odluku o rangiranju sportova i razvrstavanju u kategorije donose Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih prema nomenklaturi iz stavka 1. ovoga Cclanka, uz prethodnu suglasnost celnika tijela drzavne uprave nadleznog za sport. Kriteriji kategorizacije sportova i pokazatelji uspjesnosti Clanak 6. (1) Kriteriji kategorizacije sportova su: \\u2014 zastupljenost sporta u svijetu i Europi \\u2014 masovnost u Republici Hrvatskoj \\u2014 Status sporta \\u2014 ostvareni sportski rezultat na medunarodngj razini. (2) K]jucni pokazatelji uspjeSnosti su: \\u2014 broj nacionalnih sportskih saveza na svjetskoj i europskoj razini \\u2014 broj klubova i sportaSa u pojedinom sportu u Republici Hrvatskoj \\u2014 udio sportasa do 18 godina u odnosu na ukupan broj sportasa u pojedinom sportu u Republici Hrvatskoj \\u2014 olimpijski status pojedinog sporta odnosno paraolimpijski status sporta odnosno status olimpijskog sporta gluhih i \\u2014 rezultati na medunarodnim sportskim natjecanjima. (3) Za odredivanje kljucnih pokazatelja uspjesnosti iz stavka 2. podstavaka 2. i 3. ovoga Clanka tijelo koje provodi kategorizaciju duzno je koristiti se podacima iz Nacionalnog informacijskog sustava u sportu. (4) Nacin i rokove kategorizacije sportova pravilnikom propisuje celnik tijela drzavne uprave\", \"gluhih i \\u2014 rezultati na medunarodnim sportskim natjecanjima. (3) Za odredivanje kljucnih pokazatelja uspjesnosti iz stavka 2. podstavaka 2. i 3. ovoga Clanka tijelo koje provodi kategorizaciju duzno je koristiti se podacima iz Nacionalnog informacijskog sustava u sportu. (4) Nacin i rokove kategorizacije sportova pravilnikom propisuje celnik tijela drzavne uprave nadleznog za sport. DIO TRECI OSOBE U SUSTAVU SPORTA Op\\u00e9e odredbe Clanak 7. (1) U sustavu sporta djeluje: \\u2014 fizicka osoba \\u2014 pravna osoba i \\u2014 $kolsko sportsko drustvo. (2) Fizi\\u00a2ka osoba koja djeluje u sustavu sporta je: \\u2014 sportas \\u2014 rekreativac \\u2014 osoba koja obavlja strucne poslove u sportu \\u2014 sluzbena osoba koja sudjeluje u organiziranju i vodenju sportskog natjecanja \\u2014 posrednik u sportu \\u2014 ostale osobe u sportu. (3) Pravna osoba koja djeluje u sustavu sporta je: \\u2014 sportski klub \\u2014 udruga sportske rekreacije \\u2014 sportska zajednica \\u2014 sportski savez \\u2014 krovno sportsko udruzenje \\u2014 fitnes centar i \\u2014 ostale pravne osobe registrirane za obavljanje sportskih djelatnosti. (4) Skolsko sportsko drustvo koje djeluje u sustavu sporta je drustvo bez pravne osobnosti osnovano s ciljem provodenja izvannastavnih sportskih aktivnosti ucenika, a moze sudjelovati u provodenju i izvanskolskih sportskih aktivnosti ucenika. (5) Pravne osobe iz stavka 3. ovoga clanka odnose se i na parasport i sport gluhih osoba. POGLAVLJE I. FIZICKA OSOBA KOJA DJELUJE U SUSTAVU SPORTA Odjeljak 1. ODREDBE KOJE SE ODNOSE NA SPORTASA Sportas Clanak 8. Sportas je osoba koja sudjeluje u sportskoj pripremi odnosno treningu i sluzbenom sportskom natjecanju s ciljem ostvarivanja Sto boljeg postignuca odnosno postizanja natjecateljskih rezultata u svim dobnim kategorijama i razinama sportskog natjecanja. Vrste sportasa Clanak 9. Sportas moze biti profesionalni sportas i sportas amater. Profesionalni sportas Clanak 10. (1) Profesionalni sportas je onaj sportas koji se bavi sportskim djelatnostima sudjelovanja u sportskom natjecanju i sportskoj pripremi kao osnovnim zanimanjem. (2) Profesionalni sportas moze djelatnosti iz stavka 1. ovoga clanka obavljati na temelju sklopljenog ugovora o radu odnosno na temelju sklopljenog ugovora o profesionalnom igranju ako ima registriranu samostalnu sportsku djelatnost. (3) Nacionalni sportski savez moze opcim aktom urediti da je profesionalni sporta$ i onaj sportas koji zakljuci stipendijski ugovor u netoiznosu vecem od 10.000,00 eura godisnje. (4) Samostalnu sportsku djelatnost sudjelovanja na sportskom natjecanju i sportskoj pripremi moze obavljati osoba koja je: \\u2014 profesionalni sportas kojemu je sudjelovanje u sluzbenom sportskom natjecanju osnovno zanimanje i ima ugovor o profesionalnom igranju sklopljen sa sportskim klubom \\u2014 profesionalni sportas kojemu je sudjelovanje u sluzbenom sportskom natjecanju osnovno zanimanje, a nije u ugovornom odnosu sa sportskim klubom ili \\u2014 sportas kojemu bavljenje sportskom djelatnos\\u00a2u nije osnovno zanimanje. (5) Osoba iz stavka 2. ovoga clanka mora: \\u2014 imati najmanje 16 godina \\u2014 biti upisana u Evidenciju sportasa koja je sastavni dio Nacionalnog informacijskog sustava u sportu \\u2014 dostaviti dokaz da nema zapreke za obavljanje poslova propisanih clankom 111. ovoga Zakona. (6) Osobe iz stavka 2. ovoga clanka podnose zahtjev za upis u Registar samostalne sportske djelatnosti i brisanje iz Registra samostalne sportske djelatnosti koji vodi nadlezno upravno tijelo zupanije odnosno Grada Zagreba prema prebivalistu fizicke osobe,\", \"\\u2014 dostaviti dokaz da nema zapreke za obavljanje poslova propisanih clankom 111. ovoga Zakona. (6) Osobe iz stavka 2. ovoga clanka podnose zahtjev za upis u Registar samostalne sportske djelatnosti i brisanje iz Registra samostalne sportske djelatnosti koji vodi nadlezno upravno tijelo zupanije odnosno Grada Zagreba prema prebivalistu fizicke osobe, u cijem je djelokrugu obavljanje povjerenih poslova drzavne uprave koji se odnose na sportske djelatnosti. (7) O upisu u Registar samostalne sportske djelatnosti i brisanju iz Registra samostalne sportske djelatnosti osobe iz stavka 6. ovoga Clanka donosi se rjesenje. (8) Protiv rjeSenja iz stavka 7. ovoga clanka stranka ima pravo izjaviti zalbu tijelu drzavne uprave nadleznom za sport. (9) Nacin i rokove upisa i brisanja te sadrzaj i vodenje Registra iz stavka 6. ovoga clanka pravilnikom propisuje celnik tijela drzavne uprave nadleznog za sport. Ugovorni odnos i status sportasa Clanak 11. (1) Na profesionalne sportaSe koji imaju sklopljen ugovor o radu ne primjenjuju se odredbe opceg propisa o radnim odnosima, a koje reguliraju pitanje ugovora o radu na odredeno vrijeme, prestanak ugovora o radu, otkazni rok i otpremninu, raspored radnog vremena te nacin koriStenja odmora i dopusta. (2) Druk\\u00a2iji nacin odredivanja pitanja iz stavka 1. ovoga Clanka, a na koje se ne primjenjuju odredbe opceg propisa o radnim odnosima sportas mora ugovoriti s poslodavcem. (3) Ugovor i dodatak ugovoru o radu zakljucen izmedu sportaSa i sportskog kluba evidentira se i pohranjuje u nacionalnom sportskom savezu sukladno propisima nacionalnog sportskog saveza. (4) Nije dopustena odredba akta nacionalnog sportskog saveza koja valjanost ugovora uvjetuje potvrdom nacionalnog sportskog saveza. (5) Nije dopustena odredba akta nacionalnog sportskog saveza ili sportskog kluba kojom se sportasu namece obveza prihvacanja ponude sportskog kluba na zakljucenje novog ugovora, predstavlja prijetnju suspenzijom u slucaju neprihvacanja ponude ili namece pla\\u00a2anje bilo kakve naknade osim Clanarine. (6) Svaka odredba ugovora zakljucenog izmedu sportaSa i sportskog kluba kojom se sportaSu namece obveza prihvacanja ponude sportskog kluba na zakljucenje novog ugovora ili predstavlja prijetnju suspenzijom u slucaju neprihvacanja ponude je nistetna. (7) Svaka odredba iz ugovora zakljucenog izmedu sportaSa i sportskog kluba kojom se jedna ugovorna strana stavlja u povoljniji polozaj, na nacin da iskljucivo 0 njezinoj volji ovisi produljenje ugovora ili sklapanje novoga ugovora, je nistetna. (8) Nije dopustena odredba akta nacionalnog sportskog saveza kojom se prilikom prelaska sportasa amatera koji zadrzava amaterski status iz jednog sportskog kluba u drugi trazi isplata naknade za prijelaz. (9) Odredba ugovora zakljucenog izmedu sportaSa i sportskog kluba kojom se prilikom prelaska sportasa amatera koji zadrzava amaterski status iz jednog sportskog kluba u drugi trazi isplata naknade za prijelaz je nistetna. (10) Odredbe stavaka 8. i 9. ovoga clanka ne primjenjuju se na naknadu za razvoj i usavrsavanje i druge oblike nagradivanja sportskog kluba za razvoj sportaSa koju propisuje medunarodni sportski savez ili nacionalni sportski savez, u slucaju kada sportaS stjece profesionalni status. (11) Naknada koja predstavlja nagradu za ostvareni sportski rezultat ekipe i/ili profesionalnog sportaSa na temelju redovitog obavljanja sportske djelatnosti za koji sportaS prima placu smatra se stimulativnim dijelom place. (12) U slucaju stecaja\", \"sportaSa koju propisuje medunarodni sportski savez ili nacionalni sportski savez, u slucaju kada sportaS stjece profesionalni status. (11) Naknada koja predstavlja nagradu za ostvareni sportski rezultat ekipe i/ili profesionalnog sportaSa na temelju redovitog obavljanja sportske djelatnosti za koji sportaS prima placu smatra se stimulativnim dijelom place. (12) U slucaju stecaja kluba ili u slucaju spora vezanog uz izvrSenje obveza iz ugovora sklopljenog sa sportasem koji djelatnost obavlja kao samostalnu sportsku djelatnost smatra se da je sa sportaSem sklopljen ugovor 0 radu. Sportas amater Clanak 12. (1) Sportas amater je osoba koja se bavi sportskom djelatnoScu i sudjeluje u sluzbenom sportskom natjecanju, a nije profesionalni sportas kako je to propisano clankom 10. ovoga Zakona. (2) Sportas amater i sportski klub mogu zakljuciti stipendijski ugovor koji moze trajati najduze do navrsene 24 godine starosti sportasa u netoiznosu do 24.000,00 eura godisnje. Rekreativac Clanak 13. Rekreativac je osoba koja sudjeluje u organiziranim sportskorekreativnim aktivnostima, osim sudjelovanja u sluzbenom sportskom natjecanju. Kategorizacija sportasa Clanak 14. (1) Kategorizacija sportaSa je postupak razvrstavanja sportaSa u kategorije. (2) Sportasi se razvrstavaju u sljedece kategorije: \\u2014 Sportas I. kategorije \\u2014 vrhunski sportas \\u2014 Sportas II. kategorije - vrhunski sportas \\u2014 Sportas III. kategorije - vrhunski sportas \\u2014 Sportas IV. kategorije \\u2014 vrsni sportas \\u2014 Sportas V. kategorije - daroviti sportas \\u2014 Sportas VI. kategorije - daroviti sportas. (3) Hrvatskom olimpijskom odboru, Hrvatskom paraolimpijskom odboru odnosno Hrvatskom sportskom savezu gluhih povjerava se kao javna ovlast provedba kategorizacije sportaSa i donoSenje rjeSenja o kategorizaciji sportasa. (4) Kriterij za utvrdivanje kategorije sportasa je sportski rezultat, poredak odnosno plasman, rang-lista ili norma ostvarena na nacionalnom i medunarodnom natjecanju te sudjelovanje u nacionalnoj ekipi na medunarodnom natjecanju, a koje za pojedini sport donose Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih te objavljuju na svojim mreznim stranicama. (5) Sportas se rjeSenjem razvrstava u odredenu kategoriju s prvim danom sljedeceg mjeseca nakon Sto je ostvario rezultat, poredak odnosno plasman ili normu na temelju koje stjece pravo na odredenu kategoriju odnosno nakon zakljucenja rang-liste za odredeni sport, sportsku granu odnosno sportsku disciplinu. (6) Rjesenje o kategorizaciji izdaje se na rok, i to: za vrhunske sportaSe I. kategorije \\u2014 Cetiri godine, za vrhunske sportase II. kategorije \\u2014 dvije godine, a za ostale kategorije - jednu godinu. (7) Postupak kategorizacije sportasa pokrece se na zahtjev sportaSa. (8) Ako sportas ostvari pravo na razvrstavanje po razlicitim osnovama (sportski rezultat, poredak odnosno plasman, norma, rang-lista), razvrstavanje se provodi po kriteriju koji je povoljniji za sportaSa. (9) Ako kategorizirani sportas promijeni klub, o nastaloj promjeni, na zahtjev sportasa, pravne osobe iz stavka 3. ovoga Cclanka izdaju rjesenje. (10) RjeSenje o kategorizaciji sportaSa tijelo iz stavka 3. ovoga clanka ukinut \\u00a2e po sluzbenoj duznosti ako: Jesen) 8 Ji Sp J 8 P ) \\u2014 je sportas koristio doping, a Sto je utvrdeno odlukom nadleznog tijela \\u2014 postoji pravomoc\\u00a2na osuda iz Clanka 111. stavaka 1. i 2. ovoga Zakona. (11) Kategoriziranom sportasu produljuje se pravo po osnovi kategorizacije za vrijeme trajanja bolovanja, dugotrajne ozljede, rodiljnog, roditeljskog, posvojiteljskog, skrbnickog ili\", \"Sp J 8 P ) \\u2014 je sportas koristio doping, a Sto je utvrdeno odlukom nadleznog tijela \\u2014 postoji pravomoc\\u00a2na osuda iz Clanka 111. stavaka 1. i 2. ovoga Zakona. (11) Kategoriziranom sportasu produljuje se pravo po osnovi kategorizacije za vrijeme trajanja bolovanja, dugotrajne ozljede, rodiljnog, roditeljskog, posvojiteljskog, skrbnickog ili udomiteljskog dopusta sukladno posebnom propisu te u slucaju vise sile koja je uvjetovala nemogucnost ostvarenja kriterija kategorizacije, a koja je proglasena na nacionalnoj ili medunarodnoj razini. (12) Kategorizirani sportasi upisuju se u Registar kategoriziranih sportasa koji je sastavni dio Nacionalnog informacijskog sustava u sportu. (13) Protiv rjeSenja iz stavaka 3., 9. i 10. ovoga clanka sportas ima pravo na Zalbu tijelu drzavne uprave nadleznom za sport. (14) Nacin razvrstavanja sportasa u odredenu kategoriju iz stavka 2. ovoga Clanka, sukladno kriteriju iz stavka 4. ovoga Cclanka, pravilnikom propisuje \\u00a2celnik tijela drzavne uprave nadleznog za sport na prijedlog Hrvatskog olimpijskog odbora, Hrvatskog paraolimpijskog odbora i Hrvatskog sportskog saveza gluhih. Zdravstveni pregled Clanak 15. (1) U sportskom natjecanju i sportskoj pripremi moze sudjelovati sportas za kojega je utvrdena zdravstvena sposobnost za navedeni sport i dobnu skupinu. (2) Odredba stavka 1. ovoga clanka ne odnosi se na sportaSa registriranog u klubu koji ima sjediste izvan Republike Hrvatske. (3) Zdravstvena sposobnost utvrduje se zdravstvenim pregledom za razdoblje koje ne moze biti dulje od 24 myeseca. (4) Sportas mora obaviti zdravstveni pregled najkasnije mjesec dana od dana po\\u00a2etka bavljenja sportskom pripremom. (5) Nacin obavljanja zdravstvenog pregleda, specijalnost lije\\u00a2nika koji obavljaju zdravstveni pregled, rok, vrstu i opseg pregleda sportasa za pojedini sport, ucenika i studenata koji sudjeluju u natjecanjima u sustavu Skolskog i akademskog sporta te organizaciju medicinske pomodi u sportu pravilnikom propisuje celnik tijela drzavne uprave nadleznog za zdravstvo, uz prethodnu suglasnost \\u00a2elnika tijela drzavne uprave nadleznog za sport. Borba protiv dopinga Clanak 16. (1) Sve osobe u sustavu sporta duzne su poSstivati pravila nacionalnog tijela nadleznog za borbu protiv dopinga, a osobito vezano uz provedbu testiranja. (2) Sportasi ne smiju koristiti dopinska sredstva niti metode, u skladu s pravilima Svjetske antidopinske agencije te pripadajucim medunarodnim standardima. (3) Trener, lijecnik i druge osobe ne smiju sportasu davati doping. (4) Ako se utvrdi da su sportaS ili osoba iz stavka 3. ovoga Clanka postupali protivno odredbama stavaka 2. i 3. ovoga Clanka, osoba i nacionalno tijelo nadlezno za borbu protiv dopinga koji to utvrde duzni su postupiti sukladno pravilima o antidopingu te pravilima tijela iz stavka 1. ovoga \\u00a2lanka. Odjeljak 2. FIZICKE OSOBE KOJE OBAVLJAJU STRUCNE POSLOVE U SUSTAVU SPORTA Podjela fizickih osoba koje obavijaju strucne poslove u sportu Clanak 17. Osobe koje obavljaju strucne poslove u sportu su: \\u2014 instruktor \\u2014 trener \\u2014 kineziterapeut. Instruktor Clanak 18. (1) Instruktor je osoba koja obavlja poslove provodenja sportske rekreacije i poducavanje osnovnoj tehnici pojedinog sporta, a cilj nije priprema i sudjelovanje polaznika u natjecanju. (2) Poslove instruktora moze obavljati osoba: \\u2014 sa zavrSenim odgovarajucim programom strucnog specijalistickog osposobljavanja za instruktora pojedinog sporta, sportske grane ili sportske rekreacije u trajanju od najmanje 180 Skolskih sati za koji je uvjet\", \"rekreacije i poducavanje osnovnoj tehnici pojedinog sporta, a cilj nije priprema i sudjelovanje polaznika u natjecanju. (2) Poslove instruktora moze obavljati osoba: \\u2014 sa zavrSenim odgovarajucim programom strucnog specijalistickog osposobljavanja za instruktora pojedinog sporta, sportske grane ili sportske rekreacije u trajanju od najmanje 180 Skolskih sati za koji je uvjet upisa najmanje zavrsena razina 4.1 Hrvatskog kvalifikacijskog okvira (u daljnjem tekstu: HKO) \\u2014 koja ima najmanje 18 godina \\u2014 koja nema zapreke za obavljanje posla propisane clankom 111. ovoga Zakona \\u2014 koja je s pravnom ili fizickom osobom u sportu sklopila ugovor o radu, ili drugi ugovor, ili je uredeno drugim odgovarajucim aktom. (3) Instruktor moze obavljati poslove provodenja sportske rekreacije samo s osobama starijima od 16 godina. (4) Osim osoba iz stavka 2. ovoga clanka, poslove instruktora moze obavljati osoba koja ispunjava uvjete za trenera pojedinog sporta ili sportske rekreacije. (5) Na izradu i provedbu programa iz stavka 6. ovoga Clanka i Clanka 19. ovoga Zakona, odgovarajuce se primjenjuju odredbe zakona kojim se ureduje podrucje obrazovanja odraslih, osim kada je drukcije propisano ovim Zakonom. (6) Program iz stavka 2. podstavka 1. ovoga clanka donosi ustanova za obrazovanje odraslih, a obvezni dio sadrzaja programa i strucni uvjeti za njegovo provodenje ureduju se pravilnikom koji donosi Celnik tijela drzavne uprave nadleznog za sport. Trener Clanak 19. (1) Trener je osoba koja priprema i vodi sportaSe na natjecanjima te posjeduje vazecu licenciju ako je tako propisano aktima nacionalnog sportskog saveza. (2) Prema stupnju obrazovanja i poslovima koje mogu obavljati, treneri mogu biti: \\u2014 Trener 1. razine je osoba sa zavrSenim odgovarajucim programom strucnog specijalistickog osposobljavanja za trenera pojedinog sporta ili sportske grane u trajanju od najmanje 180 sati za koji je uvjet upisa najmanje zavrsena razina 4.1 HKO-a, a moze obavljati poslove provodenja sportske pripreme sa sportasima starijima od 16 godina te vodenja sportaSa koji sudjeluju na sportskom natjecanju \\u2014 Trener 2. razine je osoba sa zavrSenim odgovarajucim programom strucnog specijalistickog usavrsavanja za trenera pojedinog sporta ili sportske grane u trajanju od najmanje 180 sati za koji je uvjet upisa najmanje zavrsena razina 4.1 HKO-a i zavrseno strucno specijalisticko osposobljavanje iz stavka 2. podstavka 1. ovoga clanka te jedna godina radnog iskustva na poslovima trenera 1. razine, a moze obavljati poslove provodenja sportske pripreme te vodenja sportaSa koji sudjeluju na sportskom natjecanju \\u2014 Trener 3. razine je osoba sa zavrSenim odgovarajucim programom strucnog specijalistickog usavrsavanja za trenera pojedinog sporta ili sportske grane u trajanju od najmanje 140 sati uskladen s programom za stjecanje licencije svjetskih ili europskih udruzenja odredenog sporta ako takav program postoji, za koji je uvjet upisa najmanje zavrsena razina 4.1 HKO-a i zavrseno strucno specijalisticko osposobljavanje iz podstavka 1. ovoga stavka i strucno specijalisticko usavrSavanje iz podstavka 2. ovoga stavka te jedna godina radnog iskustva na poslovima trenera 2. razine, a moze obavljati poslove provodenja i kontrole sportske pripreme, vodenja sportasa koji sudjeluju na sportskom natjecanju te osnove planiranja i programiranja \\u2014 Trener 4. razine je osoba sa zavrSenim preddiplomskim strucnim studijem odgovarajuceg sporta ili sa zavrsenim preddiplomskim sveucilisnim\", \"stavka te jedna godina radnog iskustva na poslovima trenera 2. razine, a moze obavljati poslove provodenja i kontrole sportske pripreme, vodenja sportasa koji sudjeluju na sportskom natjecanju te osnove planiranja i programiranja \\u2014 Trener 4. razine je osoba sa zavrSenim preddiplomskim strucnim studijem odgovarajuceg sporta ili sa zavrsenim preddiplomskim sveucilisnim studijem kineziologije s izbornim modulom/usmjerenjem ili smjerom pojedinog sporta, sportske grane, kondicijske pripreme sportaSa ili sportske rekreacije, a moze obavljati poslove planiranja i programiranja, vodenja sportasa koji sudjeluju na sportskom natjecanju te provodenja i kontrole sportske pripreme i sportske rekreacije \\u2014 Trener 5. razine je osoba sa zavrSenim diplomskim sveucilisnim studijem kineziologije koja je zavrsila izborni modul/usmjerenje ili smjer odgovarajuceg sporta, sportske grane ili sportske rekreacije odnosno zavrsenim specijalisti\\u00a2kim diplomskim strucnim studijem kineziologije odgovarajuceg sporta, kondicijske pripreme sportaSa ili sportske rekreacije, a moze obavljati poslove planiranja i programiranja, vodenja sportasa koji sudjeluju na sportskom natjecanju te provodenja i kontrole sportske pripreme i sportske rekreacije, kao i poslove provodenja sportskodijagnostickih postupaka i interpretiranje rezultata sportskodijagnostickih postupaka. (3) Trener 1. razine koji je stekao pedagoSko-psiholoske kompetencije u skladu s propisima visokog obrazovanja moze obavljati poslove iz stavka 2. podstavka 1. ovoga clanka sa svim dobnim skupinama. (4) Iznimno od stavka 2. podstavka 1. ovoga clanka, ako zbog nedostatka strucno osposobljenih trenera klub ne moze angazirati trenera vise razine ili trenera koji udovoljava uvjetu iz stavka 3. ovoga Clanka, trener 1. razine moze obavljati poslove provodenja sportske pripreme sa sportasima u svim dobnim skupinama, uz obvezu rada s mentorom koji je najmanje trener 3. razine. (5) Osoba sa zavrsenim diplomskim sveucilisnim studijem kineziologije odnosno zavrSenim specijalistickim diplomskim strucnim studijem kineziologije koja nije zavrsila izborni modul/usmjerenje ili smjer odgovarajuceg sporta, sportske grane ili sportske rekreacije, a zavrSila je program strucnog specijalistickog osposobljavanja za trenera sporta ili sportske grane u trajanju od najmanje 180 sati za koji je uvjet upisa najmanje zavrsena razina 4.1 HKO-a, moze obavljati poslove trenera 4. razine sporta, sportske grane ili sportske rekreacije za koju je zavrsila program strucnog specijalistickog osposobljavanja. (6) Sustav mentoriranja detaljnije ureduje nacionalni savez odredenog sporta op\\u00a2cim aktom. (7) Poslove trenera iz stavka 2. ovoga Clanka moze obavljati osoba koja: \\u2014 ima najmanje 18 godina \\u2014 ima zavrsen stupanj obrazovanja propisan stavcima 2., 3. i 4. ovoga clanka \\u2014 nema zapreke za obavljanje posla propisane Cclankom 111. ovoga Zakona \\u2014 jes pravnom ili fizickom osobom u sportu sklopila ugovor o radu, ili drugi ugovor, ili je uredeno drugim odgovarajucim aktom. (8) Trener je u svom radu duzan poticati sportase na sportsko i fair-play odgovorno ponaSanje, prevenirati i sprjecavati uporabe dopinga i drugih zabranjenih supstancija, prevenirati i sprjecavati svaki oblik tjelesnog, psihickog, verbalnog i svih drugih oblika nasilja ili zlostavljanja sportasa, osobito maloljetnih. (9) Obvezni dio sadrzaja programa iz ovoga Clanka i strucne uvjete za njegovo provodenje ureduje se pravilnikom iz clanka 18. stavka 6. ovoga Zakona. Licenciranje strucnih kadrova u sportu Clanak 20. (1) Osim uvjeta za obavljanje poslova, propisanih clancima 18. i 19. ovoga Zakona, ako je tako propisano opcim aktom krovnog sportskog udruzenja, nacionalnog sportskog\", \"iz ovoga Clanka i strucne uvjete za njegovo provodenje ureduje se pravilnikom iz clanka 18. stavka 6. ovoga Zakona. Licenciranje strucnih kadrova u sportu Clanak 20. (1) Osim uvjeta za obavljanje poslova, propisanih clancima 18. i 19. ovoga Zakona, ako je tako propisano opcim aktom krovnog sportskog udruzenja, nacionalnog sportskog saveza ili udruge strucnih kadrova u sportu, treneri i instruktori mogu obavljati poslove nakon sto steknu licenciju koja se, ovisno o pravilima nacionalnih sportskih saveza, moze zvati i dozvola za rad ili slicno. (2) Licenciranjem se detaljnije ureduju strucni poslovi koje osoba kojoj je izdana licencija smije obavljati, a posebno u smislu razine natjecanja i dobne kategorije sportasa. (3) Licenciranje strucnih kadrova u sportu ukljucuje izdavanje, produljivanje i oduzimanje licencije. (4) Nacionalni sportski savez ili krovno sportsko udruzenje kada nije osnovan nacionalni sportski savez moze, uz prethodnu suglasnost tijela drzavne uprave nadleznog za sport, donijeti opci akt o licenciranju strucnih kadrova u sportu za pojedini sport, sportsku granu ili sportsku rekreaciju kojim se ureduje nacin licenciranja. (5) Licenciranje provodi nacionalni sportski savez ili krovno sportsko udruzenje ili druga pravna osoba odredena opcim aktom o licenciranju iz stavka 4. ovoga clanka. (6) Op\\u00a2i akt iz stavka 4. ovoga clanka obvezno ureduje nacin licenciranja, a kao uvjet za produljivanje licencije obvezno je propisati sudjelovanje na strucnim usavrsavanjima (seminarima, predavanjima i sli\\u00a2no) koje organiziraju ili odobravaju donositelji tog opceg akta u najmanjem trajanju od 20 sati tijekom tri godine. (7) Trener iz Clanka 19. stavka 2. podstavka 4. i 5. ovoga Zakona, sa zavrSenim sveucilisnim preddiplomskim ili diplomskim studijem kineziologije koji nema izborni modul/usmjerenje ili smjer iz pojedinog sporta, sportske grane ili sportske rekreacije, moze ostvariti pravo na nizu razinu licencije od razine propisane za osobe s izbornim modulom/usmjerenjem ili smjerom iz pojedinog sporta, sportske grane ili sportske rekreacije ako je tako propisano opcim aktom iz stavka 4. ovoga clanka. (8) Opcim aktom iz stavka 4. ovoga clanka moze se urediti izdavanje privremene licencije vrhunskim sportasima uz obvezu rada s mentorom, a najdulje na 18 mjeseci. Kineziterapeut Clanak 21. (1) Kineziterapeut je osoba koja obavlja poslove planiranja, programiranja, provedbe i kontrole kineziterapijskih postupaka, kao i poslove provodenja i interpretiranja dijagnostickih postupaka u kineziterapiji. (2) Poslove kineziterapeuta moze obavljati osoba koja ispunjava sljedece uvjete: \\u2014 zavrsen preddiplomski struc\\u00a2ni (stru\\u00a2ni prvostupnik kineziterapije) ili zavrsen preddiplomski sveucilisni studij kineziologije (uz izborni modul/usmjerenje ili smjer kineziterapije) \\u2014 zavrsen specijalisticki diplomski strucni ili diplomski sveucilisni studij kineziologije sa zavrSenim izbornim modulom/usmjerenjem ili smjerom iz kineziterapije. Sportovi koji ne prepoznaju strucne poslove trenera i instruktora Clanak 22. (1) Odredbe ovoga Zakona koje se odnose na strucne poslove i strucne kadrove u sportu ne primjenjuju se na specificne sportove koji na medunarodnoj razini ne prepoznaju strucne poslove trenera i instruktora. (2) Odluku o popisu sportova iz stavka 1. ovoga Clanka koji se izuzimaju od odredbi 0 stru\\u00a2nim kadrovima propisanim ovim Zakonom donosi tijelo drzavne uprave nadleZno za sport. Samostalna sportska djelatnost strucnih kadrova u sportu Clanak 23. (1) Osobe koje ispunjavaju uvjete za obavljanje strucnih poslova u sportu mogu obavljajuci\", \"(2) Odluku o popisu sportova iz stavka 1. ovoga Clanka koji se izuzimaju od odredbi 0 stru\\u00a2nim kadrovima propisanim ovim Zakonom donosi tijelo drzavne uprave nadleZno za sport. Samostalna sportska djelatnost strucnih kadrova u sportu Clanak 23. (1) Osobe koje ispunjavaju uvjete za obavljanje strucnih poslova u sportu mogu obavljajuci samostalnu sportsku djelatnost, obavljati sportsku pripremu, zdravstveno usmjereno tjelesno vjezbanje i sportsku poduku pod uvjetom da ispunjavaju potrebne uvjete za obavljanje strucnih poslova u sportu propisane ovim Zakonom. (2) Osoba iz stavka 1. ovoga clanka mora imati: \\u2014 dokaz da ispunjava potrebne uvjete za obavljanje strucnih poslova u sportu propisane ovim Zakonom \\u2014 dokaz da nema zapreka za obavljanje posla propisanih clankom 111. ovoga Zakona. (3) Osobe iz stavka 1. ovoga clanka podnose zahtjev za upis u Registar samostalne sportske djelatnosti i brisanje iz Registra samostalne sportske djelatnosti koji vodi nadlezno upravno tijelo zupanije odnosno Grada Zagreba prema prebivalistu fizicke osobe u Ccijem je djelokrugu obavljanje povjerenih poslova drzavne uprave koji se odnose na sportske djelatnosti. (4) O upisu u Registar samostalne sportske djelatnosti i brisanju osobe iz Registra samostalne sportske djelatnosti iz stavka 3. ovoga Clanka donosi se rjeSenje. (5) Protiv rjeSenja iz stavka 4. ovoga clanka osoba ima pravo izjaviti zalbu tijelu drzavne uprave nadleznom Za sport. (6) Nacin i rokovi upisa i brisanja te sadrzaj i vodenje Registra iz stavka 3. ovoga Clanka propisani su pravilnikom iz clanka 10. stavka 9. ovoga Zakona. Obavijanje sportske djelatnosti u obrtu Clanak 24. (1) Sve sportske djelatnosti, osim sudjelovanja u sportskom natjecanju, mogu se obavljati u obrtu. (2) Na osnivanje, djelovanje, prestanak i druga pitanja vazna za obavljanje obrta iz stavka 1. ovoga clanka primjenjuje se poseban zakon kojim se ureduje poslovanje obrta, osim kada je druk\\u00a2cije propisano ovim Zakonom. Odjeljak 3. SLUZBENA OSOBA KOJA SUDJELUJE U ORGANIZIRANJU I VODENJU SPORTSKOG NATJECANJA Sluzbena osoba Clanak 25. (1) Sluzbena osoba koja sudjeluje u organiziranju i vodenju sportskog natjecanja je osoba koja obavlja poslove i ispunjava uvjete koje propisuje nacionalni sportski savez. (2) Sluzbene osobe koje sudjeluju u organiziranju i vodenju sportskog natjecanja su sportski sudac, sportski delegat, sportski povjerenik ili druge osobe utvrdene op\\u00a2cim aktom nacionalnog sportskog saveza. (3) Osobe iz stavka 1. ovoga clanka mogu obavljati poslove sudjelovanja u organiziranju i vodenju sportskog natjecanja propisane opcim aktom nacionalnog sportskog saveza. Odjeljak 4. POSREDNIK U SPORTU Posrednik Clanak 26. (1) Posrednik u sportu je osoba koja je prema pravilima nacionalnog sportskog saveza ovlastena obavljati poslove posredovanja i zastupanja prelaska sportaSa ili trenera iz jednog sportskog kluba u drugi sportski klub ili poslove posredovanja i zastupanja izmedu sportskih klubova. (2) Uvjeti i nacin posredovanja u sportu utvrduju se opcim aktom nacionalnog sportskog saveza. (3) Prilikom posredovanja u zapoSsljavanju profesionalnih sportasa i trenera posrednik u sportu ima pravo naplatiti naknadu od osoba za koje je poduzimao poslove posredovanja. Odjeljak 5. OSTALE OSOBE U SPORTU Sportski asistent \\u2014 vodic i komunikacijski posrednik u sportu gluhih Clanak 27. (1) Sportski asistent - vodic je osoba koja pomaze parasportasu i osobi s intelektualnim oStecenjima koja sudjeluje\", \"posrednik u sportu ima pravo naplatiti naknadu od osoba za koje je poduzimao poslove posredovanja. Odjeljak 5. OSTALE OSOBE U SPORTU Sportski asistent \\u2014 vodic i komunikacijski posrednik u sportu gluhih Clanak 27. (1) Sportski asistent - vodic je osoba koja pomaze parasportasu i osobi s intelektualnim oStecenjima koja sudjeluje u natjecanjima koje organizira Specijalna olimpijada Hrvatske u izvodenju sportske aktivnosti u sportovima i sportskim disciplinama u kojima je pomo\\u00a2 sportasu definirana tehnickim pravilima pojedinog sporta. (2) Komunikacijski posrednik u sportu je osoba koja ima odgovarajuce vjestine, znanja i sposobnosti u koristenju hrvatskog znakovnog jezika odnosno koristenju ostalih sustava komunikacije gluhih te pomaze gluhom sportasu u izvodenju sportske aktivnosti na nacin da prevodi i tumaci govor na znakovni jezik te obratno, a sukladno tehnickim pravilima pojedinog sporta. (3) Uvjet za obavljanje poslova sportskog asistenta opcim aktom utvrduje Hrvatski paraolimpijski odbor za parasportase ili Specijalna olimpijada Hrvatske za osobe s intelektualnim oStecenjima. (4) Uvjet za obavljanje poslova komunikacijskog posrednika u sportu opcim aktom utvrduje Hrvatski sportski savez gluhih. Sportski klasifikator Clanak 28. Sportski klasifikator je osoba koja obavlja klasifikacijske preglede i razvrstava parasportaSe u sportske klasifikacijske kategorije, a ispunjava uvjete koje propisuje Hrvatski paraolimpijski odbor. Ostalo Clanak 29. (1) Nacionalni sportski savez moze svojim aktom propisati obvezu Clana upravljackog tijela klubova i saveza, predstavnika kluba na utakmicama, tehnickog tajnika, zdravstvenog djelatnika aktivnog u sportu i drugih na disciplinsku odgovornost, registraciju, licenciranje i sli\\u00a2no. (2) Osobe koje djeluju u sustavu sporta duzne su poduzimati mjere zaStite djece u sportu te o svakom krSenju prava djece, posebice svim oblicima nasilja nad djecom, spolne zloporabe, zanemarivanja ili nehajnog postupanja, zlostavijanja ili izrabljivanja djece u sportu obavijestiti policiju, nadlezno tijelo za socijalnu skrb odnosno druga nadlezna tijela. (3) Sportsku djelatnost sportske pripreme, sportske poduke i zdravstveno usmjerenog tjelesnog vjezbanja moze obavljati samo fizicka osoba upisana u Registar strucnih kadrova. POGLAVLJE IL. PRAVNA OSOBA KOJA DJELUJE U SUSTAVU SPORTA Odjeljak 1. SPORTSKI KLUB Djelatnost i osnivanje sportskog kluba Clanak 30. (1) Sportski klub je pravna osoba registrirana za obavljanje sportske djelatnosti sportske pripreme i sudjelovanja u sportskom natjecanju pojedinog sporta iz nomenklature sportova. (2) Sportski klub mozZe biti osnovan kao udruga ili sportsko dioni\\u00a2ko druStvo. (3) Sportski klub mozZe, osim djelatnosti iz stavka 1. ovoga Clanka, obavljati i druge sportske djelatnosti u skladu s ovim Zakonom, kao i druge djelatnosti u skladu sa statutom udruge ili drustvenim ugovorom odnosno izjavom oO osnivanju drustva. (4) Sportski klub u nazivu sadrzi rijeci: \\u00bbsportski klub\\u00ab ili ispred rijeci: \\u00bbklub\\u00ab naziv sporta u kojem obavlja djelatnost. (5) Sportski klub obavljanje pojedinih ili svih poslova, osim sudjelovanja u sportskim natjecanjima, moze povjeriti trgovackom drustvu u odnosu na koje se smatra vladajucim, odnosno na koje ima prevladavajuci utjecaj, u smislu odredbi 0 povezanim drustvima sukladno posebnom propisu kojim se ureduju trgovacka drustva. Tvrtka sportskog dionickog drustva Clanak 31. Tvrtka sportskog dionickog drustva sadrzi rijeci: \\u00bbsportsko dionicko drustvo\\u00ab, a skracena tvrtka naznaku: \\u00bb$.d.d.\\u00ab. Izuzece od odredbi o obveznoj ponudi za preuzimanje Clanak 32. Na pravne osobe u sustavu sporta osnovane kao sportsko dionicko\", \"povezanim drustvima sukladno posebnom propisu kojim se ureduju trgovacka drustva. Tvrtka sportskog dionickog drustva Clanak 31. Tvrtka sportskog dionickog drustva sadrzi rijeci: \\u00bbsportsko dionicko drustvo\\u00ab, a skracena tvrtka naznaku: \\u00bb$.d.d.\\u00ab. Izuzece od odredbi o obveznoj ponudi za preuzimanje Clanak 32. Na pravne osobe u sustavu sporta osnovane kao sportsko dionicko druStvo ne primjenjuju se odredbe propisa 0 preuzimanju dionickih drustava 0 obveznoj ponudi za preuzimanje. Odjeljak 2. UDRUGA SPORTSKE REKREACITJE I SAVEZ SPORTSKE REKREACIJE Djelatnosti i osnivanje udruge i saveza sportske rekreacije Clanak 33. (1) Udruga sportske rekreacije je udruga registrirana za sportsku djelatnost sportske rekreacije, a moze biti registrirana i za druge sportske djelatnosti, osim sudjelovanja u sportskom natjecanju te organizacije i vodenja sportskog natjecanja. (2) Najmanje tri udruge za sportsku rekreaciju u jedinici lokalne i podrucne (regionalne) samouprave mogu osnovati savez sportske rekreacije. (3) Clanovi saveza sportske rekreacije mogu biti i druge pravne i fizi\\u00a2ke osobe koje se bave sportskom rekreacijom ili je njihova djelatnost vezana uz sportsku rekreaciju. (4) Hrvatski savez sportske rekreacije osniva se kao nacionalni sportski savez u koji se udruzuju savezi sportske rekreacije jedinica lokalne i podrucne (regionalne) samouprave. (5) Na razini jedinice lokalne i podrucne (regionalne) samouprave moze se osnovati samo jedan savez sportske rekreacije. Odjeljak 3. SPORTSKA ZAJEDNICA Clanovi i zadace sportske zajednice Clanak 34. (1) Sportska zajednica je udruga koja se osniva radi ostvarivanja zajednickih interesa u sportu, na podrucju jedinice lokalne i podrucne (regionalne) samouprave. (2) Na razini jedinice lokalne i podrucne (regionalne) samouprave moze se osnovati samo jedna sportska zajednica. (3) Clanovi sportske zajednice u jedinici lokalne i podru\\u00e9ne (regionalne) samouprave su pravne osobe iz sustava sporta sa sjedistem na podrucju jedinice lokalne i podrucne (regionalne) samouprave. (4) Clanovi sportske zajednice mogu biti i druge pravne osobe \\u00a2ija je djelatnost zna\\u00a2ajna za sport i u vezi sa sportom. (5) Zadace sportske zajednice su: \\u2014 uskladivanje aktivnosti clanova \\u2014 poticanje i promicanje sporta u skladu s aktima strateSkog planiranja iz clanka 104. ovoga Zakona i drugim strateSkim dokumentima donesenim na lokalnoj i podruc\\u00a2noj (regionalnoj) razini, a osobito sporta djece, mladezi i studenata, osoba s invaliditetom te zdravstveno usmjerenog tjelesnog vjezbanja i zdravstveno usmjerene tjelesne aktivnosti \\u2014 objedinjavanje i uskladivanje sportskih programa \\u2014 predlaganje programa javnih potreba u sportu jedinica lokalne i podrucne (regionalne) samouprave i njihovo provodenje \\u2014 skrb o kategoriziranim sportasima \\u2014 utvrdivanje nacina ostvarivanja prava sportasa \\u2014 sudjelovanje u stvaranju uvjeta za pripremu sportaSa za olimpijske igre, paraolimpijske igre, olimpijske igre gluhih, svjetska i europska prvenstva te druga velika medunarodna natjecanja \\u2014 suradnja u ostvarivanju programa Hrvatskog olimpijskog odbora, Hrvatskog paraolimpijskog odbora i Hrvatskog sportskog saveza gluhih \\u2014 promicanje strucnog rada u sportu \\u2014 edukacija, informiranje i savjetovanje sportasa, sportskih djelatnika, gradana i ostalih sudionika u sportu o pitanjima bitnim za bavljenje sportskim aktivnostima i djelatnostima \\u2014 edukacija sportaSa 0 antidopingu \\u2014 sprjecavanje negativnih pojava u sportu \\u2014 skrb 0 javnim sportskim gradevinama koje su joj povjerene na upravljanje \\u2014 ostali poslovi propisani opcim aktima. Odjeljak 4. SPORTSKI SAVEZ Zadace i razine sportskih saveza Clanak 35. (1) Sportski\", \"pitanjima bitnim za bavljenje sportskim aktivnostima i djelatnostima \\u2014 edukacija sportaSa 0 antidopingu \\u2014 sprjecavanje negativnih pojava u sportu \\u2014 skrb 0 javnim sportskim gradevinama koje su joj povjerene na upravljanje \\u2014 ostali poslovi propisani opcim aktima. Odjeljak 4. SPORTSKI SAVEZ Zadace i razine sportskih saveza Clanak 35. (1) Sportski savez je udruga u koju se udruzuju najmanje tri sportska kluba koja obavljaju sportske djelatnosti u istom sportu, a koja radi ostvarivanja zajednickih interesa u tom sportu osobito: uskladuje aktivnosti svojih Clanica, ureduje sustav natjecanja, organizira i provodi natjecanja, ureduje pitanja koja se odnose na registraciju sportasa i njihov status te disciplinsku odgovornost sportasa, skrbi o kategoriziranim sportasima te promice strucni rad u sportu. (2) Na nacionalnoj razini, na razini jedinice podrucne (regionalne) samouprave i na razini jedinice lokalne samouprave moze se osnovati jedan sportski savez za isti sport. (3) U slucaju dvojbe tijelo drzavne uprave nadlezno za sport, uz prethodno misljenje Hrvatskog olimpijskog odbora, Hrvatskog paraolimpijskog odbora ili Hrvatskog sportskog saveza gluhih, utvrduje Sto se smatra istim sportom. (4) Odluku o organiziranju sportskih natjecanja za podrucje jedne ili vise jedinica lokalne i podrucne (regionalne) samouprave, u skladu s opcim aktom nacionalnog sportskog saveza tog sporta kojim su utvrdeni sustav, uvjeti i organizacija sportskih natjecanja u tom sportu, donose sportski savezi osnovani na tim podru\\u00a2jima. Gradski i Zupanijski sportski savez Clanak 36. Clanovi gradskog i zupanijskog sportskog saveza i sportskog saveza Grada Zagreba mogu biti pravne osobe koje obavljaju sportsku djelatnost u podrucju za koje se osniva gradski i zupanijski sportski savez, a sjediSte im je na podrucju grada ili zupanije. NacionalIni sportski savez i njegove zadace Clanak 37. (1) Nacionalni sportski savez je udruga koja se osniva ako na podrucju Republike Hrvatske djeluju najmanje tri sportska kluba odnosno najmanje dva sportska saveza osnovana u istome sportu. (2) Clanovi nacionalnog sportskog saveza mogu biti sportski savezi Zupanija, Grada Zagreba i gradova te sportski klubovi istoga sporta u Republici Hrvatskoj, Sto opcim aktom propisuje nacionalni sportski savez. (3) Clanovi nacionalnih sportskih saveza mogu biti i strukovne sportske udruge u istome sportu, udruge sportskih klubova istog sporta i ranga natjecanja te udruge u koje se udruzuju sportasi i treneri istoga sporta. (4) Zadace nacionalnog sportskog saveza su: \\u2014 poticanje i promicanje sporta u skladu s aktima strateskog planiranja iz clanka 104. ovoga Zakona \\u2014 utvrdivanje sustava, uvjeta i organizacije sportskih natjecanja u pojedinom sportu u skladu s na\\u00a2elima i elementima sustava koje je opcim aktom utvrdio Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih prema pravilima sporta i normama medunarodnih sportskih udruzenja \\u2014 organiziranje i vodenje sportskih natjecanja \\u2014 donoSenje odluke o organiziranju sustava sportskih natjecanja za podrucje vise drzava ili vise inozemnih regija \\u2014 donoSenje odluke o sudjelovanju sportskih klubova i sportasa iz Republike Hrvatske u viSedrzavnim ili inozemnim regionalnim sustavima natjecanja \\u2014 donoSenje odluke o organizaciji i organiziranje sportskih natjecanja za podrucje drzave, u skladu s aktom iz podstavka 2. ovoga stavka \\u2014 promicanje strucnog rada u sportu i skrb 0 osposobljavanju i usavrsavanju strucnih djelatnika u\", \"sportskih klubova i sportasa iz Republike Hrvatske u viSedrzavnim ili inozemnim regionalnim sustavima natjecanja \\u2014 donoSenje odluke o organizaciji i organiziranje sportskih natjecanja za podrucje drzave, u skladu s aktom iz podstavka 2. ovoga stavka \\u2014 promicanje strucnog rada u sportu i skrb 0 osposobljavanju i usavrsavanju strucnih djelatnika u sportu \\u2014 strucno usavrsavanje i licenciranje strucnih kadrova \\u2014 vodenje strucnih i administrativnih poslova vezano uz osobe koje obavljaju strucne poslove u sportu \\u2014 sudjelovanje u borbi protiv dopinga \\u2014 edukacija sportaSa vezana uz teme antidopinga, koja se organizira u suradnji s nacionalnim tijelom nadleznim za borbu protiv dopinga \\u2014 skrb 0 zdravstvenoj zastiti sportasa \\u2014 skrb o nacionalnoj sportskoj ekipi \\u2014 suradnja s odgovarajucim krovnim medunarodnim udruzenjima \\u2014 briga za odrzivi razvoj sporta \\u2014 skrb 0 sportskorekreativnim aktivnostima \\u2014 sudjelovanje u prikupljanju i azuriranju informacija za Nacionalni informacijski sustav u sportu \\u2014 na trazenje tijela drzavne uprave nadleznog za sport daje prethodno misljenje o postojanju interesa za prijam u hrvatsko drzavljanstvo fizicke osobe u sustavu sporta koja je strani drzavljanin i \\u2014 druge zadace odredene opcim aktima nacionalnog sportskog saveza. (5) Nacionalni sportski savez, kao javnu ovlast, opcim aktom ureduje: \\u2014 sustav natjecanja u sportu za koji je osnovan, i to najmanje jednu godinu prije pocetka primjene tog sustava \\u2014 materijalne, tehnicke i strucne uvjete za uclanjenje sportskih klubova u svoje clanstvo u odgovarajucem sportu \\u2014 nacin licenciranja strucnih kadrova sukladno ovome Zakonu \\u2014 nacin registracije sportaSa \\u2014 prava i obveze sportaSa i sportskih klubova Clanova saveza \\u2014 pravo nastupa stranih sportasa za sportske klubove u Republici Hrvatskoj \\u2014 disciplinsku odgovornost osoba u sustavu sporta \\u2014 prava i obveze sportskih sudaca i zdravstvenih djelatnika, ako ova pitanja ne ureduju strukovne udruge navedenih osoba \\u2014 druga pitanja iz svoje nadleznosti sukladno ovome Zakonu te pravilima svjetskog i europskog saveza pripadajuceg sporta. (6) Op\\u00a2i akt iz stavka 5. ovoga clanka nacionalni sportski savez duzan je javno objaviti. (7) Nacionalni sportski savez moze vodenje i organiziranje sportskih natjecanja povjeriti svojoj Clanici ili drugoj pravnoj osobi registriranoj za obavljanje sportske djelatnosti, sto utvrduje opcim aktom kojim se ureduje sustav natjecanja. Odjeljak 5. FITNES CENTAR Obaviljanje djelatnosti fitnes centra i njegov sastav Clanak 38. Fitnes centar je pravna ili fizicka osoba u sportu koja svoju djelatnost obavlja kao trgovacko drustvo, ustanova, udruga ili obrt koja sportsku djelatnost obavlja u uredenom prostoru za vjezbanje, u okviru kojega se nalazi: \\u2014 teretana koja se sastoji od prostora za vjezbanje sa slobodnim utezima, prijenosnom i/ili fiksnom opremom i/ili trenazerima za kardiovaskularni trening i/ili \\u2014 fitnes studio koji se sastoji od prostora u kojem se provode individualni i/ili grupni fitnes treninzi. Odjeljak 6. OSTALE PRAVNE OSOBE REGISTRIRANE ZA OBAVLJANJE SPORTSKIH DJELATNOSTI Specijalna olimpijada Hrvatske Clanak 39. Specijalna olimpijada Hrvatske je nacionalni sportski savez koji se bavi provodenjem specificnih sportskorekreativnih aktivnosti osoba s intelektualnim oStecenjima prema na\\u00a2elima i pravilima medunarodne organizacije Specijalne olimpijade i propisa Republike Hrvatske koji ureduju pitanje sporta osoba s intelektualnim ostecenjima. Akademska sportska udruga i akademski sportski savez Clanak 40. (1) Akademska sportska udruga je\", \"Hrvatske je nacionalni sportski savez koji se bavi provodenjem specificnih sportskorekreativnih aktivnosti osoba s intelektualnim oStecenjima prema na\\u00a2elima i pravilima medunarodne organizacije Specijalne olimpijade i propisa Republike Hrvatske koji ureduju pitanje sporta osoba s intelektualnim ostecenjima. Akademska sportska udruga i akademski sportski savez Clanak 40. (1) Akademska sportska udruga je udruga osnovana s ciljem provodenja izvannastavnih sportskih aktivnosti studenata. (2) Radi uskladivanja aktivnosti akademskih sportskih udruga i provodenja sportskih natjecanja, akademske sportske udruge udruzuju se u akademski sportski savez visokog uCciliSta. (3) Na razini jednog visokog ucilista moze se osnovati samo jedan akademski sportski savez. (4) Programi akademskog sportskog saveza visokog ucilista financiraju se iz sredstava proracuna visokog ucilista, studenskog zbora visokog ucilista, Hrvatskog akademskog sportskog saveza te proracuna jedinice lokalne i podrucne (regionalne) samouprave. (5) Akademska sportska udruga za rad i aktivnosti koristi prostore visokog uCcilista i ima prioritet za njihovo koristenje u odnosu na vanjske korisnike prostora visokog ucilista. Strukovna sportska udruga Clanak 41. Strukovna sportska udruga je udruga u koju se uclanjuju osobe iste struke iz podrucja pojedinog sporta, sportske grane ili sportske rekreacije. Odjeljak 7. OSTALE ODREDBE KOJE SE ODNOSE NA PRAVNE OSOBE U SUSTAVU SPORTA Nacin obavijanja sportskih djelatnosti Clanak 42. (1) Sve pravne osobe u sustavu sporta mogu obaviljati sve sportske djelatnosti u skladu s ovim Zakonom i propisima koji ureduju trgovacka druStva, udruge i ustanove, osim sudjelovanja u sportskom natjecanju te organiziranja i vodenja sportskog natjecanja koje mogu obavljati samo udruge i trgovacka drustva. (2) Pravna osoba ne smije za obavljanje strucnih poslova u sportu angazirati osobe koje ne udovoljavaju odredbama ovoga Zakona. (3) Pravna osoba ne moze zapoceti s obavljanjem sportske djelatnosti prije upisa u Evidenciju pravnih osoba u sportu koja je sastavni dio Nacionalnog informacijskog sustava u sportu. Primjena posebnih propisa na pravne osobe u sustavu sporta Clanak 43. (1) Na osnivanje, pravni polozaj, registraciju, prestanak postojanja, ustrojstvo i nacin poslovanja te ustroj i nadleznost tijela upravljanja pravne osobe u sustavu sporta osnovane kao udruga, primjenjuju se odredbe zakona kojim se ureduje djelovanje udruga ako ovim Zakonom nije drukcije propisano. (2) Na osnivanje, pravni polozaj, registraciju, prestanak postojanja, ustrojstvo i nacin poslovanja te ustroj i nadleznost tijela upravljanja pravne osobe u sustavu sporta osnovane kao ustanova, primjenjuju se odredbe zakona kojim se ureduje djelovanje ustanova ako ovim Zakonom nije drukcije propisano. (3) Na osnivanje, pravni polozaj, registraciju, prestanak postojanja, ustrojstvo i nacin poslovanja te ustroj i nadleznost tijela upravljanja pravne osobe u sustavu sporta osnovane kao trgovacko drustvo, primjenjuju se odredbe zakona kojim se ureduje djelovanje trgovackih drustava ako ovim Zakonom nije drukcije propisano. POGLAVUJJE III. SKOLSKO SPORTSKO DRUSTVO I SKOLSKI SPORTSKI SAVEZ Svrha i zadac\\u00e9e skolskog sportskog drustva i skolskog sportskog saveza Clanak 44. (1) Skolsko sportsko drustvo je drustvo bez pravne osobnosti osnovano s ciljem provodenja izvannastavnih i sudjelovanja u provodenju izvanskolskih sportskih aktivnosti ucenika, a osniva ga Skolska ustanova i njezin je sastavni dio. (2) Radi uskladivanja aktivnosti Skolskih sportskih drustava i provodenja sportskih natjecanja, Skolska sportska drustva udruzuju se u gradske i Zupanijske saveze te u Skolski\", \"bez pravne osobnosti osnovano s ciljem provodenja izvannastavnih i sudjelovanja u provodenju izvanskolskih sportskih aktivnosti ucenika, a osniva ga Skolska ustanova i njezin je sastavni dio. (2) Radi uskladivanja aktivnosti Skolskih sportskih drustava i provodenja sportskih natjecanja, Skolska sportska drustva udruzuju se u gradske i Zupanijske saveze te u Skolski sportski savez Grada Zagreba. (3) Zadace Skolskog sportskog saveza su: \\u2014 organizacija i provodenje skolskih sportskih natjecanja, izvannastavnih i izvanskolskih sportskih aktivnosti ucenika \\u2014 planiranje i programiranje razvitka izvannastavnih i izvanskolskih sportskih aktivnosti ucenika \\u2014 valoriziranje programa potreba i interesa Skolskih sportskih drustava u izvannastavnim i izvanskolskim sportskim aktivnostima ucenika i predlaganje njegova financiranja nadleznim gradskim i drzavnim tijelima \\u2014 poticanje ukljucivanja sto veceg broja ucenika u Skolske sportske aktivnosti, a posebno ucenika s teSkocama u razvoju \\u2014 pruzanje organizacijske, strucne i druge pomoci Skolskim sportskim druStvima. (4) U jedinici lokalne i podrucne (regionalne) samouprave moze se osnovati samo jedan Sskolski sportski SaveZ. (5) Sredstva za rad i aktivnosti Skolskog sportskog saveza osiguravaju se u proracunu jedinice lokalne i podrucne (regionalne) samouprave te drzavnom proracunu Republike Hrvatske kroz programe Hrvatskog Skolskog sportskog saveza. (6) Skolsko sportsko dru&tvo za rad i aktivnosti koristi prostor skole i ima prioritet za njihovo koristenje u odnosu na vanjske korisnike prostora skole. DIO CETVRTI KROVNA SPORTSKA UDRUZENJA POGLAVLJE I. HRVATSKI OLIMPIJSKI ODBOR I NJEGOVE ZADACE Arvatski olimpijski odbor Clanak 45. (1) Hrvatski olimpijski odbor je krovno sportsko udruzenje u Republici Hrvatskoj u koje se udruzuju nacionalni sportski savezi, sportske zajednice u jedinici podrucne (regionalne) samouprave te druge pravne osobe cija je djelatnost od znacaja za promicanje sporta, sukladno statutu Hrvatskog olimpijskog odbora, a prema nacelima olimpijskog pokreta i Olimpijske povelje. (2) Hrvatski olimpijski odbor svojim op\\u00a2cim aktima odreduje ustrojstvo i na\\u00a2cin rada, Clanstvo i nacin ostvarivanja prava i obveza Clanova, nacin uporabe i zastite simbola i obiljezja Medunarodnog olimpijskog odbora i Hrvatskog olimpijskog odbora te druga pitanja u vezi s djelokrugom i zadacama Hrvatskog olimpijskog odbora iz Clanka 46. ovoga Zakona. Zadace Hrvatskog olimpijskog odbora Clanak 46. Zadace Hrvatskog olimpijskog odbora su: \\u2014 poticanje i promicanje sporta i olimpizma u Republici Hrvatskoj \\u2014 sudjelovanje u predlaganju i ostvarivanju mjera za unaprjedenje i razvoj sporta \\u2014 sudjelovanje u predlaganju i provodenju akata strateSkog planiranja iz Cclanka 104. ovoga Zakona i dijela programa javnih potreba u sportu na drzavnoj razini \\u2014 utvrdivanje nomenklature sportova s podjelom na ekipne i pojedinacne sportove \\u2014 uskladivanje i kontrola aktivnosti nacionalnih sportskih saveza \\u2014 suradnja u provedbi aktivnosti u podrucju razvoja sporta s lokalnim i regionalnim sportskim zajednicama \\u2014 skrb o promicanju vrhunskih sportskih dostignuca hrvatskih sportaSa i njihovu sudjelovanju u nacionalnim sportskim ekipama na olimpijskim igrama, svjetskim i europskim prvenstvima te drugim velikim medunarodnim sportskim natjecanjima \\u2014 sudjelovanje u provedbi aktivnosti, pripadajucih pravila i postupaka za borbu protiv dopinga u sportu \\u2014 provedba strucnog nadzora nad radom trenera koji su financirani kroz program javnih potreba u sportu drzavne razine \\u2014 promicanje strucnog rada u sportu i skrbi 0 osposobljavanju i usavrSavanju strucnih djelatnika u sportu \\u2014 koordiniranje svojih Cclanica pri\", \"aktivnosti, pripadajucih pravila i postupaka za borbu protiv dopinga u sportu \\u2014 provedba strucnog nadzora nad radom trenera koji su financirani kroz program javnih potreba u sportu drzavne razine \\u2014 promicanje strucnog rada u sportu i skrbi 0 osposobljavanju i usavrSavanju strucnih djelatnika u sportu \\u2014 koordiniranje svojih Cclanica pri izradi protokola za postupanje u slucaju nasilja medu djecom u sportskim klubovima \\u2014 kontrola i izvjestavanje tijela drzavne uprave nadleznog za sport o ucinku svih programa, a posebno razvojnih programa za sportase i programa za trenere koji su financirani kroz program javnih potreba u sportu drzavne razine \\u2014 dostavljanje podataka u Nacionalni informacijski sustav u sportu \\u2014 kategorizacija sportova \\u2014 kategorizacija sportaSa \\u2014 sudjelovanje u provedbi zdravstvene skrbi u sportu \\u2014 davanje suglasnosti na statute svojih Clanica koji moraju biti u skladu sa Statutom Hrvatskog olimpijskog odbora i ovim Zakonom \\u2014u slucaju pokretanja stecajnog postupka nad nacionalnim sportskim savezom, odlukom preuzimanje skrbi 0 nacionalnoj sportskoj ekipi i briga o zastiti interesa sportasa i stecenih prava na medunarodngj razini \\u2014 na trazenje tijela drzavne uprave nadleznog za sport, davanje prethodnog misljenja 0 postojanju interesa za prijam u hrvatsko drzavljanstvo fizicke osobe u sustavu sporta koja je strani drzavljanin \\u2014 druge zadace koje su utvrdene ovim Zakonom, statutom i aktima Hrvatskog olimpijskog odbora. POGLAVLJE II. HRVATSKI PARAOLIMPIJSKI ODBOR I NJEGOVE ZADACE Arvatski paraolimpijski odbor Clanak 47. (1) Hrvatski paraolimpijski odbor je krovno sportsko udruzenje osoba s invaliditetom u Republici Hrvatskoj u koje se udruzuju parasportski savezi te druge udruge Cija je djelatnost od znacaja za promicanje sporta osoba s invaliditetom, sukladno statutu Hrvatskog paraolimpijskog odbora. (2) Hrvatski paraolimpijski odbor ustrojava se prema nacelima paraolimpijskog pokreta i potrebama hrvatskog parasporta. (3) Hrvatski paraolimpijski odbor svojim pravilima odreduje ustrojstvo i nacin rada, Clanstvo i nacin ostvarivanja prava i obveza Clanova, nacin uporabe i zastite simbola i obiljezja Medunarodnog paraolimpijskog odbora i Hrvatskog paraolimpijskog odbora te druga pitanja u vezi s djelokrugom i zadacama Hrvatskog paraolimpijskog odbora. (4) Hrvatski paraolimpijski odbor osigurava uvjete za nesmetan razvoj parasporta i paraolimpijskog pokreta u Republici Hrvatskoj. Zadace Hrvatskog paraolimpijskog odbora Clanak 48. Zadace Hrvatskog paraolimpijskog odbora su: \\u2014 poticanje i promicanje parasporta u Republici Hrvatskoj \\u2014 sudjelovanje u predlaganju i ostvarivanju mjera za unaprjedenje i razvoj parasporta \\u2014 sudjelovanje u predlaganju i provodenju akata strateSkog planiranja iz clanka 104. ovoga Zakona i dijela programa javnih potreba u sportu na drzavnoj razini \\u2014 utvrdivanje nomenklature parasportova s podjelom na ekipne i pojedinacne sportove \\u2014 uskladivanje i kontrola aktivnosti nacionalnih parasportskih saveza u ostvarivanju ukupnog programa sporta osoba s invaliditetom i aktima strateskog planiranja iz Clanka 104. ovoga Zakona \\u2014 sudjelovanje u provedbi aktivnosti, pripadajucih pravila i postupaka za borbu protiv dopinga u sportu \\u2014 skrb o promicanju vrhunskih sportskih dostignuca hrvatskih parasportaSa i njihovu sudjelovanju u nacionalnim sportskim ekipama na paraolimpijskim igrama, parasvjetskim i paraeuropskim prvenstvima te drugim velikim medunarodnim sportskim natjecanjima \\u2014 provedba strucnog nadzora nad radom trenera koji su financirani kroz program javnih potreba u sportu drzavne razine \\u2014 promicanje strucnog rada u sportu i skrbi 0\", \"dostignuca hrvatskih parasportaSa i njihovu sudjelovanju u nacionalnim sportskim ekipama na paraolimpijskim igrama, parasvjetskim i paraeuropskim prvenstvima te drugim velikim medunarodnim sportskim natjecanjima \\u2014 provedba strucnog nadzora nad radom trenera koji su financirani kroz program javnih potreba u sportu drzavne razine \\u2014 promicanje strucnog rada u sportu i skrbi 0 osposobljavanju i usavrsavanju strucnih djelatnika u sportu \\u2014 koordiniranje svojih clanica pri izradi protokola za postupanje u slucaju nasilja medu djecom u sportskim klubovima \\u2014 kontrola i izvjestavanje tijela drzavne uprave nadleznog za sport o ucinku razvojnih programa za parasportase i programa za trenere koji su financirani kroz program javnih potreba u sportu na drzavnoj razini \\u2014 dostavljanje podataka u Nacionalni informacijski sustav u sportu \\u2014 kategorizacija parasportova \\u2014 kategorizacija parasportasa \\u2014 sudjelovanje u provedbi zdravstvene skrbi u sportu \\u2014 utvrdivanje sustava, uvjeta i organizacije sportskih natjecanja parasportaSa u skladu s pravilima sporta i normama medunarodnih sportskih udruzenja parasporta$a u slucaju kada ne postoji nacionalni sportski savez \\u2014 davanje suglasnosti na statute svojih Clanica koji moraju biti u skladu sa Statutom Hrvatskog paraolimpijskog odbora i ovim Zakonom \\u2014u slucaju pokretanja stecajnog postupka nad nacionalnim sportskim savezom, odlukom preuzimanje skrbi 0 nacionalnoj sportskoj ekipi i briga o zastiti interesa sportasa i stecenih prava na medunarodngj razini \\u2014 na trazenje tijela drzavne uprave nadleznog za sport, davanje prethodnog misljenja 0 postojanju interesa za prijam u hrvatsko drzavljanstvo fizicke osobe u sustavu sporta koja je strani drzavljanin \\u2014 druge zadace koje su utvrdene ovim Zakonom, statutom i aktima Hrvatskog paraolimpijskog odbora. POGLAVUJJE III. HRVATSKI SPORTSKI SAVEZ GLUHIH I NJEGOVE ZADACE Arvatski sportski savez gluhih Clanak 49. (1) Hrvatski sportski savez gluhih je krovno sportsko udruzenje gluhih osoba u Republici Hrvatskoj u koje se udruzuju sportski savezi gluhih osoba te druge udruge Cija je djelatnost od znacaja za promicanje sporta gluhih osoba, sukladno statutu Hrvatskog sportskog saveza gluhih. (2) Hrvatski sportski savez gluhih ustrojava se prema nacelima sportskog pokreta gluhih i potrebama hrvatskog sporta gluhih osoba. (3) Hrvatski sportski savez gluhih svojim pravilima odreduje ustrojstvo i nacin rada, Clanstvo i nacin ostvarivanja prava i obveza Clanova, nacin uporabe i zastite simbola i obiljezja Medunarodnog odbora za sport gluhih i Hrvatskog sportskog saveza gluhih te druga pitanja u vezi s djelokrugom i zadacama Hrvatskog sportskog saveza gluhih iz clanka 50. ovoga Zakona. (4) Hrvatski sportski savez gluhih osigurava uvjete za nesmetan razvoj sporta gluhih osoba i olimpijskog pokreta gluhih u Republici Hrvatskoj. Zadace Hrvatskog sportskog saveza gluhih Clanak 50. Zadace Hrvatskog sportskog saveza gluhih su: \\u2014 poticanje i promicanje sporta gluhih osoba u Republici Hrvatskoj \\u2014 sudjelovanje u predlaganju i ostvarivanju mjera za unaprjedenje i razvoj sporta gluhih osoba \\u2014 sudjelovanje u predlaganju i provodenju akata strateSkog planiranja iz clanka 104. ovoga Zakona i dijela programa javnih potreba u sportu na drzavnoj razini \\u2014 utvrdivanje sustava, uvjeta i organizacija sportskih natjecanja, ako za pojedini sport gluhih osoba u tom sportu nije osnovan nacionalni sportski savez \\u2014 utvrdivanje nomenklature sportova gluhih osoba s podjelom na ekipne i pojedinacne sportove \\u2014 sudjelovanje u provedbi aktivnosti, pripadajucih pravila\", \"programa javnih potreba u sportu na drzavnoj razini \\u2014 utvrdivanje sustava, uvjeta i organizacija sportskih natjecanja, ako za pojedini sport gluhih osoba u tom sportu nije osnovan nacionalni sportski savez \\u2014 utvrdivanje nomenklature sportova gluhih osoba s podjelom na ekipne i pojedinacne sportove \\u2014 sudjelovanje u provedbi aktivnosti, pripadajucih pravila i postupaka za borbu protiv dopinga u sportu \\u2014 provedba strucnog nadzora nad radom trenera koji su financirani programima javnih potreba u sportu drzavne razine \\u2014 promicanje strucnog rada u sportu i skrbi o osposobljavanju i usavrsavanju strucnih djelatnika u sportu \\u2014 promicanje vrhunskih sportskih dostignuca hrvatskih gluhih sportaSa i njihovu sudjelovanju u nacionalnim sportskim ekipama na olimpijskim igrama gluhih, svjetskim i europskim prvenstvima te drugim velikim medunarodnim natjecanjima gluhih sportasa \\u2014 koordiniranje svojih clanica pri izradi protokola za postupanje u slucaju nasilja medu djecom u sportskim klubovima \\u2014 kontrola i izvjestavanje tijela drzavne uprave nadleznog za sport 0 ucinku razvojnih programa za sportase i programa za trenere koji su financirani javnim potrebama u sportu na drzavnoj razini \\u2014 dostavljanje podataka u Nacionalni informacijski sustav u sportu \\u2014 kategorizacija sportova gluhih osoba \\u2014 kategorizacija gluhih sportasa \\u2014 sudjelovanje u provedbi zdravstvene skrbi u sportu \\u2014 davanje suglasnosti na statute svojih Clanica koji moraju biti u skladu sa Statutom Hrvatskog sportskog saveza gluhih i ovim Zakonom \\u2014 uslucaju pokretanja stecajnog postupka nad nacionalnim sportskim savezom, odlukom preuzimanje skrbi o nacionalnoj sportskoj ekipi i briga 0 zastiti interesa sportasa i stecenih prava na medunarodngj razini \\u2014 na trazenje tijela drzavne uprave nadleznog za sport, davanje prethodnog misljenja 0 postojanju interesa za prijam u hrvatsko drzavljanstvo fizi\\u00a2ke osobe u sustavu sporta koja je strani drzavljanin \\u2014 druge zadace koje su utvrdene ovim Zakonom, statutom i aktima Hrvatskog sportskog saveza gluhih. POGLAVLJE IV. HRVATSKI SKOLSKI SPORTSKI SAVEZ I NJEGOVE ZADACE Hrvatski skolski sportski savez Clanak 51. (1) Hrvatski skolski sportski savez je krovno sportsko udruzenje skolskog sporta u Republici Hrvatskoj u koji se udruzuju Skolski sportski savezi u jedinicama podrucne (regionalne) samouprave i Grada Zagreba, a radi uskladivanja aktivnosti svojih Clanica i organiziranja natjecanja Skolskih sportskih drustava i Skolskih sportskih aktivnosti ucenika. (2) Hrvatski skolski sportski savez predstavlja hrvatski Skolski sport na medunarodnim i nacionalnim natjecanjima iz Skolskog sporta koja se odrzavaju pod pokroviteljstvom Medunarodnog udruzenja skolskog sporta. (3) Hrvatski skolski sportski savez moze se financirati i iz drzavnog proracuna tijela drzavne uprave nadleznog za obrazovanje. Zadace Hrvatskog skolskog sportskog saveza Clanak 52. Zadace Hrvatskog Skolskog sportskog saveza su: \\u2014 utvrdivanje nacela i osnovnih uvjeta sustava skolskih sportskih natjecanja u Republici Hrvatskoj u suradnji s tijelom drzavne uprave nadleznim za sport i tijelom drzavne uprave nadleznim za obrazovanje \\u2014 organizacija i provodenje izvannastavnih i izvanskolskih sportskih aktivnosti ucenika \\u2014 sudjelovanje u predlaganju i provodenju akata strateskog planiranja iz Clanka 104. ovoga Zakona i dijela programa javnih potreba u sportu na drzavnoj razini \\u2014 davanje suglasnosti na statute svojih clanica koji moraju biti u skladu sa Statutom Hrvatskog Skolskog sportskog saveza \\u2014 sudjelovanje u prikupljanju, unosu i aZuriranju informacija za Nacionalni informacijski sustav u sportu\", \"akata strateskog planiranja iz Clanka 104. ovoga Zakona i dijela programa javnih potreba u sportu na drzavnoj razini \\u2014 davanje suglasnosti na statute svojih clanica koji moraju biti u skladu sa Statutom Hrvatskog Skolskog sportskog saveza \\u2014 sudjelovanje u prikupljanju, unosu i aZuriranju informacija za Nacionalni informacijski sustav u sportu \\u2014 druge zadace koje su utvrdene ovim Zakonom, statutom i aktima Hrvatskog skolskoga sportskog saveza. POGLAVLJE V. HRVATSKI AKADEMSKI SPORTSKI SAVEZ I NJEGOVE ZADACE Hrvatski akademski sportski savez Clanak 53. Hrvatski akademski sportski savez je krovno sportsko udruzenje akademskog sporta u Republici Hrvatskoj u koji se udruzuju sportski savezi visokih ucilista radi uskladivanja aktivnosti svojih Clanica, organizacije natjecanja te ostalih sportskih djelatnosti u sustavu akademskog sporta. Zadace Hrvatskog akademskog sportskog saveza Clanak 54. Zadace Hrvatskog akademskog sportskog saveza su: \\u2014 sudjelovanje u predlaganju i provodenju akata strateSkog planiranja iz Cclanka 104. ovoga Zakona i dijela programa javnih potreba u sportu na drzavnoj razini \\u2014 sudjelovanje u prikupljanju, unosu i azuriranju informacija za Nacionalni informacijski sustav u sportu \\u2014 sudjelovanje u medunarodnim studentskim sportskim pokretima i udruzivanje u odgovarajuca medunarodna studentska sportska udruzenja \\u2014 skrb o pripremama i sudjelovanju na univerzijadi, studentskim svjetskim, europskim i sli\\u00a2nim prvenstvima i igrama te njihovu organiziranju \\u2014 davanje suglasnosti na statute svojih Clanica koji moraju biti u skladu sa Statutom Hrvatskog akademskog sportskog saveza \\u2014 obavljanje drugih zadaca koje su utvrdene ovim Zakonom, statutom i opcim aktima Hrvatskog akademskog sportskog saveza. DIO PETI SPORTSKO NATJECANJE Provodenje sportskog natjecanja Clanak 55. (1) Sportsko natjecanje je organizirano natjecanje sportskih ekipa ili sportaSa pojedinaca koje organizira i vodi pravna ili fizicka osoba ovim Zakonom ovlastena za organiziranje i vodenje sportskog natjecanja. (2) Sportska natjecanja koja provode nacionalni sportski savezi ili njegove Clanice provode se sukladno aktu iz Clanka 37. stavka 5. ovoga Zakona, a kojim se propisuju osnovni elementi sustava natjecanja u razlicitim dobnim kategorijama i rangovima natjecanja od lokalne do nacionalne razine. Medunarodna sportska natjecanja Clanak 56. (1) Medunarodna sportska natjecanja organiziraju se sukladno odredbama ovoga Zakona te uvjetima i pravilima koje propisuju medunarodna sportska udruzenja ako takva postoje za to natjecanje. (2) Prijedlog za isticanje kandidature za odrzavanje olimpijskih igara, mediteranskih igara, kao i ostalih medunarodnih visesportskih natjecanja i sportskih priredaba u Republici Hrvatskoj daje Hrvatski olimpijski odbor, a za odrzavanje svjetskih i europskih prvenstava i kupova u pojedinim sportovima daje nacionalni sportski saveZz. (3) Prijedlog za isticanje kandidature za odrzavanje paraolimpijskih igara, olimpijskih igara gluhih, kao i ostalih medunarodnih visesportskih natjecanja za parasportaSe i gluhe osobe u Republici Hrvatskoj daje Hrvatski paraolimpijski odbor odnosno Hrvatski sportski savez gluhih, a za odrzavanje svjetskih i europskih prvenstava i kupova u pojedinim sportovima daje nacionalni sportski savez, uz prethodnu suglasnost Hrvatskog paraolimpijskog odbora ili Hrvatskog sportskog saveza gluhih. (4) Ako za pojedini parasport ili sport gluhih osoba nije osnovan nacionalni sportski savez, prijedloge za odrzavanje svjetskih i europskih prvenstava i kupova u pojedinim sportovima daje Hrvatski paraolimpijski odbor odnosno Hrvatski sportski savez gluhih. (5) Prijedlog za odrzavanje sluzbenih medunarodnih natjecanja u sustavu skolskog i akademskog sporta daje Hrvatski\", \"(4) Ako za pojedini parasport ili sport gluhih osoba nije osnovan nacionalni sportski savez, prijedloge za odrzavanje svjetskih i europskih prvenstava i kupova u pojedinim sportovima daje Hrvatski paraolimpijski odbor odnosno Hrvatski sportski savez gluhih. (5) Prijedlog za odrzavanje sluzbenih medunarodnih natjecanja u sustavu skolskog i akademskog sporta daje Hrvatski Skolski sportski savez odnosno Hrvatski akademski sportski savez. (6) Pri isticanju kandidature za odrzavanje olimpijskih igara, svjetskih i europskih prvenstava te medunarodnih sportskih natjecanja na teritoriju Republike Hrvatske potrebna je prethodna suglasnost tijela drzavne uprave nadleznog za sport te iznimno Vlade Republike Hrvatske ako je takva suglasnost propisana pravilima medunarodnih sportskih udruzenja u Cijoj je nadleznosti odrzavanje predmetnog natjecanja ili ako zahtjev sadrzi i zahtjev za financiranje. (7) Zahtjev za prethodnu suglasnost iz stavka 6. ovoga Clanka potrebno je dostaviti tijelu drzavne uprave nadleznom za sport najmanje godinu dana prije odrzavanja natjecanja, uz prilozen proracun natjecanja ako zahtjev sadrzi i zahtjev za financiranje. Osiguranje sigurnosti i pruzanje medicinske pomoci Clanak 57. (1) Neposredni organizator sportskih natjecanja duzan je osigurati sigurnost i pruzanje medicinske pomo\\u00a2i na sportskom natjecanju. (2) Standardi i normativi mjera za osiguranje medicinske pomod\\u00a2i iz stavka 1. ovoga clanka propisuju se pravilnikom iz clanka 15. stavka 5. ovoga Zakona. (3) Sigurnost na uredenim skijalistima pravilnikom propisuje \\u00a2celnik tijela drzavne uprave nadlezan za sport. Sudjelovanje stranog drzavljanina u sportskom natjecanju Clanak 58. Strani drzavljanin moze sudjelovati u sportskom natjecanju za domacu pravnu osobu koja obavlja djelatnost sudjelovanja u sportskom natjecanju pod uvjetima koje utvrdi odgovarajuci nacionalni sportski savez te sukladno propisima kojima se ureduje boravak i rad stranaca u Republici Hrvatskoj. DIO SESTI SPORTSKA INFRASTRUKTURA Sportska gradevina Clanak 59. (1) Sportska gradevina je uredena i opremljena gradevina i povrSina na kojoj se provode sportske djelatnosti, a koja zadovoljava opce uvjete definirane propisima kojima se ureduju graditeljstvo i prostorno uredenje. (2) Sportsko boriliste je povrsina/prostor na kojem se provode sportske djelatnosti iz Clanka 3. stavka 3. ovoga Zakona. (3) Gradevina i povrsina na kojoj se privremeno obavljaju sportske djelatnosti je privremena sportska gradevina. (4) Gradevina u kojoj se provodi iskljucivo sportska djelatnost upravljanja sportskom gradevinom, upravljacki i administrativni poslovi i posredovanje u sportu ne smatra se sportskom gradevinom. (5) Vlada Republike Hrvatske moze odlukom pojedine sportske gradevine proglasiti sportskim gradevinama od nacionalnog interesa. (6) Javne sportske gradevine su sportske gradevine koje su u vlasnistvu Republike Hrvatske ili vlasnistvu jedinica lokalne i podrucne (regionalne) samouprave, kao i one u vlasnistvu trgovackih drustava u vlasnistvu Republike Hrvatske ili vlasnistvu jedinica lokalne i podrucne (regionalne) samouprave. Standardi i dimenzije borilista Clanak 60. Nacionalni sportski savez za pojedini sport na svojim mreznim stranicama javno objavljuje standarde i dimenzije boriliSta s popratnim prostorijama za sportsku gradevinu toga sporta, kao i propozicije medunarodne federacije toga sporta. MreZa sportskih gradevina Clanak 61. (1) Mreza sportskih gradevina obuhvaca postojece i planirane sportske gradevine na podrucju Republike Hrvatske. (2) Svaku izmjenu prostornog plana vezanu uz mrezu sportskih gradevina jedinice lokalne i podrucne (regionalne) samouprave duzne su dostaviti tijelu drzavne uprave nadleznom za sport. (3) Odluku o donoSenju mreze sportskih\", \"MreZa sportskih gradevina Clanak 61. (1) Mreza sportskih gradevina obuhvaca postojece i planirane sportske gradevine na podrucju Republike Hrvatske. (2) Svaku izmjenu prostornog plana vezanu uz mrezu sportskih gradevina jedinice lokalne i podrucne (regionalne) samouprave duzne su dostaviti tijelu drzavne uprave nadleznom za sport. (3) Odluku o donoSenju mreze sportskih gradevina iz stavka 1. ovoga clanka donosi \\u00a2elnik tijela drzavne uprave nadleznog za sport. (4) Sportske gradevine planiraju se na temelju prostornih standarda i normativa za planiranje sportskih gradevina propisanih pravilnikom koji donosi \\u00a2elnik tijela drzavne uprave nadlezan za sport, uz prethodnu suglasnost \\u00a2elnika tijela drzavne uprave nadleznog za graditeljstvo i prostorno uredenje. Prenamjena i uklanjanje javnih sportskih gradevina Clanak 62. (1) Jedinica lokalne i jedinica podrucne (regionalne) samouprave moze samo uz prethodnu suglasnost tijela drzavne uprave nadleznog za sport, na temelju mreze sportskih gradevina, prenamijeniti povrsinu planiranu za javnu sportsku gradevinu, ukloniti ili prenamijeniti javnu sportsku gradevinu sukladno prostornim planovima za namjene koje nisu sportske djelatnosti. (2) Prethodna suglasnost iz stavka 1. ovoga Clanka izdat Ce se: \\u2014 ako je jedinica lokalne i podrucne (regionalne) samouprave planirala odgovarajucu zamjensku povrsinu sukladno mrezi sportskih gradevina ili \\u2014 ako investitor prenamjene javne sportske gradevine odnosno vlasnik javne sportske gradevine koja se uklanja preuzme obvezu i osigura uvjete izgradnje odgovarajuce zamjenske javne sportske gradevine iz podstavka 1. ovoga stavka sukladno mrezi sportskih gradevina. (3) Iznimno od stavka 2. ovoga Cclanka, prethodna suglasnost moze se dati samo ako iz mreze sportskih gradevina iz Clanka 61. ovoga Zakona proizlazi da vise ne postoji potreba za odredenom gradevinom, s obzirom na nepostojanje korisnika te sportske gradevine. (4) Dok se ne ishode akti za gradenje sukladno propisima iz podru\\u00a2ja graditeljstva i prostornoga uredenja za izgradnju zamjenske javne sportske gradevine te ne dostavi dokaz 0 osiguranim sredstvima za njezinu izgradnju, postojeca se sportska gradevina ne moze ukloniti, osim ako to nije naredeno u postupku koji provodi gradevinska inspekcija sukladno propisu kojim se ureduju inspekcijski poslovi u podrucju gradenja. Upravljanje javnom sportskom gradevinom Clanak 63. Upravljanje javnom sportskom gradevinom mozZe se ugovorom povjeriti sportskoj udruzi, sportskom savezu, sportskoj zajednici, obrtu, ustanovi i trgovackom drustvu registriranom za upravljanje sportskom gradevinom. DIO SEDMI NACIONALNI INFORMACISKI SUSTAV U SPORTU Ustroj i sadrzaj Nacionalnog informacijskog sustava u sportu Clanak 64. (1) U svrhu sustavnog pracenja stanja u sportu i njegova dugorocnog razvoja, tijelo drzavne uprave nadlezno za sport ustrojava i vodi Nacionalni informacijski sustav u sportu. (2) Nacionalni informacijski sustav u sportu je sustav koji Cini skup medusobno povezanih elektronickih registara i evidencija. (3) Podaci koji se nalaze u Nacionalnom informacijskom sustavu u sportu mogu se uciniti dostupni javnosti u obliku skupa (otvorenih) podataka ili kroz izvjestajni sustav u otvorenom i strojno Citljivom obliku, a sluze kao podloga za izradu strateskih dokumenata iz podrucja sporta i zdravstveno usmjerenog tjelesnog vjezbanja. (4) Razmjena podataka s drugim sustavima provodi se sukladno propisima o drzavnoj informacijskoj infrastrukturi i propisima zaStite podataka te zastite osobnih podataka. (5) Nacin unoSenja i pristupa podacima Nacionalnog informacijskog sustava u sportu, kao i detaljniju razradu sadrzaja te vrstu i oblik\", \"iz podrucja sporta i zdravstveno usmjerenog tjelesnog vjezbanja. (4) Razmjena podataka s drugim sustavima provodi se sukladno propisima o drzavnoj informacijskoj infrastrukturi i propisima zaStite podataka te zastite osobnih podataka. (5) Nacin unoSenja i pristupa podacima Nacionalnog informacijskog sustava u sportu, kao i detaljniju razradu sadrzaja te vrstu i oblik informacija koje se prikupljaju pravilnikom propisuje celnik tijela drzavne uprave nadleznog za sport. Registri i evidencije Clanak 65. Nacionalni informacijski sustav u sportu obuhvaca sljedece registre i evidencije: 1. Evidenciju sportasa 2. Registar kategoriziranih sportasa 3. Registar strucnih kadrova 4. Evidenciju pravnih osoba u sportu 5. Evidenciju sportskih gradevina 6. Evidenciju sportskih natjecanja i rezultata 7. Registar samostalne sportske djelatnosti 8. Evidenciju sportskih nagrada, naknada i stipendija 9. Evidenciju financijskog pracenja sportskih programa 10. Evidenciju programa Skolovanja, osposobljavanja i usavrSavanja 11. Evidenciju obrta 12. Evidenciju pravnih osoba ovlastenih za licenciranje 13. Evidenciju natjecaja i javnih poziva 14. Evidenciju sportske inspekcije 15. Evidenciju priznavanja inozemnih strucnih kvalifikacija 16. Evidenciju zdravstveno usmjerenog tjelesnog vjezbanja. Obveznici unosa i azuriranja podataka Clanak 66. (1) Obveznici unosa i azuriranja podataka u Evidenciju sportaSa su nacionalni sportski savezi, Hrvatski paraolimpijski odbor, Hrvatski sportski savez gluhih, Hrvatski akademski sportski savez, Hrvatski Skolski sportski savez i sportski klubovi. (2) Obveznici unosa i azuriranja podataka u Registar kategoriziranih sportasa su Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih. (3) Obveznici unosa i azuriranja podataka u Registar strucnih kadrova i Evidenciju pravnih osoba u sportu su Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor, Hrvatski sportski savez gluhih, Hrvatski akademski sportski savez, Hrvatski Skolski sportski savez, nacionalni sportski savezi i tijelo drzavne uprave nadlezno za sport. (4) Obveznici unosa i azuriranja podataka u Evidenciju sportskih natjecanja i rezultata su Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor, Hrvatski sportski savez gluhih, Hrvatski akademski sportski savez, Hrvatski Skolski sportski savez i nacionalni sportski savezi. (5) Obveznici unosa i azuriranja podataka u Evidenciju sportskih gradevina su jedinice lokalne i podrucne (regionalne) samouprave u Cijem je vlasnistvu sportska gradevina. (6) Obveznik unosa i azuriranja podataka u Registar samostalne sportske djelatnosti je nadlezno upravno tijelo zupanije odnosno Grada Zagreba prema prebivalistu fizicke osobe, u cijem je djelokrugu obavljanje povjerenih poslova drzavne uprave koji se odnosi na sportske djelatnosti. (7) Obveznik unosa i azuriranja podataka u Evidenciju programa skolovanja, osposobljavanja i usavrSavanja je tiielo drzavne uprave nadlezno za sport. (8) Obveznik unosa i azuriranja podataka u Evidenciju obrta je tijelo drzavne uprave nadlezno za sport. (9) Obveznik unosa i azuriranja podataka u Evidenciju sportskih nagrada, naknada i stipendija, Evidenciju pravnih osoba ovlastenih za licenciranje i Evidenciju priznavanja inozemnih strucnih kvalifikacija je tijelo drzavne uprave nadlezno za sport. (10) Obveznici unosa i azuriranja podataka u Evidenciju natjecaja i javnih poziva su jedinice lokalne i podrucne (regionalne) samouprave, sportske zajednice i tijelo drzavne uprave nadlezno za sport. (11) Obveznici unosa i azuriranja podataka u Evidenciju financijskog pracenja sportskih programa su Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor, Hrvatski sportski savez gluhih, Hrvatski akademski sportski savez, Hrvatski Skolski sportski savez, nacionalni sportski savezi, jedinice lokalne i podrucne (regionalne) samouprave i\", \"sportske zajednice i tijelo drzavne uprave nadlezno za sport. (11) Obveznici unosa i azuriranja podataka u Evidenciju financijskog pracenja sportskih programa su Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor, Hrvatski sportski savez gluhih, Hrvatski akademski sportski savez, Hrvatski Skolski sportski savez, nacionalni sportski savezi, jedinice lokalne i podrucne (regionalne) samouprave i tijelo drzavne uprave nadlezno za sport. (12) Obveznik unosa i azuriranja podataka u Evidenciju sportske inspekcije je tijelo drzavne uprave nadlezno za sportsku inspekciju. (13) Obveznici unosa i azuriranja podataka u Evidenciju zdravstveno usmjerenog tjelesnog vjezbanja su osobe upisane u Registar iz Clanka 65. tocke 7. i evidencija iz Clanka 65. tocaka 4. i 11. ovoga Zakona. (14) Zahtjev za upis u Evidenciju pravnih osoba u sportu pravne osobe koje nisu Cclanice krovnog sportskog udruzenja ili nacionalnog sportskog saveza podnose tijelu drzavne uprave nadleznom za sport. (15) U slucaju neispunjenja uvjeta za upisa u Evidenciju pravnih osoba u sportu, tijelo drzavne uprave nadlezno za sport izdaje rjeSenje kojim se odbija zahtjev za upis. (16) Protiv rjeSenja iz stavka 15. ovoga clanka zalba nije dopuStena, vec se moze pokrenuti upravni spor. DIO OSMI FINANCIRANJE SPORTA Prihodi pravnih i fizickih osoba u sustavu sporta Clanak 67. Osnovu financiranja sporta cine prihodi pravnih i fizickih osoba u sustavu sporta od: \\u2014 obavljanja sportske djelatnosti \\u2014 Clanarina koju ostvaruju sportske udruge \\u2014 sponzorstava i donacija \\u2014 sredstava kojima Republika Hrvatska i jedinice lokalne i podrucne (regionalne) samouprave financiraju javne potrebe u sportu \\u2014 obavljanja gospodarske djelatnosti \\u2014 drugih sredstava stecenih u skladu s ovim Zakonom. Javne potrebe u sportu Clanak 68. (1) Republika Hrvatska potice vrhunski sport, zdravstveno usmjerenu tjelesnu aktivnost, Skolski i akademski sport, parasport i sport gluhih te sportske aktivnosti djece i mladih kroz financiranje javnih potreba u sportu na drzavnoj razini. (2) Javne potrebe u sportu su: \\u2014 izgradnja, obnova, odrzavanje i opremanje sportskih gradevina od interesa za razvoj sporta na drzavnoj ili na razini jedinica lokalne i podrucne (regionalne) samouprave \\u2014 organizacija medunarodnih i nacionalnih sportskih natjecanja \\u2014 osiguravanje uvjeta za pripreme i nastup sportasa na medunarodnim natjecanjima \\u2014 skrb o sportaSima, financiranje nacionalne stipendije te mirovinskog i zdravstvenog osiguranja vrhunskim sportasima \\u2014 obavljanje strucnih poslova u sportu \\u2014 poticanje bavljenja sportom, a osobito djece i mladih \\u2014 djelovanje nacionalnih sportskih saveza i krovnih sportskih udruzenja \\u2014 funkcioniranje Nacionalnog informacijskog sustava u sportu \\u2014 $kolovanje i osposobljavanje strucnih kadrova u sportu, a posebice bivsih i sadaSnjih vrhunskih sportasa \\u2014 ocuvanje integriteta sporta \\u2014 dodjeljivanje drzavne nagrade za sport, drzavnih nagrada za vrhunska sportska postignuca, drzavnih priznanja osvajacima medalja te drzavnih priznanja izbornicima i trenerima \\u2014 medunarodna sportska suradnja i medunarodne obveze Republike Hrvatske u sportu \\u2014 poticanje i organizacija sportskorekreativnih programa i natjecanja te utilitarnih sportskih aktivnosti i zdravstveno usmjerene tjelesne aktivnosti \\u2014 poticanje razvoja 1 promocija sporta. Sredstva za financiranje javnih potreba u sportu Clanak 69. (1) Sredstva za financiranje javnih potreba u sportu na drzavnoj razini osiguravaju se u drzavnom proracunu Republike Hrvatske iz opcih prihoda i primitaka, iz prihoda od igara na srecu sukladno propisima kojima se\", \"tjelesne aktivnosti \\u2014 poticanje razvoja 1 promocija sporta. Sredstva za financiranje javnih potreba u sportu Clanak 69. (1) Sredstva za financiranje javnih potreba u sportu na drzavnoj razini osiguravaju se u drzavnom proracunu Republike Hrvatske iz opcih prihoda i primitaka, iz prihoda od igara na srecu sukladno propisima kojima se ureduju igre na srecu te iz ostalih izvora financiranja. (2) Namjena i raspodjela sredstava za financiranje javnih potreba u sportu na drzavnoj razini poblize se definiraju programom javnih potreba u sportu na drzavnoj razini koji donosi \\u00a2elnik tijela drzavne uprave nadleznog za sport, a koji se donosi u skladu s drzavnim proracunom Republike Hrvatske i mjerama iz akata strateSkog planiranja iz clanka 104. ovoga Zakona, najkasnije 30 dana od dana donoSenja drzavnog proracuna. (3) Pri izradi programa javnih potreba vodi se racuna 0 uskladenosti izdvajanja iz razlicitih javnih izvora. (4) Dio programa javnih potreba koji se financira putem krovnih sportskih udruzenja predlazu krovna sportska udruzenja. (5) Na temelju programa javnih potreba u sportu na drzavnoj razini Celnik tijela drzavne uprave nadleznog za sport donosi odluku o dodjeli sredstava za provedbu programa javnih potreba u sportu. (6) Korisnici sredstava duzni su dodijeljena sredstva koristiti namjenski. (7) Tijelo drzavne uprave nadlezno za sport i korisnici sredstava sklapaju ugovor o financiranju programa javnih potreba u sportu kojim se definiraju prava i obveze korisnika dodijeljenih sredstava. (8) Uvjet za financiranje programa javnih potreba u sportu je da pravne osobe koje provode programe i projekte koji se financiraju ispune obvezu unosa podataka u Nacionalni informacijski sustav u sportu, koji ujedno sluzi kao sustav koordinacije izdvajanja iz razlicitih javnih izvora. (9) Sadrzaj programa javnih potreba u sportu, metodologiju i rokove za izradu i dostavu programa javnih potreba u sportu, nacin izvrSavanja te nacin i rokove izvjestavanja o provedbi ovih programa pravilnikom propisuje celnik tijela drzavne uprave nadleznog za sport. Javne potrebe u sportu na drzavnoj razini koje se financiraju kroz aktivnosti krovnih sportskih udruzenja Clanak 70. (1) Javne potrebe u sportu na drzavnoj razini koje se financiraju putem krovnih sportskih udruzenja utvrduju se programom javnih potreba u sportu na drzavnoj razini iz clanka 69. stavka 2. ovoga Zakona. (2) Aktivnosti koje se financiraju putem Hrvatskog olimpijskog odbora, Hrvatskog paraolimpijskog odbora i Hrvatskog sportskog saveza gluhih su: \\u2014 redoviti sportski programi nacionalnih sportskih saveza \\u2014 priprema i natjecanja nacionalnih selekcija \\u2014 organizacija nacionalnih prvenstava, kupova i turnira nacionalne razine u organizaciji nacionalnih sportskih saveza i krovnih sportskih udruzenja \\u2014 olimpijske/paraolimpijske stipendije i olimpijske stipendije gluhih \\u2014 strucni rad u sportu, a posebice u nacionalnim selekcijama te licenciranje trenera \\u2014 razvojni program za sportase i stipendije za sportaSe u razvojnom programu \\u2014 olimpijski/paraolimpijski program i olimpijski program gluhih unutar kojega se financiraju nastupi i pripreme sportaSa za nastupe na ljetnim i zimskim olimpijskim/paraolimpijskim igrama i olimpijskim igrama gluhih te drugim visesportskim natjecanjima \\u2014 program razvoja sporta i sustava selekcije sportskih talenata koje provode nacionalni sportski savezi i krovna sportska udruzenja \\u2014 provodenje i financiranje znanstvenih i razvojnih projekata, elaborata i studija u funkciji razvoja sporta \\u2014 poticanje sporta\", \"na ljetnim i zimskim olimpijskim/paraolimpijskim igrama i olimpijskim igrama gluhih te drugim visesportskim natjecanjima \\u2014 program razvoja sporta i sustava selekcije sportskih talenata koje provode nacionalni sportski savezi i krovna sportska udruzenja \\u2014 provodenje i financiranje znanstvenih i razvojnih projekata, elaborata i studija u funkciji razvoja sporta \\u2014 poticanje sporta i olimpizma na svim razinama / paraolimpizma i olimpizma gluhih \\u2014 strucni i administrativni poslovi koje obavljaju tijela i sluzbe krovnih sportskih udruzenja i nacionalnih sportskih saveza Clanica krovnih sportskih udruzenja. (3) Aktivnosti koje se financiraju putem Hrvatskog Skolskog sportskog saveza su: \\u2014 programi iz podrucja medunarodne suradnje kojima je cilj promoviranje tjelesnog vjezbanja i zdravog nacina Zivota \\u2014 organizacija i provedba sluzbenih natjecanja u sustavu skolskog sporta na nacionalnoj razini te sudjelovanje na sluzbenim natjecanjima na medunarodngj razini \\u2014 provedba izvannastavnih i izvanskolskih programa u osnovnim i srednjim Skolama kojima je cilj promoviranje tjelesnog vjezbanja i zdravog nacina zivota \\u2014 programi razvoja Skolskog sporta \\u2014 strucni i administrativni poslovi koje obavljaju tijela i sluzbe Hrvatskog Skolskog sportskog saveza. (4) Aktivnosti koje se financiraju putem Hrvatskog akademskog sportskog saveza su: \\u2014 programi iz podrucja medunarodne suradnje kojima je cilj promoviranje tjelesnog vjezbanja i zdravog nacina zivota studenata \\u2014 organizacija i provedba sluzbenih natjecanja u sustavu akademskog sporta na nacionalnoj razini te sudjelovanje na sluzbenim natjecanjima na medunarodngj razini \\u2014 programi razvoja studentskog sporta \\u2014 strucni i administrativni poslovi koje obavljaju tijela i sluzbe Hrvatskog akademskog sportskog saveza. (5) Programi koje provode nacionalni sportski savezi sastavni su dio programa javnih potreba krovnih sportskih udruzenja, a osnovni kriterij za raspodjelu sredstava je kategorizacija sportova koju donose Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih za saveze prema nomenklaturi iz clanka 5. ovoga Zakona. (6) Osim kriterija iz stavka 5. ovoga Clanka, kriteriji za raspodjelu sredstava mogu biti i primjena standarda dobrog upravljanja, prepoznavanje i razvijanje talenata, skrb o djeci sportaSima, ravnopravnost spolova, borba protiv dopinga, borba protiv zlostavljanja, borba protiv namjestanja utakmica i slicno, a nacin primjene kriterija svojim op\\u00a2cim aktom definiraju Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih za saveze prema nomenklaturi iz clanka 5. ovoga Zakona. (7) Programi, poslovi i djelatnosti koje se odnose na zada\\u00a2ce Hrvatskog akademskog sportskog saveza mogu se financirati i iz sredstava visokih ucilista odnosno sredstava studentskih organizacija sukladno posebnom propisu. (8) Krovna sportska udruzenja dostavljaju tijelu drzavne uprave nadleznom za sport prijedlog programa financiranja javnih potreba koje oni provode, na nacin i u rokovima utvrdenim pravilnikom iz stavka 12. ovoga clanka. (9) Izmjene i dopune programa javnih potreba u sportu i financijskog plana moguce su u okviru ukupnog iznosa, a prethodnu odluku o odobrenju izmjena donosi tijelo drzavne uprave nadlezno za sport. (10) Krovno sportsko udruzenje moze zahtjev za izmjene i dopune programa javnih potreba koji se odnosi na krovno sportsko udruzenje dostaviti tijelu drzavne uprave nadleznom za sport sukladno pravilniku iz stavka 12. ovoga Clanka. (11) Za izmjene i dopune programa krovnih sportskih udruzenja manje od 5 % godisnje po pojedinoj stavci nije potrebno prethodno odobrenje iz\", \"za izmjene i dopune programa javnih potreba koji se odnosi na krovno sportsko udruzenje dostaviti tijelu drzavne uprave nadleznom za sport sukladno pravilniku iz stavka 12. ovoga Clanka. (11) Za izmjene i dopune programa krovnih sportskih udruzenja manje od 5 % godisnje po pojedinoj stavci nije potrebno prethodno odobrenje iz stavka 9. ovoga Cclanka. (12) Rokovi za dostavu programa javnih potreba u sportu i financijskog plana krovnih sportskih udruzenja, nacin izvrsavanja te nacin i rokovi izvjeStavanja o provedbi programa iz stavka 1. ovoga Cclanka propisuju se pravilnikom iz clanka 69. stavka 9. ovoga Zakona. Postupanje u slucaju utvrdenja postojanja stecajnih razloga krovnih sportskih udruzenja Clanak 71. (1) U slucaju utvrdenja postojanja stecajnih razloga krovnog sportskog udruzenja, financijska sredstva namijenjena programu financiranja javnih potreba u sportu tijelo drzavne uprave nadlezno za sport izravno doznacuje krajnjim korisnicima, do prestanka postojanja stecajnih razloga krovnog sportskog udruzenja. (2) U slu\\u00e9aju financijskih obveza krovnog sportskog udruzenja prema trecim osobama koje je nastalo iz poslovnog odnosa koji nije utvrden odlukom iz clanka 69. stavka 5. ovoga Zakona, koje krovno sportsko udruzenje ne moze podmiriti iz vlastitih sredstava te zbog kojega je izvrSavanje programa financiranja javnih potreba u sportu dovedeno u pitanje, tijelo drzavne uprave nadlezno za sport moze izravno doznaciti sredstva krajnjim korisnicima, do prestanka tih financijskih obveza. (3) U slucajevima iz ovoga Cclanka, krajnji korisnici javnih potreba u sportu svojim zahtjevima za financiranje izravno se obracaju tijelu drzavne uprave nadleznom za sport u rokovima propisanim pravilnikom iz clanka 69. stavka 9. ovoga Zakona. Sufinanciranje medunarodnih sportskih natjecanja Clanak 72. (1) Sufinanciranje medunarodnih sportskih natjecanja utvrduje se programom javnih potreba u sportu na drzavnoj razini iz Clanka 69. stavka 2. ovoga Zakona. (2) Pravo na sufinanciranje iz stavka 1. ovoga clanka ostvaruje se ako su kumulativno ispunjeni sljedeci uvjeti: \\u2014 sadrzaj, ciljevi i broj sudionika medunarodnog sportskog natjecanja imaju vaznost za razvoj i promociju sporta \\u2014 osigurana je pokrivenost medunarodnog sportskog natjecanja putem nacionalnih i inozemnih medijskih i ostalih promotivnih komunikacijskih kanala \\u2014 medunarodno sportsko natjecanje ima osigurana sredstva za organizaciju \\u2014 dostavljen elaborat 0 sportskoj, drustvenoj i ekonomskoj opravdanosti organizacije medunarodnog sportskog natjecanja \\u2014 suglasnost za isticanje kandidature medunarodnog sportskog natjecanja koju je izdalo tijelo drzavne uprave nadlezno za sport, ako je ona propisana ovim Zakonom. (3) Nacin dodjele, rokovi dostave zahtjeva za sufinanciranje, opravdanost troskova te nacin izvjestavanja 0 utrosku sredstava za sufinanciranje organizacije medunarodnih sportskih natjecanja iz stavka 1. ovoga clanka propisuju se pravilnikom iz clanka 69. stavka 9. ovoga Zakona. Financiranje sportskih gradevina Clanak 73. (1) Tijelo drzavne uprave nadleZzno za sport moze financirati ili sufinancirati izgradnju, obnovu i rekonstrukciju sportskih gradevina za pojedini sport ili skupine sportova. (2) Financiranje ili sufinanciranje iz stavka 1. ovoga clanka utvrduje se programom javnih potreba u sportu na drzavnoj razini, a pravo na financiranje ili sufinanciranje ostvaruje se ako su kumulativno ispunjeni sljedeci uvjeti: \\u2014 dostavljen elaborat 0 sportskoj, drustvenoj i ekonomskoj opravdanosti izgradnje sportskih gradevina ili zahvata iz stavka 1. ovoga clanka \\u2014 sportska gradevina mora biti predvidena mrezom sportskih gradevina. (3) Odredbe stavka\", \"u sportu na drzavnoj razini, a pravo na financiranje ili sufinanciranje ostvaruje se ako su kumulativno ispunjeni sljedeci uvjeti: \\u2014 dostavljen elaborat 0 sportskoj, drustvenoj i ekonomskoj opravdanosti izgradnje sportskih gradevina ili zahvata iz stavka 1. ovoga clanka \\u2014 sportska gradevina mora biti predvidena mrezom sportskih gradevina. (3) Odredbe stavka 2. ovoga Clanka ne primjenjuju se na sportsku gradevinu koja je proglaSena sportskom gradevinom od nacionalnog interesa u smislu Clanka 59. stavka 5. ovoga Zakona. (4) Prijedlog za sufinanciranje izgradnje ili obnove sportske gradevine od nacionalnog interesa, uz obrazlozenje sportske, drustvene i ekonomske opravdanosti, moze tijelu drzavne uprave nadleznom za sport podnijeti Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor ili Hrvatski sportski savez gluhih te nacionalni sportski savez. (5) Rokovi dostave zahtjeva za financiranje ili sufinanciranje, opravdanost troskova, na\\u00a2cin odabira te nacin izvjestavanja o utrosku sredstava za financiranje ili sufinanciranje iz stavka 1. ovoga Clanka propisuju se pravilnikom iz clanka 69. stavka 9. ovoga Zakona. Sufinanciranje programa i projekata od interesa lokalne i podrucne (regionalne) razine iz drzavnog proracuna Republike Hrvatske Clanak 74. (1) Sukladno aktima strateskog planiranja iz clanka 104. ovoga Zakona i programu javnih potreba u sportu na drzavnoj razini, tijelo drzavne uprave nadlezno za sport moze sufinancirati programe i projekte posebno vazne Za razvoj sporta na razini jedinica lokalne odnosno podrucne (regionalne) samouprave. (2) Tijelo drzavne uprave nadlezno za sport moze sufinancirati sljedece programe i projekte: \\u2014 provedbu sportskih natjecanja kojima je cilj popularizacija sporta i tjelesnog vjezbanja \\u2014 programe razvoja sporta od interesa za jedinicu lokalne odnosno podrucne (regionalne) samouprave i \\u2014 programe razvoja sporta od interesa za jedinicu lokalne odnosno podrucne (regionalne) samouprave putem sportskih zajednica u jedinicama podrucne (regionalne) samouprave. (3) Programima iz stavka 2. podstavka 3. ovoga Clanka iskljucivo se mogu sufinancirati troSkovi strucnog rada i poboljSanja materijalnih uvjeta za provedbu programa za djecu i mlade do 18 godina. (4) Nakon donoSenja drzavnog proracuna Republike Hrvatske i provedenog javnog natjecaja, Ccelnik tijela drzavne uprave nadleznog za sport donosi odluku o raspodjeli sredstava iz stavka 2. podstavaka 1. i 2. ovoga clanka. (5) Kriteriji za raspodjelu sredstava iz stavka 2. podstavka 3. su: \\u2014 indeks razvijenosti zupanija sukladno posebnom propisu \\u2014 broj clanica zupanijske sportske zajednice \\u2014 broj sportskih klubova, udruga sportske rekreacije i sportskih saveza u zupaniji \\u2014 broj djece i mladih do 18 godina u Clanicama zupanijske sportske zajednice. (6) Nacin i rokovi podnoSenja zahtjeva, postupak vrednovanja sportskih programa i postupak dodjele sredstava iz stavka 2. podstavka 3. ovoga Clanka, opravdani troskovi te nacin izvrsavanja programa, kao i nacin i rokovi izvjestavanja o provedbi programa propisuju se pravilnikom iz clanka 69. stavka 9. ovoga Zakona. Javne potrebe u sportu na lokalnoj i podrucnoj (regionalnoj) razini Clanak 75. (1) Odluku o koristenju sredstava za financiranje javnih potreba u sportu na razini lokalne odnosno podrucne (regionalne) samouprave donosi predstavnicko tijelo jedinice lokalne i podrucne (regionalne) samouprave. (2) Javne potrebe u sportu za koje se sredstva osiguravaju iz proracuna jedinica lokalne i podrucne (regionalne) samouprave su: \\u2014 poticanje razvoja 1 promocija sporta \\u2014 provodenje sportskih aktivnosti\", \"financiranje javnih potreba u sportu na razini lokalne odnosno podrucne (regionalne) samouprave donosi predstavnicko tijelo jedinice lokalne i podrucne (regionalne) samouprave. (2) Javne potrebe u sportu za koje se sredstva osiguravaju iz proracuna jedinica lokalne i podrucne (regionalne) samouprave su: \\u2014 poticanje razvoja 1 promocija sporta \\u2014 provodenje sportskih aktivnosti djece, mladezi i studenata \\u2014 djelovanje sportskih udruga, sportskih zajednica i sportskih saveza \\u2014 sportska priprema, doma\\u00a2a i medunarodna natjecanja te opca i posebna zdravstvena zaStita sportasa \\u2014 \\u00a7kolovanje i osposobljavanje strucnog kadra u sportu \\u2014 zaposljavanje osoba za obavljanje strucnih poslova u sportu \\u2014 sportska stipendija \\u2014 sportskorekreativne aktivnosti gradana \\u2014 sportske aktivnosti djece s teskocama u razvoju te parasportasa i gluhih sportasa \\u2014 planiranje, izgradnja, odrzavanje i koristenje sportskih gradevina zna\\u00a2ajnih za jedinicu lokalne i podrucne (regionalne) samouprave. (3) Predstavnicko tijelo jedinice lokalne i podrucne (regionalne) samouprave donosi godisnji program javnih potreba u sportu. (4) Program javnih potreba u sportu predlazu i provode sportska zajednica te Skolski i akademski sportski savez u jedinici lokalne i podrucne (regionalne) samouprave u kojoj su osnovani. (5) Ako na podrud\\u00a2ju jedinice lokalne i podrucne (regionalne) samouprave nije osnovana sportska zajednica ili Skolski te akademski sportski savez, o provodenju programa javnih potreba iz ovoga Clanka odlucuje jedinica lokalne i podrucne (regionalne) samouprave, sukladno ovom Zakonu i opcim aktima jedinica lokalne i podrucne (regionalne) samouprave. (6) Tijelo jedinica lokalne i podrucne (regionalne) samouprave nadlezno za sport prati i nadzire izvrSenje programa financiranja javnih potreba u sportu i prati koristenje i utroSak sredstava za te programe. (7) Jedinice lokalne i podrucne (regionalne) samouprave opcim aktom na prijedlog sportske zajednice te Skolskog i akademskog sportskog saveza, u dijelu programa koji provode i ako su osnovani u toj jedinici lokalne i podrucne (regionalne) samouprave, detaljnije propisuju kriterije financiranja javnih potreba u sportu, mjerila za osiguranje sredstava, metodologiju i rokove za izradu i dostavu prijedloga programa javnih potreba, nacin izvrsavanja programa javnih potreba, nacin i rokove izvjestavanja 0 provedbi programa javnih potreba te metodologiju izrade financijskih planova korisnika javnih potreba u sportu. DIO DEVETI PRAVA SPORTASA, TRENERA I IZBORNIKA Prava sportasa, trenera i izbornika Clanak 76. (1) Prava koja sportaS moze ostvariti na temelju ovoga Zakona su: \\u2014 pravo na pokrice obveznih doprinosa \\u2014 pravo na sportsku stipendiju \\u2014 pravo na nagrade za sportska ostvarenja \\u2014 pravo na trajnu novcanu naknadu \\u2014 pravo na pokrice osnovnih troskova za bavljenje sportskom djelatnos\\u00a2u. (2) Na temelju ovoga Zakona trener i izbornik mogu ostvariti pravo na trajnu novcanu naknadu i nagradu za sportska ostvarenja. Obvezni doprinosi Clanak 77. (1) Vrhunski sportas I. kategorije ima pravo na uplatu obveznih doprinosa iz sredstava drzavnog proracuna Republike Hrvatske. (2) Pravo na uplatu obveznih doprinosa odobrava se sportasu iz stavka 1. ovoga clanka na vlastiti zahtjev ako ispunjava sljedece uvjete: \\u2014 ima status vrhunskog sportaSa I. kategorije \\u2014 ima registriranu samostalnu sportsku djelatnost ili ima sklopljen ugovor o radu za djelatnost pripreme i sudjelovanja u sportskom natjecanju \\u2014 ima hrvatsko drzavljanstvo \\u2014 ima prebivaliste u Republici Hrvatskoj \\u2014 ako je ostvario ukupni godisnji netodohodak u\", \"zahtjev ako ispunjava sljedece uvjete: \\u2014 ima status vrhunskog sportaSa I. kategorije \\u2014 ima registriranu samostalnu sportsku djelatnost ili ima sklopljen ugovor o radu za djelatnost pripreme i sudjelovanja u sportskom natjecanju \\u2014 ima hrvatsko drzavljanstvo \\u2014 ima prebivaliste u Republici Hrvatskoj \\u2014 ako je ostvario ukupni godisnji netodohodak u prethodnoj godini do 24.000,00 eura \\u2014 nije pravomocno osuden za pocinjeno kazneno djelo iz clanka 111. stavaka 1. i 2. ovoga Zakona. (3) Sportasu iz stavka 1. ovoga clanka prestaje pravo na uplatu obveznih doprinosa: \\u2014 na osobni zahtjev \\u2014 prestankom odnosno gubitkom statusa vrhunskog sportaSa I. kategorije \\u2014 ako ostvari ukupni godisnji netodohodak u prethodnoj godini visi od 24.000,00 eura \\u2014 prestankom ugovora o radu \\u2014 prestankom obavljanja samostalne sportske djelatnosti \\u2014 ostvarivanjem prava redovitog studenta \\u2014 nakon pravomocnosti odluke suda kojom je osuden na kaznu zatvora za pocinjeno kazneno djelo \\u2014 smrcu \\u2014 ostvarivanjem prava na obvezno mirovinsko osiguranje po drugoj osnovi. (4) O priznanju i gubitku prava na uplatu obveznih doprinosa vrhunskim sportaSima I. kategorije iz clanka 14. ovoga Zakona rjeSenjem odlucuje tijelo drzavne uprave nadlezno za sport. (5) Protiv rjeSenja iz stavka 4. ovoga Clanka zalba nije dopuStena, vec se moze pokrenuti upravni spor. (6) Za sportaSe kojima je utvrdeno pravo na uplatu obveznih doprinosa, a imaju sklopljen ugovor o radu sredstva se isplacuju na racun sportskog kluba po dostavljenom dokazu o placenim doprinosima prema ispla\\u00a2cenoj placi. (7) Za sportaSe kojima je utvrdeno pravo na uplatu obveznih doprinosa, a imaju registriranu samostalnu sportsku djelatnost te su po toj osnovi osigurani na obvezna osiguranja sredstva se uplacuju sportasu po dostavljenom dokazu o pla\\u00a2enim doprinosima, a najvise do iznosa obracunanih doprinosa prema najnizoj mjesecnoj osnovici propisanoj propisom o obveznim doprinosima za osiguranika po osnovi sportaSa. (8) Prijavu o pocetku osiguranja za sportase kojima je utvrdeno pravo na uplatu obveznih doprinosa podnosi poslodavac odnosno sportas ako obavlja samostalnu sportsku djelatnost, a obveznik placanja doprinosa je tijelo drzavne uprave nadlezno za sport. (9) Nacin dodjele prava na obvezne doprinose, potrebnu dokumentaciju te izgled i sadrzaj obrazaca propisuje pravilnikom \\u00a2elnik tijela drzavne uprave nadleznog za sport. Ukidanje rjesenja kojim je priznato pravo na obvezne doprinose Clanak 78. (1) Tijelo drzavne uprave nadlezno za sport po sluzbenoj ce duznosti ukinuti rjeSenje priznatog prava sportasu iz clanka 77. ovoga Zakona ako se utvrdi da vise ne ispunjava uvjete iz Clanka 77. stavka 2. ovoga Zakona. (2) Sportas koji je ostvario pravo iz clanka 77. ovoga Zakona duzan je o promjeni okolnosti koja je utjecala na ostvarivanje prava obavijestiti tijelo koje je rjeSenje donijelo, odmah po nastanku okolnosti, a najkasnije u roku od 15 dana od nastupa okolnosti. (3) Vrhunski sportas I. kategorije koji nakon Sto mu je rjeSenjem priznato pravo na uplatu obveznih doprinosa, obvezan je tijelu drzavne uprave nadleznom za sport vratiti sredstva s pripadajucim zateznim kamatama uplacena za doprinose prema ovome Zakonu, ako su doprinosi uplacivani nakon Sto su nastupile okolnosti koje utjecu na prestanak prava na uplatu obveznih doprinosa, a sportas je znao ili je morao znati za te okolnosti,\", \"doprinosa, obvezan je tijelu drzavne uprave nadleznom za sport vratiti sredstva s pripadajucim zateznim kamatama uplacena za doprinose prema ovome Zakonu, ako su doprinosi uplacivani nakon Sto su nastupile okolnosti koje utjecu na prestanak prava na uplatu obveznih doprinosa, a sportas je znao ili je morao znati za te okolnosti, ali nije o njima obavijestio tijelo drzavne uprave nadlezno za sport u roku od 15 dana od nastanka okolnosti. (4) Protiv rjeSenja iz stavka 1. ovoga clanka zalba nije dopuStena, vec se moze pokrenuti upravni spor. Trajna novcana naknada Clanak 79. (1) Pravo na trajnu novcanu mjesecnu naknadu ostvaruje sportas koji je osvojio medalju na olimpijskim igrama / paraolimpijskim igrama / olimpijskim igrama gluhih i svjetskom seniorskom prvenstvu u olimpijskom/paraolimpijskom sportu i disciplini te olimpijskom sportu i disciplini gluhih, kao drzavno priznanje za poseban doprinos ugledu Republike Hrvatske, ako ima ispunjene sljedece uvjete: \\u2014 hrvatsko drzavljanstvo \\u2014 prebivaliste u Republici Hrvatskoj \\u2014 navrsenih 45 godina zivota \\u2014 nije pravomocno osuden za pocinjeno kazneno djelo iz clanka 111. stavaka 1. i 2. ovoga Zakona. (2) Trajna novcana mjesecna naknada sportasu iz stavka 1. ovoga Clanka, u netoiznosu, je: \\u2014 100 % prosjecne netoplace po zaposlenom u pravnim osobama u Republici Hrvatskoj prema objavi Drzavnog zavoda za statistiku za osvojenu zlatnu medalju na olimpijskim igrama, paraolimpijskim igrama i olimpijskim igrama gluhih koja je utvrdena za prethodnu godinu u odnosu na godinu u kojoj se trajna novcana mjesecna naknada isplacuje \\u2014 80 % prosjecne netoplace po zaposlenom u pravnim osobama u Republici Hrvatskoj prema objavi Drzavnog zavoda za statistiku za osvojenu srebrnu medalju na olimpijskim igrama, paraolimpijskim igrama i olimpijskim igrama gluhih te za osvojenu zlatnu medalju na svjetskim seniorskim prvenstvima u olimpijskom/paraolimpijskom sportu i disciplini te olimpijskom sportu i disciplini gluhih koja je utvrdena za prethodnu godinu u odnosu na godinu u kojoj se trajna novcana mjesecna nagrada isplacuje \\u2014 60 % prosjecne netoplace po zaposlenom u pravnim osobama u Republici Hrvatskoj prema objavi Drzavnog zavoda za statistiku za osvojenu broncanu medalju na olimpijskim igrama, paraolimpijskim igrama i olimpijskim igrama gluhih te za osvojenu srebrnu medalju na svjetskim seniorskim prvenstvima u olimpijskom/paraolimpijskom sportu i disciplini te olimpijskom sportu i disciplini gluhih, sportovima i disciplinama koja je utvrdena za prethodnu godinu u odnosu na godinu u kojoj se trajna novcana mjesecna naknada isplacuje \\u2014 40 % prosjecne netoplace po zaposlenom u pravnim osobama u Republici Hrvatskoj prema objavi Drzavnog zavoda za statistiku za osvojenu broncanu medalju na svjetskim seniorskim prvenstvima u olimpijskom/paraolimpijskom sportu i disciplini te olimpijskom sportu i disciplini gluhih, sportovima i disciplinama koja je utvrdena za prethodnu godinu u odnosu na godinu u kojoj se trajna novcana mjesecna naknada ispla\\u00a2cuje. (3) Pravo na trajnu novcanu mjesecnu naknadu ostvaruje i izbornik u ekipnim sportovima i trener u individualnim sportovima koji je obavljao strucne poslove vodenja sportaSa ili ekipe na sportskom natjecanju, zasluzan za medalju koja je osvojena na olimpijskim igrama / paraolimpijskim igrama / olimpijskim igrama gluhih, kao drzavno priznanje za poseban doprinos ugledu Republike Hrvatske, ako ima ispunjene sljedece uvjete: \\u2014\", \"ekipnim sportovima i trener u individualnim sportovima koji je obavljao strucne poslove vodenja sportaSa ili ekipe na sportskom natjecanju, zasluzan za medalju koja je osvojena na olimpijskim igrama / paraolimpijskim igrama / olimpijskim igrama gluhih, kao drzavno priznanje za poseban doprinos ugledu Republike Hrvatske, ako ima ispunjene sljedece uvjete: \\u2014 hrvatsko drzavljanstvo \\u2014 prebivaliste u Republici Hrvatskoj \\u2014 navrsenih 55 godina zivota \\u2014 nije pravomocno osuden za pocinjeno kazneno djelo iz clanka 111. stavaka 1. i 2. ovoga Zakona. (4) Trajna novcana mjesecna naknada izborniku odnosno treneru iz stavka 3. ovoga Clanka, u netoiznosu, je: \\u2014 100 % prosjecne netoplace po zaposlenom u pravnim osobama u Republici Hrvatskoj prema objavi Drzavnog zavoda za statistiku za zaslugu za osvojenu zlatnu medalju na olimpijskim igrama, paraolimpijskim igrama i olimpijskim igrama gluhih koja je utvrdena za prethodnu godinu u odnosu na godinu u kojoj se trajna novcana mjesecna naknada isplacuje \\u2014 80 % prosjecne netoplace po zaposlenom u pravnim osobama u Republici Hrvatskoj prema objavi Drzavnog zavoda za statistiku za zaslugu za osvojenu srebrnu medalju na olimpijskim igrama, paraolimpijskim igrama i olimpijskim igrama gluhih koja je utvrdena za prethodnu godinu u odnosu na godinu u kojoj se trajna novcana mjesecna nagrada isplacuje \\u2014 60 % prosjecne netoplace po zaposlenom u pravnim osobama u Republici Hrvatskoj prema objavi Drzavnog zavoda za statistiku za zaslugu za osvojenu broncanu medalju na olimpijskim igrama, paraolimpijskim igrama i olimpijskim igrama gluhih koja je utvrdena za prethodnu godinu u odnosu na godinu u kojoj se trajna novcana mjesecna naknada isplacuje. (5) Sportas, izbornik ili trener koji je osvojio vise medalja, a koji ispunjava uvjete iz stavaka 1. i 3. ovoga clanka, moze ostvariti pravo na trajnu novcanu mjesecnu naknadu samo u iznosu za osvojenu jednu medalju, pri cemu je mjerodavan najvisi iznos naknade. (6) Trajna novcana mjesecna naknada uskladuje se s visinom prosjecne netoplace za mjesec koji slijedi mjesecu u kojem je Drzavni zavod za statistiku objavio visinu prosjecne netoplace. (7) O priznanju i gubitku prava na trajnu novcanu mjesecnu naknadu rjeSenjem odlucuje tijelo drzavne uprave nadlezno za sport. (8) Protiv rjeSenja iz stavka 7. ovoga clanka zalba nije dopuStena, vec se moze pokrenuti upravni spor. (9) Pravo na trajnu novcanu mjesecnu naknadu iz stavaka 1. i 3. ovoga clanka je dozivotno, a ukinut \\u00a2e se ako prestane udovoljavanje nekim od uvjeta propisanim stavcima 1. ili 3. ovoga clanka. (10) Protiv rjeSenja iz stavka 9. ovoga clanka zalba nije dopustena, vec se moze pokrenuti upravni spor. (11) Hrvatski olimpijski odbor za osvajace medalja na olimpijskim igrama i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama, zatim Hrvatski paraolimpijski odbor za osvajace medalja na paraolimpijskim igrama i svjetskim seniorskim prvenstvima u paraolimpijskim sportovima i disciplinama odnosno Hrvatski sportski savez gluhih za osvajace medalja na olimpijskim igrama gluhih i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama gluhih vode sluzbene evidencije te izdaju uvjerenja o osvojenim medaljama. (12) Hrvatski olimpijski odbor za osvajace medalja na olimpijskim igrama i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama, zatim Hrvatski paraolimpijski odbor za\", \"za osvajace medalja na olimpijskim igrama gluhih i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama gluhih vode sluzbene evidencije te izdaju uvjerenja o osvojenim medaljama. (12) Hrvatski olimpijski odbor za osvajace medalja na olimpijskim igrama i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama, zatim Hrvatski paraolimpijski odbor za osvajace medalja na paraolimpijskim igrama i svjetskim seniorskim prvenstvima u paraolimpijskim sportovima i disciplinama odnosno Hrvatski sportski savez gluhih za osvajace medalja na olimpijskim igrama gluhih i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama gluhih vode sluzbene evidencije o treneru ili izborniku koji je obavljao strucne poslove vodenja na sportskom natjecanju sportaSa ili ekipe koja je osvojila medalju te o tome izdaju uvjerenja. (13) U slucaju postojanja vise razina (rangova, divizija i sl.) svjetskih i europskih prvenstava pojedinog sporta, naknade iz stavaka 1. ili 2. ovoga Clanka dodjeljuju se samo za svjetska prvenstva najviSe razine. (14) Nadlezni nacionalni sportski savez duzan je na zahtjev dostaviti dokaz 0 tome koji se rang natjecanja u smislu stavka 1. ovoga clanka smatra svjetskim i europskim prvenstvom najvise razine sukladno pravilima nadleznog medunarodnog sportskog saveza. (15) Nacin dodjele prava na trajnu novcanu naknadu, potrebna dokumentacija, izgled i sadrzaj obrazaca te druga pitanja znacajna za dodjelu trajne novcane naknade propisuju se pravilnikom iz clanka 77. stavka 9. ovoga Zakona. Nacionalna sportska stipendija Clanak 80. (1) Vrhunski sportas moze ostvariti pravo na nacionalnu sportsku stipendiju nakon Sto rjeSenje o kategorizaciji sportaSa postane izvrsno, i to na rok dok traje rjesenje o kategorizaciji. (2) O priznanju i gubitku prava na nacionalnu sportsku stipendiju rjeSenjem odlucuje tijelo drzavne uprave nadlezno za sport. (3) RjeSenje iz stavka 2. ovoga Clanka ukinut Ce se po sluzbenoj duznosti ako je ukinuto rjeSenje o kategorizaciji sportasa. (4) O iznosu nacionalne sportske stipendije celnik tijela drzavne uprave nadleznog za sport donosi odluku za svaku kalendarsku godinu. (5) Protiv rjeSenja iz stavaka 2. i 3. ovoga Clanka zalba nije dopuStena, ve\\u00a2 se moze pokrenuti upravni spor. (6) Nacin dodjele nacionalne sportske stipendije, potrebna dokumentacija, izgled i sadrzaj obrazaca te druga pitanja znacajna za dodjelu nacionalne sportske stipendije propisuju se pravilnikom iz clanka 77. stavka 9. ovoga Zakona. Sportska stipendija Clanak 81. (1) Sportsku stipendiju kategoriziranom sportasu za sportsko usavrSavanje moze, sukladno op\\u00a2em aktu, isplacivati Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih. (2) Sportsku stipendiju kategoriziranom sportasu, sukladno op\\u00a2cem aktu, moze isplacivati jedinica lokalne i podrucne (regionalne) samouprave, sportska zajednica, sportski savez i sportski klub. (3) Sportske stipendije iz clanka 80. ovoga Zakona i stavka 1. ovoga Clanka, ako se ispla\\u00a2cuju iz javnih izvora, medusobno se iskljucuju. Obrazovanje prema posebnim propisima Clanak 82. (1) Sportas moze ostvariti pravo na posebne uvjete pohadanja i zavrsetka osnovnog obrazovanja te pohadanja i zavrsetka srednjoskolskog obrazovanja, a visokog obrazovanja samo ako to nije protivno nacelima autonomije sveucilista za kategorizirane sportase i akademske samouprave vezano uz upis i pravila studiranja. (2) Sportas u dobi do 12 godina koji ne ostvaruje pravo na kategorizaciju sukladno pravilniku iz Clanka 14. stavka 14. ovoga Zakona, na temelju potvrde\", \"srednjoskolskog obrazovanja, a visokog obrazovanja samo ako to nije protivno nacelima autonomije sveucilista za kategorizirane sportase i akademske samouprave vezano uz upis i pravila studiranja. (2) Sportas u dobi do 12 godina koji ne ostvaruje pravo na kategorizaciju sukladno pravilniku iz Clanka 14. stavka 14. ovoga Zakona, na temelju potvrde nadleznog nacionalnog sportskog saveza i uz prethodnu suglasnost tijela drzavne uprave nadleznog za sport, moze pohadati osnovno obrazovanje sukladno uvjetima propisanim pravilnikom iz stavka 4. ovoga clanka. (3) Potvrda iz stavka 2. ovoga Clanka izdaje se za tekucu Skolsku godinu, uz ispunjenje najmanje dvaju od sljedecih kriterija: \\u2014 sudjelovanje na medunarodnim natjecanjima \\u2014 ostvareni rezultat od 1. do 10. mjesta na natjecanjima na nacionalnoj razini \\u2014 redoviti trening najmanje jedan sat dnevno najmanje Cetiri puta u tjednu. (4) Nacin pohadanja i zavrSetka obrazovanja pravilnikom propisuje celnik tijela drzavne uprave nadlezne za sport, uz prethodnu suglasnost \\u00a2celnika tijela drzavne uprave nadleznog za obrazovanje. Troskovi skolovanja Clanak 83. (1) Aktivnom i bivSem vrhunskom sportasu moze se odobriti sufinanciranje skolarine i troskova Skolovanja za studij na visokom uCilistu u svim znanstvenim i umjetnickim podrucjima ili pohadanje programa obrazovanja odraslih u Republici Hrvatskoj za stjecanje strucnih kvalifikacija za rad u sportu ako ima hrvatsko drzavljanstvo i nije pravomocno osuden za pocinjeno kazneno djelo iz clanka 111. stavaka 1. i 2. ovoga Zakona. (2) Odluku o sufinanciranju skolarine i troskova Skolovanja iz stavka 1. ovoga Clanka donosi Celnik tijela drzavne uprave nadleznog za sport na temelju javnog natjecaja, sukladno osiguranim sredstvima u drzavnom proracunu Republike Hrvatske. Nagrada za sportsko ostvarenje Clanak 84. Nagrada za sportsko ostvarenje sportasa i trenera je nagrada koja se dodjeljuje za sportska ostvarenja, odredena prema pravilniku iz clanka 77. stavka 9. ovoga Zakona. Troskovi bavljenja sportskom djelatnoscu Clanak 85. Sportas i trener mogu ostvariti pravo na pokrivanje osnovnih troskova za bavljenje sportskom djelatnoscu, a cine ga pravo na koristenje sportskih gradevina, sportske opreme, usluga strucnog rada, pokrivanje troskova za smjestaj i prehranu u vrijeme priprema i natjecanja, za pojacanu prehranu i za putne troskove, obrazovanje i usavrsavanje, sportsku opremu, a pravo mu moze osigurati sportski klub, sportski savez, sportska zajednica i krovna sportska udruzenja. DIO DESETI DRZAVNE NAGRADE Drzavna nagrada za sport \\u00bbFranjo Bucar\\u00ab Clanak 86. (1) Drzavna nagrada za sport \\u00bbFranjo Bucar\\u00ab (u daljnjem tekstu: Drzavna nagrada) najviSe je priznanje koje Republika Hrvatska dodjeljuje za iznimna postignu\\u00a2a i doprinos od osobitog znacenja za razvoj sporta u Republici Hrvatskoj. (2) Drzavna nagrada dodjeljuje se sportasima, trenerima, ostalim strucnim djelatnicima te drugim osobama zasluznim za razvoj sporta u Republici Hrvatskoj, a moze se dodijeliti i pravnim osobama. (3) Drzavna nagrada dodjeljuje se u obliku medalje s likom Franje Bucara, posebne diplome i novcane nagrade. Odbor Drzavne nagrade za sport \\u00bbFranjo Bucar\\u00ab Clanak 87. (1) Odluku o dodjeli Drzavne nagrade donosi Odbor Drzavne nagrade za sport \\u00bbFranjo Bucar\\u00ab (u daljnjem tekstu: Odbor Drzavne nagrade). (2) Predsjednika i osam Clanova Odbora Drzavne nagrade, na prijedlog celnika tijela drzavne uprave nadleznog za sport, imenuje Hrvatski sabor iz redova uglednih sportskih i javnih djelatnika, istaknutih sportaSa\", \"87. (1) Odluku o dodjeli Drzavne nagrade donosi Odbor Drzavne nagrade za sport \\u00bbFranjo Bucar\\u00ab (u daljnjem tekstu: Odbor Drzavne nagrade). (2) Predsjednika i osam Clanova Odbora Drzavne nagrade, na prijedlog celnika tijela drzavne uprave nadleznog za sport, imenuje Hrvatski sabor iz redova uglednih sportskih i javnih djelatnika, istaknutih sportaSa i drugih istaknutih strucnjaka iz podrucja sporta na vrijeme od Cetiri godine. (3) Odbor Drzavne nagrade donosi poslovnik 0 svom radu. Postupak dodjele Drzavne nagrade Clanak 88. (1) Drzavna nagrada dodjeljuje se kao godisnja nagrada i nagrada za zivotno djelo. (2) Svaka od nagrada iz stavka 1. ovoga Cclanka istoj se osobi moze dodijeliti samo jedanput. (3) Moze se dodijeliti najvise 15 Drzavnih nagrada u istoj godini, od Cega najvise tri za zivotno djelo. (4) Dodjela Drzavne nagrade od nacionalnog je interesa, a sredstva potrebna za dodjelu Drzavne nagrade osiguravaju se u drzavnom proracunu Republike Hrvatske. (5) Visinu novcanog dijela godisnje nagrade i nagrade za zivotno djelo odlukom utvrduje Celnik tijela drzavne uprave nadleznog za sport. (6) Izgled medalja i diploma, dodjelu Drzavne nagrade, kao i druga pitanja znacajna za dodjelu Drzavne nagrade pravilnikom propisuje \\u00a2celnik tijela drzavne uprave nadleznog za sport. Drzavna nagrada za vrhunska sportska postignuca Clanak 89. (1) Drzavna nagrada za vrhunska sportska postignuca je nagrada koja se dodjeljuje sportasu, sportskoj ekipi i drugom stru\\u00a2njaku u sustavu sporta, a koje predlaze nacionalni sportski savez. (2) Drzavna nagrada za vrhunska sportska postignuca dodjeljuje se za: \\u2014 osvojenu medalju na olimpijskim igrama / paraolimpijskim igrama / olimpijskim igrama gluhih te svjetskom i europskom seniorskom prvenstvu u olimpijskom/paraolimpijskom sportu i disciplini / olimpijskom sportu i disciplini za gluhe \\u2014 osvojenu zlatnu medalju na svjetskom i europskom seniorskom prvenstvu u neolimpijskom sportu / neparaolimpijskom sportu / neolimpijskom sportu gluhih koji u Republici Hrvatskoj ima tradiciju duzu od deset godina \\u2014 svjetski rekord oboren na seniorskom natjecanju u olimpijskom sportu / paraolimpijskom sportu / olimpijskom sportu za gluhe \\u2014 zlatnu medalju, odnosno osvojeno prvo mjesto na svjetskom/europskom seniorskom prvenstvu u neolimpijskoj disciplini olimpijskog sporta / neparaolimpijskoj disciplini paraolimpijskog sporta / neolimpijskoj disciplini olimpijskog sporta za gluhe. (3) Nagrade iz stavka 2. ovoga Cclanka dodjeljuju se samo za svjetska i europska prvenstva najviSe razine. (4) U slucaju dvojbe, nadlezni nacionalni sportski savez duzan je na zahtjev dostaviti dokaz 0 tome koji se rang natjecanja u smislu stavka 3. ovoga clanka smatra svjetskim i europskim prvenstvom najvise razine, sukladno pravilima nadleznog medunarodnog sportskog saveza. (5) Popis sportova iz stavka 2. podstavka 2. ovoga clanka donose Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih, uz prethodnu suglasnost tijela drzavne uprave nadleznog za sport. (6) Uzimajuci u obzir specificnosti sustava natjecanja svakog sporta sukladno sportskim pravilima pripadajucih medunarodnih sportskih federacija, ako se u odredenom sportu prvenstva na svjetskoj i/ili europskoj razini ne odrzavaju pod imenom svjetskog ili europskog prvenstva, vec pod drugim nazivom koji upucuje na tu razinu natjecanja, ona se prihvacaju pod uvjetom da predlagatelj iz stavka 8. ovoga clanka dostavi tijelu drzavne uprave nadleznom za sport popis takvih natjecanja po sportovima,\", \"odredenom sportu prvenstva na svjetskoj i/ili europskoj razini ne odrzavaju pod imenom svjetskog ili europskog prvenstva, vec pod drugim nazivom koji upucuje na tu razinu natjecanja, ona se prihvacaju pod uvjetom da predlagatelj iz stavka 8. ovoga clanka dostavi tijelu drzavne uprave nadleznom za sport popis takvih natjecanja po sportovima, sportskim granama i sportskim disciplinama. (7) Na razini europskog i svjetskog prvenstva za svaku sportsku disciplinu, sportsku granu i sport moze postojati samo jedno sluzbeno natjecanje koje se smatra europskim ili svjetskim prvenstvom u toj sportskoj disciplini, sportskoj grani ili sportu. Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih duzni su tijelu drzavne uprave nadleznom za sport dostaviti popis europskih i svjetskih prvenstava prema sportovima, sportskim granama i sportskim disciplinama. (8) Prijedlog za dodjelu drzavne nagrade podnosi nadlezni nacionalni sportski savez clan Hrvatskog olimpijskog odbora odnosno Hrvatski paraolimpijski odbor ili Hrvatski sportski savez gluhih tijelu drzavne uprave nadleznom za sport u roku od 30 dana od dana zavrSetka natjecanja. (9) Odluku o dodjeli drzavne nagrade donosi tijelo drzavne uprave nadlezno za sport. Sredstva za nagrade Clanak 90. (1) Sredstva za nagrade iz Clanka 89. ovoga Zakona osiguravaju se u drzavnom proracunu Republike Hrvatske. (2) Nov\\u00e9ani iznosi drzavnih nagrada za vrhunska sportska postignuca, nacin raspodjele novcane nagrade, postupak predlaganja, potrebna dokumentacija te nacin dodjele propisuju se pravilnikom iz Clanka 88. stavka 6. ovoga Zakona. Sportski dopust Clanak 91. (1) Za obavljanje sportskih djelatnosti zaposleni mogu ostvariti pravo na sportski dopust. (2) Ostvarivanje prava na sportski dopust utvrduju radnik i poslodavac sporazumno. DIO JEDANAESTI ODREDBE O SPORTSKOM DIONICKOM DRUSTVU I POSTUPKU PREOBLIKOVANJA Nastanak sportskog dionickog drustva Clanak 92. (1) Sportsko dionicko drustvo moze nastati osnivanjem novog druStva ili preoblikovanjem sportskog kluba - udruge za natjecanje u sportsko dionicko drustvo. (2) Na nastanak, djelovanje i prestanak sportskog dionickog drustva primjenjuju se odredbe zakona kojim se ureduju trgovacka druStva, osim kada je drukcije propisano ovim Zakonom. Temeljni kapital sportskog dionickog drustva Clanak 93. (1) Temeljni kapital sportskog dionickog druSstva utvrduje povjerenstvo za preoblikovanje nakon provedenog postupka financijske revizije. (2) Sportsko dionicko druStvo moze izdati samo redovne dionice na ime s nominalnim iznosom. Clanstvo u sportskom dionickom drustvu Clanak 94. (1) Jedna osoba ne moze imati dionice u vise sportskih dionickih druStava istoga sporta u iznosu visem od 1 % ukupnog temeljnog kapitala u bilo kojem od tih sportskih dionickih drustava. (2) Odredba stavka 1. ovoga clanka ne primjenjuje se na Republiku Hrvatsku niti na jedinice lokalne i podrucne (regionalne) samouprave. (3) Dionice u sportskom dioni\\u00a2kom druStvu izravno, neizravno ili preko povezanih osoba ne mogu imati osobe Ciji poslovi i djelatnosti mogu neposredno utjecati na sustav natjecanja u istome sportu, a osobito sportasi, sportski suci, posrednici u sportu te osobe koje su clanovi pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica. (4) Dionice u sportskom dionickom druStvu izravno, neizravno ili preko povezanih osoba ne moze imati sportsko dionicko druSstvo koje obavlja djelatnost sudjelovanja u sportskim natjecanjima istoga sporta. Povezane osobe Clanak 95. (1) Smatra se, u smislu ovoga Zakona, da su fizicke ili pravne osobe\", \"koje obavljaju djelatnost organiziranja sportskih kladionica. (4) Dionice u sportskom dionickom druStvu izravno, neizravno ili preko povezanih osoba ne moze imati sportsko dionicko druSstvo koje obavlja djelatnost sudjelovanja u sportskim natjecanjima istoga sporta. Povezane osobe Clanak 95. (1) Smatra se, u smislu ovoga Zakona, da su fizicke ili pravne osobe povezane: \\u2014 ako su ugovorile da uskladeno djeluju u vezi sa stjecanjem dionica izdavatelja ili u vezi s ostvarivanjem prava glasa prema izdavatelju \\u2014 ako jedna od njih drzi dionice za racun druge ili \\u2014 ako jedna od njih izravno ili neizravno kontrolira drugu ili druge pravne osobe. (2) Smatra se da fizicka ili pravna osoba kontrolira pravnu osobu ako ima: \\u2014 izravan ili neizravan vecinski udio u temeljnom kapitalu te osobe \\u2014 izravnu ili neizravnu vecinu glasackih prava u toj osobi \\u2014 pravo imenovati ili opozvati vecinu Clanova uprave ili nadzornog odbora odnosno upravnog odbora ili izvrsnog direktora odnosno drugog tijela koje upravlja ili vodi poslovanje te osobe ili \\u2014 na neki drugi nacin prevladavajuci utjecaj na tu osobu. (3) Smatra se da fizicke osobe djeluju zajednicki ako su u krvnom srodstvu u ravnoj liniji, braca i sestre i njihovi potomci, ako su bracni ili izvanbracni drugovi, zivotni partneri ili neformalni zivotni partneri ili ako su u odnosu posvojitelj \\u2014 posvojenik. Upotreba dobiti sportskog dionickog drustva Clanak 96. (1) Na upotrebu netodobiti sportskog dionickog druStva primjenjuju se odredbe sukladno propisu kojim se ureduju trgovacka druStva, ako odredbama ovoga Zakona nije drukCcije propisano. (2) Zakonskim rezervama sportskog dionickog druStva, u smislu ovoga Zakona, uz iznose koji se unose u zakonske rezerve odredene opcim propisima, smatraju se i posebne zakonske rezerve u koje se mora unositi dio netodobiti sportskog dionickog druStva. (3) U posebne zakonske rezerve sportskog dioni\\u00a2kog drustva moraju se unositi iznosi u visini najmanje polovice netodobiti koja preostane nakon Sto se, sukladno posebnom propisu kojim se ureduju trgovacka drustva, podmire gubici iz prijaSnjih godina te zakonske rezerve. (4) Posebne zakonske rezerve sportskog dionickog druStva iz stavka 3. ovoga clanka smiju se koristiti samo za obavljanje i unaprjedenje sportske djelatnosti sportske pripreme djece. Prijenos trazbina Clanak 97. (1) Republika Hrvatska moze posebnim ugovorom o prijenosu u kojem \\u00a2e se utvrditi prava i obveze ugovornih strana prenijeti svoje trazbine prema sportskom klubu - udruzi za natjecanje, na jedinicu lokalne samouprave u kojoj je sjediste sportskog kluba \\u2014 udruge za natjecanje. (2) Pravne osobe u kojima Republika Hrvatska ima vecinski udio ili vecinsko pravo glasa, posebnim ugovorom 0 prijenosu u kojem Ce se utvrditi prava i obveze ugovornih strana, mogu prenijeti svoje trazbine prema sportskom klubu \\u2014 udruzi za natjecanje, koja ce se preoblikovati u sportsko dionicko druStvo, na jedinicu lokalne samouprave u kojoj je sjediste sportskog kluba - udruge za natjecanje. Preoblikovanje sportskog kluba \\u2014 udruge za natjecanje u sportsko dionicko drustvo Clanak 98. (1) Sportski klub - udruga za natjecanja moze se preoblikovati u sportsko dionicko druStvo. (2) Oblik ne moze promijeniti udruga nad kojom je otvoren stecajni postupak, osim u provedbi stecajnog plana. (3) Preoblikovanje se upisuje u sudski\", \"Preoblikovanje sportskog kluba \\u2014 udruge za natjecanje u sportsko dionicko drustvo Clanak 98. (1) Sportski klub - udruga za natjecanja moze se preoblikovati u sportsko dionicko druStvo. (2) Oblik ne moze promijeniti udruga nad kojom je otvoren stecajni postupak, osim u provedbi stecajnog plana. (3) Preoblikovanje se upisuje u sudski registar. (4) Nacin i rokove provedbe preoblikovanja te druga pitanja znacajna za preoblikovanje propisuje pravilnikom \\u00a2elnik tijela drzavne uprave nadleznog za sport. Povjerenstvo za preoblikovanje Clanak 99. (1) Povjerenstvo za preoblikovanje je strucno i savjetodavno tijelo osnovano radi provedbe postupka preoblikovanja iz clanka 98. ovoga Zakona. (2) Povjerenstvo za preoblikovanje ima sedam Cclanova koje imenuje Celnik tijela drzavne uprave nadleznog za sport na sljedeci nacin: \\u2014 Sest stalnih Clanova iz reda stru\\u00a2njaka iz polja pravnih ili ekonomskih znanosti na temelju provedenog javnog natjecaja i \\u2014 jedan clan na prijedlog nacionalnog sportskog saveza Ciji je Clan sportski klub na koji se odnosi odluka koju Povjerenstvo za preoblikovanje treba donijeti. (3) Mandat clanova Povjerenstva za preoblikovanje traje pet godina. (4) Povjerenstvo za preoblikovanje obavlja sljedece poslove: \\u2014 Celniku tijela drzavne uprave nadleznog za sport predlaze davanje suglasnosti na elaborat o preoblikovanju \\u2014 Celniku tijela drzavne uprave nadleznog za sport predlaze davanje dopustenja o preoblikovanju. (5) Povjerenstvo za preoblikovanje ima pravo na naknadu za svoj rad, koja se obracunava po odrzanoj sjednici, a visina naknade odreduje se odlukom o imenovanju. (6) Nacin rada Povjerenstva za preoblikovanje pravilnikom iz clanka 98. stavka 4. ovoga Zakona propisuje celnik tijela drzavne uprave nadleznog za sport. DIO DVANAESTI NACIONALNO VIJECE ZA SPORT Nacionalno vijece za sport i njegove zadace Clanak 100. (1) Nacionalno vijece za sport je strucno i savjetodavno tijelo Hrvatskoga sabora koje se brine za razvoj i kvalitetu sporta u Republici Hrvatskoj. (2) Zadace Nacionalnog vije\\u00a2a za sport su: \\u2014 raspravljanje o pitanjima vaznim za razvoj sporta \\u2014 davanje misljenja na nacrte prijedloga propisa koji se odnose na sport \\u2014 davanje misljenja na nacrt prijedloga akata strateSkog planiranja iz Clanka 104. ovoga Zakona \\u2014 davanje misljenja na program javnih potreba u sportu na drzavnoj razini \\u2014 predlaganje mjera za unaprjedenje i razvoj sporta u Republici Hrvatskoj \\u2014 na trazenje tijela drzavne uprave nadleznog za sport daje prethodno misljenje o postojanju interesa za prijam u hrvatsko drzavljanstvo fizicke osobe u sustavu sporta koja je strani drzavljanin \\u2014 davanje misljenja na proglaSenje sportske gradevine gradevinom od nacionalnog interesa \\u2014 obavljanje drugih poslova utvrdenih ovim Zakonom i drugim propisima. Sastav Nacionalnog vijeca za sport Clanak 101. (1) Nacionalno vijece za sport ima predsjednika i 12 clanova koje imenuje Hrvatski sabor na razdoblje od Cetiri godine, vodeci racuna o zastupljenosti predstavnika s podrudja cijele Republike Hrvatske i ravnopravnoj spolnoj zastupljenosti, i to: \\u2014 predsjednika i Sest Clanova na prijedlog celnika tijela drzavne uprave nadleznog za sport i \\u2014 po jednog \\u00a2lana na prijedlog Hrvatskog olimpijskog odbora, Hrvatskog paraolimpijskog odbora, Hrvatskog sportskog saveza gluhih, Hrvatskog akademskog sportskog saveza i Hrvatskog Skolskog sportskog saveza te jednog predstavnika kinezioloskih fakulteta. (2) Kriterij za odabir predsjednika i Clanova Nacionalnog vijeca za sport je\", \"celnika tijela drzavne uprave nadleznog za sport i \\u2014 po jednog \\u00a2lana na prijedlog Hrvatskog olimpijskog odbora, Hrvatskog paraolimpijskog odbora, Hrvatskog sportskog saveza gluhih, Hrvatskog akademskog sportskog saveza i Hrvatskog Skolskog sportskog saveza te jednog predstavnika kinezioloskih fakulteta. (2) Kriterij za odabir predsjednika i Clanova Nacionalnog vijeca za sport je ostvareno sportsko postignuce ili znacajan strucan doprinos sustavu sporta. Izbor i mandat clanova Clanak 102. (1) Clanove iz \\u00e9lanka 101. stavka 1. podstavka 1. ovoga Zakona tijelo drzavne uprave nadlezZno za sport predlaze na temelju javnog poziva. (2) Clanovi Nacionalnog vije\\u00e9a za sport ne mogu biti duznosnici koje definira propis kojim se ureduje sprjecavanje sukoba interesa. (3) Predsjednika ili Clana Nacionalnog vijeca za sport Hrvatski sabor moze razrijeSiti duznosti i prije isteka vremena na koje je imenovan ako: \\u2014 sam zatrazi razrjesenje \\u2014 stupi na duZnost koja prijeci rad u Nacionalnom vijecu za sport \\u2014 ne ispunjava svoje obveze \\u2014 izgubi sposobnost obavljanja duznosti ili \\u2014 svojim postupcima povrijedi ugled duznosti koju obavlja. (4) U slucaju razrjeSenja iz stavka 3. ovoga clanka Hrvatski sabor imenuje novog predsjednika ili Clana Nacionalnog vijeca za sport do isteka mandata razrijeSenog predsjednika ili Clana. (5) Novi predsjednik ili Clan Nacionalnog vijeca za sport imenuje se na temelju prijedloga prikupljenih u javnom pozivu iz stavka 1. ovoga clanka. Program i nacin rada Clanak 103. (1) Nacionalno vijece za sport donosi poslovnik o radu. (2) Nacionalno vijece za sport sve odluke donosi vecinom glasova ako je na sjednici nazocna natpolovicna vecina Clanova, a u slucaju jednakog broja glasova glas predsjednika je odlucujuci. (3) Nacionalno vijece za sport odrzava sjednice najmanje osam puta godisnje. (4) Nacionalno vijece za sport donosi program rada za mandatno razdoblje te godisnji program rada koji potvrduje celnik tijela drzavne uprave nadleznog za sport. (5) Nacionalno vijece za sport za svoj rad odgovara Hrvatskome saboru, kojem podnosi izvjestaj najmanje jedanput godisnje. (6) Administrativne i strucne poslove Nacionalnog vijeca za sport obavlja tijelo drzavne uprave nadlezno za sport. (7) Nacionalno vijece za sport ima pravo na naknadu za svoj rad. DIO TRINAESTI PROVEDBA ZAKONA Stratesko planiranje Clanak 104. (1) StrateSko planiranje razvoja sporta na nacionalnoj razini ostvaruje se donoSenjem i provedbom nacionalne strategije razvoja sporta i nacionalnog plana razvoja sporta. (2) Svi akti strateSkog planiranja na razini jedinice lokalne i podrucne (regionalne) samouprave moraju, u dijelu koji govori 0 sportu, biti uskladeni sa strateskim dokumentima iz stavka 1. ovoga \\u00a2lanka. Godisnji program rada Clanak 105. (1) Krovna sportska udruzenja i nacionalni sportski savezi duzni su donijeti godisnji program rada za sljedecu godinu i financijski plan za njegovu provedbu, u skladu s propisom kojim se ureduje financijsko poslovanje i racunovodstvo neprofitnih organizacija. (2) Godisnji program rada mora sadrzavati planirane aktivnosti i sredstva za njihovu provedbu, kao i naznaku financira li se aktivnost iz vlastitih sredstava ili iz javnih izvora. Financijski nadzor i izvjestavanje Clanak 106. (1) Pravne osobe u sustavu sporta obvezne su izradivati godisnje financijske izvjestaje te ih javno objavljivati sukladno odredbama posebnih propisa kojima je uredeno podrucje financijskog poslovanja i racunovodstva. (2) Krovna\", \"kao i naznaku financira li se aktivnost iz vlastitih sredstava ili iz javnih izvora. Financijski nadzor i izvjestavanje Clanak 106. (1) Pravne osobe u sustavu sporta obvezne su izradivati godisnje financijske izvjestaje te ih javno objavljivati sukladno odredbama posebnih propisa kojima je uredeno podrucje financijskog poslovanja i racunovodstva. (2) Krovna sportska udruzenja duzna su tijelu drzavne uprave nadleznom za sport dostaviti izvjestaj o potrosnji proracunskih sredstava u skladu s ovim Zakonom te propisima kojim se ureduje financijsko poslovanje i racunovodstvo neprofitnih organizacija. (3) Krovna sportska udruzenja i nacionalni sportski savezi duzni su izvjestaj iz stavka 2. ovoga Clanka unijeti u Nacionalni informacijski sustav u sportu. Nadzor nad namjenskim trosenjem proracunskih sredstava Clanak 107. (1) Nadzor nad namjenskim troSenjem javnih sredstava provodi tijelo drzavne uprave nadlezno za sport odnosno jedinica lokalne i podrucne (regionalne) samouprave za dio javnih sredstava koja isplacuje. (2) Tijelo nadlezno za provedbu nadzora iz stavka 1. ovoga clanka obavlja nadzor na temelju dokumentacije zatrazene od nadzirane pravne osobe, izvjeS\\u00a2a, podataka, materijala i drugih obavijesti. (3) Tijelo nadlezno za provedbu nadzora iz stavka 1. ovoga Clanka moze naloziti nadziranoj pravnoj osobi pribavljanje misljenja neovisnog revizora o namjenskom troSenju javnih sredstava. (4) O provedenom nadzoru tijelo nadlezno za provedbu nadzora sastavlja izvjesce koje se dostavlja nadziranoj pravnoj osobi. (5) Na temelju izvjeSca o provedenom nadzoru tijelo nadlezno za provedbu nadzora moze naloziti otklanjanje nepravilnosti i povrat sredstava. Upravni i inspekcijski nadzor Clanak 108. (1) Upravni nadzor nad primjenom ovoga Zakona i propisa donesenih na temelju ovoga Zakona obavlja tijelo drzavne uprave nadlezno za sport. (2) Inspekcijski nadzor nad provedbom ovoga Zakona i na temelju njega donesenih propisa te opcih akata pravnih osoba u sustavu sporta provode sportski inspektori u skladu s posebnim zakonom. Strucni nadzor Clanak 109. (1) Strucni nadzor nad obavljanjem strucnih poslova iz clanka 4. ovoga Zakona provode krovna sportska udruzenja i nacionalni sportski savezi. (2) Svrha provodenja strucnog nadzora je poboljsanje i unaprjedenje obavljanja strucnih poslova. (3) Nakon obavljenog strucnog nadzora sastavlja se nalaz o strucnom nadzoru koji moze sadrzavati preporuke za poboljsanje i unaprjedenje obavljanja strucnih poslova. (4) Krovna sportska udruzenja opcim aktom ureduju postupak provedbe strucnog nadzora te su obvezna izvjestavati tijelo drzavne uprave nadlezno za sport 0 rezultatima provedenog nadzora. (5) IzvjeSce iz stavka 4. ovoga clanka dostavlja se do 31. ozujka tekuce godine za nadzore provedene u protekloj kalendarskoj godini. Nadzor nad strucnim radom nacionalnih sportskih saveza Clanak 110. (1) Nadzor nad strucnim radom nacionalnih sportskih saveza provode krovna sportska udruzenja. (2) Kriterij za vrednovanje rada krovnih sportskih udruzenja i nacionalnih sportskih saveza su kriteriji iz clanka 70. stavka 6. ovoga Zakona. (3) Nadzor iz stavka 1. ovoga clanka provodi se periodicno, a najmanje jednom u Cetiri godine. (4) O provedenom nadzoru sastavlja se izvjeSce koje se dostavlja nadziranom savezu i tijelu drzavne uprave nadleznom za sport. (5) Na temelju izvjeSca o provedenom nadzoru tijelo nadlezno za provedbu nadzora moze naloziti otklanjanje nepravilnosti ili prijaviti nepravilnost sportskoj inspekciji. DIO CETRNAESTI ZAPREKE ZA OBAVLJANJE POSLOVA U SUSTAVU SPORTA Zapreke za obavijanje poslova u\", \"sastavlja se izvjeSce koje se dostavlja nadziranom savezu i tijelu drzavne uprave nadleznom za sport. (5) Na temelju izvjeSca o provedenom nadzoru tijelo nadlezno za provedbu nadzora moze naloziti otklanjanje nepravilnosti ili prijaviti nepravilnost sportskoj inspekciji. DIO CETRNAESTI ZAPREKE ZA OBAVLJANJE POSLOVA U SUSTAVU SPORTA Zapreke za obavijanje poslova u sportu Clanak 111. (1) Osoba koja je pravomocno osudena za neko od kaznenih djela protiv zivota i tijela, protiv slobode i prava covjeka i gradanina, protiv Republike Hrvatske, protiv vrijednosti zasti\\u00a2enih medunarodnim pravom, protiv spolne slobode i spolnog cudoreda, protiv braka, obitelji i mladezi, protiv imovine, protiv sigurnosti pravnog prometa i poslovanja, protiv pravosuda, protiv vjerodostojnosti isprava, protiv javnog reda i protiv sluzbene duznosti, a koje je propisano Kaznenim zakonom (\\u00bbNarodne novine\\u00ab, br. 110/97., 27/98. \\u2014 ispravak, 50/00. - Odluka Ustavnog suda Republike Hrvatske, 129/00., 51/01., 111/03., 190/03. - Odluka Ustavnog suda Republike Hrvatske, 105/04., 84/05. \\u2014 ispravak, 71/06., 110/07., 152/08., 57/11. i 77/11. - Odluka Ustavnog suda Republike Hrvatske), ne moze organizirati i voditi sportska natjecanja, obavljati strucne poslove u sportu, sudjelovati u radu skupStine ili drugog tijela sportske udruge ili trgovackog druStva niti moze biti ovlastena za zastupanje te pravne osobe. (2) Osoba koja je pravomocno osudena za neko od kaznenih djela protiv zivota i tijela, protiv Republike Hrvatske, protiv pravosuda, protiv javnog reda, protiv imovine, protiv sluzbene duznosti, protiv Covjecnosti i ljudskog dostojanstva, protiv osobne slobode, protiv spolne slobode, spolnog zlostavljanja i iskoriStavanja djeteta, protiv braka, obitelji i djece, protiv zdravlja ljudi, protiv opce sigurnosti, protiv krivotvorenja, a koje je propisano Kaznenim zakonom (\\u00bbNarodne novinex, br. 125/11., 144/12., 56/15., 61/15. \\u2014 ispravak, 101/17., 118/18., 126/19., 84/21. i 114/22.), ne moze organizirati i voditi sportska natjecanja, obavljati strucne poslove u sportu, sudjelovati u radu skupStine ili drugog tijela sportske udruge ili trgovackog druStva niti moze biti ovlaStena za zastupanje te pravne osobe. (3) Pravna osoba duzna je u roku od tri dana nakon saznanja za pravomocnu osudu iz stavaka 1. i 2. ovoga clanka udaljiti osudenu osobu od obavljanja sportske djelatnosti. (4) Pravna osoba duzna je raskinuti ugovor o radu ili drugi ugovor na temelju kojeg osoba iz stavaka 1. i 2. ovoga Clanka obavlja poslove ili sportsku djelatnost u roku od osam dana odnosno razrijesiti je duznosti u roku od 30 dana od saznanja za pravomocnu presudu i 0 tome obavijestiti registarsko tijelo. (5) Ako pravna osoba u sustavu sporta kao poslodavac sazna da je protiv osobe koja obavlja sportske djelatnosti pokrenut i vodi se kazneni postupak za kazneno djelo na Sstetu djeteta odnosno maloljetnika, udaljit ce osobu od obavljanja poslova u sportu u kojima dolazi u kontakt s djecom odnosno maloljetnicima do obustave kaznenog postupka odnosno najduze do pravomocnosti sudske presude. Zapreke za obavljanje poslova upravljanja u sportskom klubu Clanak 112. (1) Ista fizicka osoba moze biti osoba ovlastena za zastupanje ili osoba ovlastena za vodenje poslova, clan uprave, nadzornog tijela, upravnog tijela ili izvrsni direktor samo u jednom sportskom klubu u istom sportu. (2) Osoba ovlastena za zastupanje ili osoba ovlaStena za vodenje poslova, clan\", \"u sportskom klubu Clanak 112. (1) Ista fizicka osoba moze biti osoba ovlastena za zastupanje ili osoba ovlastena za vodenje poslova, clan uprave, nadzornog tijela, upravnog tijela ili izvrsni direktor samo u jednom sportskom klubu u istom sportu. (2) Osoba ovlastena za zastupanje ili osoba ovlaStena za vodenje poslova, clan uprave, clan nadzornog tijela, clan upravnog tijela ili izvrsni direktor sportskog kluba ne moze biti osoba: \\u2014 koja je pravomoc\\u00a2no osudena za kazneno djelo propisano clankom 111. stavcima 1. i 2. ovoga Zakona ili protiv koje se vodi kazneni postupak za kazneno djelo na Stetu djeteta odnosno maloljetnika \\u2014 koja je clan upravljackog tijela ili dioni\\u00a2ar drugog sportskog kluba u istome sportu \\u2014 koja je clan tijela, osoba ovlastena za zastupanje ili osoba ovlastena za vodenje poslova prema odluci ovlastenog tijela ili na temelju opceg akta sportskog kluba u istome sportu \\u2014 koja je profesionalni sporta$ u ugovornom odnosu sukladno clanku 11. ovoga Zakona s drugim sportskim klubom u istome sportu \\u2014 koja je ili je posljednjih godinu dana bila posrednik u istome sportu \\u2014 koja ima ili je posljednjih godinu dana imala sklopljen ugovor sa sportasem ili trenerom na temelju kojega ostvaruje pravo na dio prihoda koji proizlaze iz obavljanja djelatnosti sportaSa ili trenera \\u2014 koja je ovlastena za zastupanje u pravnoj osobi koja ima sklopljen ugovor sa sportasem ili trenerom na temelju kojega ostvaruje pravo na dio prihoda koji proizlazi iz obavljanja djelatnosti sportaSa ili trenera \\u2014 koja je ili je posljednjih godinu dana bila Clan ili clan tijela pravne osobe koja obavlja djelatnost organiziranja sportske kladionice ili \\u2014 koja s posrednicima u istome sportu i Clanovima pravnih osoba te clanovima tijela pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica djeluje zajednicki u smislu clanka 95. stavka 3. ovoga Zakona. Zapreke za upravijanje u sportskom savezu u jedinici lokalne ili podrucne (regionalne) samouprave i sportskoj zajednici Clanak 113. Clan tijela, osoba ovlaStena za zastupanje te osoba ovlastena za vodenje poslova prema odluci ovla\\u2019tenog tijela ili na temelju opceg akta sportskog saveza u jedinici lokalne ili podrucne (regionalne) samouprave ili sportske zajednice ne moze biti osoba: \\u2014 koja je pravomocno osudena za kazneno djelo propisano clankom 111. stavcima 1. i 2. ovoga Zakona ili protiv koje se vodi kazneni postupak za kazneno djelo na Stetu djeteta odnosno maloljetnika \\u2014 koja je ili je posljednjih godinu dana bila posrednik u sportu \\u2014 koja ima ili je posljednjih godinu dana imala sklopljen ugovor sa sportasem ili trenerom na temelju kojega ostvaruje pravo na dio prihoda koji proizlaze iz obavljanja djelatnosti sportaSa ili trenera \\u2014 koja je ovlaStena za zastupanje u pravnoj osobi koja ima sklopljen ugovor sa sportasem ili trenerom na temelju kojega ostvaruje pravo na dio prihoda koji proizlazi iz obavljanja djelatnosti sportaSa ili trenera \\u2014 koja je ili je posljednjih godinu dana bila clan ili clan tijela pravne osobe koja obavlja djelatnost organiziranja sportske kladionice ili \\u2014 koja s posrednicima u istome sportu i clanovima pravnih osoba te clanovima tijela pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica djeluje\", \"obavljanja djelatnosti sportaSa ili trenera \\u2014 koja je ili je posljednjih godinu dana bila clan ili clan tijela pravne osobe koja obavlja djelatnost organiziranja sportske kladionice ili \\u2014 koja s posrednicima u istome sportu i clanovima pravnih osoba te clanovima tijela pravnih osoba koje obavljaju djelatnost organiziranja sportskih kladionica djeluje zajednicki u smislu clanka 95. stavka 3. ovoga Zakona. Zapreke za upravijanje u nacionalnom sportskom savezu i krovnim sportskim udruZenjima Clanak 114. Clan tijela, osoba ovlaStena za zastupanje te osoba ovlastena za vodenje poslova prema odluci ovla8tenog tijela ili na temelju opceg akta nacionalnog sportskog saveza ili krovnog sportskog udruzenja ne moze biti osoba koja je pravomocno osudena za kaznena djela iz clanka 111. stavaka 1. i 2. ovoga Zakona. Zapreke za obavijanje poslova organiziranja 1 vodenja sportskog natjecanja Clanak 115. (1) Sudac u nogometu, koSarci, rukometu, odbojci i vaterpolu ili osoba koja je u posljednjih godinu dana sudjelovala u organiziranju i vodenju sportskog natjecanja, u tom sportu ne moze biti: \\u2014 clan upravljackog tijela sportskog kluba \\u2014 osoba koja ima vlasnicka prava u sportskom dionickom druStvu i \\u2014 osoba ovlastena za zastupanje sportskog kluba. (2) Delegat u nogometu, koSarci, ruakometu, odbojci i vaterpolu ne moze obavljati navedenu duznost ako u tom rangu natjecanja, koje moze podrazumijevati i ligaska i kup natjecanja toga sporta, sudjeluje sportski klub s kojim je povezan na nacin iz stavka 1. ovoga Clanka. DIO PETNAESTI PREKRSAJNE ODREDBE Prekrsaj pravne osobe u sportu Clanak 116. (1) Novcanom kaznom u iznosu od 700,00 do 3000,00 eura kaznit ce se za prekrSaj pravna osoba u sportu ako: \\u2014 zakljuci ugovor sa sportaSem suprotno odredbi clanka 11. stavaka 1., 2., 3., 5., 6.19. ovoga Zakona (clanak 11. stavak 1., 2., 3., 5., 6.19.) \\u2014 dopusti da u sportskom natjecanju sudjeluje osoba kojoj nije utvrdena zdravstvena sposobnost (clanak 15.) \\u2014 ne postuje pravila tijela nadleznog za borbu protiv dopinga iz clanka 16. stavka 1. ovoga Zakona (Clanak 16.) \\u2014 povjeri obavljanje strucnih poslova u sportu osobi koja za to ne ispunjava uvjete navedene u clancima 18. do 21., a kako je propisano clankom 42. ovoga Zakona \\u2014 obavlja sportsku djelatnost prije nego Sto bude upisana u Registar pravnih osoba u sportu koji je sastavni dio Nacionalnog informacijskog sustava u sportu u skladu s clankom 42. ovoga Zakona \\u2014 ne osigura sigurnost i pruzanje medicinske pomoci u skladu s clankom 57. ovoga Zakona \\u2014 ne unosi podatke u Nacionalni informacijski sustav u sportu u skladu s clankom 66. ovoga Zakona \\u2014 proracunska sredstva trosi nenamjenski (clanak 69.) \\u2014 obavlja poslove suprotno odredbama o zaprekama i ograni\\u00a2cenjima iz Clanaka 111. do 115. ovoga Zakona \\u2014 ne objavi op\\u00a2i akt sukladno clanku 37. stavku 6. ovoga Zakona \\u2014 ne objavi godisnji financijski izvjestaj sukladno Clanku 106. ovoga Zakona \\u2014 ne uskladi op\\u00e9e akte s ovim Zakonom kako je propisano clankom 120. ovoga Zakona. (2) Za prekrSaj iz stavka 1. ovoga clanka kaznit \\u00a2e se i odgovorna osoba u pravnoj osobi novCanom kaznom u iznosu od 650,00 do 2000,00 eura. Prekrgaj fizicke osobe Clanak\", \"sukladno Clanku 106. ovoga Zakona \\u2014 ne uskladi op\\u00e9e akte s ovim Zakonom kako je propisano clankom 120. ovoga Zakona. (2) Za prekrSaj iz stavka 1. ovoga clanka kaznit \\u00a2e se i odgovorna osoba u pravnoj osobi novCanom kaznom u iznosu od 650,00 do 2000,00 eura. Prekrgaj fizicke osobe Clanak 117. Novcanom kaznom u iznosu od 650,00 do 2000,00 eura kaznit \\u00a2e se fizi\\u00a2ka osoba koja obavlja djelatnost u sustavu sporta ako: \\u2014 obavlja strucne poslove u sportu, a ne ispunjava uvjete iz clanaka 18. do 21. ovoga Zakona \\u2014 obavlja samostalnu sportsku djelatnost prije upisa u Registar samostalne sportske djelatnosti ili nastavi obavljati sportsku djelatnost nakon brisanja iz Registra samostalne sportske djelatnosti \\u2014 ne obavijesti tijelo drzavne uprave o prestanku okolnosti iz clanka 77. stavka 2. ovoga Zakona. DIO SESNAESTI PRIJELAZNE I ZAVRSNE ODREDBE Obavijanje poslova Clanak 118. (1) Osoba koja je ostvarila pravo na obavljanje regulirane profesije iz podrucja sporta na temelju odredbe clanka 9. stavka 2. Zakona o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. \\u2014 ispravak, 98/19., 47/20. i 77/20.) moze obavljati poslove trenera 4. razine iz Clanka 19. ovoga Zakona. (2) Osoba koja je do dana stupanja na snagu ovoga Zakona upisala ili zavrsila program iz Clanka 9. stavka 3. Zakona o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. \\u2014 ispravak, 98/19., 47/20. i 77/20.) moze nakon zavrsetka programa obavljati poslove trenera propisane Cclankom 19. ovoga Zakona. (3) Osoba koja je ostvarila pravo na obavljanje regulirane profesije iz podrucja sporta na temelju odredbe clanka 9. stavaka 3. i4. Zakona o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. \\u2014 ispravak, 98/19., 47/20. i 77/20.) moze obavljati poslove trenera 3. razine iz Clanka 19. ovoga Zakona. (4) Osoba koja je do dana stupanja na snagu ovoga Zakona upisala ili zavrsila program iz clanka 10. Zakona o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. \\u2014 ispravak, 98/19., 47/20. i 77/20.) moze nakon zavrsetka programa obavljati poslove instruktora propisane clankom 18. ovoga Zakona. (5) Osoba koja je ostvarila pravo na obavljanje regulirane profesije iz podrucja sporta na temelju odredbe clanka 10. Zakona o sportu (\\u00bbNarodne novine\\u00ab, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. \\u2014 ispravak, 98/19., 47/20. i 77/20.) moze obavljati poslove u sportu iz clanka 18. ovoga Zakona. (6) Rok za upis pravnih osoba koje djeluju u sustavu sporta, a registrirane su na temelju odredbi Zakona o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. \\u2014 ispravak, 98/19., 47/20. i 77/20.), u registar iz Clanka 65. ovoga Zakona je tri mjeseca od dana stupanja na snagu ovoga Zakona. Prva kategorizacija sportova Clanak 119. (1) Prva kategorizacija sportova iz Clanka 5. ovoga Zakona donijet ce se najkasnije u roku od Sest mjeseci od dana stupanja na snagu pravilnika iz Clanka 6. stavka 4. ovoga Zakona. (2) Kategorizacija sportova koja \\u00a2ce biti prvi put donesena od dana stupanja na snagu ovoga Zakona predstavlja iznimku\", \"119. (1) Prva kategorizacija sportova iz Clanka 5. ovoga Zakona donijet ce se najkasnije u roku od Sest mjeseci od dana stupanja na snagu pravilnika iz Clanka 6. stavka 4. ovoga Zakona. (2) Kategorizacija sportova koja \\u00a2ce biti prvi put donesena od dana stupanja na snagu ovoga Zakona predstavlja iznimku od propisanog clankom 5. stavkom 4. ovoga Zakona. (3) Do donoSenja odluke iz clanka 5. stavka 5. ovoga Zakona program javnih potreba donijet ce se u skladu s Kriterijima za vrednovanje programa nacionalnih sportskih saveza koje je na temelju Zakona o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. \\u2014 ispravak, 98/19., 47/20. i 77/20.) donio Hrvatski olimpijski odbor. Obveza uskladivanja opcih akata Clanak 120. (1) Hrvatski olimpijski odbor, Hrvatski paraolimpijski odbor i Hrvatski sportski savez gluhih duzni su u roku od tri mjeseca od dana stupanja na snagu ovoga Zakona donijeti nacela i osnovne elemente sustava sportskih natjecanja sukladno ovome Zakonu. (2) Krovna sportska udruzenja duzna su u roku od tri mjeseca od dana stupanja na snagu ovoga Zakona uskladiti svoje akte i poslovanje s odredbama ovoga Zakona. (3) Nacionalni sportski savezi duzni su u roku od godinu dana od dana stupanja na snagu ovoga Zakona donijeti opce akte uskladene s odredbama ovoga Zakona. (4) Zupanijski sportski savezi i nacionalni sportski savezi duZni su uskladiti svoje akte i poslovanje s odredbama ovoga Zakona u roku od Sest mjeseci od dana stupanja na snagu ovoga Zakona. (5) Iznimno od obveze uskladivanja iz ovoga Clanka, sportska dionicka drustva osnovana prije donoSenja ovoga Zakona ne moraju mijenjati naziv u sportska dionicka drustva i mogu koristiti naziv Sportsko dionicko druStvo i kraticu \\u00bb$.d.d.\\u00ab. (6) Iznimno od \\u00a2clanka 30. stavka 4. ovoga Zakona, pravna osoba koja je registrirana za sudjelovanje u sportskom natjecanju, a koja je registrirana do dana stupanja na snagu ovoga Zakona kao drustvo ne mora mijenjati naziv u sportski klub. Rok za donoSsenje podzakonskih akata Clanak 121. (1) Celnik tijela drzavne uprave nadleznog za sport \\u00a2e u roku od Sest mjeseci od dana stupanja na snagu ovoga Zakona donijeti pravilnike iz clanka 6. stavka 4., Clanka 10. stavka 9., clanka 14. stavka 14., clanka 18. stavka 6., Clanka 57. stavka 3., clanka 61. stavka 4., Clanka 64. stavka 5., clanka 69. stavka 9., clanka 77. stavka 9., clanka 82. stavka 4., clanka 88. stavka 6. i clanka 98. stavka 4. ovoga Zakona. (2) Celnik tijela drzavne uprave nadleznog za zdravstvo \\u00a2e u roku od est mjeseci od dana stupanja na snagu ovoga Zakona donijeti pravilnik iz clanka 15. stavka 5. ovoga Zakona. Postojeci ugovori Clanak 122. (1) Sportski klubovi obvezni su uskladiti ugovore o stipendiranju i ostale ugovore koji nisu u skladu s odredbama ovoga Zakona ili ih raskinuti i ponuditi sklapanje odgovarajuceg ugovora u skladu sa Zakonom najkasnije u roku od jedne godine od dana stupanja na snagu ovoga Zakona. (2) Obveza iz stavka 1. ovoga Clanka odnosi se i na osobe kojima je planiranje, programiranje, provodenje i kontrola sportske pripreme u sportskom klubu osnovno zanimanje.\", \"ih raskinuti i ponuditi sklapanje odgovarajuceg ugovora u skladu sa Zakonom najkasnije u roku od jedne godine od dana stupanja na snagu ovoga Zakona. (2) Obveza iz stavka 1. ovoga Clanka odnosi se i na osobe kojima je planiranje, programiranje, provodenje i kontrola sportske pripreme u sportskom klubu osnovno zanimanje. Uskladivanje rjesenja za trajne naknade osvajacima medaija i stipendije Clanak 123. (1) Korisnicima prava na trajne naknade, koji su ta prava ostvarili na temelju clanka 81.a stavka 3. Zakona 0 sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. - ispravak, 98/19., 47/20. i 77/20.), osiguravaju se ta prava i nakon toga dana u istom opsegu i uskladuju se prema ovome Zakonu. (2) Sportske stipendije kategoriziranim sportasima isplacivat ce se prema odredbama Clanka 7. stavka 3. Zakona o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. \\u2014 ispravak, 98/19., 47/20. i 77/20.) do donoSenja odluke iz clanka 80. stavka 4. ovoga Zakona. Uskladivanje opcih akata Clanak 124. Do dana stupanja na snagu pravilnika iz clanka 69. stavka 9. ovoga Zakona financiranje izgradnje sportskih gradevina provodit ce se prema odredbama Zakona o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08, 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. - ispravak, 98/19., 47/20. i 77/20.). Mandat predsjednika i clanova Odbora drzavne nagrade za sport \\u00bbFranjo Bucar\\u00ab i Nacionalnog vijeca za sport Clanak 125. (1) Mandat predsjednika i clanova Odbora drzavne nagrade za sport \\u00bbFranjo Bucar\\u00ab i Povjerenstva za profesionalne Sportske klubove, imenovanih prema odredbama Zakona o sportu (\\u00bbNarodne novine\\u00ab, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. - ispravak, 98/19., 47/20. i 77/20.), traje do isteka mandata, sukladno odredbama toga Zakona. (2) Mandat predsjednika i Clanova Nacionalnog vijeca za sport, imenovanih prema odredbama Zakona o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. \\u2014 ispravak, 98/19., 47/20. i 77/20.), traje do imenovanja predsjednika i clanova Nacionalnog vijeca za sport sukladno odredbama ovoga Zakona. Primjena propisa Clanak 126. (1) Do stupanja na snagu propisa iz Clanka 121. ovoga Zakona ostaju na snazi propisi koji su doneseni na temelju Zakona o sportu (\\u00bbNarodne novinex\\u00ab, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. - ispravak, 98/19., 47/20. i 77/20.), i to: \\u2014 Uredba o dodjeljivanju trajnih novcanih mjese\\u00a2nih naknada osvajacima medalja na olimpijskim igrama, paraolimpijskim igrama, olimpijskim igrama gluhih i svjetskim seniorskim prvenstvima u olimpijskim sportovima i disciplinama (\\u00bbNarodne novine\\u00ab, br. 113/13.) \\u2014 Uredba o kriterijima za dodjeljivanje drzavnih nagrada za vrhunska sportska postignuca (\\u00bbNarodne novine\\u00ab, br. 129/17.) \\u2014 Pravilnik o prostornim standardima, normativima te urbanisti\\u00a2ko-tehnickim uvjetima za planiranje mreze Sportskih objekata (\\u00bbNarodne novinex, br. 38/91.) \\u2014 Pravilnik o sigurnosti na uredenim skijalistima (\\u00bbNarodne novine\\u00ab, br. 68/91.) \\u2014 Pravilnik 0 Registru Sportskih djelatnosti (\\u00bbNarodne novine\\u00ab, br. 112/06.) \\u2014 Pravilnik o registru profesionalnih Sportskih klubova (\\u00bbNarodne novine\\u00ab, br. 11/07.) \\u2014 Pravilnik o nacinu i rokovima podnoSenja akata Povjerenstvu za profesionalne Sportske klubove (\\u00bbNarodne novinex, br. 11/07.) \\u2014 Pravilnik o djelokrugu i nacinu rada Povjerenstva za profesionalne Sportske klubove (\\u00bbNarodne novine\\u00ab, br. 11/07.) \\u2014 Pravilnik o Drzavnoj nagradi\", \"112/06.) \\u2014 Pravilnik o registru profesionalnih Sportskih klubova (\\u00bbNarodne novine\\u00ab, br. 11/07.) \\u2014 Pravilnik o nacinu i rokovima podnoSenja akata Povjerenstvu za profesionalne Sportske klubove (\\u00bbNarodne novinex, br. 11/07.) \\u2014 Pravilnik o djelokrugu i nacinu rada Povjerenstva za profesionalne Sportske klubove (\\u00bbNarodne novine\\u00ab, br. 11/07.) \\u2014 Pravilnik o Drzavnoj nagradi za Sport Franjo Bucar (\\u00bbNarodne novine\\u00ab, br. 30/07.) \\u2014 Pravilnik 0 mjerilima za dodjelu nagrada sportaSima za sportska ostvarenja (\\u00bbNarodne novinex, br. 46/14. i 9/17.) \\u2014 Pravilnik o metodologiji, rokovima za izradu i dostavu, nacinu izvrSavanja programa javnih potreba, o nacinu i rokovima izvjestavanja o provedbi programa te o metodologiji izrade financijskog plana javnih potreba u sportu (\\u00bbNarodne novinex, br. 108/17.) \\u2014 Pravilnik o informacijskom sustavu u sportu (\\u00bbNarodne novine\\u00ab, br. 25/19.). (2) Opci akti koji vaze na temelju odredbi Zakona o sportu (\\u00bbNarodne novine\\u00ab, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. - ispravak, 98/19., 47/20. i 77/20.) ostaju na snazi do donoSenja op\\u00a2ih akata na temelju ovoga Zakona. (3) Do donoSenja pravilnika iz Clanka 15. stavka 5. ovoga Zakona, u sportskom natjecanju moze sudjelovati osoba za koju je u razdoblju od Sest mjeseci prije sportskog natjecanja utvrdena op\\u00a2a zdravstvena sposobnost, koju ce utvrdivati ovlasteni lijecnik odnosno specijalist sportske medicine, specijalist medicine rada i sporta ili lijecnici drugih specijalnosti koji imaju zavrSeni poslijediplomski studij iz medicine rada i sporta. Zapoceti postupci Clanak 127. Postupci zapoceti prema odredbama Zakona o sportu (\\u00bbNarodne novine\\u00ab, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. - ispravak, 98/19., 47/20. i 77/20.), propisa i opcih akata donesenih na temelju toga Zakona dovrSit Ce se prema odredbama toga Zakona, propisa i opcih akata. Prestanak vazenja propisa Clanak 128. Danom stupanja na snagu ovoga Zakona prestaju vaziti: \\u2014 Zakon o sportu (\\u00bbNarodne novinex, br. 71/06., 150/08., 124/10., 124/11., 86/12., 94/13., 85/15., 19/16. - ispravak, 98/19., 47/20. i 77/20.) \\u2014 Pravilnik o nacinu osnivanja, zadacama, djelokrugu i nacinu rada Skolskih sportskih saveza (\\u00bbNarodne novine\\u00ab, br. 136/06.) \\u2014 Pravilnik o nacinu osnivanja, zadacama, djelokrugu i nacinu rada Skolskih sportskih drustava (\\u00bbNarodne novine\\u00ab, br. 13/14.) \\u2014 Pravilnik 0 postupku pred Vije\\u00a2em sportske arbitraze Hrvatskog olimpijskog odbora (\\u00bbNarodne novinex, br. 11/15., 57/15. i 4/16.). Stupanje na snagu Zakona Clanak 129. Ovaj Zakon objavit ce se u \\u00bbNarodnim novinama\\u00abx, a stupa na snagu 1. sijecnja 2023. Klasa: 022-02/22-01/155 Zagreb, 29. studenoga 2022. HRVATSKI SABOR Predsjednik Hrvatskoga sabora Gordan Jandrokovic, v. r.\"]"